#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Chest01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Chest01.AB_Chest01_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct AB_Chest01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_133;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_134;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_135;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_136;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_137;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_138;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_139;                                // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_140;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_141;                                // 0x0044(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_142;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_143;                                // 0x0054(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_144;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_145;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_146;                              // 0x0068(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_147;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_148;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_149;                                // 0x0099(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_150;                                // 0x009C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_151;                                // 0x00A8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_152;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_153;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_154;                              // 0x00C0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0168(0x0018)()
};
static_assert(alignof(AB_Chest01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Chest01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Chest01::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on AB_Chest01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_133) == 0x000004, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_133' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_134) == 0x000010, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_134' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __IntProperty_135) == 0x00001C, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__IntProperty_135' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_136) == 0x000020, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_136' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __IntProperty_137) == 0x00002C, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__IntProperty_137' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __BoolProperty_138) == 0x000030, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__BoolProperty_138' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_139) == 0x000034, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_139' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __IntProperty_140) == 0x000040, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__IntProperty_140' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x000044, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __IntProperty_142) == 0x000050, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__IntProperty_142' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_143) == 0x000054, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_143' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __IntProperty_144) == 0x000060, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__IntProperty_144' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __FloatProperty_145) == 0x000064, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__FloatProperty_145' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __StructProperty_146) == 0x000068, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__StructProperty_146' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __FloatProperty_147) == 0x000094, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__FloatProperty_147' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __BoolProperty_148) == 0x000098, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__BoolProperty_148' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __EnumProperty_149) == 0x000099, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__EnumProperty_149' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_150) == 0x00009C, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_150' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __NameProperty_151) == 0x0000A8, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__NameProperty_151' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __IntProperty_152) == 0x0000B4, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__IntProperty_152' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __ByteProperty_153) == 0x0000B8, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__ByteProperty_153' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, __StructProperty_154) == 0x0000C0, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::__StructProperty_154' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E8, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Chest01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000168, "Member 'AB_Chest01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

