#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Chest01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_Chest01.AB_Chest01_C.ExecuteUbergraph_AB_Chest01
// 0x000C (0x000C - 0x0000)
struct AB_Chest01_C_ExecuteUbergraph_AB_Chest01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01) == 0x000004, "Wrong alignment on AB_Chest01_C_ExecuteUbergraph_AB_Chest01");
static_assert(sizeof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01) == 0x00000C, "Wrong size on AB_Chest01_C_ExecuteUbergraph_AB_Chest01");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, EntryPoint) == 0x000000, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, CallFunc_Not_PreBool_ReturnValue_1) == 0x000007, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, CallFunc_BooleanOR_ReturnValue_1) == 0x000008, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Chest01_C_ExecuteUbergraph_AB_Chest01, CallFunc_Not_PreBool_ReturnValue_2) == 0x000009, "Member 'AB_Chest01_C_ExecuteUbergraph_AB_Chest01::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function AB_Chest01.AB_Chest01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_Chest01_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Chest01_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Chest01_C_AnimGraph");
static_assert(sizeof(AB_Chest01_C_AnimGraph) == 0x000010, "Wrong size on AB_Chest01_C_AnimGraph");
static_assert(offsetof(AB_Chest01_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_Chest01_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

