#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Cage_Calamari_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_Cage_Calamari_01.AB_Cage_Calamari_01_C.ExecuteUbergraph_AB_Cage_Calamari_01
// 0x0050 (0x0050 - 0x0000)
struct AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADeathBedInteractable*                  K2Node_DynamicCast_AsDeath_Bed_Interactable;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCagedSurvivor_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General;           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01) == 0x000008, "Wrong alignment on AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01");
static_assert(sizeof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01) == 0x000050, "Wrong size on AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, EntryPoint) == 0x000000, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, K2Node_DynamicCast_AsDeath_Bed_Interactable) == 0x000010, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::K2Node_DynamicCast_AsDeath_Bed_Interactable' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, CallFunc_GetCagedSurvivor_ReturnValue) == 0x000020, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::CallFunc_GetCagedSurvivor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, CallFunc_GetOwningActor_ReturnValue_1) == 0x000028, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, K2Node_DynamicCast_AsBPI_Effect_General) == 0x000038, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::K2Node_DynamicCast_AsBPI_Effect_General' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'AB_Cage_Calamari_01_C_ExecuteUbergraph_AB_Cage_Calamari_01::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AB_Cage_Calamari_01.AB_Cage_Calamari_01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_Cage_Calamari_01_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Cage_Calamari_01_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Cage_Calamari_01_C_AnimGraph");
static_assert(sizeof(AB_Cage_Calamari_01_C_AnimGraph) == 0x000010, "Wrong size on AB_Cage_Calamari_01_C_AnimGraph");
static_assert(offsetof(AB_Cage_Calamari_01_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_Cage_Calamari_01_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

