#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Cage_Calamari_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Cage_Calamari_01.AB_Cage_Calamari_01_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_11;                               // 0x0010(0x0028)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_12;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_14;                               // 0x0040(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_15;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_17;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_18;                                 // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_19;                                 // 0x0074(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __StructProperty_11) == 0x000010, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__StructProperty_11' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_12) == 0x000038, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_13) == 0x00003C, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __StructProperty_14) == 0x000040, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__StructProperty_14' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_15) == 0x00006C, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_16) == 0x000070, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __EnumProperty_17) == 0x000071, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__EnumProperty_17' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __ByteProperty_18) == 0x000072, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__ByteProperty_18' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, __NameProperty_19) == 0x000074, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::__NameProperty_19' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'AB_Cage_Calamari_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

