#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DF_Hair_ACC01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_DF_Hair_ACC01.AB_DF_Hair_ACC01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_DF_Hair_ACC01_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_DF_Hair_ACC01_C_AnimGraph) == 0x000008, "Wrong alignment on AB_DF_Hair_ACC01_C_AnimGraph");
static_assert(sizeof(AB_DF_Hair_ACC01_C_AnimGraph) == 0x000010, "Wrong size on AB_DF_Hair_ACC01_C_AnimGraph");
static_assert(offsetof(AB_DF_Hair_ACC01_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_DF_Hair_ACC01_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function AB_DF_Hair_ACC01.AB_DF_Hair_ACC01_C.ExecuteUbergraph_AB_DF_Hair_ACC01
// 0x0004 (0x0004 - 0x0000)
struct AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01) == 0x000004, "Wrong alignment on AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01");
static_assert(sizeof(AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01) == 0x000004, "Wrong size on AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01");
static_assert(offsetof(AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01, EntryPoint) == 0x000000, "Member 'AB_DF_Hair_ACC01_C_ExecuteUbergraph_AB_DF_Hair_ACC01::EntryPoint' has a wrong offset!");

}

