#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DF_Glasses_ACC01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_DF_Glasses_ACC01.AB_DF_Glasses_ACC01_C
// 0x0210 (0x0570 - 0x0360)
class UAB_DF_Glasses_ACC01_C final : public UDynamicAccessoryAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0398(0x01D8)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_AB_DF_Glasses_ACC01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_DF_Glasses_ACC01_C">();
	}
	static class UAB_DF_Glasses_ACC01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_DF_Glasses_ACC01_C>();
	}
};
static_assert(alignof(UAB_DF_Glasses_ACC01_C) == 0x000010, "Wrong alignment on UAB_DF_Glasses_ACC01_C");
static_assert(sizeof(UAB_DF_Glasses_ACC01_C) == 0x000570, "Wrong size on UAB_DF_Glasses_ACC01_C");
static_assert(offsetof(UAB_DF_Glasses_ACC01_C, UberGraphFrame) == 0x000360, "Member 'UAB_DF_Glasses_ACC01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_DF_Glasses_ACC01_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UAB_DF_Glasses_ACC01_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAB_DF_Glasses_ACC01_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UAB_DF_Glasses_ACC01_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAB_DF_Glasses_ACC01_C, AnimGraphNode_Root) == 0x000378, "Member 'UAB_DF_Glasses_ACC01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAB_DF_Glasses_ACC01_C, AnimGraphNode_CopyPoseFromMesh) == 0x000398, "Member 'UAB_DF_Glasses_ACC01_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

