#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Escape

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_Escape.AB_Escape_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_Escape_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Escape_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Escape_C_AnimGraph");
static_assert(sizeof(AB_Escape_C_AnimGraph) == 0x000010, "Wrong size on AB_Escape_C_AnimGraph");
static_assert(offsetof(AB_Escape_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_Escape_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function AB_Escape.AB_Escape_C.ExecuteUbergraph_AB_Escape
// 0x0008 (0x0008 - 0x0000)
struct AB_Escape_C_ExecuteUbergraph_AB_Escape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Escape_C_ExecuteUbergraph_AB_Escape) == 0x000004, "Wrong alignment on AB_Escape_C_ExecuteUbergraph_AB_Escape");
static_assert(sizeof(AB_Escape_C_ExecuteUbergraph_AB_Escape) == 0x000008, "Wrong size on AB_Escape_C_ExecuteUbergraph_AB_Escape");
static_assert(offsetof(AB_Escape_C_ExecuteUbergraph_AB_Escape, EntryPoint) == 0x000000, "Member 'AB_Escape_C_ExecuteUbergraph_AB_Escape::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Escape_C_ExecuteUbergraph_AB_Escape, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'AB_Escape_C_ExecuteUbergraph_AB_Escape::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Escape_C_ExecuteUbergraph_AB_Escape, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'AB_Escape_C_ExecuteUbergraph_AB_Escape::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

