#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Entity

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_Entity.AB_Entity_C.ExecuteUbergraph_AB_Entity
// 0x0018 (0x0018 - 0x0000)
struct AB_Entity_C_ExecuteUbergraph_AB_Entity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         CallFunc_GetKiller_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInMeathookZone_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Entity_C_ExecuteUbergraph_AB_Entity) == 0x000008, "Wrong alignment on AB_Entity_C_ExecuteUbergraph_AB_Entity");
static_assert(sizeof(AB_Entity_C_ExecuteUbergraph_AB_Entity) == 0x000018, "Wrong size on AB_Entity_C_ExecuteUbergraph_AB_Entity");
static_assert(offsetof(AB_Entity_C_ExecuteUbergraph_AB_Entity, EntryPoint) == 0x000000, "Member 'AB_Entity_C_ExecuteUbergraph_AB_Entity::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Entity_C_ExecuteUbergraph_AB_Entity, CallFunc_GetKiller_ReturnValue) == 0x000008, "Member 'AB_Entity_C_ExecuteUbergraph_AB_Entity::CallFunc_GetKiller_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Entity_C_ExecuteUbergraph_AB_Entity, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AB_Entity_C_ExecuteUbergraph_AB_Entity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Entity_C_ExecuteUbergraph_AB_Entity, CallFunc_IsInMeathookZone_ReturnValue) == 0x000011, "Member 'AB_Entity_C_ExecuteUbergraph_AB_Entity::CallFunc_IsInMeathookZone_ReturnValue' has a wrong offset!");

// Function AB_Entity.AB_Entity_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_Entity_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Entity_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Entity_C_AnimGraph");
static_assert(sizeof(AB_Entity_C_AnimGraph) == 0x000010, "Wrong size on AB_Entity_C_AnimGraph");
static_assert(offsetof(AB_Entity_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_Entity_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

