#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Entity_Endgame

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Entity_Endgame.AB_Entity_Endgame_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_97;                                 // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_98;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_99;                                 // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_100;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_101;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_102;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_103;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_104;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_105;                              // 0x0058(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_106;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_107;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_108;                                // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_109;                                // 0x008A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_110;                                // 0x008C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_111;                                // 0x0098(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_112;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_113;                              // 0x00A8(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000010, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x00001C, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_97) == 0x000020, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_97' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __IntProperty_98) == 0x00002C, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__IntProperty_98' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000030, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __IntProperty_100) == 0x00003C, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__IntProperty_100' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_101) == 0x000040, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_101' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __IntProperty_102) == 0x00004C, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__IntProperty_102' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __BoolProperty_103) == 0x000050, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__BoolProperty_103' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __FloatProperty_104) == 0x000054, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__FloatProperty_104' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __StructProperty_105) == 0x000058, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__StructProperty_105' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __FloatProperty_106) == 0x000084, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__FloatProperty_106' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __BoolProperty_107) == 0x000088, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__BoolProperty_107' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __EnumProperty_108) == 0x000089, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__EnumProperty_108' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __ByteProperty_109) == 0x00008A, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__ByteProperty_109' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x00008C, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __NameProperty_111) == 0x000098, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__NameProperty_111' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __IntProperty_112) == 0x0000A4, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__IntProperty_112' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, __StructProperty_113) == 0x0000A8, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::__StructProperty_113' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'AB_Entity_Endgame::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

