#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Entity_Generator

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Entity_Generator.AB_Entity_Generator_C.AnimBlueprintGeneratedConstantData
// 0x0157 (0x0158 - 0x0001)
struct AB_Entity_Generator::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_77;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_78;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_79;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_81;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_82;                                 // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_83;                                  // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_84;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_85;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_86;                               // 0x0048(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_87;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_88;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_89;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_90;                                 // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_91;                                 // 0x007C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x0088(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_93;                                  // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_94;                               // 0x0098(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
};
static_assert(alignof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Entity_Generator::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData) == 0x000158, "Wrong size on AB_Entity_Generator::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __NameProperty_77) == 0x000004, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__NameProperty_77' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000010, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __IntProperty_79) == 0x00001C, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__IntProperty_79' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000020, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __IntProperty_81) == 0x00002C, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__IntProperty_81' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000030, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __IntProperty_83) == 0x00003C, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__IntProperty_83' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __BoolProperty_84) == 0x000040, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__BoolProperty_84' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __FloatProperty_85) == 0x000044, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__FloatProperty_85' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __StructProperty_86) == 0x000048, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__StructProperty_86' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __FloatProperty_87) == 0x000074, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__FloatProperty_87' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __BoolProperty_88) == 0x000078, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__BoolProperty_88' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __EnumProperty_89) == 0x000079, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__EnumProperty_89' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __ByteProperty_90) == 0x00007A, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__ByteProperty_90' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x00007C, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x000088, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __IntProperty_93) == 0x000094, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__IntProperty_93' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, __StructProperty_94) == 0x000098, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::__StructProperty_94' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Entity_Generator::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'AB_Entity_Generator::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

