#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Generator01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AB_Generator01_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_Generator01.AB_Generator01_C
// 0x09C0 (0x0D30 - 0x0370)
class UAB_Generator01_C final : public UGeneratorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AB_Generator01::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0378(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0388(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0390(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0398(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x03E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0458(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0480(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x04C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x04E8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0530(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0610(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0658(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0678(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x06E8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0730(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0810(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0830(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0878(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0898(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_3;                       // 0x0960(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_2;                       // 0x0A18(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_1;                       // 0x0AD0(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x0B88(0x00B8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0C40(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0C50(0x00E0)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_RushToPistonsIdle();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Generator01_AnimGraphNode_BlendSpacePlayer_E7D2FB6546148FF72C6E48B147E19262();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Generator01_AnimGraphNode_TransitionResult_0F0ECBD944F794DCD32E19AB93FF1E1B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Generator01_AnimGraphNode_TransitionResult_D289890F46BB643406C0D0B85FF6F3CA();
	void ExecuteUbergraph_AB_Generator01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Generator01_C">();
	}
	static class UAB_Generator01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Generator01_C>();
	}
};
static_assert(alignof(UAB_Generator01_C) == 0x000010, "Wrong alignment on UAB_Generator01_C");
static_assert(sizeof(UAB_Generator01_C) == 0x000D30, "Wrong size on UAB_Generator01_C");
static_assert(offsetof(UAB_Generator01_C, UberGraphFrame) == 0x000370, "Member 'UAB_Generator01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, __AnimBlueprintMutables) == 0x000378, "Member 'UAB_Generator01_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimBlueprintExtension_PropertyAccess) == 0x000388, "Member 'UAB_Generator01_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimBlueprintExtension_Base) == 0x000390, "Member 'UAB_Generator01_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_Root) == 0x000398, "Member 'UAB_Generator01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_TransitionResult_4) == 0x0003B8, "Member 'UAB_Generator01_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_TransitionResult_3) == 0x0003E0, "Member 'UAB_Generator01_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_TransitionResult_2) == 0x000408, "Member 'UAB_Generator01_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_TransitionResult_1) == 0x000430, "Member 'UAB_Generator01_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_TransitionResult) == 0x000458, "Member 'UAB_Generator01_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SequencePlayer_4) == 0x000480, "Member 'UAB_Generator01_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_StateResult_3) == 0x0004C8, "Member 'UAB_Generator01_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SequencePlayer_3) == 0x0004E8, "Member 'UAB_Generator01_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_LayeredBoneBlend_2) == 0x000530, "Member 'UAB_Generator01_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SequencePlayer_2) == 0x000610, "Member 'UAB_Generator01_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_StateResult_2) == 0x000658, "Member 'UAB_Generator01_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_BlendSpacePlayer) == 0x000678, "Member 'UAB_Generator01_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SequencePlayer_1) == 0x0006E8, "Member 'UAB_Generator01_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000730, "Member 'UAB_Generator01_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_StateResult_1) == 0x000810, "Member 'UAB_Generator01_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SequencePlayer) == 0x000830, "Member 'UAB_Generator01_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_StateResult) == 0x000878, "Member 'UAB_Generator01_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_StateMachine) == 0x000898, "Member 'UAB_Generator01_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SubInstance_3) == 0x000960, "Member 'UAB_Generator01_C::AnimGraphNode_SubInstance_3' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SubInstance_2) == 0x000A18, "Member 'UAB_Generator01_C::AnimGraphNode_SubInstance_2' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SubInstance_1) == 0x000AD0, "Member 'UAB_Generator01_C::AnimGraphNode_SubInstance_1' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_SubInstance) == 0x000B88, "Member 'UAB_Generator01_C::AnimGraphNode_SubInstance' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_LocalRefPose) == 0x000C40, "Member 'UAB_Generator01_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UAB_Generator01_C, AnimGraphNode_LayeredBoneBlend) == 0x000C50, "Member 'UAB_Generator01_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");

}

