#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Generator01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Generator01.AB_Generator01_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct AB_Generator01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_129;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_130;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_131;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_132;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_133;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_134;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_135;                                // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_136;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_137;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_138;                              // 0x0048(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_139;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_140;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_141;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_142;                                // 0x007C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_143;                                // 0x0088(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_144;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_145;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_146;                              // 0x00A0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(AB_Generator01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Generator01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Generator01::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on AB_Generator01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000004, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __NameProperty_130) == 0x000010, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__NameProperty_130' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __IntProperty_131) == 0x00001C, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__IntProperty_131' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __NameProperty_132) == 0x000020, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__NameProperty_132' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __IntProperty_133) == 0x00002C, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__IntProperty_133' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __BoolProperty_134) == 0x000030, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__BoolProperty_134' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000034, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __IntProperty_136) == 0x000040, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__IntProperty_136' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __FloatProperty_137) == 0x000044, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__FloatProperty_137' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __StructProperty_138) == 0x000048, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__StructProperty_138' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __FloatProperty_139) == 0x000074, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__FloatProperty_139' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __BoolProperty_140) == 0x000078, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__BoolProperty_140' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __EnumProperty_141) == 0x000079, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__EnumProperty_141' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x00007C, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __NameProperty_143) == 0x000088, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__NameProperty_143' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __IntProperty_144) == 0x000094, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__IntProperty_144' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __ByteProperty_145) == 0x000098, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__ByteProperty_145' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, __StructProperty_146) == 0x0000A0, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::__StructProperty_146' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'AB_Generator01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AB_Generator01.AB_Generator01_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct AB_Generator01::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Generator01::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AB_Generator01::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AB_Generator01::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on AB_Generator01::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'AB_Generator01::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(AB_Generator01::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'AB_Generator01::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

