#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Hatch

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Hatch.AB_Hatch_C.AnimBlueprintGeneratedConstantData
// 0x0157 (0x0158 - 0x0001)
struct AB_Hatch::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_80;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_81;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_82;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_83;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_84;                                 // 0x0024(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_85;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_86;                                 // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_87;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_88;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_89;                               // 0x0048(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_90;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_91;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_92;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_93;                                 // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x007C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x0088(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_97;                               // 0x0098(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
};
static_assert(alignof(AB_Hatch::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Hatch::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Hatch::FAnimBlueprintGeneratedConstantData) == 0x000158, "Wrong size on AB_Hatch::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000004, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x000010, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __IntProperty_82) == 0x00001C, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__IntProperty_82' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __BoolProperty_83) == 0x000020, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__BoolProperty_83' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_84) == 0x000024, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_84' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __IntProperty_85) == 0x000030, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__IntProperty_85' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_86) == 0x000034, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_86' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __IntProperty_87) == 0x000040, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__IntProperty_87' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __FloatProperty_88) == 0x000044, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__FloatProperty_88' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __StructProperty_89) == 0x000048, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__StructProperty_89' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __FloatProperty_90) == 0x000074, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__FloatProperty_90' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __BoolProperty_91) == 0x000078, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__BoolProperty_91' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __EnumProperty_92) == 0x000079, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__EnumProperty_92' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __ByteProperty_93) == 0x00007A, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__ByteProperty_93' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x00007C, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000088, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x000094, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, __StructProperty_97) == 0x000098, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::__StructProperty_97' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Hatch::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'AB_Hatch::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

