#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_MT_Hair_ACC01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_MT_Hair_ACC01.AB_MT_Hair_ACC01_C
// 0xB830 (0xBB90 - 0x0360)
class UAB_MT_Hair_ACC01_C final : public UDynamicAccessoryAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x03E8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0418(0x0020)()
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_33;                     // 0x0440(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_32;                     // 0x0980(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_31;                     // 0x0EC0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_30;                     // 0x1400(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_29;                     // 0x1940(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_28;                     // 0x1E80(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_27;                     // 0x23C0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_26;                     // 0x2900(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_25;                     // 0x2E40(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_24;                     // 0x3380(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_23;                     // 0x38C0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_22;                     // 0x3E00(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_21;                     // 0x4340(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_20;                     // 0x4880(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0x4DC0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0x5300(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0x5840(0x0540)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x5D80(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x5DB0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5DD0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x5DF0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x5E10(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x6350(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x6890(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x6DD0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x7310(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x7850(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x7D90(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x82D0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x8810(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x8D50(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x9290(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x97D0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x9D10(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0xA250(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0xA790(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0xACD0(0x0540)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0xB210(0x0540)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xB750(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xB780(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xB7A0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xB7C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xB7E0(0x00C8)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0xB8A8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xBA80(0x0108)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_AB_MT_Hair_ACC01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_MT_Hair_ACC01_C">();
	}
	static class UAB_MT_Hair_ACC01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_MT_Hair_ACC01_C>();
	}
};
static_assert(alignof(UAB_MT_Hair_ACC01_C) == 0x000010, "Wrong alignment on UAB_MT_Hair_ACC01_C");
static_assert(sizeof(UAB_MT_Hair_ACC01_C) == 0x00BB90, "Wrong size on UAB_MT_Hair_ACC01_C");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, UberGraphFrame) == 0x000360, "Member 'UAB_MT_Hair_ACC01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UAB_MT_Hair_ACC01_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UAB_MT_Hair_ACC01_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_Root) == 0x000378, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_TransitionResult_1) == 0x000398, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_TransitionResult) == 0x0003C0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_UseCachedPose_2) == 0x0003E8, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_StateResult_2) == 0x000418, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_33) == 0x000440, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_33' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_32) == 0x000980, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_32' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_31) == 0x000EC0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_31' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_30) == 0x001400, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_30' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_29) == 0x001940, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_29' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_28) == 0x001E80, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_28' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_27) == 0x0023C0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_27' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_26) == 0x002900, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_26' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_25) == 0x002E40, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_25' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_24) == 0x003380, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_24' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_23) == 0x0038C0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_23' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_22) == 0x003E00, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_22' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_21) == 0x004340, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_21' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_20) == 0x004880, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_20' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_19) == 0x004DC0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_19' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_18) == 0x005300, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_17) == 0x005840, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_UseCachedPose_1) == 0x005D80, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_LocalToComponentSpace_1) == 0x005DB0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x005DD0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_StateResult_1) == 0x005DF0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_16) == 0x005E10, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_15) == 0x006350, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_14) == 0x006890, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_13) == 0x006DD0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_12) == 0x007310, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_11) == 0x007850, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_10) == 0x007D90, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_9) == 0x0082D0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_8) == 0x008810, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_7) == 0x008D50, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_6) == 0x009290, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_5) == 0x0097D0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_4) == 0x009D10, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_3) == 0x00A250, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_2) == 0x00A790, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics_1) == 0x00ACD0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_AnimDynamics) == 0x00B210, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_UseCachedPose) == 0x00B750, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_LocalToComponentSpace) == 0x00B780, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_ComponentToLocalSpace) == 0x00B7A0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_StateResult) == 0x00B7C0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_StateMachine) == 0x00B7E0, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_CopyPoseFromMesh) == 0x00B8A8, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UAB_MT_Hair_ACC01_C, AnimGraphNode_SaveCachedPose) == 0x00BA80, "Member 'UAB_MT_Hair_ACC01_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");

}

