#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_MT_Longcoat_SurvivorCharmsChains

#include "Basic.hpp"

#include "Enum_charmsJointAttachment_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Enum_charmsJointChains_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_MT_Longcoat_SurvivorCharmsChains.AB_MT_Longcoat_SurvivorCharmsChains_C
// 0x0500 (0x0850 - 0x0350)
class UAB_MT_Longcoat_SurvivorCharmsChains_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0388(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0x0560(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x0618(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x06D0(0x00B8)()
	Enum_CharmsJointChains                        __CustomProperty_JointChain_E98E53014C900C0E2D4EED8D8A087E40; // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_RotationOffset_E98E53014C900C0E2D4EED8D8A087E40; // 0x0790(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_TranslationOffset_E98E53014C900C0E2D4EED8D8A087E40; // 0x07A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CharmsJointAttachment                    __CustomProperty_ConstraintParent_E98E53014C900C0E2D4EED8D8A087E40; // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CharmsJointChains                        __CustomProperty_JointChain_1F7C1C9545B3CBFD54FF5A93DCA60219; // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C2[0x6];                                      // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_RotationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219; // 0x07C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_TranslationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219; // 0x07E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CharmsJointAttachment                    __CustomProperty_ConstraintParent_1F7C1C9545B3CBFD54FF5A93DCA60219; // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CharmsJointChains                        __CustomProperty_JointChain_7CFB7B874784EFCC1F6542A41222AEFD; // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FA[0x6];                                      // 0x07FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_RotationOffset_7CFB7B874784EFCC1F6542A41222AEFD; // 0x0800(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_TranslationOffset_7CFB7B874784EFCC1F6542A41222AEFD; // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CharmsJointAttachment                    __CustomProperty_ConstraintParent_7CFB7B874784EFCC1F6542A41222AEFD; // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharmAttacher*                         CharmAttacher;                                     // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OwningSkeletalMesh;                                // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintLinkedAnimationLayersInitialized();
	void ExecuteUbergraph_AB_MT_Longcoat_SurvivorCharmsChains(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_MT_Longcoat_SurvivorCharmsChains_C">();
	}
	static class UAB_MT_Longcoat_SurvivorCharmsChains_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_MT_Longcoat_SurvivorCharmsChains_C>();
	}
};
static_assert(alignof(UAB_MT_Longcoat_SurvivorCharmsChains_C) == 0x000010, "Wrong alignment on UAB_MT_Longcoat_SurvivorCharmsChains_C");
static_assert(sizeof(UAB_MT_Longcoat_SurvivorCharmsChains_C) == 0x000850, "Wrong size on UAB_MT_Longcoat_SurvivorCharmsChains_C");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, UberGraphFrame) == 0x000350, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimGraphNode_Root) == 0x000368, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimGraphNode_CopyPoseFromMesh) == 0x000388, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimGraphNode_LinkedAnimGraph_2) == 0x000560, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimGraphNode_LinkedAnimGraph_2' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimGraphNode_LinkedAnimGraph_1) == 0x000618, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, AnimGraphNode_LinkedAnimGraph) == 0x0006D0, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_JointChain_E98E53014C900C0E2D4EED8D8A087E40) == 0x000788, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_JointChain_E98E53014C900C0E2D4EED8D8A087E40' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_RotationOffset_E98E53014C900C0E2D4EED8D8A087E40) == 0x000790, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_RotationOffset_E98E53014C900C0E2D4EED8D8A087E40' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_TranslationOffset_E98E53014C900C0E2D4EED8D8A087E40) == 0x0007A8, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_TranslationOffset_E98E53014C900C0E2D4EED8D8A087E40' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_ConstraintParent_E98E53014C900C0E2D4EED8D8A087E40) == 0x0007C0, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_ConstraintParent_E98E53014C900C0E2D4EED8D8A087E40' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_JointChain_1F7C1C9545B3CBFD54FF5A93DCA60219) == 0x0007C1, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_JointChain_1F7C1C9545B3CBFD54FF5A93DCA60219' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_RotationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219) == 0x0007C8, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_RotationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_TranslationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219) == 0x0007E0, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_TranslationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_ConstraintParent_1F7C1C9545B3CBFD54FF5A93DCA60219) == 0x0007F8, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_ConstraintParent_1F7C1C9545B3CBFD54FF5A93DCA60219' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_JointChain_7CFB7B874784EFCC1F6542A41222AEFD) == 0x0007F9, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_JointChain_7CFB7B874784EFCC1F6542A41222AEFD' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_RotationOffset_7CFB7B874784EFCC1F6542A41222AEFD) == 0x000800, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_RotationOffset_7CFB7B874784EFCC1F6542A41222AEFD' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_TranslationOffset_7CFB7B874784EFCC1F6542A41222AEFD) == 0x000818, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_TranslationOffset_7CFB7B874784EFCC1F6542A41222AEFD' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, __CustomProperty_ConstraintParent_7CFB7B874784EFCC1F6542A41222AEFD) == 0x000830, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::__CustomProperty_ConstraintParent_7CFB7B874784EFCC1F6542A41222AEFD' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, CharmAttacher) == 0x000838, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::CharmAttacher' has a wrong offset!");
static_assert(offsetof(UAB_MT_Longcoat_SurvivorCharmsChains_C, OwningSkeletalMesh) == 0x000840, "Member 'UAB_MT_Longcoat_SurvivorCharmsChains_C::OwningSkeletalMesh' has a wrong offset!");

}

