#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Survivor_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Survivor_00.AB_Survivor_00_C.AnimBlueprintGeneratedConstantData
// 0x01BF (0x01C0 - 0x0001)
struct AB_Survivor_00::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_225;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_226;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_227;                                // 0x001C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_228;                                // 0x0028(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_229;                                // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_230;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_231;                                // 0x004C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_232;                                // 0x0058(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_233;                                // 0x0064(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_234;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_235;                                  // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_236;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_237;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_238;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_239;                                // 0x0098(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_240;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_241;                                // 0x00A8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_242;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_243;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_244;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_245;                              // 0x00C0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_246;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_247;                                // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_248;                                // 0x00F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_249;                                // 0x00F2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_250;                                // 0x00F4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_251;                              // 0x0100(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0128(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A8(0x0018)()
};
static_assert(alignof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Survivor_00::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData) == 0x0001C0, "Wrong size on AB_Survivor_00::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_225) == 0x000004, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_225' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_226) == 0x000010, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_226' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_227) == 0x00001C, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_227' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_228) == 0x000028, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_228' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_229) == 0x000034, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_229' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_230) == 0x000040, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_230' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_231) == 0x00004C, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_231' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_232) == 0x000058, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_232' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_233) == 0x000064, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_233' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __BlendProfile_234) == 0x000070, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__BlendProfile_234' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __CurveFloat_235) == 0x000078, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__CurveFloat_235' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __EnumProperty_236) == 0x000080, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__EnumProperty_236' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __EnumProperty_237) == 0x000081, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__EnumProperty_237' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __ArrayProperty_238) == 0x000088, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__ArrayProperty_238' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_239) == 0x000098, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_239' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __IntProperty_240) == 0x0000A4, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__IntProperty_240' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_241) == 0x0000A8, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_241' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __IntProperty_242) == 0x0000B4, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__IntProperty_242' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __BoolProperty_243) == 0x0000B8, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__BoolProperty_243' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __FloatProperty_244) == 0x0000BC, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__FloatProperty_244' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __StructProperty_245) == 0x0000C0, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__StructProperty_245' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __FloatProperty_246) == 0x0000EC, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__FloatProperty_246' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __BoolProperty_247) == 0x0000F0, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__BoolProperty_247' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __EnumProperty_248) == 0x0000F1, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__EnumProperty_248' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __ByteProperty_249) == 0x0000F2, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__ByteProperty_249' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __NameProperty_250) == 0x0000F4, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__NameProperty_250' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, __StructProperty_251) == 0x000100, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::__StructProperty_251' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000128, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A8, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AB_Survivor_00.AB_Survivor_00_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct AB_Survivor_00::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Survivor_00::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AB_Survivor_00::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AB_Survivor_00::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on AB_Survivor_00::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AB_Survivor_00::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AB_Survivor_00::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

