#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_Locomotion_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ASet_Slasher_BaseLocomotion_structs.hpp"


namespace SDK::Params
{

// Function AB_Slasher_SubGraph_Locomotion_00.AB_Slasher_SubGraph_Locomotion_00_C.SetLocoAnimationFromMainAB
// 0x00A0 (0x00A0 - 0x0000)
struct AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB final
{
public:
	struct FASet_Slasher_BaseLocomotion           LocoAnimSet;                                       // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB");
static_assert(sizeof(AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB) == 0x0000A0, "Wrong size on AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB, LocoAnimSet) == 0x000000, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_SetLocoAnimationFromMainAB::LocoAnimSet' has a wrong offset!");

// Function AB_Slasher_SubGraph_Locomotion_00.AB_Slasher_SubGraph_Locomotion_00_C.ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00
// 0x00F0 (0x00F0 - 0x0000)
struct AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FASet_Slasher_BaseLocomotion           K2Node_Event_LocoAnimSet;                          // 0x0008(0x00A0)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast;              // 0x00E8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_1;            // 0x00EC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00");
static_assert(sizeof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00) == 0x0000F0, "Wrong size on AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, EntryPoint) == 0x000000, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, K2Node_Event_LocoAnimSet) == 0x000008, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::K2Node_Event_LocoAnimSet' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x0000B0, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x0000C0, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C8, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000C9, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CA, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_SelectFloat_ReturnValue) == 0x0000D0, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, K2Node_Event_DeltaTimeX) == 0x0000DC, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_SelectFloat_ReturnValue_1) == 0x0000E0, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Array_Set_Item_ImplicitCast) == 0x0000E8, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Array_Set_Item_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00, CallFunc_Array_Set_Item_ImplicitCast_1) == 0x0000EC, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_00::CallFunc_Array_Set_Item_ImplicitCast_1' has a wrong offset!");

// Function AB_Slasher_SubGraph_Locomotion_00.AB_Slasher_SubGraph_Locomotion_00_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation");
static_assert(sizeof(AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AB_Slasher_SubGraph_Locomotion_00.AB_Slasher_SubGraph_Locomotion_00_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph");
static_assert(sizeof(AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph) == 0x000010, "Wrong size on AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_Slasher_SubGraph_Locomotion_00_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

