#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Slasher_01.AB_Slasher_01_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct AB_Slasher_01::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_01::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AB_Slasher_01::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AB_Slasher_01::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on AB_Slasher_01::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

// ScriptStruct AB_Slasher_01.AB_Slasher_01_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct AB_Slasher_01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_46;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_47;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_48;                                 // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_49;                                   // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_50;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_51;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_52;                                 // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_53;                                // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_54;                               // 0x0048(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0070(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Slasher_01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on AB_Slasher_01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __NameProperty_46) == 0x000004, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__NameProperty_46' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __NameProperty_47) == 0x000010, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__NameProperty_47' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __BlendProfile_48) == 0x000020, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__BlendProfile_48' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __CurveFloat_49) == 0x000028, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__CurveFloat_49' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_50) == 0x000030, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_50' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __EnumProperty_51) == 0x000031, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__EnumProperty_51' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __EnumProperty_52) == 0x000032, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__EnumProperty_52' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __ArrayProperty_53) == 0x000038, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__ArrayProperty_53' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, __StructProperty_54) == 0x000048, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::__StructProperty_54' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000070, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'AB_Slasher_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

