#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_LegIK_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_Slasher_SubGraph_LegIK_00.AB_Slasher_SubGraph_LegIK_00_C
// 0x0110 (0x0460 - 0x0350)
class UAB_Slasher_SubGraph_LegIK_00_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0388(0x00D0)()
	class ABP_Slasher_Character_C*                MyCharacter;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void TraceGround(class FName SocketName);
	void ExecuteUbergraph_AB_Slasher_SubGraph_LegIK_00(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Slasher_SubGraph_LegIK_00_C">();
	}
	static class UAB_Slasher_SubGraph_LegIK_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Slasher_SubGraph_LegIK_00_C>();
	}
};
static_assert(alignof(UAB_Slasher_SubGraph_LegIK_00_C) == 0x000010, "Wrong alignment on UAB_Slasher_SubGraph_LegIK_00_C");
static_assert(sizeof(UAB_Slasher_SubGraph_LegIK_00_C) == 0x000460, "Wrong size on UAB_Slasher_SubGraph_LegIK_00_C");
static_assert(offsetof(UAB_Slasher_SubGraph_LegIK_00_C, UberGraphFrame) == 0x000350, "Member 'UAB_Slasher_SubGraph_LegIK_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Slasher_SubGraph_LegIK_00_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UAB_Slasher_SubGraph_LegIK_00_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAB_Slasher_SubGraph_LegIK_00_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UAB_Slasher_SubGraph_LegIK_00_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAB_Slasher_SubGraph_LegIK_00_C, AnimGraphNode_Root) == 0x000368, "Member 'UAB_Slasher_SubGraph_LegIK_00_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAB_Slasher_SubGraph_LegIK_00_C, AnimGraphNode_LinkedInputPose) == 0x000388, "Member 'UAB_Slasher_SubGraph_LegIK_00_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UAB_Slasher_SubGraph_LegIK_00_C, MyCharacter) == 0x000458, "Member 'UAB_Slasher_SubGraph_LegIK_00_C::MyCharacter' has a wrong offset!");

}

