#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_LookAT_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Aset_Slasher_LookAT_structs.hpp"


namespace SDK::Params
{

// Function AB_Slasher_SubGraph_LookAT_00.AB_Slasher_SubGraph_LookAT_00_C.SetLookAtAnimationFromMainAB
// 0x0038 (0x0038 - 0x0000)
struct AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB final
{
public:
	struct FAset_Slasher_LookAT                   LookAtAnimSet;                                     // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB");
static_assert(sizeof(AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB) == 0x000038, "Wrong size on AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB");
static_assert(offsetof(AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB, LookAtAnimSet) == 0x000000, "Member 'AB_Slasher_SubGraph_LookAT_00_C_SetLookAtAnimationFromMainAB::LookAtAnimSet' has a wrong offset!");

// Function AB_Slasher_SubGraph_LookAT_00.AB_Slasher_SubGraph_LookAT_00_C.ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00
// 0x0040 (0x0040 - 0x0000)
struct AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAset_Slasher_LookAT                   K2Node_Event_LookAtAnimSet;                        // 0x0008(0x0038)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00");
static_assert(sizeof(AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00) == 0x000040, "Wrong size on AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00");
static_assert(offsetof(AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00, EntryPoint) == 0x000000, "Member 'AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00, K2Node_Event_LookAtAnimSet) == 0x000008, "Member 'AB_Slasher_SubGraph_LookAT_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_LookAT_00::K2Node_Event_LookAtAnimSet' has a wrong offset!");

// Function AB_Slasher_SubGraph_LookAT_00.AB_Slasher_SubGraph_LookAT_00_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct AB_Slasher_SubGraph_LookAT_00_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Slasher_SubGraph_LookAT_00_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_LookAT_00_C_AnimGraph");
static_assert(sizeof(AB_Slasher_SubGraph_LookAT_00_C_AnimGraph) == 0x000020, "Wrong size on AB_Slasher_SubGraph_LookAT_00_C_AnimGraph");
static_assert(offsetof(AB_Slasher_SubGraph_LookAT_00_C_AnimGraph, InPose) == 0x000000, "Member 'AB_Slasher_SubGraph_LookAT_00_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_LookAT_00_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'AB_Slasher_SubGraph_LookAT_00_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

