#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Survivor00_StreamPipeReact_AnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AB_Survivor00_StreamPipeReact_AnimInstance_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_Survivor00_StreamPipeReact_AnimInstance.AB_Survivor00_StreamPipeReact_AnimInstance_C
// 0x07A0 (0x0DA0 - 0x0600)
class UAB_Survivor00_StreamPipeReact_AnimInstance_C final : public USteamPipeSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AB_Survivor00_StreamPipeReact_AnimInstance::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0608(0x0004)(HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0610(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0618(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0620(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0640(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0710(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0840(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0868(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0898(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x08E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0928(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0970(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A50(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0A98(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AE0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B70(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0B90(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BC0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0BE0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0CA8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0CC8(0x00D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_InteractionUpperBodyLayerDone();
	void ExecuteUbergraph_AB_Survivor00_StreamPipeReact_AnimInstance(int32 EntryPoint);
	void Survivor_InteractionUpperBody_Layer(const struct FPoseLink& InPose, struct FPoseLink* Param_Survivor_InteractionUpperBody_Layer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Survivor00_StreamPipeReact_AnimInstance_C">();
	}
	static class UAB_Survivor00_StreamPipeReact_AnimInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Survivor00_StreamPipeReact_AnimInstance_C>();
	}
};
static_assert(alignof(UAB_Survivor00_StreamPipeReact_AnimInstance_C) == 0x000010, "Wrong alignment on UAB_Survivor00_StreamPipeReact_AnimInstance_C");
static_assert(sizeof(UAB_Survivor00_StreamPipeReact_AnimInstance_C) == 0x000DA0, "Wrong size on UAB_Survivor00_StreamPipeReact_AnimInstance_C");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, UberGraphFrame) == 0x000600, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, __AnimBlueprintMutables) == 0x000608, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimBlueprintExtension_PropertyAccess) == 0x000610, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimBlueprintExtension_Base) == 0x000618, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_Root_1) == 0x000620, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_LinkedInputPose_1) == 0x000640, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_SaveCachedPose) == 0x000710, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_TransitionResult_1) == 0x000818, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_TransitionResult) == 0x000840, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_UseCachedPose_1) == 0x000868, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_SequencePlayer_3) == 0x000898, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_BlendListByBool_2) == 0x0008E0, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_SequencePlayer_2) == 0x000928, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_LayeredBoneBlend) == 0x000970, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_SequencePlayer_1) == 0x000A50, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_BlendListByBool_1) == 0x000A98, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_BlendListByBool) == 0x000AE0, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_SequencePlayer) == 0x000B28, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_StateResult_1) == 0x000B70, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_UseCachedPose) == 0x000B90, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_StateResult) == 0x000BC0, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_StateMachine) == 0x000BE0, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_Root) == 0x000CA8, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAB_Survivor00_StreamPipeReact_AnimInstance_C, AnimGraphNode_LinkedInputPose) == 0x000CC8, "Member 'UAB_Survivor00_StreamPipeReact_AnimInstance_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

