#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_SurvivorCharmsChains

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AB_SurvivorCharmsChains.AB_SurvivorCharmsChains_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_175;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_176;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_177;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_178;                                  // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_179;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_180;                                // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_181;                                // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_182;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_183;                               // 0x0048(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_184;                              // 0x0058(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __NameProperty_175) == 0x000004, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__NameProperty_175' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __NameProperty_176) == 0x000010, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__NameProperty_176' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __BlendProfile_177) == 0x000020, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__BlendProfile_177' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __CurveFloat_178) == 0x000028, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__CurveFloat_178' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __BoolProperty_179) == 0x000030, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__BoolProperty_179' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __EnumProperty_180) == 0x000031, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__EnumProperty_180' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __EnumProperty_181) == 0x000032, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__EnumProperty_181' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __ArrayProperty_182) == 0x000038, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__ArrayProperty_182' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __ArrayProperty_183) == 0x000048, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__ArrayProperty_183' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, __StructProperty_184) == 0x000058, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::__StructProperty_184' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AB_SurvivorCharmsChains.AB_SurvivorCharmsChains_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData) == 0x000005, "Wrong size on AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000002, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x000003, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x000004, "Member 'AB_SurvivorCharmsChains::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");

}

