#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AB_Slasher_01.AB_Slasher_01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AB_Slasher_01_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Slasher_01_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Slasher_01_C_AnimGraph");
static_assert(sizeof(AB_Slasher_01_C_AnimGraph) == 0x000010, "Wrong size on AB_Slasher_01_C_AnimGraph");
static_assert(offsetof(AB_Slasher_01_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AB_Slasher_01_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function AB_Slasher_01.AB_Slasher_01_C.ExecuteUbergraph_AB_Slasher_01
// 0x00A8 (0x00A8 - 0x0000)
struct AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AB_Slasher_SubGraph_LookAt_C> K2Node_DynamicCast_AsBPI_AB_Slasher_Sub_Graph_Look_At; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01) == 0x000008, "Wrong alignment on AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01");
static_assert(sizeof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01) == 0x0000A8, "Wrong size on AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, EntryPoint) == 0x000000, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_GetSocketLocation_ReturnValue) == 0x000050, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000080, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000088, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, K2Node_DynamicCast_AsBPI_AB_Slasher_Sub_Graph_Look_At) == 0x000090, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::K2Node_DynamicCast_AsBPI_AB_Slasher_Sub_Graph_Look_At' has a wrong offset!");
static_assert(offsetof(AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'AB_Slasher_01_C_ExecuteUbergraph_AB_Slasher_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

