#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_BaseAttack_00

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Slasher_SubGraph_BaseAttack_00.AB_Slasher_SubGraph_BaseAttack_00_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

// ScriptStruct AB_Slasher_SubGraph_BaseAttack_00.AB_Slasher_SubGraph_BaseAttack_00_C.AnimBlueprintGeneratedConstantData
// 0x01AF (0x01B0 - 0x0001)
struct AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_233;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_234;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_235;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_236;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_237;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_238;                                // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_239;                                // 0x003C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_240;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_241;                              // 0x004C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_242;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_243;                                // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_244;                                // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_245;                                // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_246;                                // 0x0080(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_247;                                // 0x008C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_248;                                 // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_249;                                // 0x009C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_250;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_251;                                // 0x00AC(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_252;                                // 0x00B8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_253;                                // 0x00C4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_254;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_255;                                // 0x00D4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_256;                                // 0x00E0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_257;                                 // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_258;                              // 0x00F0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0118(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0198(0x0018)()
};
static_assert(alignof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData) == 0x0001B0, "Wrong size on AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_233) == 0x000004, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_233' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_234) == 0x000010, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_234' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __IntProperty_235) == 0x00001C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__IntProperty_235' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_236) == 0x000020, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_236' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __IntProperty_237) == 0x00002C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__IntProperty_237' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_238) == 0x000030, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_238' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_239) == 0x00003C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_239' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __FloatProperty_240) == 0x000048, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__FloatProperty_240' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __StructProperty_241) == 0x00004C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__StructProperty_241' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __FloatProperty_242) == 0x000078, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__FloatProperty_242' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __BoolProperty_243) == 0x00007C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__BoolProperty_243' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __EnumProperty_244) == 0x00007D, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__EnumProperty_244' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __ByteProperty_245) == 0x00007E, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__ByteProperty_245' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_246) == 0x000080, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_246' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_247) == 0x00008C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_247' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __IntProperty_248) == 0x000098, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__IntProperty_248' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_249) == 0x00009C, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_249' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __IntProperty_250) == 0x0000A8, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__IntProperty_250' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_251) == 0x0000AC, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_251' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_252) == 0x0000B8, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_252' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_253) == 0x0000C4, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_253' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __IntProperty_254) == 0x0000D0, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__IntProperty_254' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_255) == 0x0000D4, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_255' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __NameProperty_256) == 0x0000E0, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__NameProperty_256' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __IntProperty_257) == 0x0000EC, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__IntProperty_257' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, __StructProperty_258) == 0x0000F0, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::__StructProperty_258' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000118, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000198, "Member 'AB_Slasher_SubGraph_BaseAttack_00::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

