#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Survivor_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AB_Survivor_00_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_Survivor_00.AB_Survivor_00_C
// 0x22E0 (0x2910 - 0x0630)
class UAB_Survivor_00_C : public USurvivorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AB_Survivor_00::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0638(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_63A[0x6];                                      // 0x063A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0640(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0648(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0650(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0670(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0740(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0760(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0830(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0850(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0870(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0940(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0960(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0A30(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0A50(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0B20(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0B40(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0C10(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0C30(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D00(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0D20(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0D70(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0E78(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0EA8(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0FB0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0FF8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x10D8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1108(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1138(0x0030)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_5;                   // 0x1168(0x0100)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_3;                       // 0x1268(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_2;                       // 0x1320(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_1;                       // 0x13D8(0x00B8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x1490(0x00D0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x1560(0x00B8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_4;                   // 0x1618(0x0100)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x1718(0x00D0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x17E8(0x00D0)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_3;                   // 0x18B8(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x19B8(0x0050)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_2;                   // 0x1A08(0x0100)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x1B08(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1C08(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1CD8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1D20(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1E00(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1F08(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1F38(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x1F68(0x00D0)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x2038(0x0100)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x2138(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2208(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2258(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2280(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x22A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x22F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2310(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2358(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2378(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2440(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2520(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x25F0(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x2638(0x00D0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x2708(0x00D0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x27D8(0x00D0)()
	bool                                          __CustomProperty__isCrawling_ACC0BB80497248397CD26EAC6A80B78A; // 0x28A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__inAir_ACC0BB80497248397CD26EAC6A80B78A; // 0x28A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AA[0x2];                                     // 0x28AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty__speed_ACC0BB80497248397CD26EAC6A80B78A; // 0x28AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty__maxSpeed_ACC0BB80497248397CD26EAC6A80B78A; // 0x28B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty__dropStaggerTimeLeft_ACC0BB80497248397CD26EAC6A80B78A; // 0x28B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isS2702_E892D78E41219B65274825A0A6068C22; // 0x28B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isS27_E892D78E41219B65274825A0A6068C22; // 0x28B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isS2602_E892D78E41219B65274825A0A6068C22; // 0x28BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isS26_E892D78E41219B65274825A0A6068C22; // 0x28BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isSteve_E892D78E41219B65274825A0A6068C22; // 0x28BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isJohn_E892D78E41219B65274825A0A6068C22; // 0x28BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isCrouched_E892D78E41219B65274825A0A6068C22; // 0x28BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isJane_E892D78E41219B65274825A0A6068C22; // 0x28BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isKate_E892D78E41219B65274825A0A6068C22; // 0x28C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__dynamics_E892D78E41219B65274825A0A6068C22; // 0x28C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingLantern_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingWormholeFatherKeyCard_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingVhs_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingSprayObject_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingLamentBox_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingMirror_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__disableArmOverride_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingVaccine_A67A9EE84C6B0F166BCED3B099057E92; // 0x28C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isInjured_A67A9EE84C6B0F166BCED3B099057E92; // 0x28CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isHoldingFlashBang_A67A9EE84C6B0F166BCED3B099057E92; // 0x28CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isFrightScream_A67A9EE84C6B0F166BCED3B099057E92; // 0x28CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__holdAimItem_A67A9EE84C6B0F166BCED3B099057E92; // 0x28CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__useAimItem_A67A9EE84C6B0F166BCED3B099057E92; // 0x28CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__smallItem_A67A9EE84C6B0F166BCED3B099057E92; // 0x28CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__fireCracker_A67A9EE84C6B0F166BCED3B099057E92; // 0x28D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D1[0x3];                                     // 0x28D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty__speed_A67A9EE84C6B0F166BCED3B099057E92; // 0x28D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__holdingItem_A67A9EE84C6B0F166BCED3B099057E92; // 0x28D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isCrawling_A67A9EE84C6B0F166BCED3B099057E92; // 0x28D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isCrawling_C06415134CD56CBD79193CADED004E18; // 0x28DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldUseDynamics;                                 // 0x28DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKate;                                            // 0x28DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsJane;                                            // 0x28DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsS26;                                             // 0x28DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsS26_02;                                          // 0x28DF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsS27_02;                                          // 0x28E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsS27;                                             // 0x28E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override;                                          // 0x28E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _isSteve;                                          // 0x28E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _isJohn;                                           // 0x28E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E5[0x3];                                     // 0x28E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          FaceIdle;                                          // 0x28E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FaceAdditive;                                      // 0x28F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FaceIdleInjured;                                   // 0x28F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FaceAdditive_Inverted;                             // 0x2900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_00_AnimGraphNode_TransitionResult_235F69074FC3A036506E4A9ECD20AE97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_00_AnimGraphNode_TransitionResult_355C1A6440A720937962D89A91E0D058();
	void ExecuteUbergraph_AB_Survivor_00(int32 EntryPoint);
	void KillerSpecificSurvivorAnimation(const struct FPoseLink& InPose, struct FPoseLink* Param_KillerSpecificSurvivorAnimation);
	void KillerSpecivicSurvivorAnimationAfterMontage(const struct FPoseLink& InPose_, struct FPoseLink* Param_KillerSpecivicSurvivorAnimationAfterMontage);
	void Survivor_InteractionUpperBody2_Layer(const struct FPoseLink& InPose, struct FPoseLink* Param_Survivor_InteractionUpperBody2_Layer);
