#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_SurvivorCharmsChains

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_SurvivorCharmsChains.AB_SurvivorCharmsChains_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct AB_SurvivorCharmsChains_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_SurvivorCharmsChains_C_AnimGraph) == 0x000008, "Wrong alignment on AB_SurvivorCharmsChains_C_AnimGraph");
static_assert(sizeof(AB_SurvivorCharmsChains_C_AnimGraph) == 0x000020, "Wrong size on AB_SurvivorCharmsChains_C_AnimGraph");
static_assert(offsetof(AB_SurvivorCharmsChains_C_AnimGraph, InPose) == 0x000000, "Member 'AB_SurvivorCharmsChains_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'AB_SurvivorCharmsChains_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function AB_SurvivorCharmsChains.AB_SurvivorCharmsChains_C.ExecuteUbergraph_AB_SurvivorCharmsChains
// 0x0050 (0x0050 - 0x0000)
struct AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharmAttacher*                         K2Node_DynamicCast_AsCharm_Attacher;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorAttachedOn_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDMenuPlayer*                         K2Node_DynamicCast_AsDBDMenu_Player;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains) == 0x000008, "Wrong alignment on AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains");
static_assert(sizeof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains) == 0x000050, "Wrong size on AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, EntryPoint) == 0x000000, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, K2Node_DynamicCast_AsCharm_Attacher) == 0x000018, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::K2Node_DynamicCast_AsCharm_Attacher' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, CallFunc_GetActorAttachedOn_ReturnValue) == 0x000028, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::CallFunc_GetActorAttachedOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, K2Node_DynamicCast_AsDBDMenu_Player) == 0x000030, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::K2Node_DynamicCast_AsDBDMenu_Player' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, K2Node_DynamicCast_AsCamper_Player) == 0x000040, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'AB_SurvivorCharmsChains_C_ExecuteUbergraph_AB_SurvivorCharmsChains::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

