#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Survivor00_Lantern_AnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Survivor00_Lantern_AnimInstance.AB_Survivor00_Lantern_AnimInstance_C.AnimBlueprintGeneratedConstantData
// 0x0157 (0x0158 - 0x0001)
struct AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_75;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_76;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_77;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_78;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_79;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_80;                               // 0x0028(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_81;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_82;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_83;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_84;                                 // 0x005A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_85;                                 // 0x005C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_86;                                  // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_87;                                 // 0x006C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_88;                                  // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_89;                                 // 0x007C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x0088(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_91;                               // 0x0098(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
};
static_assert(alignof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData) == 0x000158, "Wrong size on AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_75) == 0x000004, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_75' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_76) == 0x000010, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_76' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __IntProperty_77) == 0x00001C, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__IntProperty_77' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __BoolProperty_78) == 0x000020, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__BoolProperty_78' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __FloatProperty_79) == 0x000024, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__FloatProperty_79' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __StructProperty_80) == 0x000028, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__StructProperty_80' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __FloatProperty_81) == 0x000054, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__FloatProperty_81' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __BoolProperty_82) == 0x000058, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__BoolProperty_82' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __EnumProperty_83) == 0x000059, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__EnumProperty_83' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __ByteProperty_84) == 0x00005A, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__ByteProperty_84' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_85) == 0x00005C, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_85' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __IntProperty_86) == 0x000068, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__IntProperty_86' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x00006C, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __IntProperty_88) == 0x000078, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__IntProperty_88' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_89) == 0x00007C, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_89' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000088, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, __StructProperty_91) == 0x000098, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::__StructProperty_91' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'AB_Survivor00_Lantern_AnimInstance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

