#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_BaseAttack_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Aset_Slasher_BaseAttack_structs.hpp"


namespace SDK::Params
{

// Function AB_Slasher_SubGraph_BaseAttack_00.AB_Slasher_SubGraph_BaseAttack_00_C.SetAttackAnimationFromMainAB
// 0x0078 (0x0078 - 0x0000)
struct AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB final
{
public:
	struct FAset_Slasher_BaseAttack               AttackAnimset;                                     // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB");
static_assert(sizeof(AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB) == 0x000078, "Wrong size on AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB, AttackAnimset) == 0x000000, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_SetAttackAnimationFromMainAB::AttackAnimset' has a wrong offset!");

// Function AB_Slasher_SubGraph_BaseAttack_00.AB_Slasher_SubGraph_BaseAttack_00_C.ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAset_Slasher_BaseAttack               K2Node_Event_AttackAnimSet;                        // 0x0008(0x0078)(ConstParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00");
static_assert(sizeof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00) == 0x0000B8, "Wrong size on AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, EntryPoint) == 0x000000, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, K2Node_Event_AttackAnimSet) == 0x000008, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::K2Node_Event_AttackAnimSet' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000080, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000081, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000084, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000089, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue) == 0x00008A, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_1) == 0x00008B, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_2) == 0x00008C, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue_1) == 0x00008D, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_3) == 0x00008E, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue_2) == 0x00008F, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000090, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000091, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000093, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue_3) == 0x000094, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_4) == 0x000095, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue_4) == 0x000096, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_5) == 0x000097, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue_5) == 0x000098, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_6) == 0x000099, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_Not_PreBool_ReturnValue_7) == 0x00009A, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanAND_ReturnValue_6) == 0x00009B, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00009C, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00009D, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x0000A0, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0000A5, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x0000A6, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A7, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x0000A8, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x0000A9, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanOR_ReturnValue_2) == 0x0000AA, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x0000AC, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x0000B0, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x0000B1, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00, CallFunc_BooleanOR_ReturnValue_3) == 0x0000B2, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_ExecuteUbergraph_AB_Slasher_SubGraph_BaseAttack_00::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function AB_Slasher_SubGraph_BaseAttack_00.AB_Slasher_SubGraph_BaseAttack_00_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph");
static_assert(sizeof(AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph) == 0x000020, "Wrong size on AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph, InPose) == 0x000000, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'AB_Slasher_SubGraph_BaseAttack_00_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

