#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TheTrapper_classes.hpp"
#include "Aset_Slasher_LookAT_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "AB_Slasher_01_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AB_Slasher_01.AB_Slasher_01_C
// 0x09C0 (0x10E0 - 0x0720)
class UAB_Slasher_01_C final : public UTrapperAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AB_Slasher_01::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0728(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_72A[0x6];                                      // 0x072A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0738(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0740(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0748(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_4;                       // 0x0768(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_3;                       // 0x0820(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x08D8(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0928(0x0050)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_2;                       // 0x0978(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_1;                       // 0x0A30(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x0AE8(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0BA0(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0BF0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0C38(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0C68(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C98(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DD0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DF0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0E10(0x0108)()
	bool                                          __CustomProperty__shouldResetLookAtOnAnyInteraction_4219668D4588B9C1E397D0841A680431; // 0x0F18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__shouldResetLookAtOnAnyMontagePlay_4219668D4588B9C1E397D0841A680431; // 0x0F19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1A[0x2];                                      // 0x0F1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty__blendTime_4219668D4588B9C1E397D0841A680431; // 0x0F1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__enableDynamics_4219668D4588B9C1E397D0841A680431; // 0x0F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__FirstPersonView_4219668D4588B9C1E397D0841A680431; // 0x0F21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F22[0x6];                                      // 0x0F22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty__animPitch_4219668D4588B9C1E397D0841A680431; // 0x0F28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty__animDirection_23A59038435947E12390B7820BB0846A; // 0x0F30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty__animSpeed_23A59038435947E12390B7820BB0846A; // 0x0F38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isAttacking_23A59038435947E12390B7820BB0846A; // 0x0F40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isIdle_23A59038435947E12390B7820BB0846A; // 0x0F41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isInAir_23A59038435947E12390B7820BB0846A; // 0x0F42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionAnimation                         __CustomProperty__interactionType_23A59038435947E12390B7820BB0846A; // 0x0F43(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isCarrying_23A59038435947E12390B7820BB0846A; // 0x0F44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__firstPersonView_FE7643F54EC4E22F9894C4981B832801; // 0x0F45(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F46[0x2];                                      // 0x0F46(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty__direction_FE7643F54EC4E22F9894C4981B832801; // 0x0F48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isAttack_FE7643F54EC4E22F9894C4981B832801; // 0x0F4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__isIdle_FE7643F54EC4E22F9894C4981B832801; // 0x0F4D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty__FirstPersonView_69CFA2FF4D91CC2BBCFE28A2B79B226B; // 0x0F4E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4F[0x1];                                      // 0x0F4F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Attack_In;                                         // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_In_FPV;                                     // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_Swing;                                      // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_Swing_FPV;                                  // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_Hit;                                        // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_Hit_FPV;                                    // 0x0F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_Miss;                                       // 0x0F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_Miss_FPV;                                   // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_BOW;                                        // 0x0F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Attack_BOW_FPV;                                    // 0x0F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_Locomotion;                                     // 0x0FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_Locomotion_FPV;                                 // 0x0FA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Idle;                                              // 0x0FB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Idle_FPV;                                          // 0x0FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Idle;                                        // 0x0FC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Idle_FPV;                                    // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Search_Locker;                                     // 0x0FD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          WalkToFall;                                        // 0x0FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          WalktoFall_FPV;                                    // 0x0FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Falling;                                           // 0x0FE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Falling_FPV;                                       // 0x0FF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          LandLight;                                         // 0x0FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          LandLight_FPV;                                     // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          BS_Land;                                           // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          BS_Land_FPV;                                       // 0x1010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_Carry_Locomotion;                               // 0x1018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_Carry_locomotion_FPV;                           // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   AimOffset;                                         // 0x1028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   AimOffset_FPV;                                     // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_In;                                   // 0x1038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_In_FPV;                               // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_Swing;                                // 0x1048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_Swing_FPV;                            // 0x1050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_Out;                                  // 0x1058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_Out_FPV;                              // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_BOW;                                  // 0x1068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Carry_Attack_BOW_FPV;                              // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Stand;                                             // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        _SpeedRate;                                        // 0x1080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          BS_TT_PushBack_RT;                                 // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          BS_TT_PushBack_LT;                                 // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          EndGameWalk;                                       // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAset_Slasher_LookAT                   LookAtAnimSet;                                     // 0x10A0(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintLinkedAnimationLayersInitialized();
	void AnimNotify_FX_TT_BreakableWall_Kick_Decal();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_AB_Slasher_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Slasher_01_C">();
	}
	static class UAB_Slasher_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Slasher_01_C>();
	}
};
static_assert(alignof(UAB_Slasher_01_C) == 0x000010, "Wrong alignment on UAB_Slasher_01_C");
static_assert(sizeof(UAB_Slasher_01_C) == 0x0010E0, "Wrong size on UAB_Slasher_01_C");
static_assert(offsetof(UAB_Slasher_01_C, UberGraphFrame) == 0x000720, "Member 'UAB_Slasher_01_C::UberGraphFrame' has a wrong offset!");
