#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_SmallMeatLocker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_SmallMeatLocker.AB_SmallMeatLocker_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_113;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_114;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_115;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_116;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_117;                                // 0x002C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_118;                                // 0x0038(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_119;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_120;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_121;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_122;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_123;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_124;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_125;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_126;                                // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_127;                                // 0x0084(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_128;                                // 0x0090(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_129;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_130;                              // 0x00A0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x000004, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_114) == 0x000010, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_114' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __IntProperty_115) == 0x00001C, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__IntProperty_115' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_116) == 0x000020, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_116' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_117) == 0x00002C, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_117' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_118) == 0x000038, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_118' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __IntProperty_119) == 0x000044, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__IntProperty_119' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __BoolProperty_120) == 0x000048, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__BoolProperty_120' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __FloatProperty_121) == 0x00004C, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__FloatProperty_121' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __StructProperty_122) == 0x000050, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__StructProperty_122' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __FloatProperty_123) == 0x00007C, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__FloatProperty_123' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __BoolProperty_124) == 0x000080, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__BoolProperty_124' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __EnumProperty_125) == 0x000081, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__EnumProperty_125' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __ByteProperty_126) == 0x000082, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__ByteProperty_126' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_127) == 0x000084, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_127' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __NameProperty_128) == 0x000090, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__NameProperty_128' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __IntProperty_129) == 0x00009C, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__IntProperty_129' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, __StructProperty_130) == 0x0000A0, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::__StructProperty_130' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'AB_SmallMeatLocker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

