#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_Locomotion_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Slasher_SubGraph_Locomotion_00.AB_Slasher_SubGraph_Locomotion_00_C.AnimBlueprintGeneratedMutableData
// 0x004B (0x004C - 0x0001)
struct AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0025(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0026(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0036(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0037(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData) == 0x00004C, "Wrong size on AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000D, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000018, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x00001C, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000020, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000024, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_9) == 0x000025, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_9' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_10) == 0x000026, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_10' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000028, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x00002C, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000030, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x000034, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_15) == 0x000035, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_15' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_16) == 0x000036, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_17) == 0x000037, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_17' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_18) == 0x000038, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_18' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_19) == 0x00003C, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_19' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __BoolProperty_20) == 0x000040, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__BoolProperty_20' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_21) == 0x000044, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_21' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData, __FloatProperty_22) == 0x000048, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedMutableData::__FloatProperty_22' has a wrong offset!");

// ScriptStruct AB_Slasher_SubGraph_Locomotion_00.AB_Slasher_SubGraph_Locomotion_00_C.AnimBlueprintGeneratedConstantData
// 0x0207 (0x0208 - 0x0001)
struct AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_449;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_450;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_451;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_452;                                // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_453;                                // 0x0024(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_454;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_455;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_456;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_457;                                // 0x0050(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_458;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_459;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_460;                                // 0x0070(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_461;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_462;                                // 0x0080(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_463;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_464;                                // 0x0090(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_465;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_466;                               // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_467;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_468;                               // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_469;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_470;                                  // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_471;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_472;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_473;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_474;                              // 0x00F0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_475;                               // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_476;                                // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_477;                               // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_478;                                // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_479;                                // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_480;                                // 0x012A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_481;                                // 0x012C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_482;                                // 0x0138(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_483;                                 // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_484;                              // 0x0148(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0170(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01F0(0x0018)()
};
static_assert(alignof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData) == 0x000208, "Wrong size on AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData, __NameProperty_449) == 0x000004, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData::__NameProperty_449' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData, __NameProperty_450) == 0x000010, "Member 'AB_Slasher_SubGraph_Locomotion_00::FAnimBlueprintGeneratedConstantData::__NameProperty_450' has a wrong offset!");
