#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Slasher_SubGraph_LegIK_00

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AB_Slasher_SubGraph_LegIK_00.AB_Slasher_SubGraph_LegIK_00_C.AnimBlueprintGeneratedConstantData
// 0x00DF (0x00E0 - 0x0001)
struct AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_4;                                  // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_5;                                  // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_6;                                // 0x0020(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
};
static_assert(alignof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData) == 0x0000E0, "Wrong size on AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData, __NameProperty_4) == 0x000004, "Member 'AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData::__NameProperty_4' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData, __NameProperty_5) == 0x000010, "Member 'AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData::__NameProperty_5' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData, __StructProperty_6) == 0x000020, "Member 'AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData::__StructProperty_6' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000048, "Member 'AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C8, "Member 'AB_Slasher_SubGraph_LegIK_00::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

