#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_FireCracker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABSub_Survivor00_FireCracker.ABSub_Survivor00_FireCracker_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABSub_Survivor00_FireCracker_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_Survivor00_FireCracker_C_AnimGraph) == 0x000008, "Wrong alignment on ABSub_Survivor00_FireCracker_C_AnimGraph");
static_assert(sizeof(ABSub_Survivor00_FireCracker_C_AnimGraph) == 0x000020, "Wrong size on ABSub_Survivor00_FireCracker_C_AnimGraph");
static_assert(offsetof(ABSub_Survivor00_FireCracker_C_AnimGraph, InPose) == 0x000000, "Member 'ABSub_Survivor00_FireCracker_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'ABSub_Survivor00_FireCracker_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABSub_Survivor00_FireCracker.ABSub_Survivor00_FireCracker_C.ExecuteUbergraph_ABSub_Survivor00_FireCracker
// 0x0004 (0x0004 - 0x0000)
struct ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker) == 0x000004, "Wrong alignment on ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker");
static_assert(sizeof(ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker) == 0x000004, "Wrong size on ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker");
static_assert(offsetof(ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker, EntryPoint) == 0x000000, "Member 'ABSub_Survivor00_FireCracker_C_ExecuteUbergraph_ABSub_Survivor00_FireCracker::EntryPoint' has a wrong offset!");

// Function ABSub_Survivor00_FireCracker.ABSub_Survivor00_FireCracker_C.SurvivorInteractionCollectableLayer
// 0x0020 (0x0020 - 0x0000)
struct ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SurvivorInteractionCollectableLayer;         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer) == 0x000008, "Wrong alignment on ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer");
static_assert(sizeof(ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer) == 0x000020, "Wrong size on ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer");
static_assert(offsetof(ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer, InPose) == 0x000000, "Member 'ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer, Param_SurvivorInteractionCollectableLayer) == 0x000010, "Member 'ABSub_Survivor00_FireCracker_C_SurvivorInteractionCollectableLayer::Param_SurvivorInteractionCollectableLayer' has a wrong offset!");

}

