#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Scream

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABSub_Survivor00_Scream.ABSub_Survivor00_Scream_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABSub_Survivor00_Scream_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_Survivor00_Scream_C_AnimGraph) == 0x000008, "Wrong alignment on ABSub_Survivor00_Scream_C_AnimGraph");
static_assert(sizeof(ABSub_Survivor00_Scream_C_AnimGraph) == 0x000020, "Wrong size on ABSub_Survivor00_Scream_C_AnimGraph");
static_assert(offsetof(ABSub_Survivor00_Scream_C_AnimGraph, InPose) == 0x000000, "Member 'ABSub_Survivor00_Scream_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'ABSub_Survivor00_Scream_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABSub_Survivor00_Scream.ABSub_Survivor00_Scream_C.ExecuteUbergraph_ABSub_Survivor00_Scream
// 0x0004 (0x0004 - 0x0000)
struct ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream) == 0x000004, "Wrong alignment on ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream");
static_assert(sizeof(ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream) == 0x000004, "Wrong size on ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream");
static_assert(offsetof(ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream, EntryPoint) == 0x000000, "Member 'ABSub_Survivor00_Scream_C_ExecuteUbergraph_ABSub_Survivor00_Scream::EntryPoint' has a wrong offset!");

// Function ABSub_Survivor00_Scream.ABSub_Survivor00_Scream_C.Survivor_InteractionUpperBody_Layer
// 0x0020 (0x0020 - 0x0000)
struct ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_Survivor_InteractionUpperBody_Layer;         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer) == 0x000008, "Wrong alignment on ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer");
static_assert(sizeof(ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer) == 0x000020, "Wrong size on ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer");
static_assert(offsetof(ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer, InPose) == 0x000000, "Member 'ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer, Param_Survivor_InteractionUpperBody_Layer) == 0x000010, "Member 'ABSub_Survivor00_Scream_C_Survivor_InteractionUpperBody_Layer::Param_Survivor_InteractionUpperBody_Layer' has a wrong offset!");

}

