#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Interaction_Heal

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABSub_Survivor00_Interaction_Heal.ABSub_Survivor00_Interaction_Heal_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABSub_Survivor00_Interaction_Heal_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_Survivor00_Interaction_Heal_C_AnimGraph) == 0x000008, "Wrong alignment on ABSub_Survivor00_Interaction_Heal_C_AnimGraph");
static_assert(sizeof(ABSub_Survivor00_Interaction_Heal_C_AnimGraph) == 0x000020, "Wrong size on ABSub_Survivor00_Interaction_Heal_C_AnimGraph");
static_assert(offsetof(ABSub_Survivor00_Interaction_Heal_C_AnimGraph, InPose) == 0x000000, "Member 'ABSub_Survivor00_Interaction_Heal_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Heal_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'ABSub_Survivor00_Interaction_Heal_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABSub_Survivor00_Interaction_Heal.ABSub_Survivor00_Interaction_Heal_C.ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal
// 0x0004 (0x0004 - 0x0000)
struct ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal) == 0x000004, "Wrong alignment on ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal");
static_assert(sizeof(ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal) == 0x000004, "Wrong size on ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal");
static_assert(offsetof(ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal, EntryPoint) == 0x000000, "Member 'ABSub_Survivor00_Interaction_Heal_C_ExecuteUbergraph_ABSub_Survivor00_Interaction_Heal::EntryPoint' has a wrong offset!");

// Function ABSub_Survivor00_Interaction_Heal.ABSub_Survivor00_Interaction_Heal_C.SurvivorInteractionLayer
// 0x0020 (0x0020 - 0x0000)
struct ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SurvivorInteractionLayer;                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer) == 0x000008, "Wrong alignment on ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer");
static_assert(sizeof(ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer) == 0x000020, "Wrong size on ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer");
static_assert(offsetof(ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer, InPose) == 0x000000, "Member 'ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer, Param_SurvivorInteractionLayer) == 0x000010, "Member 'ABSub_Survivor00_Interaction_Heal_C_SurvivorInteractionLayer::Param_SurvivorInteractionLayer' has a wrong offset!");

}

