#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Breathing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Breathing.ABSub_Survivor00_Breathing_C
// 0x06A0 (0x0CB0 - 0x0610)
class UABSub_Survivor00_Breathing_C final : public UBreathingSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0618(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0620(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0628(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0718(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0898(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x08C0(0x0030)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x08F0(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x09C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0A30(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0A60(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A80(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0AB0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B80(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BC8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0BE8(0x00C8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABSub_Survivor00_Breathing(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Breathing_C">();
	}
	static class UABSub_Survivor00_Breathing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Breathing_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Breathing_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Breathing_C");
static_assert(sizeof(UABSub_Survivor00_Breathing_C) == 0x000CB0, "Wrong size on UABSub_Survivor00_Breathing_C");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, UberGraphFrame) == 0x000610, "Member 'UABSub_Survivor00_Breathing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimBlueprintExtension_PropertyAccess) == 0x000618, "Member 'UABSub_Survivor00_Breathing_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimBlueprintExtension_Base) == 0x000620, "Member 'UABSub_Survivor00_Breathing_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_SubInput) == 0x000628, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_SaveCachedPose) == 0x000718, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_TransitionResult_3) == 0x000820, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_TransitionResult_2) == 0x000848, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_TransitionResult_1) == 0x000870, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_TransitionResult) == 0x000898, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_UseCachedPose_2) == 0x0008C0, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x0008F0, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_SequencePlayer_1) == 0x0009C8, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_StateResult_2) == 0x000A10, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_UseCachedPose_1) == 0x000A30, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_StateResult_1) == 0x000A60, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_UseCachedPose) == 0x000A80, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_ApplyAdditive) == 0x000AB0, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_SequencePlayer) == 0x000B80, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_StateResult) == 0x000BC8, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Breathing_C, AnimGraphNode_StateMachine) == 0x000BE8, "Member 'UABSub_Survivor00_Breathing_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

