#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Flashlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Flashlight.ABSub_Survivor00_Flashlight_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_193;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_194;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_195;                                  // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_196;                                // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_197;                                // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_198;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_199;                                // 0x0038(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_200;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_201;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_202;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_203;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_204;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_205;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_206;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_207;                                // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_208;                                // 0x0084(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_209;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_210;                                // 0x0094(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_211;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_212;                                // 0x00A4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_213;                                // 0x00B0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_214;                              // 0x00C0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0168(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __NameProperty_193) == 0x000004, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__NameProperty_193' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __BlendProfile_194) == 0x000010, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__BlendProfile_194' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __CurveFloat_195) == 0x000018, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__CurveFloat_195' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __EnumProperty_196) == 0x000020, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__EnumProperty_196' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __EnumProperty_197) == 0x000021, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__EnumProperty_197' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __ArrayProperty_198) == 0x000028, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__ArrayProperty_198' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __NameProperty_199) == 0x000038, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__NameProperty_199' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __IntProperty_200) == 0x000044, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__IntProperty_200' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __BoolProperty_201) == 0x000048, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__BoolProperty_201' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __FloatProperty_202) == 0x00004C, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__FloatProperty_202' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __StructProperty_203) == 0x000050, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__StructProperty_203' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __FloatProperty_204) == 0x00007C, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__FloatProperty_204' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __BoolProperty_205) == 0x000080, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__BoolProperty_205' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __EnumProperty_206) == 0x000081, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__EnumProperty_206' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __ByteProperty_207) == 0x000082, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__ByteProperty_207' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __NameProperty_208) == 0x000084, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__NameProperty_208' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __IntProperty_209) == 0x000090, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__IntProperty_209' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __NameProperty_210) == 0x000094, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__NameProperty_210' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __IntProperty_211) == 0x0000A0, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__IntProperty_211' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __NameProperty_212) == 0x0000A4, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__NameProperty_212' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __NameProperty_213) == 0x0000B0, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__NameProperty_213' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, __StructProperty_214) == 0x0000C0, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::__StructProperty_214' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E8, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000168, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABSub_Survivor00_Flashlight.ABSub_Survivor00_Flashlight_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000004, "Member 'ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");

}

