#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_RepairGenerator_Left

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_RepairGenerator_Left.ABSub_RepairGenerator_Left_C.AnimBlueprintGeneratedConstantData
// 0x0187 (0x0188 - 0x0001)
struct ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_176;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_177;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_178;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_179;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_180;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_181;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_182;                                // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_183;                                // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_184;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_185;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_186;                                // 0x0050(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_187;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_188;                                // 0x0060(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_189;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_190;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_191;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_192;                              // 0x0078(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_193;                               // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_194;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_195;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_196;                                // 0x00AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_197;                                // 0x00AC(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_198;                                // 0x00B8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_199;                                 // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_200;                              // 0x00C8(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0170(0x0018)()
};
static_assert(alignof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData) == 0x000188, "Wrong size on ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_176) == 0x000004, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_176' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_177) == 0x000010, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_177' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __IntProperty_178) == 0x00001C, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__IntProperty_178' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_179) == 0x000020, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_179' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __IntProperty_180) == 0x00002C, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__IntProperty_180' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __EnumProperty_181) == 0x000030, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__EnumProperty_181' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __ByteProperty_182) == 0x000031, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__ByteProperty_182' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_183) == 0x000034, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_183' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_184) == 0x000040, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_184' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __IntProperty_185) == 0x00004C, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__IntProperty_185' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_186) == 0x000050, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_186' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __IntProperty_187) == 0x00005C, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__IntProperty_187' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_188) == 0x000060, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_188' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __IntProperty_189) == 0x00006C, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__IntProperty_189' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __BoolProperty_190) == 0x000070, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__BoolProperty_190' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __FloatProperty_191) == 0x000074, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__FloatProperty_191' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __StructProperty_192) == 0x000078, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__StructProperty_192' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __FloatProperty_193) == 0x0000A4, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__FloatProperty_193' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __BoolProperty_194) == 0x0000A8, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__BoolProperty_194' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __EnumProperty_195) == 0x0000A9, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__EnumProperty_195' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __ByteProperty_196) == 0x0000AA, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__ByteProperty_196' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_197) == 0x0000AC, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_197' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __NameProperty_198) == 0x0000B8, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__NameProperty_198' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __IntProperty_199) == 0x0000C4, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__IntProperty_199' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, __StructProperty_200) == 0x0000C8, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::__StructProperty_200' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F0, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000170, "Member 'ABSub_RepairGenerator_Left::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

