#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Interaction_Sabotage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Interaction_Sabotage.ABSub_Survivor00_Interaction_Sabotage_C
// 0x0690 (0x0D30 - 0x06A0)
class UABSub_Survivor00_Interaction_Sabotage_C final : public USabotageSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x06B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x06D8(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07A8(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x08B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x08D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0928(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0950(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0978(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x09A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x09C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x09F0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A88(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0AA8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0AF0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B10(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0B58(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0B78(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C40(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0C60(0x00D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_InteractionLayerDone();
	void ExecuteUbergraph_ABSub_Survivor00_Interaction_Sabotage(int32 EntryPoint);
	void SurvivorInteractionLayer(const struct FPoseLink& InPose, struct FPoseLink* Param_SurvivorInteractionLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Interaction_Sabotage_C">();
	}
	static class UABSub_Survivor00_Interaction_Sabotage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Interaction_Sabotage_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Interaction_Sabotage_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Interaction_Sabotage_C");
static_assert(sizeof(UABSub_Survivor00_Interaction_Sabotage_C) == 0x000D30, "Wrong size on UABSub_Survivor00_Interaction_Sabotage_C");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, UberGraphFrame) == 0x0006A0, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimBlueprintExtension_Base) == 0x0006B0, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_Root_1) == 0x0006B8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_LinkedInputPose_1) == 0x0006D8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_SaveCachedPose) == 0x0007A8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_7) == 0x0008B0, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_6) == 0x0008D8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_5) == 0x000900, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_4) == 0x000928, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_3) == 0x000950, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_2) == 0x000978, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult_1) == 0x0009A0, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_TransitionResult) == 0x0009C8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_UseCachedPose) == 0x0009F0, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_StateResult_3) == 0x000A20, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_SequencePlayer_2) == 0x000A40, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_StateResult_2) == 0x000A88, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_SequencePlayer_1) == 0x000AA8, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_StateResult_1) == 0x000AF0, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_SequencePlayer) == 0x000B10, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_StateResult) == 0x000B58, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_StateMachine) == 0x000B78, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_Root) == 0x000C40, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Sabotage_C, AnimGraphNode_LinkedInputPose) == 0x000C60, "Member 'UABSub_Survivor00_Interaction_Sabotage_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

