#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Crown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "ABSub_Survivor00_Crown_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Crown.ABSub_Survivor00_Crown_C
// 0x0810 (0x0E60 - 0x0650)
class UABSub_Survivor00_Crown_C final : public UCrownSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABSub_Survivor00_Crown::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0658(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0678(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0680(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0688(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x06A8(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0778(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0948(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0970(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x09B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0A00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A48(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0A68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0AB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0AF8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B40(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0B60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0BA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0BF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0C38(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0C58(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0C88(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0CA8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D70(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0D90(0x00D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_InteractionLayerDone();
	void ExecuteUbergraph_ABSub_Survivor00_Crown(int32 EntryPoint);
	void SurvivorInteractionLayer(const struct FPoseLink& InPose, struct FPoseLink* Param_SurvivorInteractionLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Crown_C">();
	}
	static class UABSub_Survivor00_Crown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Crown_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Crown_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Crown_C");
static_assert(sizeof(UABSub_Survivor00_Crown_C) == 0x000E60, "Wrong size on UABSub_Survivor00_Crown_C");
static_assert(offsetof(UABSub_Survivor00_Crown_C, UberGraphFrame) == 0x000650, "Member 'UABSub_Survivor00_Crown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, __AnimBlueprintMutables) == 0x000658, "Member 'UABSub_Survivor00_Crown_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimBlueprintExtension_PropertyAccess) == 0x000678, "Member 'UABSub_Survivor00_Crown_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimBlueprintExtension_Base) == 0x000680, "Member 'UABSub_Survivor00_Crown_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_Root_1) == 0x000688, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_LinkedInputPose) == 0x0006A8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SaveCachedPose) == 0x000778, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_TransitionResult_5) == 0x000880, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_TransitionResult_4) == 0x0008A8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_TransitionResult_3) == 0x0008D0, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_TransitionResult_2) == 0x0008F8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_TransitionResult_1) == 0x000920, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_TransitionResult) == 0x000948, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SequencePlayer_5) == 0x000970, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_BlendListByBool_2) == 0x0009B8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SequencePlayer_4) == 0x000A00, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_StateResult_3) == 0x000A48, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_BlendListByBool_1) == 0x000A68, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SequencePlayer_3) == 0x000AB0, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SequencePlayer_2) == 0x000AF8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_StateResult_2) == 0x000B40, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_BlendListByBool) == 0x000B60, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SequencePlayer_1) == 0x000BA8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SequencePlayer) == 0x000BF0, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_StateResult_1) == 0x000C38, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_UseCachedPose) == 0x000C58, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_StateResult) == 0x000C88, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_StateMachine) == 0x000CA8, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_Root) == 0x000D70, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Crown_C, AnimGraphNode_SubInput) == 0x000D90, "Member 'UABSub_Survivor00_Crown_C::AnimGraphNode_SubInput' has a wrong offset!");

}

