#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_FireCracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_FireCracker.ABSub_Survivor00_FireCracker_C.AnimBlueprintGeneratedConstantData
// 0x0177 (0x0178 - 0x0001)
struct ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_74;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_75;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_76;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_77;                                 // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_78;                                   // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_79;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_80;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_81;                                // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_82;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_83;                               // 0x004C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_84;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_85;                                 // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_86;                                 // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_87;                                 // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_88;                                 // 0x0080(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_89;                                  // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x0090(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_91;                                  // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x00A0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x00AC(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_94;                               // 0x00B8(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0160(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData) == 0x000178, "Wrong size on ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __NameProperty_74) == 0x000004, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__NameProperty_74' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __NameProperty_75) == 0x000010, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__NameProperty_75' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __IntProperty_76) == 0x00001C, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__IntProperty_76' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __BlendProfile_77) == 0x000020, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__BlendProfile_77' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __CurveFloat_78) == 0x000028, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__CurveFloat_78' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __EnumProperty_79) == 0x000030, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__EnumProperty_79' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __EnumProperty_80) == 0x000031, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__EnumProperty_80' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_81) == 0x000038, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_81' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __FloatProperty_82) == 0x000048, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__FloatProperty_82' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __StructProperty_83) == 0x00004C, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__StructProperty_83' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __FloatProperty_84) == 0x000078, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__FloatProperty_84' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __BoolProperty_85) == 0x00007C, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__BoolProperty_85' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __EnumProperty_86) == 0x00007D, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__EnumProperty_86' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __ByteProperty_87) == 0x00007E, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__ByteProperty_87' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __NameProperty_88) == 0x000080, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__NameProperty_88' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __IntProperty_89) == 0x00008C, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__IntProperty_89' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000090, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __IntProperty_91) == 0x00009C, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__IntProperty_91' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x0000A0, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x0000AC, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, __StructProperty_94) == 0x0000B8, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::__StructProperty_94' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E0, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000160, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABSub_Survivor00_FireCracker.ABSub_Survivor00_FireCracker_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABSub_Survivor00_FireCracker::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

