#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_RepairGenerator_Right

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_RepairGenerator_Right.ABSub_RepairGenerator_Right_C
// 0x0BE0 (0x0FC0 - 0x03E0)
class UABSub_RepairGenerator_Right_C final : public URepairGeneratorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0418(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x05B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x05D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x06A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x06C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x06F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0790(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x07B8(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x07E8(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x08C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0910(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0930(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0960(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A88(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0AA8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0B88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0BB8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C00(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0C20(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0C50(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0D78(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0D98(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0DC8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0DE8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0EB0(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_006F0678407D7820D78CC1B2EAB1F6CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_036641CA492DD0F93B23AA81FC40B5ED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_0954D07F4F68A3AD371AA19036B34479();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_130E7A4E4C6556BC721284B14B834D5A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_15E4D8894A873943D0AEB19FE9409560();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_17F4ED514F6C3B17586A4A81F7F37BDB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_4E0FA9D34C776C426FCC6497A8D7B5ED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_62D2AEC749CC84400B61FC8A418A8EAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_6954196E4DF1E8599B99EEAB280BD72F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_8D837755481AAE3A0FB40AA0A78DA34D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_940177DC434414AB3F2E6694D2ADACCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_AA8E365E463EA9C59C2123AD8398884B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_C096F1F64931BE41A52572BE479F5A48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_D3E225404F108D947D7F319F434A49E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Right_AnimGraphNode_TransitionResult_D7A324304C8557FA31090D8E2AE38201();
	void ExecuteUbergraph_ABSub_RepairGenerator_Right(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_RepairGenerator_Right_C">();
	}
	static class UABSub_RepairGenerator_Right_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_RepairGenerator_Right_C>();
	}
};
static_assert(alignof(UABSub_RepairGenerator_Right_C) == 0x000010, "Wrong alignment on UABSub_RepairGenerator_Right_C");
static_assert(sizeof(UABSub_RepairGenerator_Right_C) == 0x000FC0, "Wrong size on UABSub_RepairGenerator_Right_C");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, UberGraphFrame) == 0x0003E0, "Member 'UABSub_RepairGenerator_Right_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E8, "Member 'UABSub_RepairGenerator_Right_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimBlueprintExtension_Base) == 0x0003F0, "Member 'UABSub_RepairGenerator_Right_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_Root) == 0x0003F8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_SubInput) == 0x000418, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_17) == 0x0004E8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_16) == 0x000510, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_15) == 0x000538, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_14) == 0x000560, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_13) == 0x000588, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_12) == 0x0005B0, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_11) == 0x0005D8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_10) == 0x000600, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_9) == 0x000628, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_8) == 0x000650, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_7) == 0x000678, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_6) == 0x0006A0, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_5) == 0x0006C8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_4) == 0x0006F0, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_3) == 0x000718, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_2) == 0x000740, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult_1) == 0x000768, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_TransitionResult) == 0x000790, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_UseCachedPose_4) == 0x0007B8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_LayeredBoneBlend_3) == 0x0007E8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_SequencePlayer_3) == 0x0008C8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_StateResult_4) == 0x000910, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_UseCachedPose_3) == 0x000930, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_LayeredBoneBlend_2) == 0x000960, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_SequencePlayer_2) == 0x000A40, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_StateResult_3) == 0x000A88, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000AA8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_UseCachedPose_2) == 0x000B88, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_SequencePlayer_1) == 0x000BB8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_StateResult_2) == 0x000C00, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_UseCachedPose_1) == 0x000C20, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_LayeredBoneBlend) == 0x000C50, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_SequencePlayer) == 0x000D30, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_StateResult_1) == 0x000D78, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_UseCachedPose) == 0x000D98, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_StateResult) == 0x000DC8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_StateMachine) == 0x000DE8, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Right_C, AnimGraphNode_SaveCachedPose) == 0x000EB0, "Member 'UABSub_RepairGenerator_Right_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");

}

