#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Breathing

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Breathing.ABSub_Survivor00_Breathing_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_68;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_69;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_70;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_71;                                 // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_72;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_73;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_74;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_75;                               // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_76;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_77;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_78;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_79;                                 // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_80;                                 // 0x006C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_81;                                 // 0x0078(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_82;                                  // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_83;                               // 0x0088(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __NameProperty_68) == 0x000004, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__NameProperty_68' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __NameProperty_69) == 0x000010, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__NameProperty_69' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __IntProperty_70) == 0x00001C, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__IntProperty_70' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __NameProperty_71) == 0x000020, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__NameProperty_71' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __IntProperty_72) == 0x00002C, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__IntProperty_72' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __BoolProperty_73) == 0x000030, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__BoolProperty_73' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __FloatProperty_74) == 0x000034, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__FloatProperty_74' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __StructProperty_75) == 0x000038, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__StructProperty_75' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __FloatProperty_76) == 0x000064, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__FloatProperty_76' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __BoolProperty_77) == 0x000068, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__BoolProperty_77' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __EnumProperty_78) == 0x000069, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__EnumProperty_78' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __ByteProperty_79) == 0x00006A, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__ByteProperty_79' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x00006C, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x000078, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __IntProperty_82) == 0x000084, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__IntProperty_82' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, __StructProperty_83) == 0x000088, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::__StructProperty_83' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABSub_Survivor00_Breathing::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

