#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Interaction_Hook

#include "Basic.hpp"

#include "ABSub_Survivor00_Interaction_Hook_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Interaction_Hook.ABSub_Survivor00_Interaction_Hook_C
// 0x0770 (0x0DC0 - 0x0650)
class UABSub_Survivor00_Interaction_Hook_C final : public UHookSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABSub_Survivor00_Interaction_Hook::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0658(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0660(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0668(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0670(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0690(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0760(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0890(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x08E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0908(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0930(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0960(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0980(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A60(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0AA8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B18(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0B38(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B80(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0BA0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BE8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0C08(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0CD0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0CF0(0x00D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_InteractionLayerDone();
	void ExecuteUbergraph_ABSub_Survivor00_Interaction_Hook(int32 EntryPoint);
	void SurvivorInteractionLayer(const struct FPoseLink& InPose, struct FPoseLink* Param_SurvivorInteractionLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Interaction_Hook_C">();
	}
	static class UABSub_Survivor00_Interaction_Hook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Interaction_Hook_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Interaction_Hook_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Interaction_Hook_C");
static_assert(sizeof(UABSub_Survivor00_Interaction_Hook_C) == 0x000DC0, "Wrong size on UABSub_Survivor00_Interaction_Hook_C");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, UberGraphFrame) == 0x000650, "Member 'UABSub_Survivor00_Interaction_Hook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, __AnimBlueprintMutables) == 0x000658, "Member 'UABSub_Survivor00_Interaction_Hook_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimBlueprintExtension_PropertyAccess) == 0x000660, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimBlueprintExtension_Base) == 0x000668, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_Root_1) == 0x000670, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_LinkedInputPose_1) == 0x000690, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_SaveCachedPose) == 0x000760, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_TransitionResult_4) == 0x000868, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_TransitionResult_3) == 0x000890, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_TransitionResult_2) == 0x0008B8, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_TransitionResult_1) == 0x0008E0, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_TransitionResult) == 0x000908, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_UseCachedPose) == 0x000930, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_StateResult_3) == 0x000960, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_LayeredBoneBlend) == 0x000980, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_SequencePlayer_2) == 0x000A60, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_BlendSpacePlayer) == 0x000AA8, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_StateResult_2) == 0x000B18, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_SequencePlayer_1) == 0x000B38, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_StateResult_1) == 0x000B80, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_SequencePlayer) == 0x000BA0, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_StateResult) == 0x000BE8, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_StateMachine) == 0x000C08, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_Root) == 0x000CD0, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Interaction_Hook_C, AnimGraphNode_LinkedInputPose) == 0x000CF0, "Member 'UABSub_Survivor00_Interaction_Hook_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

