#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_RepairGenerator_Back

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABSub_RepairGenerator_Back.ABSub_RepairGenerator_Back_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABSub_RepairGenerator_Back_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABSub_RepairGenerator_Back_C_AnimGraph) == 0x000008, "Wrong alignment on ABSub_RepairGenerator_Back_C_AnimGraph");
static_assert(sizeof(ABSub_RepairGenerator_Back_C_AnimGraph) == 0x000020, "Wrong size on ABSub_RepairGenerator_Back_C_AnimGraph");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_AnimGraph, InPose) == 0x000000, "Member 'ABSub_RepairGenerator_Back_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'ABSub_RepairGenerator_Back_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABSub_RepairGenerator_Back.ABSub_RepairGenerator_Back_C.ExecuteUbergraph_ABSub_RepairGenerator_Back
// 0x0018 (0x0018 - 0x0000)
struct ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_3;     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_4;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_5;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_6;     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_7;     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_8;     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_9;     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_10;    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_11;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_12;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_13;    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_14;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back) == 0x000004, "Wrong alignment on ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back");
static_assert(sizeof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back) == 0x000018, "Wrong size on ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, EntryPoint) == 0x000000, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000004, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000005, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x000006, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_3) == 0x000007, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_4) == 0x000008, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_5) == 0x000009, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_6) == 0x00000A, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_7) == 0x00000B, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_8) == 0x00000C, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_9) == 0x00000D, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_10) == 0x00000E, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_11) == 0x000010, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_BooleanAND_ReturnValue_1) == 0x000011, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_12) == 0x000012, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_BooleanAND_ReturnValue_2) == 0x000013, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_13) == 0x000014, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back, CallFunc_EqualEqual_GameplayTag_ReturnValue_14) == 0x000015, "Member 'ABSub_RepairGenerator_Back_C_ExecuteUbergraph_ABSub_RepairGenerator_Back::CallFunc_EqualEqual_GameplayTag_ReturnValue_14' has a wrong offset!");

}

