#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Flashlight

#include "Basic.hpp"

#include "ABSub_Survivor00_Flashlight_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Flashlight.ABSub_Survivor00_Flashlight_C
// 0x1600 (0x1C60 - 0x0660)
class UABSub_Survivor00_Flashlight_C final : public UFlashlightSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABSub_Survivor00_Flashlight::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0668(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0670(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0678(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0680(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x06A0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0770(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0940(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0968(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0988(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x09D0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0AB0(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x0AE0(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0BC0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x0C08(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0CE8(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0D18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0D60(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x0DA8(0x00E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0E88(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0FC0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x10F8(0x0138)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1230(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1278(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x12C0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x13A0(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x13D0(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1508(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1528(0x0138)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1660(0x0030)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1690(0x0120)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x17B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x17D0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1818(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1848(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1928(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1948(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1978(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1998(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1A60(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1B40(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1B70(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1B90(0x00D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_InteractionCollectableLayerDone();
	void ExecuteUbergraph_ABSub_Survivor00_Flashlight(int32 EntryPoint);
	void SurvivorInteractionCollectableLayer(const struct FPoseLink& InPose, struct FPoseLink* Param_SurvivorInteractionCollectableLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Flashlight_C">();
	}
	static class UABSub_Survivor00_Flashlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Flashlight_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Flashlight_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Flashlight_C");
static_assert(sizeof(UABSub_Survivor00_Flashlight_C) == 0x001C60, "Wrong size on UABSub_Survivor00_Flashlight_C");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, UberGraphFrame) == 0x000660, "Member 'UABSub_Survivor00_Flashlight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, __AnimBlueprintMutables) == 0x000668, "Member 'UABSub_Survivor00_Flashlight_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimBlueprintExtension_PropertyAccess) == 0x000670, "Member 'UABSub_Survivor00_Flashlight_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimBlueprintExtension_Base) == 0x000678, "Member 'UABSub_Survivor00_Flashlight_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_Root_1) == 0x000680, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LinkedInputPose_1) == 0x0006A0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_SaveCachedPose) == 0x000770, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_TransitionResult_5) == 0x000878, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_TransitionResult_4) == 0x0008A0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_TransitionResult_3) == 0x0008C8, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_TransitionResult_2) == 0x0008F0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_TransitionResult_1) == 0x000918, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_TransitionResult) == 0x000940, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_ComponentToLocalSpace) == 0x000968, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_SequencePlayer_4) == 0x000988, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend_6) == 0x0009D0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend_6' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose_6) == 0x000AB0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend_5) == 0x000AE0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_SequencePlayer_3) == 0x000BC0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend_4) == 0x000C08, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose_5) == 0x000CE8, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_BlendListByBool_1) == 0x000D18, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_SequencePlayer_2) == 0x000D60, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend_3) == 0x000DA8, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_ModifyBone_4) == 0x000E88, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_ModifyBone_3) == 0x000FC0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_ModifyBone_2) == 0x0010F8, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_BlendListByBool) == 0x001230, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_SequencePlayer_1) == 0x001278, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend_2) == 0x0012C0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose_4) == 0x0013A0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_ModifyBone_1) == 0x0013D0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LocalToComponentSpace) == 0x001508, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_ModifyBone) == 0x001528, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose_3) == 0x001660, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001690, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_StateResult_2) == 0x0017B0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_SequencePlayer) == 0x0017D0, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose_2) == 0x001818, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend_1) == 0x001848, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_StateResult_1) == 0x001928, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose_1) == 0x001948, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_StateResult) == 0x001978, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_StateMachine) == 0x001998, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LayeredBoneBlend) == 0x001A60, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_UseCachedPose) == 0x001B40, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_Root) == 0x001B70, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Flashlight_C, AnimGraphNode_LinkedInputPose) == 0x001B90, "Member 'UABSub_Survivor00_Flashlight_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

