#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Interaction_Sabotage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Interaction_Sabotage.ABSub_Survivor00_Interaction_Sabotage_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_92;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_94;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_97;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_98;                                 // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_99;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_100;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_101;                              // 0x0048(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_102;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_103;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_104;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_105;                                // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_106;                                // 0x007C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_107;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_108;                                // 0x008C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_109;                                // 0x0098(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_110;                              // 0x00A8(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x000004, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x000010, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __IntProperty_94) == 0x00001C, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__IntProperty_94' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000020, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x00002C, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __BoolProperty_97) == 0x000030, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__BoolProperty_97' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_98) == 0x000034, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_98' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __IntProperty_99) == 0x000040, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__IntProperty_99' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __FloatProperty_100) == 0x000044, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__FloatProperty_100' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __StructProperty_101) == 0x000048, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__StructProperty_101' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __FloatProperty_102) == 0x000074, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__FloatProperty_102' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __BoolProperty_103) == 0x000078, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__BoolProperty_103' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __EnumProperty_104) == 0x000079, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__EnumProperty_104' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __ByteProperty_105) == 0x00007A, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__ByteProperty_105' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x00007C, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __IntProperty_107) == 0x000088, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__IntProperty_107' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x00008C, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __NameProperty_109) == 0x000098, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__NameProperty_109' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, __StructProperty_110) == 0x0000A8, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::__StructProperty_110' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'ABSub_Survivor00_Interaction_Sabotage::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

