#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Scream

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABSub_Survivor00_Scream_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Scream.ABSub_Survivor00_Scream_C
// 0x0680 (0x0C80 - 0x0600)
class UABSub_Survivor00_Scream_C final : public UScreamSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0608(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0610(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0618(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0620(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0640(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0710(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0840(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0868(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x08B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x08F8(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0928(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A08(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0A50(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A70(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0AA0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0AC0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0B88(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0BA8(0x00D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_InteractionUpperBodyLayerDone();
	void AnimNotify_ScreamToIdleTransition();
	void ExecuteUbergraph_ABSub_Survivor00_Scream(int32 EntryPoint);
	void Survivor_InteractionUpperBody_Layer(const struct FPoseLink& InPose, struct FPoseLink* Param_Survivor_InteractionUpperBody_Layer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Scream_C">();
	}
	static class UABSub_Survivor00_Scream_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Scream_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Scream_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Scream_C");
static_assert(sizeof(UABSub_Survivor00_Scream_C) == 0x000C80, "Wrong size on UABSub_Survivor00_Scream_C");
static_assert(offsetof(UABSub_Survivor00_Scream_C, UberGraphFrame) == 0x000600, "Member 'UABSub_Survivor00_Scream_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, __AnimBlueprintMutables) == 0x000608, "Member 'UABSub_Survivor00_Scream_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimBlueprintExtension_PropertyAccess) == 0x000610, "Member 'UABSub_Survivor00_Scream_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimBlueprintExtension_Base) == 0x000618, "Member 'UABSub_Survivor00_Scream_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_Root_1) == 0x000620, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_LinkedInputPose) == 0x000640, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_SaveCachedPose) == 0x000710, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_TransitionResult_1) == 0x000818, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_TransitionResult) == 0x000840, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_BlendListByBool) == 0x000868, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_SequencePlayer_1) == 0x0008B0, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_UseCachedPose_1) == 0x0008F8, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_LayeredBoneBlend) == 0x000928, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_SequencePlayer) == 0x000A08, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_StateResult_1) == 0x000A50, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_UseCachedPose) == 0x000A70, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_StateResult) == 0x000AA0, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_StateMachine) == 0x000AC0, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_Root) == 0x000B88, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Scream_C, AnimGraphNode_SubInput) == 0x000BA8, "Member 'UABSub_Survivor00_Scream_C::AnimGraphNode_SubInput' has a wrong offset!");

}

