#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Slasher_01_BaseAttack_00

#include "Basic.hpp"

#include "AnimationUtilities_structs.hpp"


namespace SDK::Params
{

// Function ABSub_Slasher_01_BaseAttack_00.ABSub_Slasher_01_BaseAttack_00_C.ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00
// 0x03F0 (0x03F0 - 0x0000)
struct ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence;              // 0x0008(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_1;            // 0x0030(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_2;            // 0x0058(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_3;            // 0x0080(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_4;            // 0x00A8(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_5;            // 0x00D0(0x0028)()
	TArray<struct FTaggedAnimSequence>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_6;            // 0x0108(0x0028)()
	struct FAnimSequenceSelector                  K2Node_MakeStruct_AnimSequenceSelector;            // 0x0130(0x0018)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_7;            // 0x0148(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_8;            // 0x0170(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_9;            // 0x0198(0x0028)()
	TArray<struct FTaggedAnimSequence>            K2Node_MakeArray_Array_1;                          // 0x01C0(0x0010)(ReferenceParm)
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_10;           // 0x01D0(0x0028)()
	struct FAnimSequenceSelector                  K2Node_MakeStruct_AnimSequenceSelector_1;          // 0x01F8(0x0018)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_11;           // 0x0210(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_12;           // 0x0238(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_13;           // 0x0260(0x0028)()
	TArray<struct FTaggedAnimSequence>            K2Node_MakeArray_Array_2;                          // 0x0288(0x0010)(ReferenceParm)
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_14;           // 0x0298(0x0028)()
	struct FAnimSequenceSelector                  K2Node_MakeStruct_AnimSequenceSelector_2;          // 0x02C0(0x0018)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_15;           // 0x02D8(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_16;           // 0x0300(0x0028)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_17;           // 0x0328(0x0028)()
	TArray<struct FTaggedAnimSequence>            K2Node_MakeArray_Array_3;                          // 0x0350(0x0010)(ReferenceParm)
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_18;           // 0x0360(0x0028)()
	struct FAnimSequenceSelector                  K2Node_MakeStruct_AnimSequenceSelector_3;          // 0x0388(0x0018)()
	struct FTaggedAnimSequence                    K2Node_MakeStruct_TaggedAnimSequence_19;           // 0x03A0(0x0028)()
	TArray<struct FTaggedAnimSequence>            K2Node_MakeArray_Array_4;                          // 0x03C8(0x0010)(ReferenceParm)
	struct FAnimSequenceSelector                  K2Node_MakeStruct_AnimSequenceSelector_4;          // 0x03D8(0x0018)()
};
static_assert(alignof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00) == 0x000008, "Wrong alignment on ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00");
static_assert(sizeof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00) == 0x0003F0, "Wrong size on ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, EntryPoint) == 0x000000, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence) == 0x000008, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_1) == 0x000030, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_1' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_2) == 0x000058, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_2' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_3) == 0x000080, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_3' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_4) == 0x0000A8, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_4' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_5) == 0x0000D0, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_5' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeArray_Array) == 0x0000F8, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_6) == 0x000108, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_6' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_AnimSequenceSelector) == 0x000130, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_AnimSequenceSelector' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_7) == 0x000148, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_7' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_8) == 0x000170, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_8' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_9) == 0x000198, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_9' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeArray_Array_1) == 0x0001C0, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_10) == 0x0001D0, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_10' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_AnimSequenceSelector_1) == 0x0001F8, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_AnimSequenceSelector_1' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_11) == 0x000210, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_11' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_12) == 0x000238, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_12' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_13) == 0x000260, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_13' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeArray_Array_2) == 0x000288, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_14) == 0x000298, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_14' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_AnimSequenceSelector_2) == 0x0002C0, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_AnimSequenceSelector_2' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_15) == 0x0002D8, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_15' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_16) == 0x000300, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_16' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_17) == 0x000328, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_17' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeArray_Array_3) == 0x000350, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_18) == 0x000360, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_18' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_AnimSequenceSelector_3) == 0x000388, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_AnimSequenceSelector_3' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_TaggedAnimSequence_19) == 0x0003A0, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_TaggedAnimSequence_19' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeArray_Array_4) == 0x0003C8, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00, K2Node_MakeStruct_AnimSequenceSelector_4) == 0x0003D8, "Member 'ABSub_Slasher_01_BaseAttack_00_C_ExecuteUbergraph_ABSub_Slasher_01_BaseAttack_00::K2Node_MakeStruct_AnimSequenceSelector_4' has a wrong offset!");

}

