#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Interaction_OpenChest

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Interaction_OpenChest.ABSub_Survivor00_Interaction_OpenChest_C.AnimBlueprintGeneratedConstantData
// 0x01AF (0x01B0 - 0x0001)
struct ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_204;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_205;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_206;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_207;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_208;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_209;                                // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_210;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_211;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_212;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_213;                                // 0x0050(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_214;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_215;                                // 0x0060(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_216;                                // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_217;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_218;                              // 0x0074(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_219;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_220;                                // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_221;                                // 0x00A5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_222;                                // 0x00A6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_223;                                // 0x00A8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_224;                                // 0x00B4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_225;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_226;                                // 0x00C4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_227;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_228;                                // 0x00D4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_229;                                // 0x00E0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_230;                              // 0x00F0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0118(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0198(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData) == 0x0001B0, "Wrong size on ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_204) == 0x000004, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_204' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_205) == 0x000010, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_205' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_206) == 0x00001C, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_206' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_207) == 0x000020, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_207' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_208) == 0x00002C, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_208' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_209) == 0x000030, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_209' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_210) == 0x00003C, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_210' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_211) == 0x000040, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_211' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_212) == 0x00004C, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_212' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_213) == 0x000050, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_213' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_214) == 0x00005C, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_214' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_215) == 0x000060, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_215' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __BoolProperty_216) == 0x00006C, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__BoolProperty_216' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __FloatProperty_217) == 0x000070, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__FloatProperty_217' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __StructProperty_218) == 0x000074, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__StructProperty_218' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __FloatProperty_219) == 0x0000A0, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__FloatProperty_219' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __BoolProperty_220) == 0x0000A4, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__BoolProperty_220' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __EnumProperty_221) == 0x0000A5, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__EnumProperty_221' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __ByteProperty_222) == 0x0000A6, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__ByteProperty_222' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_223) == 0x0000A8, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_223' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_224) == 0x0000B4, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_224' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_225) == 0x0000C0, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_225' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_226) == 0x0000C4, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_226' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __IntProperty_227) == 0x0000D0, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__IntProperty_227' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_228) == 0x0000D4, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_228' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __NameProperty_229) == 0x0000E0, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__NameProperty_229' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, __StructProperty_230) == 0x0000F0, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::__StructProperty_230' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000118, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000198, "Member 'ABSub_Survivor00_Interaction_OpenChest::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

