#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Dynamic

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Dynamic.ABSub_Survivor00_Dynamic_C
// 0x6FA0 (0x75B0 - 0x0610)
class UABSub_Survivor00_Dynamic_C final : public UDynamicSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0618(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0620(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0628(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0648(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0718(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x08C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0960(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_72;                       // 0x0988(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_71;                       // 0x0AC0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_70;                       // 0x0BF8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_69;                       // 0x0D30(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_68;                       // 0x0E68(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_67;                       // 0x0FA0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_66;                       // 0x10D8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_65;                       // 0x1210(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_64;                       // 0x1348(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_63;                       // 0x1480(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_62;                       // 0x15B8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_61;                       // 0x16F0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_60;                       // 0x1828(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_59;                       // 0x1960(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_58;                       // 0x1A98(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_57;                       // 0x1BD0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_56;                       // 0x1D08(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_55;                       // 0x1E40(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x1F78(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x1F98(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1FB8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1FE8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_54;                       // 0x2008(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_53;                       // 0x2140(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_52;                       // 0x2278(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_51;                       // 0x23B0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_50;                       // 0x24E8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_49;                       // 0x2620(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_48;                       // 0x2758(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_47;                       // 0x2890(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_46;                       // 0x29C8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_45;                       // 0x2B00(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_44;                       // 0x2C38(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_43;                       // 0x2D70(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_42;                       // 0x2EA8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_41;                       // 0x2FE0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_40;                       // 0x3118(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x3250(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x3270(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3290(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x32C0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_39;                       // 0x32E0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_38;                       // 0x3418(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_37;                       // 0x3550(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_36;                       // 0x3688(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_35;                       // 0x37C0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_34;                       // 0x38F8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_33;                       // 0x3A30(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_32;                       // 0x3B68(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_31;                       // 0x3CA0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_30;                       // 0x3DD8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_29;                       // 0x3F10(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_28;                       // 0x4048(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_27;                       // 0x4180(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_26;                       // 0x42B8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_25;                       // 0x43F0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_24;                       // 0x4528(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_23;                       // 0x4660(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_22;                       // 0x4798(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x48D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x48F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x4910(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x4940(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4960(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x4980(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x49A0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x49D0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_21;                       // 0x49F0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20;                       // 0x4B28(0x0138)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4C60(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4C80(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4CB0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_19;                       // 0x4CD0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0x4E08(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x4F40(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x5078(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x51B0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x52E8(0x0138)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x5420(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x5440(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x5578(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x56B0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x57E8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x5920(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x5A58(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x5B90(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x5CC8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x5E00(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x5F38(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x6070(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x61A8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x62E0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x6418(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6550(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x6570(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x65A0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x65C0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x65E0(0x0030)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x6610(0x0178)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x6788(0x0178)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x6900(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x6920(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x6940(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x6960(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x6990(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x69B0(0x0540)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6EF0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x6F10(0x0540)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x7450(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x7470(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x7498(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x74C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x74E8(0x00C8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABSub_Survivor00_Dynamic(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Dynamic_C">();
	}
	static class UABSub_Survivor00_Dynamic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Dynamic_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Dynamic_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Dynamic_C");
static_assert(sizeof(UABSub_Survivor00_Dynamic_C) == 0x0075B0, "Wrong size on UABSub_Survivor00_Dynamic_C");
static_assert(offsetof(UABSub_Survivor00_Dynamic_C, UberGraphFrame) == 0x000610, "Member 'UABSub_Survivor00_Dynamic_C::UberGraphFrame' has a wrong offset!");
