#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Scream

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Scream.ABSub_Survivor00_Scream_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_64;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_65;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_66;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_67;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_68;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_69;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_70;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_71;                               // 0x003C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_72;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_73;                                 // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_74;                                 // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_75;                                 // 0x006E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_76;                                 // 0x0070(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_77;                                  // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_78;                                 // 0x0080(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_79;                                  // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0090(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_81;                                 // 0x009C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_82;                               // 0x00A8(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __NameProperty_64) == 0x000004, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__NameProperty_64' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __BlendProfile_65) == 0x000010, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__BlendProfile_65' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __CurveFloat_66) == 0x000018, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__CurveFloat_66' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __EnumProperty_67) == 0x000020, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__EnumProperty_67' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __EnumProperty_68) == 0x000021, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__EnumProperty_68' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __ArrayProperty_69) == 0x000028, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__ArrayProperty_69' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __FloatProperty_70) == 0x000038, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__FloatProperty_70' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __StructProperty_71) == 0x00003C, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__StructProperty_71' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __FloatProperty_72) == 0x000068, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__FloatProperty_72' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __BoolProperty_73) == 0x00006C, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__BoolProperty_73' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __EnumProperty_74) == 0x00006D, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__EnumProperty_74' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __ByteProperty_75) == 0x00006E, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__ByteProperty_75' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __NameProperty_76) == 0x000070, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__NameProperty_76' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __IntProperty_77) == 0x00007C, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__IntProperty_77' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000080, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __IntProperty_79) == 0x00008C, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__IntProperty_79' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000090, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x00009C, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, __StructProperty_82) == 0x0000A8, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::__StructProperty_82' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABSub_Survivor00_Scream.ABSub_Survivor00_Scream_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABSub_Survivor00_Scream::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

