#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Interaction_ExitDoorActivation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Interaction_ExitDoorActivation.ABSub_Survivor00_Interaction_ExitDoorActivation_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_78;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_79;                                 // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_80;                                 // 0x0014(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_81;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_82;                               // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_83;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_84;                                 // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_85;                                 // 0x0055(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_86;                                 // 0x0056(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_87;                                 // 0x0058(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_88;                                 // 0x0064(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_89;                                  // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x0074(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_91;                                  // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x0084(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x0090(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_94;                               // 0x00A0(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000004, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __BoolProperty_79) == 0x000010, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__BoolProperty_79' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000014, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __FloatProperty_81) == 0x000020, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__FloatProperty_81' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __StructProperty_82) == 0x000024, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__StructProperty_82' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __FloatProperty_83) == 0x000050, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__FloatProperty_83' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __BoolProperty_84) == 0x000054, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__BoolProperty_84' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __EnumProperty_85) == 0x000055, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__EnumProperty_85' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __ByteProperty_86) == 0x000056, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__ByteProperty_86' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x000058, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_88) == 0x000064, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_88' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __IntProperty_89) == 0x000070, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__IntProperty_89' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000074, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __IntProperty_91) == 0x000080, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__IntProperty_91' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x000084, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x000090, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, __StructProperty_94) == 0x0000A0, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::__StructProperty_94' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'ABSub_Survivor00_Interaction_ExitDoorActivation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

