#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_ArmOverride

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_ArmOverride.ABSub_Survivor00_ArmOverride_C.AnimBlueprintGeneratedConstantData
// 0x021F (0x0220 - 0x0001)
struct ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_464;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_465;                                // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_466;                                // 0x0014(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_467;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_468;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_469;                                // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_470;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_471;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_472;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_473;                                // 0x0050(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_474;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_475;                                // 0x0060(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_476;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_477;                                // 0x0070(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_478;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_479;                                // 0x0080(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_480;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_481;                                // 0x0090(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_482;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_483;                               // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_484;                                // 0x00B0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_485;                                 // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_486;                                // 0x00C0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_487;                                 // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_488;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_489;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_490;                              // 0x00D8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_491;                               // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_492;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_493;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_494;                                // 0x010C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_495;                                 // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_496;                                // 0x011C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_497;                                // 0x0128(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_498;                                 // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_499;                                // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_500;                                  // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_501;                                // 0x0148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_502;                                // 0x0149(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_503;                                // 0x014A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_504;                               // 0x0150(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_505;                              // 0x0160(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0188(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0208(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData) == 0x000220, "Wrong size on ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_464) == 0x000004, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_464' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __ByteProperty_465) == 0x000010, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__ByteProperty_465' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_466) == 0x000014, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_466' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_467) == 0x000020, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_467' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_468) == 0x00002C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_468' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_469) == 0x000030, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_469' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_470) == 0x00003C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_470' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_471) == 0x000040, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_471' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_472) == 0x00004C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_472' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_473) == 0x000050, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_473' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_474) == 0x00005C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_474' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_475) == 0x000060, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_475' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_476) == 0x00006C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_476' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_477) == 0x000070, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_477' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_478) == 0x00007C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_478' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_479) == 0x000080, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_479' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_480) == 0x00008C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_480' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_481) == 0x000090, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_481' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_482) == 0x00009C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_482' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __ArrayProperty_483) == 0x0000A0, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__ArrayProperty_483' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_484) == 0x0000B0, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_484' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_485) == 0x0000BC, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_485' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_486) == 0x0000C0, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_486' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_487) == 0x0000CC, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_487' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __BoolProperty_488) == 0x0000D0, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__BoolProperty_488' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __FloatProperty_489) == 0x0000D4, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__FloatProperty_489' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __StructProperty_490) == 0x0000D8, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__StructProperty_490' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __FloatProperty_491) == 0x000104, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__FloatProperty_491' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __EnumProperty_492) == 0x000108, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__EnumProperty_492' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __ByteProperty_493) == 0x000109, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__ByteProperty_493' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_494) == 0x00010C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_494' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_495) == 0x000118, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_495' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_496) == 0x00011C, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_496' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __NameProperty_497) == 0x000128, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__NameProperty_497' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __IntProperty_498) == 0x000134, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__IntProperty_498' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __BlendProfile_499) == 0x000138, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__BlendProfile_499' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __CurveFloat_500) == 0x000140, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__CurveFloat_500' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __BoolProperty_501) == 0x000148, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__BoolProperty_501' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __EnumProperty_502) == 0x000149, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__EnumProperty_502' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __EnumProperty_503) == 0x00014A, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__EnumProperty_503' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __ArrayProperty_504) == 0x000150, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__ArrayProperty_504' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, __StructProperty_505) == 0x000160, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::__StructProperty_505' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000188, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000208, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABSub_Survivor00_ArmOverride.ABSub_Survivor00_ArmOverride_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase) == 0x000008, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000010, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000011, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000012, "Member 'ABSub_Survivor00_ArmOverride::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

}

