#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Fall

#include "Basic.hpp"

#include "ABSub_Survivor00_Fall_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_Survivor00_Fall.ABSub_Survivor00_Fall_C
// 0x08D0 (0x0FA0 - 0x06D0)
class UABSub_Survivor00_Fall_C final : public UFallSurvivorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x06D8(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0718(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07E8(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x08F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x09B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x09E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0A80(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0AA8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0B18(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0B38(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0B80(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0BA0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0BE8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0C08(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0C78(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0CC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0D08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0D28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0D70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0D90(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0DD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0E20(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0E68(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0E88(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0EB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0ED8(0x00C8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABSub_Survivor00_Fall(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_Survivor00_Fall_C">();
	}
	static class UABSub_Survivor00_Fall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_Survivor00_Fall_C>();
	}
};
static_assert(alignof(UABSub_Survivor00_Fall_C) == 0x000010, "Wrong alignment on UABSub_Survivor00_Fall_C");
static_assert(sizeof(UABSub_Survivor00_Fall_C) == 0x000FA0, "Wrong size on UABSub_Survivor00_Fall_C");
static_assert(offsetof(UABSub_Survivor00_Fall_C, UberGraphFrame) == 0x0006D0, "Member 'UABSub_Survivor00_Fall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, __AnimBlueprintMutables) == 0x0006D8, "Member 'UABSub_Survivor00_Fall_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimBlueprintExtension_PropertyAccess) == 0x0006E8, "Member 'UABSub_Survivor00_Fall_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimBlueprintExtension_Base) == 0x0006F0, "Member 'UABSub_Survivor00_Fall_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_Root) == 0x0006F8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SubInput) == 0x000718, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SaveCachedPose) == 0x0007E8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_10) == 0x0008F0, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_9) == 0x000918, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_8) == 0x000940, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_7) == 0x000968, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_6) == 0x000990, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_5) == 0x0009B8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_4) == 0x0009E0, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_3) == 0x000A08, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_2) == 0x000A30, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult_1) == 0x000A58, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_TransitionResult) == 0x000A80, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000AA8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult_6) == 0x000B18, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SequencePlayer_5) == 0x000B38, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult_5) == 0x000B80, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SequencePlayer_4) == 0x000BA0, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult_4) == 0x000BE8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_BlendSpacePlayer) == 0x000C08, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_BlendListByBool_1) == 0x000C78, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SequencePlayer_3) == 0x000CC0, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult_3) == 0x000D08, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SequencePlayer_2) == 0x000D28, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult_2) == 0x000D70, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SequencePlayer_1) == 0x000D90, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_BlendListByBool) == 0x000DD8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_SequencePlayer) == 0x000E20, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult_1) == 0x000E68, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_UseCachedPose) == 0x000E88, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateResult) == 0x000EB8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_Survivor00_Fall_C, AnimGraphNode_StateMachine) == 0x000ED8, "Member 'UABSub_Survivor00_Fall_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

