#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_RepairGenerator_Back

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABSub_RepairGenerator_Back.ABSub_RepairGenerator_Back_C
// 0x0BE0 (0x0FC0 - 0x03E0)
class UABSub_RepairGenerator_Back_C final : public URepairGeneratorSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0418(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x05B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x05D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x06A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x06C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x06F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0790(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x07B8(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x07E8(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x08C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0910(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0930(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0960(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A88(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0AA8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0B88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0BB8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C00(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0C20(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0C50(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0D78(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0D98(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0DC8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0DE8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0EB0(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_0BFE78884EBCED74F510579B67BCBCF4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_0FF1BE4A4902D549692B93B77FEA52FD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_1ACD766049B720BDADBF95B6E2E683AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_1D2456C640523806575950906B6FD211();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_22CAA38E46276AAC485B12B3906FA389();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_2873008344A86987B3A6EDB4D217FA87();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_5CEA0C024D0E17A851A729B18EF45E19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_779FBEAB43F446C63241EDBA076CFEE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_8BE8A35C41BB7917E31A14AB6F2FB38A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_8C057C90419E4BF2D6F8C8A24300222A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_8F7B04724F8E980701267BB18C58B88B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_A899D53847EA19A6419131BB5457A9B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_C1617F4C47DF69FFCF30E788E071127B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_E26B7C31473641F85EEF2990B9FFE541();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABSub_RepairGenerator_Back_AnimGraphNode_TransitionResult_EF70BFDC4BD53249125C4AB159948BC0();
	void ExecuteUbergraph_ABSub_RepairGenerator_Back(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABSub_RepairGenerator_Back_C">();
	}
	static class UABSub_RepairGenerator_Back_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABSub_RepairGenerator_Back_C>();
	}
};
static_assert(alignof(UABSub_RepairGenerator_Back_C) == 0x000010, "Wrong alignment on UABSub_RepairGenerator_Back_C");
static_assert(sizeof(UABSub_RepairGenerator_Back_C) == 0x000FC0, "Wrong size on UABSub_RepairGenerator_Back_C");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, UberGraphFrame) == 0x0003E0, "Member 'UABSub_RepairGenerator_Back_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E8, "Member 'UABSub_RepairGenerator_Back_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimBlueprintExtension_Base) == 0x0003F0, "Member 'UABSub_RepairGenerator_Back_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_Root) == 0x0003F8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_SubInput) == 0x000418, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_17) == 0x0004E8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_16) == 0x000510, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_15) == 0x000538, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_14) == 0x000560, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_13) == 0x000588, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_12) == 0x0005B0, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_11) == 0x0005D8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_10) == 0x000600, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_9) == 0x000628, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_8) == 0x000650, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_7) == 0x000678, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_6) == 0x0006A0, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_5) == 0x0006C8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_4) == 0x0006F0, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_3) == 0x000718, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_2) == 0x000740, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult_1) == 0x000768, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_TransitionResult) == 0x000790, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_UseCachedPose_4) == 0x0007B8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_LayeredBoneBlend_3) == 0x0007E8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_SequencePlayer_3) == 0x0008C8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_StateResult_4) == 0x000910, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_UseCachedPose_3) == 0x000930, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_LayeredBoneBlend_2) == 0x000960, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_SequencePlayer_2) == 0x000A40, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_StateResult_3) == 0x000A88, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000AA8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_UseCachedPose_2) == 0x000B88, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_SequencePlayer_1) == 0x000BB8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_StateResult_2) == 0x000C00, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_UseCachedPose_1) == 0x000C20, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_LayeredBoneBlend) == 0x000C50, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_SequencePlayer) == 0x000D30, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_StateResult_1) == 0x000D78, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_UseCachedPose) == 0x000D98, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_StateResult) == 0x000DC8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_StateMachine) == 0x000DE8, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABSub_RepairGenerator_Back_C, AnimGraphNode_SaveCachedPose) == 0x000EB0, "Member 'UABSub_RepairGenerator_Back_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");

}

