#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABSub_Survivor00_Fall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABSub_Survivor00_Fall.ABSub_Survivor00_Fall_C.AnimBlueprintGeneratedConstantData
// 0x01B7 (0x01B8 - 0x0001)
struct ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_182;                                // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_183;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_184;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_185;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_186;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_187;                                // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_188;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_189;                                // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_190;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_191;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_192;                                // 0x0054(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_193;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_194;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_195;                                  // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_196;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_197;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_198;                               // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_199;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_200;                              // 0x0094(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_201;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_202;                                // 0x00C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_203;                                // 0x00C5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_204;                                // 0x00C6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_205;                                // 0x00C8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_206;                                 // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_207;                                // 0x00D8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_208;                                // 0x00E4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_209;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_210;                              // 0x00F8(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0120(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A0(0x0018)()
};
static_assert(alignof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData) == 0x0001B8, "Wrong size on ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_182) == 0x000004, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_182' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_183) == 0x000010, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_183' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_184) == 0x00001C, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_184' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_185) == 0x000020, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_185' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_186) == 0x00002C, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_186' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_187) == 0x000030, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_187' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_188) == 0x00003C, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_188' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_189) == 0x000040, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_189' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_190) == 0x00004C, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_190' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __BoolProperty_191) == 0x000050, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__BoolProperty_191' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_192) == 0x000054, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_192' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_193) == 0x000060, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_193' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __BlendProfile_194) == 0x000068, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__BlendProfile_194' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __CurveFloat_195) == 0x000070, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__CurveFloat_195' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __EnumProperty_196) == 0x000078, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__EnumProperty_196' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __EnumProperty_197) == 0x000079, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__EnumProperty_197' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __ArrayProperty_198) == 0x000080, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__ArrayProperty_198' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __FloatProperty_199) == 0x000090, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__FloatProperty_199' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __StructProperty_200) == 0x000094, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__StructProperty_200' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __FloatProperty_201) == 0x0000C0, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__FloatProperty_201' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __BoolProperty_202) == 0x0000C4, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__BoolProperty_202' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __EnumProperty_203) == 0x0000C5, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__EnumProperty_203' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __ByteProperty_204) == 0x0000C6, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__ByteProperty_204' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_205) == 0x0000C8, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_205' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_206) == 0x0000D4, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_206' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_207) == 0x0000D8, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_207' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __NameProperty_208) == 0x0000E4, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__NameProperty_208' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __IntProperty_209) == 0x0000F0, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__IntProperty_209' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, __StructProperty_210) == 0x0000F8, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::__StructProperty_210' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000120, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A0, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABSub_Survivor00_Fall.ABSub_Survivor00_Fall_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000D, "Member 'ABSub_Survivor00_Fall::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

}

