#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Achievements

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function Achievements.OnGameEventAchievement.OnScoreTypeEvent
// 0x0018 (0x0018 - 0x0000)
struct OnGameEventAchievement_OnScoreTypeEvent final
{
public:
	EDBDScoreTypes                                ScoreType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnGameEventAchievement_OnScoreTypeEvent) == 0x000008, "Wrong alignment on OnGameEventAchievement_OnScoreTypeEvent");
static_assert(sizeof(OnGameEventAchievement_OnScoreTypeEvent) == 0x000018, "Wrong size on OnGameEventAchievement_OnScoreTypeEvent");
static_assert(offsetof(OnGameEventAchievement_OnScoreTypeEvent, ScoreType) == 0x000000, "Member 'OnGameEventAchievement_OnScoreTypeEvent::ScoreType' has a wrong offset!");
static_assert(offsetof(OnGameEventAchievement_OnScoreTypeEvent, Amount) == 0x000004, "Member 'OnGameEventAchievement_OnScoreTypeEvent::Amount' has a wrong offset!");
static_assert(offsetof(OnGameEventAchievement_OnScoreTypeEvent, Instigator) == 0x000008, "Member 'OnGameEventAchievement_OnScoreTypeEvent::Instigator' has a wrong offset!");
static_assert(offsetof(OnGameEventAchievement_OnScoreTypeEvent, Target) == 0x000010, "Member 'OnGameEventAchievement_OnScoreTypeEvent::Target' has a wrong offset!");

}

