#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Activation

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Activation.ActivatableMock
// 0x0050 (0x00F8 - 0x00A8)
class UActivatableMock final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivatableMock">();
	}
	static class UActivatableMock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivatableMock>();
	}
};
static_assert(alignof(UActivatableMock) == 0x000008, "Wrong alignment on UActivatableMock");
static_assert(sizeof(UActivatableMock) == 0x0000F8, "Wrong size on UActivatableMock");

// Class Activation.ActivatorComponent
// 0x0040 (0x00E8 - 0x00A8)
class UActivatorComponent final : public UActorComponent
{
public:
	bool                                          _searchForActivatableSubAnimInstances;             // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x3F];                                      // 0x00A9(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetObjectState(class UGameplayTagContainerComponent* ObjectState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivatorComponent">();
	}
	static class UActivatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivatorComponent>();
	}
};
static_assert(alignof(UActivatorComponent) == 0x000008, "Wrong alignment on UActivatorComponent");
static_assert(sizeof(UActivatorComponent) == 0x0000E8, "Wrong size on UActivatorComponent");
static_assert(offsetof(UActivatorComponent, _searchForActivatableSubAnimInstances) == 0x0000A8, "Member 'UActivatorComponent::_searchForActivatableSubAnimInstances' has a wrong offset!");

// Class Activation.Activatable
// 0x0000 (0x0030 - 0x0030)
class IActivatable final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Activatable">();
	}
	static class IActivatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IActivatable>();
	}
};
static_assert(alignof(IActivatable) == 0x000008, "Wrong alignment on IActivatable");
static_assert(sizeof(IActivatable) == 0x000030, "Wrong size on IActivatable");

}

