#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_KillerSpecificSurvivorAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ALI_KillerSpecificSurvivorAnimation.ALI_KillerSpecificSurvivorAnimation_C.KillerSpecificSurvivorAnimation
// 0x0020 (0x0020 - 0x0000)
struct ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_KillerSpecificSurvivorAnimation;             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation) == 0x000008, "Wrong alignment on ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation");
static_assert(sizeof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation) == 0x000020, "Wrong size on ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation");
static_assert(offsetof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation, InPose) == 0x000000, "Member 'ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation::InPose' has a wrong offset!");
static_assert(offsetof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation, Param_KillerSpecificSurvivorAnimation) == 0x000010, "Member 'ALI_KillerSpecificSurvivorAnimation_C_KillerSpecificSurvivorAnimation::Param_KillerSpecificSurvivorAnimation' has a wrong offset!");

// Function ALI_KillerSpecificSurvivorAnimation.ALI_KillerSpecificSurvivorAnimation_C.KillerSpecivicSurvivorAnimationAfterMontage
// 0x0020 (0x0020 - 0x0000)
struct ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage final
{
public:
	struct FPoseLink                              InPose_;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_KillerSpecivicSurvivorAnimationAfterMontage; // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage) == 0x000008, "Wrong alignment on ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage");
static_assert(sizeof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage) == 0x000020, "Wrong size on ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage");
static_assert(offsetof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage, InPose_) == 0x000000, "Member 'ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage::InPose_' has a wrong offset!");
static_assert(offsetof(ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage, Param_KillerSpecivicSurvivorAnimationAfterMontage) == 0x000010, "Member 'ALI_KillerSpecificSurvivorAnimation_C_KillerSpecivicSurvivorAnimationAfterMontage::Param_KillerSpecivicSurvivorAnimationAfterMontage' has a wrong offset!");

}

