#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Anniversary2023

#include "Basic.hpp"

#include "Anniversary2021_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "Anniversary_classes.hpp"
#include "Engine_classes.hpp"
#include "DBDGameplay_classes.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class Anniversary2023.InvitationSurvivorComponent
// 0x0010 (0x04B0 - 0x04A0)
class UInvitationSurvivorComponent final : public UInvitationPlayerComponent
{
public:
	uint8                                         Pad_4A0[0x10];                                     // 0x04A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InvitationSurvivorComponent">();
	}
	static class UInvitationSurvivorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInvitationSurvivorComponent>();
	}
};
static_assert(alignof(UInvitationSurvivorComponent) == 0x000008, "Wrong alignment on UInvitationSurvivorComponent");
static_assert(sizeof(UInvitationSurvivorComponent) == 0x0004B0, "Wrong size on UInvitationSurvivorComponent");

// Class Anniversary2023.Anniversary2023EventComponent
// 0x0010 (0x00E8 - 0x00D8)
class UAnniversary2023EventComponent final : public UAnniversary2021EventComponent
{
public:
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Anniversary2023EventComponent">();
	}
	static class UAnniversary2023EventComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnniversary2023EventComponent>();
	}
};
static_assert(alignof(UAnniversary2023EventComponent) == 0x000008, "Wrong alignment on UAnniversary2023EventComponent");
static_assert(sizeof(UAnniversary2023EventComponent) == 0x0000E8, "Wrong size on UAnniversary2023EventComponent");

// Class Anniversary2023.BloodlustExposeInteraction
// 0x0030 (0x07F0 - 0x07C0)
class UBloodlustExposeInteraction final : public UInvitationInteractionDefinition
{
public:
	TSubclassOf<class UStatusEffect>              _effectToApply;                                    // 0x07B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _bloodlustExposeDuration;                          // 0x07C0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class ACamperPlayer*                          _camper;                                           // 0x07E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Cosmetic_BloodlustExpose(class ADBDPlayer* Player, class ACamperPlayer* Target);
	void Multicast_BloodlustExpose(class ADBDPlayer* Player, class ACamperPlayer* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BloodlustExposeInteraction">();
	}
	static class UBloodlustExposeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBloodlustExposeInteraction>();
	}
};
static_assert(alignof(UBloodlustExposeInteraction) == 0x000010, "Wrong alignment on UBloodlustExposeInteraction");
static_assert(sizeof(UBloodlustExposeInteraction) == 0x0007F0, "Wrong size on UBloodlustExposeInteraction");
static_assert(offsetof(UBloodlustExposeInteraction, _effectToApply) == 0x0007B8, "Member 'UBloodlustExposeInteraction::_effectToApply' has a wrong offset!");
static_assert(offsetof(UBloodlustExposeInteraction, _bloodlustExposeDuration) == 0x0007C0, "Member 'UBloodlustExposeInteraction::_bloodlustExposeDuration' has a wrong offset!");
static_assert(offsetof(UBloodlustExposeInteraction, _camper) == 0x0007E8, "Member 'UBloodlustExposeInteraction::_camper' has a wrong offset!");

// Class Anniversary2023.FragilePalletComponent
// 0x0050 (0x00F8 - 0x00A8)
class UFragilePalletComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             Cosmetic_OnFragilePalletSpawnBegin;                // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Cosmetic_OnFragilePalletSpawnEnd;                  // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _fragilePalletSpawnTime;                           // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FragilePalletComponent">();
	}
	static class UFragilePalletComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFragilePalletComponent>();
	}
};
static_assert(alignof(UFragilePalletComponent) == 0x000008, "Wrong alignment on UFragilePalletComponent");
static_assert(sizeof(UFragilePalletComponent) == 0x0000F8, "Wrong size on UFragilePalletComponent");
static_assert(offsetof(UFragilePalletComponent, Cosmetic_OnFragilePalletSpawnBegin) == 0x0000A8, "Member 'UFragilePalletComponent::Cosmetic_OnFragilePalletSpawnBegin' has a wrong offset!");
static_assert(offsetof(UFragilePalletComponent, Cosmetic_OnFragilePalletSpawnEnd) == 0x0000B8, "Member 'UFragilePalletComponent::Cosmetic_OnFragilePalletSpawnEnd' has a wrong offset!");
static_assert(offsetof(UFragilePalletComponent, _fragilePalletSpawnTime) == 0x0000D0, "Member 'UFragilePalletComponent::_fragilePalletSpawnTime' has a wrong offset!");

// Class Anniversary2023.FragilePalletInteractionDefinition
// 0x0000 (0x07C0 - 0x07C0)
class UFragilePalletInteractionDefinition final : public UInvitationInteractionDefinition
{
public:
	TSubclassOf<class APallet>                    _fragilePalletClass;                               // 0x07B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FragilePalletInteractionDefinition">();
	}
	static class UFragilePalletInteractionDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFragilePalletInteractionDefinition>();
	}
};
static_assert(alignof(UFragilePalletInteractionDefinition) == 0x000010, "Wrong alignment on UFragilePalletInteractionDefinition");
static_assert(sizeof(UFragilePalletInteractionDefinition) == 0x0007C0, "Wrong size on UFragilePalletInteractionDefinition");
static_assert(offsetof(UFragilePalletInteractionDefinition, _fragilePalletClass) == 0x0007B8, "Member 'UFragilePalletInteractionDefinition::_fragilePalletClass' has a wrong offset!");

// Class Anniversary2023.FragilePalletTrackerVisibilityComponent
// 0x0058 (0x0170 - 0x0118)
class UFragilePalletTrackerVisibilityComponent final : public UPalletTrackerVisibilityComponent
{
public:
	struct FDBDTunableRowHandle                   _heightLimit;                                      // 0x0118(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x30];                                     // 0x0140(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_InitializeVisibilityComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FragilePalletTrackerVisibilityComponent">();
	}
	static class UFragilePalletTrackerVisibilityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFragilePalletTrackerVisibilityComponent>();
	}
};
static_assert(alignof(UFragilePalletTrackerVisibilityComponent) == 0x000008, "Wrong alignment on UFragilePalletTrackerVisibilityComponent");
static_assert(sizeof(UFragilePalletTrackerVisibilityComponent) == 0x000170, "Wrong size on UFragilePalletTrackerVisibilityComponent");
static_assert(offsetof(UFragilePalletTrackerVisibilityComponent, _heightLimit) == 0x000118, "Member 'UFragilePalletTrackerVisibilityComponent::_heightLimit' has a wrong offset!");

// Class Anniversary2023.InvitationKillerComponent
// 0x0028 (0x04C8 - 0x04A0)
class UInvitationKillerComponent final : public UInvitationPlayerComponent
{
public:
	uint8                                         Pad_4A0[0x28];                                     // 0x04A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_SetVignetteVisibility(bool IsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InvitationKillerComponent">();
	}
	static class UInvitationKillerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInvitationKillerComponent>();
	}
};
static_assert(alignof(UInvitationKillerComponent) == 0x000008, "Wrong alignment on UInvitationKillerComponent");
static_assert(sizeof(UInvitationKillerComponent) == 0x0004C8, "Wrong size on UInvitationKillerComponent");

// Class Anniversary2023.InvitationKillerTargetComponent
// 0x0050 (0x0148 - 0x00F8)
class UInvitationKillerTargetComponent final : public UInvitationTargetComponent
{
public:
	struct FDBDTunableRowHandle                   _remoteDestroyDistance;                            // 0x00F8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _negateStunDistance;                               // 0x0120(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InvitationKillerTargetComponent">();
	}
	static class UInvitationKillerTargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInvitationKillerTargetComponent>();
	}
};
static_assert(alignof(UInvitationKillerTargetComponent) == 0x000008, "Wrong alignment on UInvitationKillerTargetComponent");
static_assert(sizeof(UInvitationKillerTargetComponent) == 0x000148, "Wrong size on UInvitationKillerTargetComponent");
static_assert(offsetof(UInvitationKillerTargetComponent, _remoteDestroyDistance) == 0x0000F8, "Member 'UInvitationKillerTargetComponent::_remoteDestroyDistance' has a wrong offset!");
static_assert(offsetof(UInvitationKillerTargetComponent, _negateStunDistance) == 0x000120, "Member 'UInvitationKillerTargetComponent::_negateStunDistance' has a wrong offset!");

// Class Anniversary2023.InvitationSurvivorTargetComponent
// 0x0060 (0x0158 - 0x00F8)
class UInvitationSurvivorTargetComponent final : public UInvitationTargetComponent
{
public:
	struct FDBDTunableRowHandle                   _vaultBlockerDistance;                             // 0x00F8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _fragilePalletDistance;                            // 0x0120(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UStatusEffect>              _masqueradeRevealStatusEffect;                     // 0x0148(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _shouldApplyTargetRevealStatusEffect;              // 0x0150(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InvitationSurvivorTargetComponent">();
	}
	static class UInvitationSurvivorTargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInvitationSurvivorTargetComponent>();
	}
};
static_assert(alignof(UInvitationSurvivorTargetComponent) == 0x000008, "Wrong alignment on UInvitationSurvivorTargetComponent");
static_assert(sizeof(UInvitationSurvivorTargetComponent) == 0x000158, "Wrong size on UInvitationSurvivorTargetComponent");
static_assert(offsetof(UInvitationSurvivorTargetComponent, _vaultBlockerDistance) == 0x0000F8, "Member 'UInvitationSurvivorTargetComponent::_vaultBlockerDistance' has a wrong offset!");
static_assert(offsetof(UInvitationSurvivorTargetComponent, _fragilePalletDistance) == 0x000120, "Member 'UInvitationSurvivorTargetComponent::_fragilePalletDistance' has a wrong offset!");
static_assert(offsetof(UInvitationSurvivorTargetComponent, _masqueradeRevealStatusEffect) == 0x000148, "Member 'UInvitationSurvivorTargetComponent::_masqueradeRevealStatusEffect' has a wrong offset!");
static_assert(offsetof(UInvitationSurvivorTargetComponent, _shouldApplyTargetRevealStatusEffect) == 0x000150, "Member 'UInvitationSurvivorTargetComponent::_shouldApplyTargetRevealStatusEffect' has a wrong offset!");

// Class Anniversary2023.KillerNegateStunInteraction
// 0x00A0 (0x0860 - 0x07C0)
class UKillerNegateStunInteraction final : public UInvitationInteractionDefinition
{
public:
	uint8                                         Pad_7B8[0x18];                                     // 0x07B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _negateStunEffect;                                 // 0x07D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UStatusEffect>              _negateStunEffectIconShow;                         // 0x07D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _negateStunPower;                                  // 0x07E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _negateStunDuration;                               // 0x0808(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_830[0x18];                                     // 0x0830(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatusEffect*                          _negateStunStatusEffect;                           // 0x0848(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_850[0x10];                                     // 0x0850(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_ActivateVFXOnKillerStunned();
	void Cosmetic_OnInteractionUpdateStart(class ADBDPlayer* InteractingPlayer, class AInteractable* Interactable);
	void OnRep_StatusEffect(class UStatusEffect* PreviousStatusEffect);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerNegateStunInteraction">();
	}
	static class UKillerNegateStunInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerNegateStunInteraction>();
	}
};
static_assert(alignof(UKillerNegateStunInteraction) == 0x000010, "Wrong alignment on UKillerNegateStunInteraction");
static_assert(sizeof(UKillerNegateStunInteraction) == 0x000860, "Wrong size on UKillerNegateStunInteraction");
static_assert(offsetof(UKillerNegateStunInteraction, _negateStunEffect) == 0x0007D0, "Member 'UKillerNegateStunInteraction::_negateStunEffect' has a wrong offset!");
static_assert(offsetof(UKillerNegateStunInteraction, _negateStunEffectIconShow) == 0x0007D8, "Member 'UKillerNegateStunInteraction::_negateStunEffectIconShow' has a wrong offset!");
static_assert(offsetof(UKillerNegateStunInteraction, _negateStunPower) == 0x0007E0, "Member 'UKillerNegateStunInteraction::_negateStunPower' has a wrong offset!");
static_assert(offsetof(UKillerNegateStunInteraction, _negateStunDuration) == 0x000808, "Member 'UKillerNegateStunInteraction::_negateStunDuration' has a wrong offset!");
static_assert(offsetof(UKillerNegateStunInteraction, _negateStunStatusEffect) == 0x000848, "Member 'UKillerNegateStunInteraction::_negateStunStatusEffect' has a wrong offset!");

// Class Anniversary2023.RemoteDestroyInteraction
// 0x0060 (0x0820 - 0x07C0)
class URemoteDestroyInteraction final : public UInvitationInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _remoteDestroyDuration;                            // 0x07B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class AInteractable*                          _interactable;                                     // 0x07E0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E8[0x38];                                     // 0x07E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnRemoteDestroy(class ADBDPlayer* InteractingPlayer, class AInteractable* Interactable);
	void Multicast_RemoteDestroy(class ADBDPlayer* Player, class AInteractable* Interactable);

	void ExplodeInteractable(class ADBDPlayer* Player, class AInteractable* Interactable) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteDestroyInteraction">();
	}
	static class URemoteDestroyInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteDestroyInteraction>();
	}
};
static_assert(alignof(URemoteDestroyInteraction) == 0x000010, "Wrong alignment on URemoteDestroyInteraction");
static_assert(sizeof(URemoteDestroyInteraction) == 0x000820, "Wrong size on URemoteDestroyInteraction");
static_assert(offsetof(URemoteDestroyInteraction, _remoteDestroyDuration) == 0x0007B8, "Member 'URemoteDestroyInteraction::_remoteDestroyDuration' has a wrong offset!");
static_assert(offsetof(URemoteDestroyInteraction, _interactable) == 0x0007E0, "Member 'URemoteDestroyInteraction::_interactable' has a wrong offset!");

// Class Anniversary2023.ReverseBamboozleInteractionDefinition
// 0x0090 (0x0850 - 0x07C0)
class UReverseBamboozleInteractionDefinition final : public UInvitationInteractionDefinition
{
public:
	float                                         _vfxDissolveTime;                                  // 0x07B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _vaultBlockerDuration;                             // 0x07C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class ABlockFeedbackBase>> _windowBlockSelfFeedbackClasses;                   // 0x07E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class ABlockFeedbackBase>> _windowBlockOtherFeedbackClasses;                  // 0x07F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_808[0x8];                                      // 0x0808(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AWindow*                                _authorityWindow;                                  // 0x0810(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_818[0x38];                                     // 0x0818(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnWindowBlockBegin(class ADBDPlayer* AbilityCaster, const class AWindow* Window, float Duration);
	void Multicast_OnWindowBlockBegin(class ADBDPlayer* AbilityCaster, const class AWindow* Window);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReverseBamboozleInteractionDefinition">();
	}
	static class UReverseBamboozleInteractionDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReverseBamboozleInteractionDefinition>();
	}
};
static_assert(alignof(UReverseBamboozleInteractionDefinition) == 0x000010, "Wrong alignment on UReverseBamboozleInteractionDefinition");
static_assert(sizeof(UReverseBamboozleInteractionDefinition) == 0x000850, "Wrong size on UReverseBamboozleInteractionDefinition");
static_assert(offsetof(UReverseBamboozleInteractionDefinition, _vfxDissolveTime) == 0x0007B8, "Member 'UReverseBamboozleInteractionDefinition::_vfxDissolveTime' has a wrong offset!");
static_assert(offsetof(UReverseBamboozleInteractionDefinition, _vaultBlockerDuration) == 0x0007C0, "Member 'UReverseBamboozleInteractionDefinition::_vaultBlockerDuration' has a wrong offset!");
static_assert(offsetof(UReverseBamboozleInteractionDefinition, _windowBlockSelfFeedbackClasses) == 0x0007E8, "Member 'UReverseBamboozleInteractionDefinition::_windowBlockSelfFeedbackClasses' has a wrong offset!");
static_assert(offsetof(UReverseBamboozleInteractionDefinition, _windowBlockOtherFeedbackClasses) == 0x0007F8, "Member 'UReverseBamboozleInteractionDefinition::_windowBlockOtherFeedbackClasses' has a wrong offset!");
static_assert(offsetof(UReverseBamboozleInteractionDefinition, _authorityWindow) == 0x000810, "Member 'UReverseBamboozleInteractionDefinition::_authorityWindow' has a wrong offset!");

// Class Anniversary2023.ShortenStunDurationEffect
// 0x0018 (0x0398 - 0x0380)
class UShortenStunDurationEffect final : public UStatusEffect
{
public:
	uint8                                         Pad_380[0x18];                                     // 0x0380(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShortenStunDurationEffect">();
	}
	static class UShortenStunDurationEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShortenStunDurationEffect>();
	}
};
static_assert(alignof(UShortenStunDurationEffect) == 0x000008, "Wrong alignment on UShortenStunDurationEffect");
static_assert(sizeof(UShortenStunDurationEffect) == 0x000398, "Wrong size on UShortenStunDurationEffect");

}

