#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Archives

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "Archives_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "NetworkUtilities_structs.hpp"


namespace SDK
{

// Class Archives.BloodPointsQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UBloodPointsQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameStatsCalculated(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BloodPointsQEEvaluator">();
	}
	static class UBloodPointsQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBloodPointsQEEvaluator>();
	}
};
static_assert(alignof(UBloodPointsQEEvaluator) == 0x000008, "Wrong alignment on UBloodPointsQEEvaluator");
static_assert(sizeof(UBloodPointsQEEvaluator) == 0x0000B0, "Wrong size on UBloodPointsQEEvaluator");

// Class Archives.HasItemTypeQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UHasItemTypeQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HasItemTypeQEEvaluator">();
	}
	static class UHasItemTypeQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHasItemTypeQEEvaluator>();
	}
};
static_assert(alignof(UHasItemTypeQEEvaluator) == 0x000008, "Wrong alignment on UHasItemTypeQEEvaluator");
static_assert(sizeof(UHasItemTypeQEEvaluator) == 0x0000B0, "Wrong size on UHasItemTypeQEEvaluator");

// Class Archives.ActorPathFollowingComponent
// 0x0000 (0x02D0 - 0x02D0)
class UActorPathFollowingComponent final : public UPathFollowingComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPathFollowingComponent">();
	}
	static class UActorPathFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPathFollowingComponent>();
	}
};
static_assert(alignof(UActorPathFollowingComponent) == 0x000008, "Wrong alignment on UActorPathFollowingComponent");
static_assert(sizeof(UActorPathFollowingComponent) == 0x0002D0, "Wrong size on UActorPathFollowingComponent");

// Class Archives.HasOneOfEventsHappenedEvaluatorCondition
// 0x0028 (0x0070 - 0x0048)
class UHasOneOfEventsHappenedEvaluatorCondition final : public UEvaluatorCondition
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnyEventConditionData>         _conditionEventsData;                              // 0x0058(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HasOneOfEventsHappenedEvaluatorCondition">();
	}
	static class UHasOneOfEventsHappenedEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHasOneOfEventsHappenedEvaluatorCondition>();
	}
};
static_assert(alignof(UHasOneOfEventsHappenedEvaluatorCondition) == 0x000008, "Wrong alignment on UHasOneOfEventsHappenedEvaluatorCondition");
static_assert(sizeof(UHasOneOfEventsHappenedEvaluatorCondition) == 0x000070, "Wrong size on UHasOneOfEventsHappenedEvaluatorCondition");
static_assert(offsetof(UHasOneOfEventsHappenedEvaluatorCondition, _conditionEventsData) == 0x000058, "Member 'UHasOneOfEventsHappenedEvaluatorCondition::_conditionEventsData' has a wrong offset!");

// Class Archives.AfterExitOpenQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UAfterExitOpenQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnExitGateOpened(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AfterExitOpenQEEvaluator">();
	}
	static class UAfterExitOpenQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAfterExitOpenQEEvaluator>();
	}
};
static_assert(alignof(UAfterExitOpenQEEvaluator) == 0x000008, "Wrong alignment on UAfterExitOpenQEEvaluator");
static_assert(sizeof(UAfterExitOpenQEEvaluator) == 0x0000B0, "Wrong size on UAfterExitOpenQEEvaluator");

// Class Archives.AlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy
// 0x0020 (0x00F0 - 0x00D0)
class UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _outlineColor;                                     // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _glyphQuestId;                                     // 0x00E0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy">();
	}
	static class UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy");
static_assert(sizeof(UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy) == 0x0000F0, "Wrong size on UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy");
static_assert(offsetof(UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy, _outlineColor) == 0x0000D0, "Member 'UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy::_outlineColor' has a wrong offset!");
static_assert(offsetof(UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy, _glyphQuestId) == 0x0000E0, "Member 'UAlwaysVisibleToGlyphQuestHolderOutlineUpdateStrategy::_glyphQuestId' has a wrong offset!");

// Class Archives.RecentlyActiveStateTagEvaluatorCondition
// 0x0080 (0x00C8 - 0x0048)
class URecentlyActiveStateTagEvaluatorCondition : public UEvaluatorCondition
{
public:
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	ERecentlyActiveStateTagType                   _type;                                             // 0x0098(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERecentlyActiveStateTagTimerStartType         _timerStartType;                                   // 0x0099(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _stateTags;                                        // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RecentlyActiveStateTagEvaluatorCondition">();
	}
	static class URecentlyActiveStateTagEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecentlyActiveStateTagEvaluatorCondition>();
	}
};
static_assert(alignof(URecentlyActiveStateTagEvaluatorCondition) == 0x000008, "Wrong alignment on URecentlyActiveStateTagEvaluatorCondition");
static_assert(sizeof(URecentlyActiveStateTagEvaluatorCondition) == 0x0000C8, "Wrong size on URecentlyActiveStateTagEvaluatorCondition");
static_assert(offsetof(URecentlyActiveStateTagEvaluatorCondition, _type) == 0x000098, "Member 'URecentlyActiveStateTagEvaluatorCondition::_type' has a wrong offset!");
static_assert(offsetof(URecentlyActiveStateTagEvaluatorCondition, _timerStartType) == 0x000099, "Member 'URecentlyActiveStateTagEvaluatorCondition::_timerStartType' has a wrong offset!");
static_assert(offsetof(URecentlyActiveStateTagEvaluatorCondition, _stateTags) == 0x0000A0, "Member 'URecentlyActiveStateTagEvaluatorCondition::_stateTags' has a wrong offset!");

// Class Archives.AnyPlayerRecentlyActiveStateTagEvaluatorCondition
// 0x0000 (0x00C8 - 0x00C8)
class UAnyPlayerRecentlyActiveStateTagEvaluatorCondition final : public URecentlyActiveStateTagEvaluatorCondition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnyPlayerRecentlyActiveStateTagEvaluatorCondition">();
	}
	static class UAnyPlayerRecentlyActiveStateTagEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnyPlayerRecentlyActiveStateTagEvaluatorCondition>();
	}
};
static_assert(alignof(UAnyPlayerRecentlyActiveStateTagEvaluatorCondition) == 0x000008, "Wrong alignment on UAnyPlayerRecentlyActiveStateTagEvaluatorCondition");
static_assert(sizeof(UAnyPlayerRecentlyActiveStateTagEvaluatorCondition) == 0x0000C8, "Wrong size on UAnyPlayerRecentlyActiveStateTagEvaluatorCondition");

// Class Archives.BaseRecentEventEvaluatorCondition
// 0x0070 (0x00B8 - 0x0048)
class UBaseRecentEventEvaluatorCondition : public UEvaluatorCondition
{
public:
	uint8                                         Pad_48[0x14];                                      // 0x0048(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _firstGameEvent;                                   // 0x005C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseRecentEventEvaluatorCondition">();
	}
	static class UBaseRecentEventEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseRecentEventEvaluatorCondition>();
	}
};
static_assert(alignof(UBaseRecentEventEvaluatorCondition) == 0x000008, "Wrong alignment on UBaseRecentEventEvaluatorCondition");
static_assert(sizeof(UBaseRecentEventEvaluatorCondition) == 0x0000B8, "Wrong size on UBaseRecentEventEvaluatorCondition");
static_assert(offsetof(UBaseRecentEventEvaluatorCondition, _firstGameEvent) == 0x00005C, "Member 'UBaseRecentEventEvaluatorCondition::_firstGameEvent' has a wrong offset!");

// Class Archives.CarryDistanceQEEvaluator
// 0x0080 (0x0128 - 0x00A8)
class UCarryDistanceQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x80];                                      // 0x00A8(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CarryDistanceQEEvaluator">();
	}
	static class UCarryDistanceQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCarryDistanceQEEvaluator>();
	}
};
static_assert(alignof(UCarryDistanceQEEvaluator) == 0x000008, "Wrong alignment on UCarryDistanceQEEvaluator");
static_assert(sizeof(UCarryDistanceQEEvaluator) == 0x000128, "Wrong size on UCarryDistanceQEEvaluator");

// Class Archives.ChaseInBasementQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UChaseInBasementQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChaseEnd(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void OnChaseStart(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void OnEscapeChase(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaseInBasementQEEvaluator">();
	}
	static class UChaseInBasementQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaseInBasementQEEvaluator>();
	}
};
static_assert(alignof(UChaseInBasementQEEvaluator) == 0x000008, "Wrong alignment on UChaseInBasementQEEvaluator");
static_assert(sizeof(UChaseInBasementQEEvaluator) == 0x0000B0, "Wrong size on UChaseInBasementQEEvaluator");

// Class Archives.SkillCheckQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class USkillCheckQEEvaluator : public UQuestEventEvaluatorBase
{
public:
	bool                                          _greatSkillCheckOnly;                              // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkillCheckQEEvaluator">();
	}
	static class USkillCheckQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillCheckQEEvaluator>();
	}
};
static_assert(alignof(USkillCheckQEEvaluator) == 0x000008, "Wrong alignment on USkillCheckQEEvaluator");
static_assert(sizeof(USkillCheckQEEvaluator) == 0x0000B0, "Wrong size on USkillCheckQEEvaluator");
static_assert(offsetof(USkillCheckQEEvaluator, _greatSkillCheckOnly) == 0x0000A8, "Member 'USkillCheckQEEvaluator::_greatSkillCheckOnly' has a wrong offset!");

// Class Archives.ConsecutiveSkillCheckQEEvaluator
// 0x0008 (0x00B8 - 0x00B0)
class UConsecutiveSkillCheckQEEvaluator final : public USkillCheckQEEvaluator
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConsecutiveSkillCheckQEEvaluator">();
	}
	static class UConsecutiveSkillCheckQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsecutiveSkillCheckQEEvaluator>();
	}
};
static_assert(alignof(UConsecutiveSkillCheckQEEvaluator) == 0x000008, "Wrong alignment on UConsecutiveSkillCheckQEEvaluator");
static_assert(sizeof(UConsecutiveSkillCheckQEEvaluator) == 0x0000B8, "Wrong size on UConsecutiveSkillCheckQEEvaluator");

// Class Archives.ContextualQuestUtilities
// 0x0000 (0x0030 - 0x0030)
class UContextualQuestUtilities final : public UBlueprintFunctionLibrary
{
public:
	static bool PlayerHasAssociatedQuest(const class ADBDPlayer* Player, const class FName SpecialBehaviourId);
	static bool PlayerHasToCompleteAssociatedQuest(const class ADBDPlayer* Player, const class FName SpecialBehaviourId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualQuestUtilities">();
	}
	static class UContextualQuestUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualQuestUtilities>();
	}
};
static_assert(alignof(UContextualQuestUtilities) == 0x000008, "Wrong alignment on UContextualQuestUtilities");
static_assert(sizeof(UContextualQuestUtilities) == 0x000030, "Wrong size on UContextualQuestUtilities");

// Class Archives.SurvivorNearMeEvaluatorCondition
// 0x0008 (0x0050 - 0x0048)
class USurvivorNearMeEvaluatorCondition final : public UEvaluatorCondition
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorNearMeEvaluatorCondition">();
	}
	static class USurvivorNearMeEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorNearMeEvaluatorCondition>();
	}
};
static_assert(alignof(USurvivorNearMeEvaluatorCondition) == 0x000008, "Wrong alignment on USurvivorNearMeEvaluatorCondition");
static_assert(sizeof(USurvivorNearMeEvaluatorCondition) == 0x000050, "Wrong size on USurvivorNearMeEvaluatorCondition");

// Class Archives.CustomValueEvaluatorCondition
// 0x0018 (0x0060 - 0x0048)
class UCustomValueEvaluatorCondition final : public UEvaluatorCondition
{
public:
	class FString                                 _paramConditionKey;                                // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECustomValueComparator                        _comparator;                                       // 0x0058(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomValueEvaluatorCondition">();
	}
	static class UCustomValueEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomValueEvaluatorCondition>();
	}
};
static_assert(alignof(UCustomValueEvaluatorCondition) == 0x000008, "Wrong alignment on UCustomValueEvaluatorCondition");
static_assert(sizeof(UCustomValueEvaluatorCondition) == 0x000060, "Wrong size on UCustomValueEvaluatorCondition");
static_assert(offsetof(UCustomValueEvaluatorCondition, _paramConditionKey) == 0x000048, "Member 'UCustomValueEvaluatorCondition::_paramConditionKey' has a wrong offset!");
static_assert(offsetof(UCustomValueEvaluatorCondition, _comparator) == 0x000058, "Member 'UCustomValueEvaluatorCondition::_comparator' has a wrong offset!");

// Class Archives.CustomValueLessThanAmountQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UCustomValueLessThanAmountQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomValueLessThanAmountQEEvaluator">();
	}
	static class UCustomValueLessThanAmountQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomValueLessThanAmountQEEvaluator>();
	}
};
static_assert(alignof(UCustomValueLessThanAmountQEEvaluator) == 0x000008, "Wrong alignment on UCustomValueLessThanAmountQEEvaluator");
static_assert(sizeof(UCustomValueLessThanAmountQEEvaluator) == 0x0000B0, "Wrong size on UCustomValueLessThanAmountQEEvaluator");

// Class Archives.CustomValueMoreThanAmountQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UCustomValueMoreThanAmountQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomValueMoreThanAmountQEEvaluator">();
	}
	static class UCustomValueMoreThanAmountQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomValueMoreThanAmountQEEvaluator>();
	}
};
static_assert(alignof(UCustomValueMoreThanAmountQEEvaluator) == 0x000008, "Wrong alignment on UCustomValueMoreThanAmountQEEvaluator");
static_assert(sizeof(UCustomValueMoreThanAmountQEEvaluator) == 0x0000B0, "Wrong size on UCustomValueMoreThanAmountQEEvaluator");

// Class Archives.CustomValuePercentQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UCustomValuePercentQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomValuePercentQEEvaluator">();
	}
	static class UCustomValuePercentQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomValuePercentQEEvaluator>();
	}
};
static_assert(alignof(UCustomValuePercentQEEvaluator) == 0x000008, "Wrong alignment on UCustomValuePercentQEEvaluator");
static_assert(sizeof(UCustomValuePercentQEEvaluator) == 0x0000A8, "Wrong size on UCustomValuePercentQEEvaluator");

// Class Archives.CustomValueQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UCustomValueQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomValueQEEvaluator">();
	}
	static class UCustomValueQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomValueQEEvaluator>();
	}
};
static_assert(alignof(UCustomValueQEEvaluator) == 0x000008, "Wrong alignment on UCustomValueQEEvaluator");
static_assert(sizeof(UCustomValueQEEvaluator) == 0x0000A8, "Wrong size on UCustomValueQEEvaluator");

// Class Archives.DifferentSurvivorsNearMeQEEvaluator
// 0x0058 (0x0100 - 0x00A8)
class UDifferentSurvivorsNearMeQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class ADBDPlayer*>                       _foundSurvivors;                                   // 0x00B0(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DifferentSurvivorsNearMeQEEvaluator">();
	}
	static class UDifferentSurvivorsNearMeQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDifferentSurvivorsNearMeQEEvaluator>();
	}
};
static_assert(alignof(UDifferentSurvivorsNearMeQEEvaluator) == 0x000008, "Wrong alignment on UDifferentSurvivorsNearMeQEEvaluator");
static_assert(sizeof(UDifferentSurvivorsNearMeQEEvaluator) == 0x000100, "Wrong size on UDifferentSurvivorsNearMeQEEvaluator");
static_assert(offsetof(UDifferentSurvivorsNearMeQEEvaluator, _foundSurvivors) == 0x0000B0, "Member 'UDifferentSurvivorsNearMeQEEvaluator::_foundSurvivors' has a wrong offset!");

// Class Archives.SurvivorDownedFromHealthyQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class USurvivorDownedFromHealthyQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorDownedFromHealthyQEEvaluator">();
	}
	static class USurvivorDownedFromHealthyQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorDownedFromHealthyQEEvaluator>();
	}
};
static_assert(alignof(USurvivorDownedFromHealthyQEEvaluator) == 0x000008, "Wrong alignment on USurvivorDownedFromHealthyQEEvaluator");
static_assert(sizeof(USurvivorDownedFromHealthyQEEvaluator) == 0x0000A8, "Wrong size on USurvivorDownedFromHealthyQEEvaluator");

// Class Archives.DoBeforeEscapeQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UDoBeforeEscapeQEEvaluator : public UQuestEventEvaluatorBase
{
public:
	void OnEscaped(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DoBeforeEscapeQEEvaluator">();
	}
	static class UDoBeforeEscapeQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoBeforeEscapeQEEvaluator>();
	}
};
static_assert(alignof(UDoBeforeEscapeQEEvaluator) == 0x000008, "Wrong alignment on UDoBeforeEscapeQEEvaluator");
static_assert(sizeof(UDoBeforeEscapeQEEvaluator) == 0x0000A8, "Wrong size on UDoBeforeEscapeQEEvaluator");

// Class Archives.DoBeforeHookQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UDoBeforeHookQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	void OnHooked(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DoBeforeHookQEEvaluator">();
	}
	static class UDoBeforeHookQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoBeforeHookQEEvaluator>();
	}
};
static_assert(alignof(UDoBeforeHookQEEvaluator) == 0x000008, "Wrong alignment on UDoBeforeHookQEEvaluator");
static_assert(sizeof(UDoBeforeHookQEEvaluator) == 0x0000A8, "Wrong size on UDoBeforeHookQEEvaluator");

// Class Archives.TotalDistanceEvaluatorCondition
// 0x0060 (0x00A8 - 0x0048)
class UTotalDistanceEvaluatorCondition : public UEvaluatorCondition
{
public:
	uint8                                         Pad_48[0x40];                                      // 0x0048(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _startTimerEvents;                                 // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   _endTimerEvents;                                   // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TotalDistanceEvaluatorCondition">();
	}
	static class UTotalDistanceEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTotalDistanceEvaluatorCondition>();
	}
};
static_assert(alignof(UTotalDistanceEvaluatorCondition) == 0x000008, "Wrong alignment on UTotalDistanceEvaluatorCondition");
static_assert(sizeof(UTotalDistanceEvaluatorCondition) == 0x0000A8, "Wrong size on UTotalDistanceEvaluatorCondition");
static_assert(offsetof(UTotalDistanceEvaluatorCondition, _startTimerEvents) == 0x000088, "Member 'UTotalDistanceEvaluatorCondition::_startTimerEvents' has a wrong offset!");
static_assert(offsetof(UTotalDistanceEvaluatorCondition, _endTimerEvents) == 0x000098, "Member 'UTotalDistanceEvaluatorCondition::_endTimerEvents' has a wrong offset!");

// Class Archives.DuringEndGameCollapseQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UDuringEndGameCollapseQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndGameCollapseStart(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DuringEndGameCollapseQEEvaluator">();
	}
	static class UDuringEndGameCollapseQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDuringEndGameCollapseQEEvaluator>();
	}
};
static_assert(alignof(UDuringEndGameCollapseQEEvaluator) == 0x000008, "Wrong alignment on UDuringEndGameCollapseQEEvaluator");
static_assert(sizeof(UDuringEndGameCollapseQEEvaluator) == 0x0000B0, "Wrong size on UDuringEndGameCollapseQEEvaluator");

// Class Archives.EarnEmblemQualityQEEvaluator
// 0x0018 (0x00C0 - 0x00A8)
class UEarnEmblemQualityQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFinishedPlaying(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EarnEmblemQualityQEEvaluator">();
	}
	static class UEarnEmblemQualityQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEarnEmblemQualityQEEvaluator>();
	}
};
static_assert(alignof(UEarnEmblemQualityQEEvaluator) == 0x000008, "Wrong alignment on UEarnEmblemQualityQEEvaluator");
static_assert(sizeof(UEarnEmblemQualityQEEvaluator) == 0x0000C0, "Wrong size on UEarnEmblemQualityQEEvaluator");

// Class Archives.TargetInBasementQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UTargetInBasementQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetInBasementQEEvaluator">();
	}
	static class UTargetInBasementQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetInBasementQEEvaluator>();
	}
};
static_assert(alignof(UTargetInBasementQEEvaluator) == 0x000008, "Wrong alignment on UTargetInBasementQEEvaluator");
static_assert(sizeof(UTargetInBasementQEEvaluator) == 0x0000A8, "Wrong size on UTargetInBasementQEEvaluator");

// Class Archives.EndOfGameQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UEndOfGameQEEvaluator : public UQuestEventEvaluatorBase
{
public:
	void OnFinishedPlaying(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndOfGameQEEvaluator">();
	}
	static class UEndOfGameQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndOfGameQEEvaluator>();
	}
};
static_assert(alignof(UEndOfGameQEEvaluator) == 0x000008, "Wrong alignment on UEndOfGameQEEvaluator");
static_assert(sizeof(UEndOfGameQEEvaluator) == 0x0000A8, "Wrong size on UEndOfGameQEEvaluator");

// Class Archives.EscapeBasementItemQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UEscapeBasementItemQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemCollectedFromChest(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void OnTargetEscapeFromTrial(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EscapeBasementItemQEEvaluator">();
	}
	static class UEscapeBasementItemQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEscapeBasementItemQEEvaluator>();
	}
};
static_assert(alignof(UEscapeBasementItemQEEvaluator) == 0x000008, "Wrong alignment on UEscapeBasementItemQEEvaluator");
static_assert(sizeof(UEscapeBasementItemQEEvaluator) == 0x0000B0, "Wrong size on UEscapeBasementItemQEEvaluator");

// Class Archives.SpendTimeWithGameplayTagQEEvaluator
// 0x0088 (0x0130 - 0x00A8)
class USpendTimeWithGameplayTagQEEvaluator : public UQuestEventEvaluatorBase
{
public:
	bool                                          _incrementOnOtherPlayers;                          // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x87];                                      // 0x00A9(0x0087)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpendTimeWithGameplayTagQEEvaluator">();
	}
	static class USpendTimeWithGameplayTagQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpendTimeWithGameplayTagQEEvaluator>();
	}
};
static_assert(alignof(USpendTimeWithGameplayTagQEEvaluator) == 0x000008, "Wrong alignment on USpendTimeWithGameplayTagQEEvaluator");
static_assert(sizeof(USpendTimeWithGameplayTagQEEvaluator) == 0x000130, "Wrong size on USpendTimeWithGameplayTagQEEvaluator");
static_assert(offsetof(USpendTimeWithGameplayTagQEEvaluator, _incrementOnOtherPlayers) == 0x0000A8, "Member 'USpendTimeWithGameplayTagQEEvaluator::_incrementOnOtherPlayers' has a wrong offset!");

// Class Archives.SpendTimeWithStateTagQEEvaluator
// 0x0030 (0x0160 - 0x0130)
class USpendTimeWithStateTagQEEvaluator final : public USpendTimeWithGameplayTagQEEvaluator
{
public:
	TArray<struct FGameplayTag>                   _stateTags;                                        // 0x0130(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x20];                                     // 0x0140(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpendTimeWithStateTagQEEvaluator">();
	}
	static class USpendTimeWithStateTagQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpendTimeWithStateTagQEEvaluator>();
	}
};
static_assert(alignof(USpendTimeWithStateTagQEEvaluator) == 0x000008, "Wrong alignment on USpendTimeWithStateTagQEEvaluator");
static_assert(sizeof(USpendTimeWithStateTagQEEvaluator) == 0x000160, "Wrong size on USpendTimeWithStateTagQEEvaluator");
static_assert(offsetof(USpendTimeWithStateTagQEEvaluator, _stateTags) == 0x000130, "Member 'USpendTimeWithStateTagQEEvaluator::_stateTags' has a wrong offset!");

// Class Archives.EscapeOtherInTrialQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UEscapeOtherInTrialQEEvaluator final : public UDoBeforeEscapeQEEvaluator
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EscapeOtherInTrialQEEvaluator">();
	}
	static class UEscapeOtherInTrialQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEscapeOtherInTrialQEEvaluator>();
	}
};
static_assert(alignof(UEscapeOtherInTrialQEEvaluator) == 0x000008, "Wrong alignment on UEscapeOtherInTrialQEEvaluator");
static_assert(sizeof(UEscapeOtherInTrialQEEvaluator) == 0x0000B0, "Wrong size on UEscapeOtherInTrialQEEvaluator");

// Class Archives.EventAfterOtherWithMinimumCustomValueQEEvaluator
// 0x0018 (0x00C0 - 0x00A8)
class UEventAfterOtherWithMinimumCustomValueQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	struct FGameplayTag                           _startEvent;                                       // 0x00A8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventAfterOtherWithMinimumCustomValueQEEvaluator">();
	}
	static class UEventAfterOtherWithMinimumCustomValueQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventAfterOtherWithMinimumCustomValueQEEvaluator>();
	}
};
static_assert(alignof(UEventAfterOtherWithMinimumCustomValueQEEvaluator) == 0x000008, "Wrong alignment on UEventAfterOtherWithMinimumCustomValueQEEvaluator");
static_assert(sizeof(UEventAfterOtherWithMinimumCustomValueQEEvaluator) == 0x0000C0, "Wrong size on UEventAfterOtherWithMinimumCustomValueQEEvaluator");
static_assert(offsetof(UEventAfterOtherWithMinimumCustomValueQEEvaluator, _startEvent) == 0x0000A8, "Member 'UEventAfterOtherWithMinimumCustomValueQEEvaluator::_startEvent' has a wrong offset!");

// Class Archives.TargetWasDamagedBySpecialAttackRecentlyEvaluator
// 0x00B8 (0x0160 - 0x00A8)
class UTargetWasDamagedBySpecialAttackRecentlyEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0xA0];                                      // 0x00A8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeLimit;                                        // 0x0148(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _specialCaseGameEvents;                            // 0x0150(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetWasDamagedBySpecialAttackRecentlyEvaluator">();
	}
	static class UTargetWasDamagedBySpecialAttackRecentlyEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetWasDamagedBySpecialAttackRecentlyEvaluator>();
	}
};
static_assert(alignof(UTargetWasDamagedBySpecialAttackRecentlyEvaluator) == 0x000008, "Wrong alignment on UTargetWasDamagedBySpecialAttackRecentlyEvaluator");
static_assert(sizeof(UTargetWasDamagedBySpecialAttackRecentlyEvaluator) == 0x000160, "Wrong size on UTargetWasDamagedBySpecialAttackRecentlyEvaluator");
static_assert(offsetof(UTargetWasDamagedBySpecialAttackRecentlyEvaluator, _timeLimit) == 0x000148, "Member 'UTargetWasDamagedBySpecialAttackRecentlyEvaluator::_timeLimit' has a wrong offset!");
static_assert(offsetof(UTargetWasDamagedBySpecialAttackRecentlyEvaluator, _specialCaseGameEvents) == 0x000150, "Member 'UTargetWasDamagedBySpecialAttackRecentlyEvaluator::_specialCaseGameEvents' has a wrong offset!");

// Class Archives.EventCountComparisonQEEvaluator
// 0x0038 (0x00E0 - 0x00A8)
class UEventCountComparisonQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	TArray<struct FGameplayTag>                   _incrementCountEvents;                             // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EEventSubject                                 _incrementIfIAm;                                   // 0x00B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _resetCountEvents;                                 // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EEventSubject                                 _resetIfIAm;                                       // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEventCountComparisonOperator                 _comparisonOperator;                               // 0x00D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D2[0xE];                                       // 0x00D2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventCountComparisonQEEvaluator">();
	}
	static class UEventCountComparisonQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventCountComparisonQEEvaluator>();
	}
};
static_assert(alignof(UEventCountComparisonQEEvaluator) == 0x000008, "Wrong alignment on UEventCountComparisonQEEvaluator");
static_assert(sizeof(UEventCountComparisonQEEvaluator) == 0x0000E0, "Wrong size on UEventCountComparisonQEEvaluator");
static_assert(offsetof(UEventCountComparisonQEEvaluator, _incrementCountEvents) == 0x0000A8, "Member 'UEventCountComparisonQEEvaluator::_incrementCountEvents' has a wrong offset!");
static_assert(offsetof(UEventCountComparisonQEEvaluator, _incrementIfIAm) == 0x0000B8, "Member 'UEventCountComparisonQEEvaluator::_incrementIfIAm' has a wrong offset!");
static_assert(offsetof(UEventCountComparisonQEEvaluator, _resetCountEvents) == 0x0000C0, "Member 'UEventCountComparisonQEEvaluator::_resetCountEvents' has a wrong offset!");
static_assert(offsetof(UEventCountComparisonQEEvaluator, _resetIfIAm) == 0x0000D0, "Member 'UEventCountComparisonQEEvaluator::_resetIfIAm' has a wrong offset!");
static_assert(offsetof(UEventCountComparisonQEEvaluator, _comparisonOperator) == 0x0000D1, "Member 'UEventCountComparisonQEEvaluator::_comparisonOperator' has a wrong offset!");

// Class Archives.EventInTimeQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UEventInTimeQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventInTimeQEEvaluator">();
	}
	static class UEventInTimeQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventInTimeQEEvaluator>();
	}
};
static_assert(alignof(UEventInTimeQEEvaluator) == 0x000008, "Wrong alignment on UEventInTimeQEEvaluator");
static_assert(sizeof(UEventInTimeQEEvaluator) == 0x0000B0, "Wrong size on UEventInTimeQEEvaluator");

// Class Archives.WhiteGlyphSurfaceComponent
// 0x0020 (0x00C8 - 0x00A8)
class UWhiteGlyphSurfaceComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ACollectable>               _fragileObjectBP;                                  // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Multicast_TeleportGlyph(const struct FVector& Location);

	class AGlyph* GetOwningGlyph() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WhiteGlyphSurfaceComponent">();
	}
	static class UWhiteGlyphSurfaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWhiteGlyphSurfaceComponent>();
	}
};
static_assert(alignof(UWhiteGlyphSurfaceComponent) == 0x000008, "Wrong alignment on UWhiteGlyphSurfaceComponent");
static_assert(sizeof(UWhiteGlyphSurfaceComponent) == 0x0000C8, "Wrong size on UWhiteGlyphSurfaceComponent");
static_assert(offsetof(UWhiteGlyphSurfaceComponent, _fragileObjectBP) == 0x0000C0, "Member 'UWhiteGlyphSurfaceComponent::_fragileObjectBP' has a wrong offset!");

// Class Archives.EventOccuredAndStayNearQuestEvaluator
// 0x0080 (0x0128 - 0x00A8)
class UEventOccuredAndStayNearQuestEvaluator final : public UQuestEventEvaluatorBase
{
public:
	struct FGameplayTag                           _triggerEvent;                                     // 0x00A8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESubjectPerspective                           _instigatorPerspective;                            // 0x00B4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESubjectPerspective                           _targetPerspective;                                // 0x00B5(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B6[0x72];                                      // 0x00B6(0x0072)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventOccuredAndStayNearQuestEvaluator">();
	}
	static class UEventOccuredAndStayNearQuestEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventOccuredAndStayNearQuestEvaluator>();
	}
};
static_assert(alignof(UEventOccuredAndStayNearQuestEvaluator) == 0x000008, "Wrong alignment on UEventOccuredAndStayNearQuestEvaluator");
static_assert(sizeof(UEventOccuredAndStayNearQuestEvaluator) == 0x000128, "Wrong size on UEventOccuredAndStayNearQuestEvaluator");
static_assert(offsetof(UEventOccuredAndStayNearQuestEvaluator, _triggerEvent) == 0x0000A8, "Member 'UEventOccuredAndStayNearQuestEvaluator::_triggerEvent' has a wrong offset!");
static_assert(offsetof(UEventOccuredAndStayNearQuestEvaluator, _instigatorPerspective) == 0x0000B4, "Member 'UEventOccuredAndStayNearQuestEvaluator::_instigatorPerspective' has a wrong offset!");
static_assert(offsetof(UEventOccuredAndStayNearQuestEvaluator, _targetPerspective) == 0x0000B5, "Member 'UEventOccuredAndStayNearQuestEvaluator::_targetPerspective' has a wrong offset!");

// Class Archives.EventOccurredBetweenQEEvaluator
// 0x0020 (0x00C8 - 0x00A8)
class UEventOccurredBetweenQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _middleEvent;                                      // 0x00B8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          OuterEventsDifferentTargets;                       // 0x00C4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventOccurredBetweenQEEvaluator">();
	}
	static class UEventOccurredBetweenQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventOccurredBetweenQEEvaluator>();
	}
};
static_assert(alignof(UEventOccurredBetweenQEEvaluator) == 0x000008, "Wrong alignment on UEventOccurredBetweenQEEvaluator");
static_assert(sizeof(UEventOccurredBetweenQEEvaluator) == 0x0000C8, "Wrong size on UEventOccurredBetweenQEEvaluator");
static_assert(offsetof(UEventOccurredBetweenQEEvaluator, _middleEvent) == 0x0000B8, "Member 'UEventOccurredBetweenQEEvaluator::_middleEvent' has a wrong offset!");
static_assert(offsetof(UEventOccurredBetweenQEEvaluator, OuterEventsDifferentTargets) == 0x0000C4, "Member 'UEventOccurredBetweenQEEvaluator::OuterEventsDifferentTargets' has a wrong offset!");

// Class Archives.TotemsAtEndTrialCountQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UTotemsAtEndTrialCountQEEvaluator final : public UEndOfGameQEEvaluator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TotemsAtEndTrialCountQEEvaluator">();
	}
	static class UTotemsAtEndTrialCountQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTotemsAtEndTrialCountQEEvaluator>();
	}
};
static_assert(alignof(UTotemsAtEndTrialCountQEEvaluator) == 0x000008, "Wrong alignment on UTotemsAtEndTrialCountQEEvaluator");
static_assert(sizeof(UTotemsAtEndTrialCountQEEvaluator) == 0x0000A8, "Wrong size on UTotemsAtEndTrialCountQEEvaluator");

// Class Archives.ExtendItemChargesQEEvaluator
// 0x0048 (0x00F0 - 0x00A8)
class UExtendItemChargesQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x48];                                      // 0x00A8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemAdded(class ACollectable* AddedItem, EInventoryType InventoryType, TWeakObjectPtr<class ADBDPlayer> Player);
	void OnItemChargeChanged(const float PreviousCharge, const float CurrentCharge, TWeakObjectPtr<class ADBDPlayer> ItemUser, TWeakObjectPtr<class ACollectable> Item);
	void OnItemEmpty(TWeakObjectPtr<class ADBDPlayer> ItemUser);

	void OnItemRemoved(class ACollectable* RemovedItem, EInventoryType InventoryType) const;
	void OnSurvivorRemoved(class ACamperPlayer* RemovedPlayer) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExtendItemChargesQEEvaluator">();
	}
	static class UExtendItemChargesQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtendItemChargesQEEvaluator>();
	}
};
static_assert(alignof(UExtendItemChargesQEEvaluator) == 0x000008, "Wrong alignment on UExtendItemChargesQEEvaluator");
static_assert(sizeof(UExtendItemChargesQEEvaluator) == 0x0000F0, "Wrong size on UExtendItemChargesQEEvaluator");

// Class Archives.FinishPreventGateEscapeQEEvaluator
// 0x0008 (0x00B0 - 0x00A8)
class UFinishPreventGateEscapeQEEvaluator final : public UEndOfGameQEEvaluator
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FinishPreventGateEscapeQEEvaluator">();
	}
	static class UFinishPreventGateEscapeQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFinishPreventGateEscapeQEEvaluator>();
	}
};
static_assert(alignof(UFinishPreventGateEscapeQEEvaluator) == 0x000008, "Wrong alignment on UFinishPreventGateEscapeQEEvaluator");
static_assert(sizeof(UFinishPreventGateEscapeQEEvaluator) == 0x0000B0, "Wrong size on UFinishPreventGateEscapeQEEvaluator");

// Class Archives.TargetOfEventRecentlyQEEvaluator
// 0x0018 (0x00C0 - 0x00A8)
class UTargetOfEventRecentlyQEEvaluator final : public UQuestEventEvaluatorBase
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _firstGameEvent;                                   // 0x00B0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _secondEventOnSelf;                                // 0x00BC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetOfEventRecentlyQEEvaluator">();
	}
	static class UTargetOfEventRecentlyQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetOfEventRecentlyQEEvaluator>();
	}
};
static_assert(alignof(UTargetOfEventRecentlyQEEvaluator) == 0x000008, "Wrong alignment on UTargetOfEventRecentlyQEEvaluator");
static_assert(sizeof(UTargetOfEventRecentlyQEEvaluator) == 0x0000C0, "Wrong size on UTargetOfEventRecentlyQEEvaluator");
static_assert(offsetof(UTargetOfEventRecentlyQEEvaluator, _firstGameEvent) == 0x0000B0, "Member 'UTargetOfEventRecentlyQEEvaluator::_firstGameEvent' has a wrong offset!");
static_assert(offsetof(UTargetOfEventRecentlyQEEvaluator, _secondEventOnSelf) == 0x0000BC, "Member 'UTargetOfEventRecentlyQEEvaluator::_secondEventOnSelf' has a wrong offset!");

// Class Archives.FragileObjectComponent
// 0x0080 (0x0128 - 0x00A8)
class UFragileObjectComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnObjectBroken;                                    // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnObjectRepaired;                                  // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _repaired;                                         // 0x00E0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x27];                                      // 0x00E1(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _minFallingHeight;                                 // 0x0108(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _generalObjectBreakingEvents;                      // 0x0110(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _previousCollector;                                // 0x0120(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnCamperRemoved(class ACamperPlayer* RemovedPlayer);
	void DBD_RepairFragileObject();
	void OnFragileObjectStateChanged__DelegateSignature();

	class ADBDPlayer* GetPreviousCollector() const;
	bool IsRepaired() const;
	void OnRep_Repaired() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FragileObjectComponent">();
	}
	static class UFragileObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFragileObjectComponent>();
	}
};
static_assert(alignof(UFragileObjectComponent) == 0x000008, "Wrong alignment on UFragileObjectComponent");
static_assert(sizeof(UFragileObjectComponent) == 0x000128, "Wrong size on UFragileObjectComponent");
static_assert(offsetof(UFragileObjectComponent, OnObjectBroken) == 0x0000A8, "Member 'UFragileObjectComponent::OnObjectBroken' has a wrong offset!");
static_assert(offsetof(UFragileObjectComponent, OnObjectRepaired) == 0x0000B8, "Member 'UFragileObjectComponent::OnObjectRepaired' has a wrong offset!");
static_assert(offsetof(UFragileObjectComponent, _repaired) == 0x0000E0, "Member 'UFragileObjectComponent::_repaired' has a wrong offset!");
static_assert(offsetof(UFragileObjectComponent, _minFallingHeight) == 0x000108, "Member 'UFragileObjectComponent::_minFallingHeight' has a wrong offset!");
static_assert(offsetof(UFragileObjectComponent, _generalObjectBreakingEvents) == 0x000110, "Member 'UFragileObjectComponent::_generalObjectBreakingEvents' has a wrong offset!");
static_assert(offsetof(UFragileObjectComponent, _previousCollector) == 0x000120, "Member 'UFragileObjectComponent::_previousCollector' has a wrong offset!");

// Class Archives.GeneratorCoOpEvaluatorCondition
// 0x0000 (0x0048 - 0x0048)
class UGeneratorCoOpEvaluatorCondition final : public UEvaluatorCondition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneratorCoOpEvaluatorCondition">();
	}
	static class UGeneratorCoOpEvaluatorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneratorCoOpEvaluatorCondition>();
	}
};
static_assert(alignof(UGeneratorCoOpEvaluatorCondition) == 0x000008, "Wrong alignment on UGeneratorCoOpEvaluatorCondition");
static_assert(sizeof(UGeneratorCoOpEvaluatorCondition) == 0x000048, "Wrong size on UGeneratorCoOpEvaluatorCondition");

// Class Archives.WhiteGlyphBasementComponent
// 0x00B0 (0x0158 - 0x00A8)
class UWhiteGlyphBasementComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnReadyForInteraction;                             // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         _basementGlyphInteractionCoolDownTime;             // 0x00D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x84];                                      // 0x00D4(0x0084)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReadyForInteractionDelegate__DelegateSignature();

	class AGlyph* GetOwningGlyph() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WhiteGlyphBasementComponent">();
	}
	static class UWhiteGlyphBasementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWhiteGlyphBasementComponent>();
	}
};
static_assert(alignof(UWhiteGlyphBasementComponent) == 0x000008, "Wrong alignment on UWhiteGlyphBasementComponent");
static_assert(sizeof(UWhiteGlyphBasementComponent) == 0x000158, "Wrong size on UWhiteGlyphBasementComponent");
static_assert(offsetof(UWhiteGlyphBasementComponent, OnReadyForInteraction) == 0x0000C0, "Member 'UWhiteGlyphBasementComponent::OnReadyForInteraction' has a wrong offset!");
static_assert(offsetof(UWhiteGlyphBasementComponent, _basementGlyphInteractionCoolDownTime) == 0x0000D0, "Member 'UWhiteGlyphBasementComponent::_basementGlyphInteractionCoolDownTime' has a wrong offset!");

// Class Archives.GeneratorsNeededCountQEEvaluator
// 0x0000 (0x00A8 - 0x00A8)
class UGeneratorsNeededCountQEEvaluator final : public UEndOfGameQEEvaluator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneratorsNeededCountQEEvaluator">();
	}
	static class UGeneratorsNeededCountQEEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneratorsNeededCountQEEvaluator>();
	}
};
static_assert(alignof(UGeneratorsNeededCountQEEvaluator) == 0x000008, "Wrong alignment on UGeneratorsNeededCountQEEvaluator");
static_assert(sizeof(UGeneratorsNeededCountQEEvaluator) == 0x0000A8, "Wrong size on UGeneratorsNeededCountQEEvaluator");

// Class Archives.Glyph
// 0x0158 (0x0540 - 0x03E8)
class AGlyph final : public ASpecialBehaviourInteractable
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADBDPlayer*>                     _playersWithVisibility;                            // 0x03F0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class ADBDPlayer*>                     _oldPlayersWithVisibility;                         // 0x0400(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class FName                                   _specialBehaviourId;                               // 0x0410(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAllowedPlayerType                            _allowedPlayerType;                                // 0x041C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _canOnlyBeInteractedOnByOnePlayer;                 // 0x041D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _canBeInteractedAfterQuestCompleted;               // 0x041E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
