#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Archives

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum Archives.ECustomValueComparator
// NumValues: 0x0004
enum class ECustomValueComparator : uint8
{
	Equal                                    = 0,
	LessOrEqual                              = 1,
	GreaterOrEqual                           = 2,
	ECustomValueComparator_MAX               = 3,
};

// Enum Archives.EEventCountComparisonOperator
// NumValues: 0x0006
enum class EEventCountComparisonOperator : uint8
{
	EqualTo                                  = 0,
	GreaterThan                              = 1,
	GreaterThanEqualTo                       = 2,
	LessThan                                 = 3,
	LessThanEqualTo                          = 4,
	EEventCountComparisonOperator_MAX        = 5,
};

// Enum Archives.EEventSubject
// NumValues: 0x0005
enum class EEventSubject : uint8
{
	Instigator                               = 0,
	Target                                   = 1,
	Any                                      = 2,
	None                                     = 3,
	EEventSubject_MAX                        = 4,
};

// Enum Archives.ESubjectPerspective
// NumValues: 0x0003
enum class ESubjectPerspective : uint8
{
	Me                                       = 0,
	Other                                    = 1,
	ESubjectPerspective_MAX                  = 2,
};

// Enum Archives.EAllowedPlayerType
// NumValues: 0x0004
enum class EAllowedPlayerType : uint8
{
	All                                      = 0,
	KillerOnly                               = 1,
	SurvivorOnly                             = 2,
	EAllowedPlayerType_MAX                   = 3,
};

// Enum Archives.ERecentlyActiveModifierType
// NumValues: 0x0003
enum class ERecentlyActiveModifierType : uint8
{
	AnyTrue                                  = 0,
	AllTrue                                  = 1,
	ERecentlyActiveModifierType_MAX          = 2,
};

// Enum Archives.ERecentlyActiveModifierTimerStartType
// NumValues: 0x0003
enum class ERecentlyActiveModifierTimerStartType : uint8
{
	OnTagAdded                               = 0,
	OnTagRemoved                             = 1,
	ERecentlyActiveModifierTimerStartType_MAX = 2,
};

// Enum Archives.EInChaseTargetLogic
// NumValues: 0x0004
enum class EInChaseTargetLogic : uint8
{
	AnyOf                                    = 0,
	AllOf                                    = 1,
	NoneOf                                   = 2,
	EInChaseTargetLogic_MAX                  = 3,
};

// Enum Archives.EInstigatorTargetDistanceComparator
// NumValues: 0x0003
enum class EInstigatorTargetDistanceComparator : uint8
{
	LessOrEqual                              = 0,
	GreaterOrEqual                           = 1,
	EInstigatorTargetDistanceComparator_MAX  = 2,
};

// Enum Archives.EAttackerSubject
// NumValues: 0x0003
enum class EAttackerSubject : uint8
{
	Instigator                               = 0,
	Target                                   = 1,
	EAttackerSubject_MAX                     = 2,
};

// Enum Archives.EObjectType
// NumValues: 0x0008
enum class EObjectType : uint8
{
	None                                     = 0,
	Generator                                = 1,
	Pallet                                   = 2,
	Totem                                    = 3,
	Window                                   = 4,
	EscapeDoor                               = 5,
	Count                                    = 6,
	EObjectType_MAX                          = 7,
};

// Enum Archives.ENearGameObjectQuestObjectType
// NumValues: 0x000B
enum class ENearGameObjectQuestObjectType : uint8
{
	Generator                                = 0,
	Pallet                                   = 1,
	Chest                                    = 2,
	Totem                                    = 3,
	Window                                   = 4,
	Wall                                     = 5,
	K32ItemBox                               = 6,
	Killer                                   = 7,
	VaultLocation                            = 8,
	Count                                    = 9,
	ENearGameObjectQuestObjectType_MAX       = 10,
};

// Enum Archives.EQueryConditionType
// NumValues: 0x0003
enum class EQueryConditionType : uint8
{
	AllTrue                                  = 0,
	AnyTrue                                  = 1,
	EQueryConditionType_MAX                  = 2,
};

// Enum Archives.ERecentlyActiveStateTagType
// NumValues: 0x0003
enum class ERecentlyActiveStateTagType : uint8
{
	AnyTrue                                  = 0,
	AllTrue                                  = 1,
	ERecentlyActiveStateTagType_MAX          = 2,
};

// Enum Archives.ERecentlyActiveStateTagTimerStartType
// NumValues: 0x0003
enum class ERecentlyActiveStateTagTimerStartType : uint8
{
	OnTagAdded                               = 0,
	OnTagRemoved                             = 1,
	ERecentlyActiveStateTagTimerStartType_MAX = 2,
};

// ScriptStruct Archives.EventOccurrenceConditionData
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FEventOccurrenceConditionData final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConditionSubject                             PreviousConditionSubject;                          // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConditionSubject                             CurrentConditionSubject;                           // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x52];                                       // 0x000E(0x0052)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEventOccurrenceConditionData) == 0x000008, "Wrong alignment on FEventOccurrenceConditionData");
static_assert(sizeof(FEventOccurrenceConditionData) == 0x000060, "Wrong size on FEventOccurrenceConditionData");
static_assert(offsetof(FEventOccurrenceConditionData, GameEventTag) == 0x000000, "Member 'FEventOccurrenceConditionData::GameEventTag' has a wrong offset!");
static_assert(offsetof(FEventOccurrenceConditionData, PreviousConditionSubject) == 0x00000C, "Member 'FEventOccurrenceConditionData::PreviousConditionSubject' has a wrong offset!");
static_assert(offsetof(FEventOccurrenceConditionData, CurrentConditionSubject) == 0x00000D, "Member 'FEventOccurrenceConditionData::CurrentConditionSubject' has a wrong offset!");

// ScriptStruct Archives.AnyEventConditionData
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FAnyEventConditionData final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConditionSubject                             PreviousConditionSubject;                          // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConditionSubject                             CurrentConditionSubject;                           // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x52];                                       // 0x000E(0x0052)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnyEventConditionData) == 0x000008, "Wrong alignment on FAnyEventConditionData");
static_assert(sizeof(FAnyEventConditionData) == 0x000060, "Wrong size on FAnyEventConditionData");
static_assert(offsetof(FAnyEventConditionData, GameEventTag) == 0x000000, "Member 'FAnyEventConditionData::GameEventTag' has a wrong offset!");
static_assert(offsetof(FAnyEventConditionData, PreviousConditionSubject) == 0x00000C, "Member 'FAnyEventConditionData::PreviousConditionSubject' has a wrong offset!");
static_assert(offsetof(FAnyEventConditionData, CurrentConditionSubject) == 0x00000D, "Member 'FAnyEventConditionData::CurrentConditionSubject' has a wrong offset!");

// ScriptStruct Archives.GameObjectQuery
// 0x0058 (0x0058 - 0x0000)
struct FGameObjectQuery final
{
public:
	ENearGameObjectQuestObjectType                Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      GameplayTagQuery;                                  // 0x0008(0x0048)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameObjectQuery) == 0x000008, "Wrong alignment on FGameObjectQuery");
static_assert(sizeof(FGameObjectQuery) == 0x000058, "Wrong size on FGameObjectQuery");
static_assert(offsetof(FGameObjectQuery, Type) == 0x000000, "Member 'FGameObjectQuery::Type' has a wrong offset!");
static_assert(offsetof(FGameObjectQuery, GameplayTagQuery) == 0x000008, "Member 'FGameObjectQuery::GameplayTagQuery' has a wrong offset!");

}

