#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Aset_Slasher_BaseAttack

#include "Basic.hpp"

#include "AnimationUtilities_structs.hpp"


namespace SDK
{

// UserDefinedStruct Aset_Slasher_BaseAttack.Aset_Slasher_BaseAttack
// 0x0078 (0x0078 - 0x0000)
struct FAset_Slasher_BaseAttack final
{
public:
	struct FAnimSequenceSelector                  Attack_In_2_F1088CF94CB5CD5805E3C5A5297C24E8;      // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FAnimSequenceSelector                  Attack_Swing_4_C44C1EBF4AF6D526D301BF8E66D9768A;   // 0x0018(0x0018)(Edit, BlueprintVisible)
	struct FAnimSequenceSelector                  Attack_Miss_6_B0913CA54BD2768CC1EB77A8D84376B1;    // 0x0030(0x0018)(Edit, BlueprintVisible)
	struct FAnimSequenceSelector                  Attack_Hit_8_8D9337BA4F10337CBF0521BE85A5DE67;     // 0x0048(0x0018)(Edit, BlueprintVisible)
	struct FAnimSequenceSelector                  Attack_BounceOnWall_10_6CE8D7714C443E321DA9EFA40A13CB1F; // 0x0060(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FAset_Slasher_BaseAttack) == 0x000008, "Wrong alignment on FAset_Slasher_BaseAttack");
static_assert(sizeof(FAset_Slasher_BaseAttack) == 0x000078, "Wrong size on FAset_Slasher_BaseAttack");
static_assert(offsetof(FAset_Slasher_BaseAttack, Attack_In_2_F1088CF94CB5CD5805E3C5A5297C24E8) == 0x000000, "Member 'FAset_Slasher_BaseAttack::Attack_In_2_F1088CF94CB5CD5805E3C5A5297C24E8' has a wrong offset!");
static_assert(offsetof(FAset_Slasher_BaseAttack, Attack_Swing_4_C44C1EBF4AF6D526D301BF8E66D9768A) == 0x000018, "Member 'FAset_Slasher_BaseAttack::Attack_Swing_4_C44C1EBF4AF6D526D301BF8E66D9768A' has a wrong offset!");
static_assert(offsetof(FAset_Slasher_BaseAttack, Attack_Miss_6_B0913CA54BD2768CC1EB77A8D84376B1) == 0x000030, "Member 'FAset_Slasher_BaseAttack::Attack_Miss_6_B0913CA54BD2768CC1EB77A8D84376B1' has a wrong offset!");
static_assert(offsetof(FAset_Slasher_BaseAttack, Attack_Hit_8_8D9337BA4F10337CBF0521BE85A5DE67) == 0x000048, "Member 'FAset_Slasher_BaseAttack::Attack_Hit_8_8D9337BA4F10337CBF0521BE85A5DE67' has a wrong offset!");
static_assert(offsetof(FAset_Slasher_BaseAttack, Attack_BounceOnWall_10_6CE8D7714C443E321DA9EFA40A13CB1F) == 0x000060, "Member 'FAset_Slasher_BaseAttack::Attack_BounceOnWall_10_6CE8D7714C443E321DA9EFA40A13CB1F' has a wrong offset!");

}

