#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioUtilities

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class AudioUtilities.SplineAudioEmitterActor
// 0x0020 (0x02C0 - 0x02A0)
class ASplineAudioEmitterActor final : public AActor
{
public:
	class USceneComponent*                        _root;                                             // 0x02A0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       _theSpline;                                        // 0x02A8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           _emitter;                                          // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAkComponent* GetEmitterComponent();
	class USplineComponent* GetSplineComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SplineAudioEmitterActor">();
	}
	static class ASplineAudioEmitterActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplineAudioEmitterActor>();
	}
};
static_assert(alignof(ASplineAudioEmitterActor) == 0x000008, "Wrong alignment on ASplineAudioEmitterActor");
static_assert(sizeof(ASplineAudioEmitterActor) == 0x0002C0, "Wrong size on ASplineAudioEmitterActor");
static_assert(offsetof(ASplineAudioEmitterActor, _root) == 0x0002A0, "Member 'ASplineAudioEmitterActor::_root' has a wrong offset!");
static_assert(offsetof(ASplineAudioEmitterActor, _theSpline) == 0x0002A8, "Member 'ASplineAudioEmitterActor::_theSpline' has a wrong offset!");
static_assert(offsetof(ASplineAudioEmitterActor, _emitter) == 0x0002B0, "Member 'ASplineAudioEmitterActor::_emitter' has a wrong offset!");

}

