#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Barrel2023

#include "Basic.hpp"

#include "DataTableUtilities_structs.hpp"
#include "Engine_classes.hpp"
#include "Barrel2023_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SpecialEventUtilities_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class Barrel2023.Barrel
// 0x0100 (0x04D0 - 0x03D0)
class ABarrel final : public ARespawnableInteractable
{
public:
	class UBarrelInteraction*                     _barrelInteraction;                                // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBarrelInteraction*                     _barrelInteractionKiller;                          // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _barrelInteractionChargeable;                      // 0x03E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _barrelInteractionChargeableKiller;                // 0x03E8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _barrelInteractionZone;                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _barrelInteractor;                                 // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _barrelStaticMesh;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _extractorStaticMesh;                              // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _barrelInteractionSecondsToCharge;                 // 0x0410(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _barrelInteractionSecondsToChargeKiller;           // 0x0438(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EBarrelType                                   _barrelType;                                       // 0x0460(0x0001)(Edit, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0468(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           _scoreTag;                                         // 0x0470(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_47C[0x34];                                     // 0x047C(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _barrelLocation;                                   // 0x04B0(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnBarrelDespawn(bool WasInteractionCompleted);
	void Cosmetic_OnBarrelRespawn();
	void Cosmetic_OnFirstBarrelSpawn();
	void Cosmetic_OnInteractionCompleted(class ADBDPlayer* InteractingPlayer);
	void Cosmetic_OnInteractionInterruptedByPlayer();
	void Cosmetic_OnStartedInteracting(class ADBDPlayer* InteractingPlayer, float InteractionDuration);
	void Cosmetic_OnStoppedInteracting();
	void OnBarrelDespawnCosmeticsComplete();
	void OnRep_OnLocationChanged();
	void SetDissolveStarted(bool IsDissolveStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Barrel">();
	}
	static class ABarrel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABarrel>();
	}
};
static_assert(alignof(ABarrel) == 0x000008, "Wrong alignment on ABarrel");
static_assert(sizeof(ABarrel) == 0x0004D0, "Wrong size on ABarrel");
static_assert(offsetof(ABarrel, _barrelInteraction) == 0x0003D0, "Member 'ABarrel::_barrelInteraction' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractionKiller) == 0x0003D8, "Member 'ABarrel::_barrelInteractionKiller' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractionChargeable) == 0x0003E0, "Member 'ABarrel::_barrelInteractionChargeable' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractionChargeableKiller) == 0x0003E8, "Member 'ABarrel::_barrelInteractionChargeableKiller' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractionZone) == 0x0003F0, "Member 'ABarrel::_barrelInteractionZone' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractor) == 0x0003F8, "Member 'ABarrel::_barrelInteractor' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelStaticMesh) == 0x000400, "Member 'ABarrel::_barrelStaticMesh' has a wrong offset!");
static_assert(offsetof(ABarrel, _extractorStaticMesh) == 0x000408, "Member 'ABarrel::_extractorStaticMesh' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractionSecondsToCharge) == 0x000410, "Member 'ABarrel::_barrelInteractionSecondsToCharge' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelInteractionSecondsToChargeKiller) == 0x000438, "Member 'ABarrel::_barrelInteractionSecondsToChargeKiller' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelType) == 0x000460, "Member 'ABarrel::_barrelType' has a wrong offset!");
static_assert(offsetof(ABarrel, _outlineComponent) == 0x000468, "Member 'ABarrel::_outlineComponent' has a wrong offset!");
static_assert(offsetof(ABarrel, _scoreTag) == 0x000470, "Member 'ABarrel::_scoreTag' has a wrong offset!");
static_assert(offsetof(ABarrel, _barrelLocation) == 0x0004B0, "Member 'ABarrel::_barrelLocation' has a wrong offset!");

// Class Barrel2023.BarrelEventComponent
// 0x01A0 (0x0248 - 0x00A8)
class UBarrelEventComponent final : public UActorComponent
{
public:
	TArray<TSubclassOf<class ABarrel>>            _spawnableBarrelClasses;                           // 0x00A8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _barrelSwitchTimerMin;                             // 0x00B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _barrelSwitchTimerMax;                             // 0x00E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _redBarrelSpawnDelay;                              // 0x0108(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _numberOfGeneratorsToComplete;                     // 0x0130(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _numberOfHooksToComplete;                          // 0x0158(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180[0x30];                                     // 0x0180(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ABarrel*, struct FVector>          _barrelLocations;                                  // 0x01B0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0x40];                                     // 0x0200(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _collisionCapsuleHalfHeight;                       // 0x0240(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _collisionCapsuleRadius;                           // 0x0244(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnBarrelInteractionChanged(class ARespawnableInteractable* RespawnableInteractable, bool IsInteracting);
	void Authority_OnBarrelTimerDone(class ARespawnableInteractable* RespawnableInteractable);
	void Authority_OnIntroComplete();
	void DBD_BarrelPauseAllTimers(bool ShouldPause);
	void DBD_BarrelSpawnBlueBarrel();
	void DBD_BarrelSpawnGreenBarrel();
	void DBD_BarrelSpawnRedBarrel();

	void DBD_BarrelDebugBarrelSpawnPositions(float Duration) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BarrelEventComponent">();
	}
	static class UBarrelEventComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarrelEventComponent>();
	}
};
static_assert(alignof(UBarrelEventComponent) == 0x000008, "Wrong alignment on UBarrelEventComponent");
static_assert(sizeof(UBarrelEventComponent) == 0x000248, "Wrong size on UBarrelEventComponent");
static_assert(offsetof(UBarrelEventComponent, _spawnableBarrelClasses) == 0x0000A8, "Member 'UBarrelEventComponent::_spawnableBarrelClasses' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _barrelSwitchTimerMin) == 0x0000B8, "Member 'UBarrelEventComponent::_barrelSwitchTimerMin' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _barrelSwitchTimerMax) == 0x0000E0, "Member 'UBarrelEventComponent::_barrelSwitchTimerMax' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _redBarrelSpawnDelay) == 0x000108, "Member 'UBarrelEventComponent::_redBarrelSpawnDelay' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _numberOfGeneratorsToComplete) == 0x000130, "Member 'UBarrelEventComponent::_numberOfGeneratorsToComplete' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _numberOfHooksToComplete) == 0x000158, "Member 'UBarrelEventComponent::_numberOfHooksToComplete' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _barrelLocations) == 0x0001B0, "Member 'UBarrelEventComponent::_barrelLocations' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _collisionCapsuleHalfHeight) == 0x000240, "Member 'UBarrelEventComponent::_collisionCapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(UBarrelEventComponent, _collisionCapsuleRadius) == 0x000244, "Member 'UBarrelEventComponent::_collisionCapsuleRadius' has a wrong offset!");

// Class Barrel2023.BarrelInteraction
// 0x0030 (0x08F0 - 0x08C0)
class UBarrelInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x18];                                     // 0x08C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _facingTolerance;                                  // 0x08D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _facingHeightUpOffset;                             // 0x08DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _facingHeightDownOffset;                           // 0x08E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8E4[0xC];                                      // 0x08E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BarrelInteraction">();
	}
	static class UBarrelInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarrelInteraction>();
	}
};
static_assert(alignof(UBarrelInteraction) == 0x000010, "Wrong alignment on UBarrelInteraction");
static_assert(sizeof(UBarrelInteraction) == 0x0008F0, "Wrong size on UBarrelInteraction");
static_assert(offsetof(UBarrelInteraction, _facingTolerance) == 0x0008D8, "Member 'UBarrelInteraction::_facingTolerance' has a wrong offset!");
static_assert(offsetof(UBarrelInteraction, _facingHeightUpOffset) == 0x0008DC, "Member 'UBarrelInteraction::_facingHeightUpOffset' has a wrong offset!");
static_assert(offsetof(UBarrelInteraction, _facingHeightDownOffset) == 0x0008E0, "Member 'UBarrelInteraction::_facingHeightDownOffset' has a wrong offset!");

// Class Barrel2023.BarrelPlayerComponent
// 0x0060 (0x0108 - 0x00A8)
class UBarrelPlayerComponent final : public UActorComponent
{
public:
	TArray<EBarrelType>                           _interactedBarrels;                                // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x50];                                      // 0x00B8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_TriggerPlayerVignette(const class ADBDPlayer* Player, const EBarrelType BarrelType);
	void DBD_BarrelResetInteractedBarrels();
	const TArray<EBarrelType> GetInteractedBarrels();
	void Server_SetCharmInfo(const bool IsRedUnlocked, const bool IsGreenUnlocked, const bool IsBlueUnlocked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BarrelPlayerComponent">();
	}
	static class UBarrelPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarrelPlayerComponent>();
	}
};
static_assert(alignof(UBarrelPlayerComponent) == 0x000008, "Wrong alignment on UBarrelPlayerComponent");
static_assert(sizeof(UBarrelPlayerComponent) == 0x000108, "Wrong size on UBarrelPlayerComponent");
static_assert(offsetof(UBarrelPlayerComponent, _interactedBarrels) == 0x0000A8, "Member 'UBarrelPlayerComponent::_interactedBarrels' has a wrong offset!");

}

