#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseSlasherInteraction

#include "Basic.hpp"


namespace SDK::Params
{

// Function BaseSlasherInteraction.BaseSlasherInteraction_C.GetCamper
// 0x0018 (0x0018 - 0x0000)
struct BaseSlasherInteraction_C_GetCamper final
{
public:
	class ACamperPlayer*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class ACamperInteractable*                    CallFunc_GetCamperInteractable_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetOwningSurvivor_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseSlasherInteraction_C_GetCamper) == 0x000008, "Wrong alignment on BaseSlasherInteraction_C_GetCamper");
static_assert(sizeof(BaseSlasherInteraction_C_GetCamper) == 0x000018, "Wrong size on BaseSlasherInteraction_C_GetCamper");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamper, ReturnValue) == 0x000000, "Member 'BaseSlasherInteraction_C_GetCamper::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamper, CallFunc_GetCamperInteractable_ReturnValue) == 0x000008, "Member 'BaseSlasherInteraction_C_GetCamper::CallFunc_GetCamperInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamper, CallFunc_GetOwningSurvivor_ReturnValue) == 0x000010, "Member 'BaseSlasherInteraction_C_GetCamper::CallFunc_GetOwningSurvivor_ReturnValue' has a wrong offset!");

// Function BaseSlasherInteraction.BaseSlasherInteraction_C.GetCamperInteractable
// 0x0020 (0x0020 - 0x0000)
struct BaseSlasherInteraction_C_GetCamperInteractable final
{
public:
	class ACamperInteractable*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AInteractable*                          CallFunc_GetInteractable_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperInteractable*                    K2Node_DynamicCast_AsCamper_Interactable;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseSlasherInteraction_C_GetCamperInteractable) == 0x000008, "Wrong alignment on BaseSlasherInteraction_C_GetCamperInteractable");
static_assert(sizeof(BaseSlasherInteraction_C_GetCamperInteractable) == 0x000020, "Wrong size on BaseSlasherInteraction_C_GetCamperInteractable");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamperInteractable, ReturnValue) == 0x000000, "Member 'BaseSlasherInteraction_C_GetCamperInteractable::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamperInteractable, CallFunc_GetInteractable_ReturnValue) == 0x000008, "Member 'BaseSlasherInteraction_C_GetCamperInteractable::CallFunc_GetInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamperInteractable, K2Node_DynamicCast_AsCamper_Interactable) == 0x000010, "Member 'BaseSlasherInteraction_C_GetCamperInteractable::K2Node_DynamicCast_AsCamper_Interactable' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetCamperInteractable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BaseSlasherInteraction_C_GetCamperInteractable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BaseSlasherInteraction.BaseSlasherInteraction_C.GetSlasher
// 0x0020 (0x0020 - 0x0000)
struct BaseSlasherInteraction_C_GetSlasher final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseSlasherInteraction_C_GetSlasher) == 0x000008, "Wrong alignment on BaseSlasherInteraction_C_GetSlasher");
static_assert(sizeof(BaseSlasherInteraction_C_GetSlasher) == 0x000020, "Wrong size on BaseSlasherInteraction_C_GetSlasher");
static_assert(offsetof(BaseSlasherInteraction_C_GetSlasher, Player) == 0x000000, "Member 'BaseSlasherInteraction_C_GetSlasher::Player' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetSlasher, ReturnValue) == 0x000008, "Member 'BaseSlasherInteraction_C_GetSlasher::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetSlasher, K2Node_DynamicCast_AsSlasher_Player) == 0x000010, "Member 'BaseSlasherInteraction_C_GetSlasher::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(BaseSlasherInteraction_C_GetSlasher, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BaseSlasherInteraction_C_GetSlasher::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

