#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BearTrapAnimBP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TheTrapper_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BearTrapAnimBP.BearTrapAnimBP_C
// 0x0610 (0x0980 - 0x0370)
class UBearTrapAnimBP_C final : public UBearTrapAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x03A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0470(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0498(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x04E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0500(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0548(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0568(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x05B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0618(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0638(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0700(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0750(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0818(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0920(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0950(0x0030)()

public:
	void ExecuteUbergraph_BearTrapAnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BearTrapAnimBP_AnimGraphNode_TransitionResult_3DF49B8C47D7C36E17EB56BA33DBC2CC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BearTrapAnimBP_AnimGraphNode_TransitionResult_226C91784A4B27073C2EBF8533C111AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BearTrapAnimBP_AnimGraphNode_TransitionResult_176792B240EC8E00FE8821B82BAB1157();
	void AnimNotify_Audio_BearTrap_Close();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BearTrapAnimBP_C">();
	}
	static class UBearTrapAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBearTrapAnimBP_C>();
	}
};
static_assert(alignof(UBearTrapAnimBP_C) == 0x000010, "Wrong alignment on UBearTrapAnimBP_C");
static_assert(sizeof(UBearTrapAnimBP_C) == 0x000980, "Wrong size on UBearTrapAnimBP_C");
static_assert(offsetof(UBearTrapAnimBP_C, UberGraphFrame) == 0x000370, "Member 'UBearTrapAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UBearTrapAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UBearTrapAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'UBearTrapAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TransitionResult_5) == 0x0003A8, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0003D0, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0003F8, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000420, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000448, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TransitionResult) == 0x000470, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000498, "Member 'UBearTrapAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_StateResult_3) == 0x0004E0, "Member 'UBearTrapAnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000500, "Member 'UBearTrapAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_StateResult_2) == 0x000548, "Member 'UBearTrapAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000568, "Member 'UBearTrapAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_StateResult_1) == 0x0005B0, "Member 'UBearTrapAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_SequencePlayer) == 0x0005D0, "Member 'UBearTrapAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_StateResult) == 0x000618, "Member 'UBearTrapAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_StateMachine) == 0x000638, "Member 'UBearTrapAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_Slot) == 0x000700, "Member 'UBearTrapAnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_TwoWayBlend) == 0x000750, "Member 'UBearTrapAnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000818, "Member 'UBearTrapAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000920, "Member 'UBearTrapAnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UBearTrapAnimBP_C, AnimGraphNode_UseCachedPose) == 0x000950, "Member 'UBearTrapAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

