#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BearTrapAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct BearTrapAnimBP.BearTrapAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0157 (0x0158 - 0x0001)
struct BearTrapAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_99;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_100;                                // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_101;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_102;                                // 0x0020(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_103;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_104;                                // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_105;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_106;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_107;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_108;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_109;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_110;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_111;                                // 0x0076(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_112;                                // 0x0078(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_113;                                // 0x0084(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_114;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_115;                              // 0x0098(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
};
static_assert(alignof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BearTrapAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000158, "Wrong size on BearTrapAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000004, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_100) == 0x000010, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_100' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_101) == 0x00001C, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_101' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_102) == 0x000020, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_102' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_103) == 0x00002C, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_103' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000030, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_105) == 0x00003C, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_105' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_106) == 0x000040, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_106' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_107) == 0x000044, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_107' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_108) == 0x000070, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_108' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_109) == 0x000074, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_109' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_110) == 0x000075, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_110' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_111) == 0x000076, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_111' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_112) == 0x000078, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_112' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x000084, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_114) == 0x000090, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_114' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_115) == 0x000098, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_115' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'BearTrapAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

