#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BearTrapAnimBP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BearTrapAnimBP.BearTrapAnimBP_C.ExecuteUbergraph_BearTrapAnimBP
// 0x0078 (0x0078 - 0x0000)
struct BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_KillerHasBearTrapNoDamageModifier_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABearTrap*                              K2Node_DynamicCast_AsBear_Trap;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkAudioComponent_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP) == 0x000008, "Wrong alignment on BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP");
static_assert(sizeof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP) == 0x000078, "Wrong size on BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, EntryPoint) == 0x000000, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_KillerHasBearTrapNoDamageModifier_ReturnValue) == 0x000004, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_KillerHasBearTrapNoDamageModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000006, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000007, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000009, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00000A, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x00000C, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000011, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, Temp_delegate_Variable) == 0x000014, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, Temp_delegate_Variable_1) == 0x000028, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000040, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, K2Node_DynamicCast_AsBear_Trap) == 0x000048, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::K2Node_DynamicCast_AsBear_Trap' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_GetAkAudioComponent_ReturnValue) == 0x000058, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_GetAkAudioComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_PostAkEvent_ReturnValue) == 0x000060, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000064, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000068, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000069, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BearTrapAnimBP_C_ExecuteUbergraph_BearTrapAnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BearTrapAnimBP.BearTrapAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BearTrapAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BearTrapAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on BearTrapAnimBP_C_AnimGraph");
static_assert(sizeof(BearTrapAnimBP_C_AnimGraph) == 0x000010, "Wrong size on BearTrapAnimBP_C_AnimGraph");
static_assert(offsetof(BearTrapAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'BearTrapAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

