#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeUtil

#include "Basic.hpp"

#include "BeUtil_structs.hpp"


namespace SDK::Params
{

// Function BeUtil.BeMaterialEditorHelper.EditMaterialConstant
// 0x0038 (0x0038 - 0x0000)
struct BeMaterialEditorHelper_EditMaterialConstant final
{
public:
	class UMaterialInstanceConstant*              InMaterialInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBeMaterialScalar>              InScalars;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBeMaterialVector>              InVectors;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBeMaterialTexture>             InTextures;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BeMaterialEditorHelper_EditMaterialConstant) == 0x000008, "Wrong alignment on BeMaterialEditorHelper_EditMaterialConstant");
static_assert(sizeof(BeMaterialEditorHelper_EditMaterialConstant) == 0x000038, "Wrong size on BeMaterialEditorHelper_EditMaterialConstant");
static_assert(offsetof(BeMaterialEditorHelper_EditMaterialConstant, InMaterialInstance) == 0x000000, "Member 'BeMaterialEditorHelper_EditMaterialConstant::InMaterialInstance' has a wrong offset!");
static_assert(offsetof(BeMaterialEditorHelper_EditMaterialConstant, InScalars) == 0x000008, "Member 'BeMaterialEditorHelper_EditMaterialConstant::InScalars' has a wrong offset!");
static_assert(offsetof(BeMaterialEditorHelper_EditMaterialConstant, InVectors) == 0x000018, "Member 'BeMaterialEditorHelper_EditMaterialConstant::InVectors' has a wrong offset!");
static_assert(offsetof(BeMaterialEditorHelper_EditMaterialConstant, InTextures) == 0x000028, "Member 'BeMaterialEditorHelper_EditMaterialConstant::InTextures' has a wrong offset!");

// Function BeUtil.BeMaterialEditorHelper.ReloadTexture
// 0x0020 (0x0020 - 0x0000)
struct BeMaterialEditorHelper_ReloadTexture final
{
public:
	class UTexture*                               InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSourceName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BeMaterialEditorHelper_ReloadTexture) == 0x000008, "Wrong alignment on BeMaterialEditorHelper_ReloadTexture");
static_assert(sizeof(BeMaterialEditorHelper_ReloadTexture) == 0x000020, "Wrong size on BeMaterialEditorHelper_ReloadTexture");
static_assert(offsetof(BeMaterialEditorHelper_ReloadTexture, InTexture) == 0x000000, "Member 'BeMaterialEditorHelper_ReloadTexture::InTexture' has a wrong offset!");
static_assert(offsetof(BeMaterialEditorHelper_ReloadTexture, InSourceName) == 0x000008, "Member 'BeMaterialEditorHelper_ReloadTexture::InSourceName' has a wrong offset!");
static_assert(offsetof(BeMaterialEditorHelper_ReloadTexture, ReturnValue) == 0x000018, "Member 'BeMaterialEditorHelper_ReloadTexture::ReturnValue' has a wrong offset!");

}

