#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BhvrAssetViewer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "BhvrAssetViewer_structs.hpp"


namespace SDK
{

// Class BhvrAssetViewer.BhvrAssetEnvironmentSystem
// 0x0048 (0x02E8 - 0x02A0)
class ABhvrAssetEnvironmentSystem final : public AActor
{
public:
	struct FDirectoryPath                         EnvironmentsPath;                                  // 0x02A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             SelectedEnvironmentChanged;                        // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     EnvironmentAssetDatas;                             // 0x02C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class FName                                   SelectedEnvironmentName;                           // 0x02D0(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 LoadedEnvironment;                                 // 0x02E0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SelectedEnvironmentChanged__DelegateSignature();
	void SelectEnvironment(const class FString& InDisplayName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetEnvironmentSystem">();
	}
	static class ABhvrAssetEnvironmentSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetEnvironmentSystem>();
	}
};
static_assert(alignof(ABhvrAssetEnvironmentSystem) == 0x000008, "Wrong alignment on ABhvrAssetEnvironmentSystem");
static_assert(sizeof(ABhvrAssetEnvironmentSystem) == 0x0002E8, "Wrong size on ABhvrAssetEnvironmentSystem");
static_assert(offsetof(ABhvrAssetEnvironmentSystem, EnvironmentsPath) == 0x0002A0, "Member 'ABhvrAssetEnvironmentSystem::EnvironmentsPath' has a wrong offset!");
static_assert(offsetof(ABhvrAssetEnvironmentSystem, SelectedEnvironmentChanged) == 0x0002B0, "Member 'ABhvrAssetEnvironmentSystem::SelectedEnvironmentChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetEnvironmentSystem, EnvironmentAssetDatas) == 0x0002C0, "Member 'ABhvrAssetEnvironmentSystem::EnvironmentAssetDatas' has a wrong offset!");
static_assert(offsetof(ABhvrAssetEnvironmentSystem, SelectedEnvironmentName) == 0x0002D0, "Member 'ABhvrAssetEnvironmentSystem::SelectedEnvironmentName' has a wrong offset!");
static_assert(offsetof(ABhvrAssetEnvironmentSystem, LoadedEnvironment) == 0x0002E0, "Member 'ABhvrAssetEnvironmentSystem::LoadedEnvironment' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetLightGroup
// 0x0028 (0x0058 - 0x0030)
class UBhvrAssetLightGroup final : public UObject
{
public:
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IntensityMultiplier;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIntensityMultiplier(float NewIntensityMultiplier);
	void SetIsEnabled(bool bNewValue);

	float GetIntensityMultiplier() const;
	bool GetIsEnabled() const;
	bool HasLights() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetLightGroup">();
	}
	static class UBhvrAssetLightGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrAssetLightGroup>();
	}
};
static_assert(alignof(UBhvrAssetLightGroup) == 0x000008, "Wrong alignment on UBhvrAssetLightGroup");
static_assert(sizeof(UBhvrAssetLightGroup) == 0x000058, "Wrong size on UBhvrAssetLightGroup");
static_assert(offsetof(UBhvrAssetLightGroup, bIsEnabled) == 0x000030, "Member 'UBhvrAssetLightGroup::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UBhvrAssetLightGroup, IntensityMultiplier) == 0x000034, "Member 'UBhvrAssetLightGroup::IntensityMultiplier' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetLightingRig
// 0x0028 (0x02C8 - 0x02A0)
class ABhvrAssetLightingRig final : public AActor
{
public:
	class UBhvrAssetLightGroup*                   KeyLightGroup;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBhvrAssetLightGroup*                   FillLightGroup;                                    // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBhvrAssetLightGroup*                   RimLightGroup;                                     // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBhvrAssetLightGroup*                   KickLightGroup;                                    // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBhvrAssetLightGroup*                   FogLightGroup;                                     // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddFillLight(class ULightComponent* InLight);
	void AddFogLight(class ULightComponent* InLight);
	void AddKeyLight(class ULightComponent* InLight);
	void AddKickLight(class ULightComponent* InLight);
	void AddRimLight(class ULightComponent* InLight);

	class FString GetDisplayName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetLightingRig">();
	}
	static class ABhvrAssetLightingRig* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetLightingRig>();
	}
};
static_assert(alignof(ABhvrAssetLightingRig) == 0x000008, "Wrong alignment on ABhvrAssetLightingRig");
static_assert(sizeof(ABhvrAssetLightingRig) == 0x0002C8, "Wrong size on ABhvrAssetLightingRig");
static_assert(offsetof(ABhvrAssetLightingRig, KeyLightGroup) == 0x0002A0, "Member 'ABhvrAssetLightingRig::KeyLightGroup' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingRig, FillLightGroup) == 0x0002A8, "Member 'ABhvrAssetLightingRig::FillLightGroup' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingRig, RimLightGroup) == 0x0002B0, "Member 'ABhvrAssetLightingRig::RimLightGroup' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingRig, KickLightGroup) == 0x0002B8, "Member 'ABhvrAssetLightingRig::KickLightGroup' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingRig, FogLightGroup) == 0x0002C0, "Member 'ABhvrAssetLightingRig::FogLightGroup' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetLightingSystem
// 0x0038 (0x02D8 - 0x02A0)
class ABhvrAssetLightingSystem final : public AActor
{
public:
	FMulticastInlineDelegateProperty_             SelectedLightingRigChanged;                        // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         LightingRigsPath;                                  // 0x02B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ABhvrAssetLightingRig*>          LightingRigs;                                      // 0x02C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class ABhvrAssetLightingRig*                  SelectedLightingRig;                               // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SelectedLightingRigChanged__DelegateSignature();
	void SelectLightingRig(const class FString& InDisplayName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetLightingSystem">();
	}
	static class ABhvrAssetLightingSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetLightingSystem>();
	}
};
static_assert(alignof(ABhvrAssetLightingSystem) == 0x000008, "Wrong alignment on ABhvrAssetLightingSystem");
static_assert(sizeof(ABhvrAssetLightingSystem) == 0x0002D8, "Wrong size on ABhvrAssetLightingSystem");
static_assert(offsetof(ABhvrAssetLightingSystem, SelectedLightingRigChanged) == 0x0002A0, "Member 'ABhvrAssetLightingSystem::SelectedLightingRigChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingSystem, LightingRigsPath) == 0x0002B0, "Member 'ABhvrAssetLightingSystem::LightingRigsPath' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingSystem, LightingRigs) == 0x0002C0, "Member 'ABhvrAssetLightingSystem::LightingRigs' has a wrong offset!");
static_assert(offsetof(ABhvrAssetLightingSystem, SelectedLightingRig) == 0x0002D0, "Member 'ABhvrAssetLightingSystem::SelectedLightingRig' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewCamera
// 0x00E0 (0x0408 - 0x0328)
class ABhvrAssetViewCamera final : public APawn
{
public:
	class UBhvrAssetViewSpringArmComponent*       SpringArm;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PanFactorXY;                                       // 0x0338(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RotationFactorXY;                                  // 0x0350(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoomFactor;                                        // 0x0368(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PanSpeed;                                          // 0x036C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RotationSensitivity;                               // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinVerticalRotation;                               // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxVerticalRotation;                               // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ZoomSpeed;                                         // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DefaultZoomDistance;                               // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinZoomDistance;                                   // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxZoomDistance;                                   // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinFocalDistance;                                  // 0x038C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxFocalDistance;                                  // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AspectRatio;                                       // 0x0394(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExposureBias;                                      // 0x0398(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FieldOfView;                                       // 0x039C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RollAngle;                                         // 0x03A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseDepthOfField;                                  // 0x03A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlurAmount;                                        // 0x03A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseAutoFocus;                                     // 0x03AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AutoFocusOffsetXY;                                 // 0x03B0(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowAutoFocusTarget;                              // 0x03C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C9[0x3F];                                     // 0x03C9(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PickFocusWithCursor();
	void PickPivotWithCursor();
	void ResetPivot(bool bAllowCameraLag);
	void ResetRotation(bool bAllowCameraLag);
	void ResetZoom(bool bAllowCameraLag);
	void SetAspectRatio(float NewAspectRatio);
	void SetAutoFocusOffset(const struct FVector& NewFocusTargetOffsetXY);
	void SetBlurAmount(float NewBlurAmount);
	void SetExposureBias(float NewExposureBias);
	void SetFieldOfView(float NewFieldOfView);
	void SetRollAngle(float NewRollAngle);
	void SetShowAutoFocusTarget(bool bNewValue);
	void SetUseAutoFocus(bool bNewValue);
	void SetUseDepthOfField(bool bNewValue);
	void ZoomFit(const struct FVector& CenterOfMass, const struct FBox& Bounds, const struct FVector& Padding);

	float GetAspectRatio() const;
	float GetExposureBias() const;
	float GetFieldOfView() const;
	float GetRollAngle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewCamera">();
	}
	static class ABhvrAssetViewCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetViewCamera>();
	}
};
static_assert(alignof(ABhvrAssetViewCamera) == 0x000008, "Wrong alignment on ABhvrAssetViewCamera");
static_assert(sizeof(ABhvrAssetViewCamera) == 0x000408, "Wrong size on ABhvrAssetViewCamera");
static_assert(offsetof(ABhvrAssetViewCamera, SpringArm) == 0x000328, "Member 'ABhvrAssetViewCamera::SpringArm' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, Camera) == 0x000330, "Member 'ABhvrAssetViewCamera::Camera' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, PanFactorXY) == 0x000338, "Member 'ABhvrAssetViewCamera::PanFactorXY' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, RotationFactorXY) == 0x000350, "Member 'ABhvrAssetViewCamera::RotationFactorXY' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, ZoomFactor) == 0x000368, "Member 'ABhvrAssetViewCamera::ZoomFactor' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, PanSpeed) == 0x00036C, "Member 'ABhvrAssetViewCamera::PanSpeed' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, RotationSensitivity) == 0x000370, "Member 'ABhvrAssetViewCamera::RotationSensitivity' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, MinVerticalRotation) == 0x000374, "Member 'ABhvrAssetViewCamera::MinVerticalRotation' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, MaxVerticalRotation) == 0x000378, "Member 'ABhvrAssetViewCamera::MaxVerticalRotation' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, ZoomSpeed) == 0x00037C, "Member 'ABhvrAssetViewCamera::ZoomSpeed' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, DefaultZoomDistance) == 0x000380, "Member 'ABhvrAssetViewCamera::DefaultZoomDistance' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, MinZoomDistance) == 0x000384, "Member 'ABhvrAssetViewCamera::MinZoomDistance' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, MaxZoomDistance) == 0x000388, "Member 'ABhvrAssetViewCamera::MaxZoomDistance' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, MinFocalDistance) == 0x00038C, "Member 'ABhvrAssetViewCamera::MinFocalDistance' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, MaxFocalDistance) == 0x000390, "Member 'ABhvrAssetViewCamera::MaxFocalDistance' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, AspectRatio) == 0x000394, "Member 'ABhvrAssetViewCamera::AspectRatio' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, ExposureBias) == 0x000398, "Member 'ABhvrAssetViewCamera::ExposureBias' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, FieldOfView) == 0x00039C, "Member 'ABhvrAssetViewCamera::FieldOfView' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, RollAngle) == 0x0003A0, "Member 'ABhvrAssetViewCamera::RollAngle' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, bUseDepthOfField) == 0x0003A4, "Member 'ABhvrAssetViewCamera::bUseDepthOfField' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, BlurAmount) == 0x0003A8, "Member 'ABhvrAssetViewCamera::BlurAmount' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, bUseAutoFocus) == 0x0003AC, "Member 'ABhvrAssetViewCamera::bUseAutoFocus' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, AutoFocusOffsetXY) == 0x0003B0, "Member 'ABhvrAssetViewCamera::AutoFocusOffsetXY' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCamera, bShowAutoFocusTarget) == 0x0003C8, "Member 'ABhvrAssetViewCamera::bShowAutoFocusTarget' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewCameraSequenceSystem
// 0x0098 (0x0338 - 0x02A0)
class ABhvrAssetViewCameraSequenceSystem final : public AActor
{
public:
	struct FDirectoryPath                         SequencesPath;                                     // 0x02A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             CameraSequencesChanged;                            // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             SelectedCameraSequenceChanged;                     // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             HasActiveSequenceChanged;                          // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             PlaybackPositionChanged;                           // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FBhvrAssetViewCameraSequence>   CameraSequences;                                   // 0x02F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x18];                                     // 0x0300(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedCameraSequence;                            // 0x0318(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         PlaybackPosition;                                  // 0x0328(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxPlaybackPosition;                               // 0x032C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLooping;                                        // 0x0330(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadSequences(const TArray<struct FAssetData>& SequenceAssetDatas);
	void PauseSequence();
	void PlaySequence();
	void RecordSequence(const class FString& Filename, class UMoviePipelinePrimaryConfig* Configuration);
	void RestartSequence();
	void SelectCameraSequence(const class FString& DisplayName);
	void SetIsLooping(bool bNewValue);
	void SetPlaybackPosition(int32 NewPlaybackPosition);
	void StopSequence();

	bool GetIsLooping() const;
	int32 GetMaxPlaybackPosition() const;
	int32 GetPlaybackPosition() const;
	class FString GetSelectedCameraSequenceName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewCameraSequenceSystem">();
	}
	static class ABhvrAssetViewCameraSequenceSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetViewCameraSequenceSystem>();
	}
};
static_assert(alignof(ABhvrAssetViewCameraSequenceSystem) == 0x000008, "Wrong alignment on ABhvrAssetViewCameraSequenceSystem");
static_assert(sizeof(ABhvrAssetViewCameraSequenceSystem) == 0x000338, "Wrong size on ABhvrAssetViewCameraSequenceSystem");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, SequencesPath) == 0x0002A0, "Member 'ABhvrAssetViewCameraSequenceSystem::SequencesPath' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, CameraSequencesChanged) == 0x0002B0, "Member 'ABhvrAssetViewCameraSequenceSystem::CameraSequencesChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, SelectedCameraSequenceChanged) == 0x0002C0, "Member 'ABhvrAssetViewCameraSequenceSystem::SelectedCameraSequenceChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, HasActiveSequenceChanged) == 0x0002D0, "Member 'ABhvrAssetViewCameraSequenceSystem::HasActiveSequenceChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, PlaybackPositionChanged) == 0x0002E0, "Member 'ABhvrAssetViewCameraSequenceSystem::PlaybackPositionChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, CameraSequences) == 0x0002F0, "Member 'ABhvrAssetViewCameraSequenceSystem::CameraSequences' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, SelectedCameraSequence) == 0x000318, "Member 'ABhvrAssetViewCameraSequenceSystem::SelectedCameraSequence' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, PlaybackPosition) == 0x000328, "Member 'ABhvrAssetViewCameraSequenceSystem::PlaybackPosition' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, MaxPlaybackPosition) == 0x00032C, "Member 'ABhvrAssetViewCameraSequenceSystem::MaxPlaybackPosition' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewCameraSequenceSystem, bIsLooping) == 0x000330, "Member 'ABhvrAssetViewCameraSequenceSystem::bIsLooping' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewController
// 0x0018 (0x0048 - 0x0030)
class UBhvrAssetViewController final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             LoadingStateChanged;                               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bIsLoading;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CalculateBounds(struct FVector* OutCenterOfMass, struct FBox* OutBounds) const;
	class FString GetScreenshotName() const;
	bool IsLoading() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewController">();
	}
	static class UBhvrAssetViewController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrAssetViewController>();
	}
};
static_assert(alignof(UBhvrAssetViewController) == 0x000008, "Wrong alignment on UBhvrAssetViewController");
static_assert(sizeof(UBhvrAssetViewController) == 0x000048, "Wrong size on UBhvrAssetViewController");
static_assert(offsetof(UBhvrAssetViewController, LoadingStateChanged) == 0x000030, "Member 'UBhvrAssetViewController::LoadingStateChanged' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewController, bIsLoading) == 0x000040, "Member 'UBhvrAssetViewController::bIsLoading' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewData
// 0x0038 (0x0068 - 0x0030)
class UBhvrAssetViewData final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             LoadingStateChanged;                               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DisplayName;                                       // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLoading;                                        // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetDisplayName() const;
	class FString GetId() const;
	bool IsLoading() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewData">();
	}
	static class UBhvrAssetViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrAssetViewData>();
	}
};
static_assert(alignof(UBhvrAssetViewData) == 0x000008, "Wrong alignment on UBhvrAssetViewData");
static_assert(sizeof(UBhvrAssetViewData) == 0x000068, "Wrong size on UBhvrAssetViewData");
static_assert(offsetof(UBhvrAssetViewData, LoadingStateChanged) == 0x000030, "Member 'UBhvrAssetViewData::LoadingStateChanged' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewData, ID) == 0x000040, "Member 'UBhvrAssetViewData::ID' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewData, DisplayName) == 0x000050, "Member 'UBhvrAssetViewData::DisplayName' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewData, bIsLoading) == 0x000060, "Member 'UBhvrAssetViewData::bIsLoading' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewDataSource
// 0x00B0 (0x00E0 - 0x0030)
class UBhvrAssetViewDataSource final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             LoadingStateChanged;                               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             AssetViewDataSelectionStateChanged;                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DisplayName;                                       // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBhvrAssetViewOption>           AssetViewDataOptions;                              // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FString, class UBhvrAssetViewData*> AssetViewDatas;                                    // 0x0080(0x0050)(Transient, NativeAccessSpecifierPrivate)
	bool                                          bIsLoading;                                        // 0x00D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBhvrAssetViewData*                     SelectedAssetViewData;                             // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UBhvrAssetViewData* GetSelectedAssetViewData();
	void SelectAssetViewData(const class FString& AssetViewDataId);

	class FString GetDisplayName() const;
	class FString GetId() const;
	bool IsLoading() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewDataSource">();
	}
	static class UBhvrAssetViewDataSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrAssetViewDataSource>();
	}
};
static_assert(alignof(UBhvrAssetViewDataSource) == 0x000008, "Wrong alignment on UBhvrAssetViewDataSource");
static_assert(sizeof(UBhvrAssetViewDataSource) == 0x0000E0, "Wrong size on UBhvrAssetViewDataSource");
static_assert(offsetof(UBhvrAssetViewDataSource, LoadingStateChanged) == 0x000030, "Member 'UBhvrAssetViewDataSource::LoadingStateChanged' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, AssetViewDataSelectionStateChanged) == 0x000040, "Member 'UBhvrAssetViewDataSource::AssetViewDataSelectionStateChanged' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, ID) == 0x000050, "Member 'UBhvrAssetViewDataSource::ID' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, DisplayName) == 0x000060, "Member 'UBhvrAssetViewDataSource::DisplayName' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, AssetViewDataOptions) == 0x000070, "Member 'UBhvrAssetViewDataSource::AssetViewDataOptions' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, AssetViewDatas) == 0x000080, "Member 'UBhvrAssetViewDataSource::AssetViewDatas' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, bIsLoading) == 0x0000D0, "Member 'UBhvrAssetViewDataSource::bIsLoading' has a wrong offset!");
static_assert(offsetof(UBhvrAssetViewDataSource, SelectedAssetViewData) == 0x0000D8, "Member 'UBhvrAssetViewDataSource::SelectedAssetViewData' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewer
// 0x00D0 (0x0370 - 0x02A0)
class ABhvrAssetViewer final : public AActor
{
public:
	FMulticastInlineDelegateProperty_             LoadingStateChanged;                               // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             AssetViewDataSourceSelectionStateChanged;          // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             AssetViewControllerSelectionStateChanged;          // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UBhvrAssetViewDataSource>   AssetViewDataSourceBaseClass;                      // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UBhvrAssetViewController>   AssetViewControllerBaseClass;                      // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ABhvrAssetViewSocket*                   AssetSocket;                                       // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBhvrAssetViewOption>           AssetViewDataSourceOptions;                        // 0x02E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, class UBhvrAssetViewDataSource*> AssetViewDataSources;                              // 0x02F8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UBhvrAssetViewController*>       AssetViewControllers;                              // 0x0348(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x4];                                      // 0x0358(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsLoading;                                        // 0x035C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBhvrAssetViewDataSource*               SelectedAssetViewDataSource;                       // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBhvrAssetViewController*               SelectedAssetViewController;                       // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BeginPlay();
	void OnSelectedAssetViewDataChanged(class UBhvrAssetViewData* OldAssetViewData, class UBhvrAssetViewData* NewAssetViewData);
	void SelectAssetViewDataSource(const class FString& AssetViewDataSourceId);

	const class UBhvrAssetViewController* GetSelectedAssetViewController() const;
	const class UBhvrAssetViewDataSource* GetSelectedAssetViewDataSource() const;
	bool IsLoading() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewer">();
	}
	static class ABhvrAssetViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetViewer>();
	}
};
static_assert(alignof(ABhvrAssetViewer) == 0x000008, "Wrong alignment on ABhvrAssetViewer");
static_assert(sizeof(ABhvrAssetViewer) == 0x000370, "Wrong size on ABhvrAssetViewer");
static_assert(offsetof(ABhvrAssetViewer, LoadingStateChanged) == 0x0002A0, "Member 'ABhvrAssetViewer::LoadingStateChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewDataSourceSelectionStateChanged) == 0x0002B0, "Member 'ABhvrAssetViewer::AssetViewDataSourceSelectionStateChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewControllerSelectionStateChanged) == 0x0002C0, "Member 'ABhvrAssetViewer::AssetViewControllerSelectionStateChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewDataSourceBaseClass) == 0x0002D0, "Member 'ABhvrAssetViewer::AssetViewDataSourceBaseClass' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewControllerBaseClass) == 0x0002D8, "Member 'ABhvrAssetViewer::AssetViewControllerBaseClass' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetSocket) == 0x0002E0, "Member 'ABhvrAssetViewer::AssetSocket' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewDataSourceOptions) == 0x0002E8, "Member 'ABhvrAssetViewer::AssetViewDataSourceOptions' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewDataSources) == 0x0002F8, "Member 'ABhvrAssetViewer::AssetViewDataSources' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, AssetViewControllers) == 0x000348, "Member 'ABhvrAssetViewer::AssetViewControllers' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, bIsLoading) == 0x00035C, "Member 'ABhvrAssetViewer::bIsLoading' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, SelectedAssetViewDataSource) == 0x000360, "Member 'ABhvrAssetViewer::SelectedAssetViewDataSource' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewer, SelectedAssetViewController) == 0x000368, "Member 'ABhvrAssetViewer::SelectedAssetViewController' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewScreenshotSystem
// 0x00C8 (0x0368 - 0x02A0)
class ABhvrAssetViewScreenshotSystem final : public AActor
{
public:
	struct FDirectoryPath                         ScreenshotsPath;                                   // 0x02A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, class FString>            CVarOverrideValues;                                // 0x02B0(0x0050)(Edit, NativeAccessSpecifierPrivate)
	struct FBhvrBufferVisualizationMaterials      BufferVisualizationMaterials;                      // 0x0300(0x0010)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x58];                                     // 0x0310(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void GetBufferVisualizationMaterialNames(TArray<class FString>* InOutBufferVisualizationMaterialNames);

	void CaptureScreen(const class FString& Filename, const struct FIntVector& ResolutionXY, const struct FBhvrScreenshotCaptureRegion& CaptureRegion);
	bool IsBufferVisualizationMaterialEnabled(const class FString& BufferVisualizationMaterialName);
	void SetBufferVisualizationMaterialEnabled(const class FString& BufferVisualizationMaterialName, bool bIsEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewScreenshotSystem">();
	}
	static class ABhvrAssetViewScreenshotSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetViewScreenshotSystem>();
	}
};
static_assert(alignof(ABhvrAssetViewScreenshotSystem) == 0x000008, "Wrong alignment on ABhvrAssetViewScreenshotSystem");
static_assert(sizeof(ABhvrAssetViewScreenshotSystem) == 0x000368, "Wrong size on ABhvrAssetViewScreenshotSystem");
static_assert(offsetof(ABhvrAssetViewScreenshotSystem, ScreenshotsPath) == 0x0002A0, "Member 'ABhvrAssetViewScreenshotSystem::ScreenshotsPath' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewScreenshotSystem, CVarOverrideValues) == 0x0002B0, "Member 'ABhvrAssetViewScreenshotSystem::CVarOverrideValues' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewScreenshotSystem, BufferVisualizationMaterials) == 0x000300, "Member 'ABhvrAssetViewScreenshotSystem::BufferVisualizationMaterials' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewSocket
// 0x0050 (0x02F0 - 0x02A0)
class ABhvrAssetViewSocket final : public ATargetPoint
{
public:
	FMulticastInlineDelegateProperty_             AssetTransformChanged;                             // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             AutoRotateEnabledChanged;                          // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             AutoRotateDirectionChanged;                        // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             AutoRotateSpeedChanged;                            // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UBhvrAssetViewSpringArmComponent*       SpringArm;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoRotateEnabled;                                // 0x02E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EBhvrAssetViewRotation                        AutoRotateDirection;                               // 0x02E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2EA[0x2];                                      // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoRotateSpeed;                                   // 0x02EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PropertyChanged__DelegateSignature();
	void SetAssetLocation(const struct FVector& NewLocation);
	void SetAssetRotation(const struct FRotator& NewRotation);
	void SetAutoRotateDirection(EBhvrAssetViewRotation NewDirection);
	void SetAutoRotateEnabled(bool bNewValue);
	void SetAutoRotateSpeed(float NewSpeed);

	const struct FTransform GetAssetTransform() const;
	EBhvrAssetViewRotation GetAutoRotateDirection() const;
	bool GetAutoRotateEnabled() const;
	float GetAutoRotateSpeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewSocket">();
	}
	static class ABhvrAssetViewSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABhvrAssetViewSocket>();
	}
};
static_assert(alignof(ABhvrAssetViewSocket) == 0x000008, "Wrong alignment on ABhvrAssetViewSocket");
static_assert(sizeof(ABhvrAssetViewSocket) == 0x0002F0, "Wrong size on ABhvrAssetViewSocket");
static_assert(offsetof(ABhvrAssetViewSocket, AssetTransformChanged) == 0x0002A0, "Member 'ABhvrAssetViewSocket::AssetTransformChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, AutoRotateEnabledChanged) == 0x0002B0, "Member 'ABhvrAssetViewSocket::AutoRotateEnabledChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, AutoRotateDirectionChanged) == 0x0002C0, "Member 'ABhvrAssetViewSocket::AutoRotateDirectionChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, AutoRotateSpeedChanged) == 0x0002D0, "Member 'ABhvrAssetViewSocket::AutoRotateSpeedChanged' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, SpringArm) == 0x0002E0, "Member 'ABhvrAssetViewSocket::SpringArm' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, bAutoRotateEnabled) == 0x0002E8, "Member 'ABhvrAssetViewSocket::bAutoRotateEnabled' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, AutoRotateDirection) == 0x0002E9, "Member 'ABhvrAssetViewSocket::AutoRotateDirection' has a wrong offset!");
static_assert(offsetof(ABhvrAssetViewSocket, AutoRotateSpeed) == 0x0002EC, "Member 'ABhvrAssetViewSocket::AutoRotateSpeed' has a wrong offset!");

// Class BhvrAssetViewer.BhvrAssetViewSpringArmComponent
// 0x0010 (0x03D0 - 0x03C0)
class UBhvrAssetViewSpringArmComponent final : public USpringArmComponent
{
public:
	uint8                                         Pad_3C0[0x10];                                     // 0x03C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrAssetViewSpringArmComponent">();
	}
	static class UBhvrAssetViewSpringArmComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrAssetViewSpringArmComponent>();
	}
};
static_assert(alignof(UBhvrAssetViewSpringArmComponent) == 0x000010, "Wrong alignment on UBhvrAssetViewSpringArmComponent");
static_assert(sizeof(UBhvrAssetViewSpringArmComponent) == 0x0003D0, "Wrong size on UBhvrAssetViewSpringArmComponent");

// Class BhvrAssetViewer.BhvrWatermarkComponent
// 0x0040 (0x0600 - 0x05C0)
class UBhvrWatermarkComponent final : public UBillboardComponent
{
public:
	struct FVector                                WatermarkLocation;                                 // 0x05B8(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                WatermarkOffset;                                   // 0x05D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        WatermarkSize;                                     // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsWatermarkHidden;                                // 0x05F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5F1[0xF];                                      // 0x05F1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetWatermarkLocation();
	void SetWatermarkHidden(bool bNewHidden);
	void SetWatermarkLocation(const struct FVector& NewLocation);
	void SetWatermarkSize(double NewSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrWatermarkComponent">();
	}
	static class UBhvrWatermarkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrWatermarkComponent>();
	}
};
static_assert(alignof(UBhvrWatermarkComponent) == 0x000010, "Wrong alignment on UBhvrWatermarkComponent");
static_assert(sizeof(UBhvrWatermarkComponent) == 0x000600, "Wrong size on UBhvrWatermarkComponent");
static_assert(offsetof(UBhvrWatermarkComponent, WatermarkLocation) == 0x0005B8, "Member 'UBhvrWatermarkComponent::WatermarkLocation' has a wrong offset!");
