#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BhvrAsserts

#include "Basic.hpp"


namespace SDK::Params
{

// Function BhvrAsserts.BhvrAssertBlueprintLibrary.Ensure
// 0x0028 (0x0028 - 0x0000)
struct BhvrAssertBlueprintLibrary_Ensure final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCondition;                                        // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BhvrAssertBlueprintLibrary_Ensure) == 0x000008, "Wrong alignment on BhvrAssertBlueprintLibrary_Ensure");
static_assert(sizeof(BhvrAssertBlueprintLibrary_Ensure) == 0x000028, "Wrong size on BhvrAssertBlueprintLibrary_Ensure");
static_assert(offsetof(BhvrAssertBlueprintLibrary_Ensure, WorldContextObject) == 0x000000, "Member 'BhvrAssertBlueprintLibrary_Ensure::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BhvrAssertBlueprintLibrary_Ensure, bCondition) == 0x000008, "Member 'BhvrAssertBlueprintLibrary_Ensure::bCondition' has a wrong offset!");
static_assert(offsetof(BhvrAssertBlueprintLibrary_Ensure, Message) == 0x000010, "Member 'BhvrAssertBlueprintLibrary_Ensure::Message' has a wrong offset!");
static_assert(offsetof(BhvrAssertBlueprintLibrary_Ensure, ReturnValue) == 0x000020, "Member 'BhvrAssertBlueprintLibrary_Ensure::ReturnValue' has a wrong offset!");

}

