#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BinkMediaPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "BinkMediaPlayer_structs.hpp"


namespace SDK
{

// Class BinkMediaPlayer.BinkFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UBinkFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Bink_DrawOverlays();
	static struct FTimespan BinkLoadingMovie_GetDuration();
	static struct FTimespan BinkLoadingMovie_GetTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkFunctionLibrary">();
	}
	static class UBinkFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkFunctionLibrary>();
	}
};
static_assert(alignof(UBinkFunctionLibrary) == 0x000008, "Wrong alignment on UBinkFunctionLibrary");
static_assert(sizeof(UBinkFunctionLibrary) == 0x000030, "Wrong size on UBinkFunctionLibrary");

// Class BinkMediaPlayer.BinkMediaPlayer
// 0x0108 (0x0138 - 0x0030)
class UBinkMediaPlayer final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnMediaClosed;                                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMediaOpened;                                     // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMediaReachedEnd;                                 // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPlaybackSuspended;                               // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSubtitleChangeEvent;                             // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Looping : 1;                                       // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         StartImmediately : 1;                              // 0x0088(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DelayedOpen : 1;                                   // 0x0088(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0090(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x00A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkBufferModes               BinkBufferMode;                                    // 0x00C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x00C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkDrawStyle                 BinkDrawStyle;                                     // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkLayerDepth;                                    // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x68];                                      // 0x00D0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseUrl();
	void Draw(class UTexture* Texture, bool Tonemap, int32 Out_nits, float Alpha, bool Srgb_decode, bool Hdr);
	bool OpenUrl(const class FString& NewUrl);
	bool Pause();
	bool Play();
	bool Rewind();
	bool Seek(const struct FTimespan& InTime);
	bool SetLooping(bool InLooping);
	bool SetRate(float Rate);
	void SetVolume(float Rate);
	void Stop();

	bool CanPause() const;
	bool CanPlay() const;
	struct FTimespan GetDuration() const;
	float GetRate() const;
	struct FTimespan GetTime() const;
	class FString GetUrl() const;
	bool IsInitialized() const;
	bool IsLooping() const;
	bool IsPaused() const;
	bool IsPlaying() const;
	bool IsStopped() const;
	bool SupportsRate(float Rate, bool Unthinned) const;
	bool SupportsScrubbing() const;
	bool SupportsSeeking() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkMediaPlayer">();
	}
	static class UBinkMediaPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaPlayer>();
	}
};
static_assert(alignof(UBinkMediaPlayer) == 0x000008, "Wrong alignment on UBinkMediaPlayer");
static_assert(sizeof(UBinkMediaPlayer) == 0x000138, "Wrong size on UBinkMediaPlayer");
static_assert(offsetof(UBinkMediaPlayer, OnMediaClosed) == 0x000038, "Member 'UBinkMediaPlayer::OnMediaClosed' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, OnMediaOpened) == 0x000048, "Member 'UBinkMediaPlayer::OnMediaOpened' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, OnMediaReachedEnd) == 0x000058, "Member 'UBinkMediaPlayer::OnMediaReachedEnd' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, OnPlaybackSuspended) == 0x000068, "Member 'UBinkMediaPlayer::OnPlaybackSuspended' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, OnSubtitleChangeEvent) == 0x000078, "Member 'UBinkMediaPlayer::OnSubtitleChangeEvent' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkDestinationUpperLeft) == 0x000090, "Member 'UBinkMediaPlayer::BinkDestinationUpperLeft' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkDestinationLowerRight) == 0x0000A0, "Member 'UBinkMediaPlayer::BinkDestinationLowerRight' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, URL) == 0x0000B0, "Member 'UBinkMediaPlayer::URL' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkBufferMode) == 0x0000C0, "Member 'UBinkMediaPlayer::BinkBufferMode' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkSoundTrack) == 0x0000C1, "Member 'UBinkMediaPlayer::BinkSoundTrack' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkSoundTrackStart) == 0x0000C4, "Member 'UBinkMediaPlayer::BinkSoundTrackStart' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkDrawStyle) == 0x0000C8, "Member 'UBinkMediaPlayer::BinkDrawStyle' has a wrong offset!");
static_assert(offsetof(UBinkMediaPlayer, BinkLayerDepth) == 0x0000CC, "Member 'UBinkMediaPlayer::BinkLayerDepth' has a wrong offset!");

// Class BinkMediaPlayer.BinkMediaTexture
// 0x0030 (0x0210 - 0x01E0)
class UBinkMediaTexture final : public UTexture
{
public:
	ETextureAddress                               AddressX;                                          // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x01E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  PixelFormat;                                       // 0x01E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Tonemap;                                           // 0x01E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutputNits;                                        // 0x01EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x01F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DecodeSRGB;                                        // 0x01F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5[0x1B];                                     // 0x01F5(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();
	void SetMediaPlayer(class UBinkMediaPlayer* InMediaPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkMediaTexture">();
	}
	static class UBinkMediaTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaTexture>();
	}
};
static_assert(alignof(UBinkMediaTexture) == 0x000010, "Wrong alignment on UBinkMediaTexture");
static_assert(sizeof(UBinkMediaTexture) == 0x000210, "Wrong size on UBinkMediaTexture");
static_assert(offsetof(UBinkMediaTexture, AddressX) == 0x0001D8, "Member 'UBinkMediaTexture::AddressX' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, AddressY) == 0x0001D9, "Member 'UBinkMediaTexture::AddressY' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, MediaPlayer) == 0x0001E0, "Member 'UBinkMediaTexture::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, PixelFormat) == 0x0001E8, "Member 'UBinkMediaTexture::PixelFormat' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, Tonemap) == 0x0001E9, "Member 'UBinkMediaTexture::Tonemap' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, OutputNits) == 0x0001EC, "Member 'UBinkMediaTexture::OutputNits' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, Alpha) == 0x0001F0, "Member 'UBinkMediaTexture::Alpha' has a wrong offset!");
static_assert(offsetof(UBinkMediaTexture, DecodeSRGB) == 0x0001F4, "Member 'UBinkMediaTexture::DecodeSRGB' has a wrong offset!");

// Class BinkMediaPlayer.BinkMoviePlayerSettings
// 0x0030 (0x0060 - 0x0030)
class UBinkMoviePlayerSettings final : public UObject
{
public:
	EBinkMoviePlayerBinkBufferModes               BinkBufferMode;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMoviePlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x0031(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x0034(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0038(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x0048(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  BinkPixelFormat;                                   // 0x0058(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BinkMoviePlayerSettings">();
	}
	static class UBinkMoviePlayerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMoviePlayerSettings>();
	}
};
static_assert(alignof(UBinkMoviePlayerSettings) == 0x000008, "Wrong alignment on UBinkMoviePlayerSettings");
static_assert(sizeof(UBinkMoviePlayerSettings) == 0x000060, "Wrong size on UBinkMoviePlayerSettings");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkBufferMode) == 0x000030, "Member 'UBinkMoviePlayerSettings::BinkBufferMode' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkSoundTrack) == 0x000031, "Member 'UBinkMoviePlayerSettings::BinkSoundTrack' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkSoundTrackStart) == 0x000034, "Member 'UBinkMoviePlayerSettings::BinkSoundTrackStart' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkDestinationUpperLeft) == 0x000038, "Member 'UBinkMoviePlayerSettings::BinkDestinationUpperLeft' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkDestinationLowerRight) == 0x000048, "Member 'UBinkMoviePlayerSettings::BinkDestinationLowerRight' has a wrong offset!");
static_assert(offsetof(UBinkMoviePlayerSettings, BinkPixelFormat) == 0x000058, "Member 'UBinkMoviePlayerSettings::BinkPixelFormat' has a wrong offset!");

}

