#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlindnessEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlindnessEffect.BlindnessEffect_C.ExecuteUbergraph_BlindnessEffect
// 0x0010 (0x0010 - 0x0000)
struct BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCustomParam_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCustomParam_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect) == 0x000004, "Wrong alignment on BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect");
static_assert(sizeof(BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect) == 0x000010, "Wrong size on BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect");
static_assert(offsetof(BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect, EntryPoint) == 0x000000, "Member 'BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect, CallFunc_GetCustomParam_ReturnValue) == 0x000004, "Member 'BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect::CallFunc_GetCustomParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect, CallFunc_GetCustomParam_ReturnValue_1) == 0x000008, "Member 'BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect::CallFunc_GetCustomParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'BlindnessEffect_C_ExecuteUbergraph_BlindnessEffect::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

