#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Audio_Survivor_AnimNotifies_Handler

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.Body
// 0x0018 (0x0018 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_Body final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Notify_Name;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_Body) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_Body");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_Body) == 0x000018, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_Body");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Body, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Body::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Body, Notify_Name) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Body::Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Body, Return_Value) == 0x000014, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Body::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Body, K2Node_SwitchName_CmpSuccess) == 0x000015, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Body::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.Closet
// 0x0048 (0x0048 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_Closet final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Notify_Name;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRushQuietly_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRushQuietly_ReturnValue_1;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_2;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRushQuietly_ReturnValue_2;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_Closet");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet) == 0x000048, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_Closet");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, Notify_Name) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, Return_Value) == 0x000014, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_SwitchName_CmpSuccess) == 0x000015, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_DynamicCast_AsCamper_Player) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_DynamicCast_AsCamper_Player_1) == 0x000028, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_DynamicCast_AsCamper_Player_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, CallFunc_CanRushQuietly_ReturnValue) == 0x000031, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::CallFunc_CanRushQuietly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, CallFunc_CanRushQuietly_ReturnValue_1) == 0x000032, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::CallFunc_CanRushQuietly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_DynamicCast_AsCamper_Player_2) == 0x000038, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_DynamicCast_AsCamper_Player_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Closet, CallFunc_CanRushQuietly_ReturnValue_2) == 0x000041, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Closet::CallFunc_CanRushQuietly_ReturnValue_2' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.FootSteps
// 0x0050 (0x0050 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Notify_Name;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasReverseBearTrap_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectStateProvider>  CallFunc_HasStateTag_objectStateProvider_CastInput; // 0x0038(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasStateTag_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps) == 0x000050, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, Notify_Name) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, ReturnValue) == 0x000014, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, K2Node_SwitchName_CmpSuccess) == 0x000015, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, K2Node_DynamicCast_AsCamper_Player) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, CallFunc_HasReverseBearTrap_ReturnValue) == 0x000021, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::CallFunc_HasReverseBearTrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, K2Node_DynamicCast_AsCamper_Player_1) == 0x000028, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::K2Node_DynamicCast_AsCamper_Player_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, CallFunc_HasStateTag_objectStateProvider_CastInput) == 0x000038, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::CallFunc_HasStateTag_objectStateProvider_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, CallFunc_HasStateTag_ReturnValue) == 0x000048, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::CallFunc_HasStateTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps, CallFunc_HasPerkFlag_ReturnValue) == 0x000049, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_FootSteps::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.Grunt
// 0x0028 (0x0028 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Notify_Name;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Audio_Survivor_Grunt_Hurt_Light_Return_Value; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerScreamEventsIfPossible_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt) == 0x000028, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, Notify_Name) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, Return_Value) == 0x000014, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, K2Node_SwitchName_CmpSuccess) == 0x000015, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, CallFunc_Audio_Survivor_Grunt_Hurt_Light_Return_Value) == 0x000016, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::CallFunc_Audio_Survivor_Grunt_Hurt_Light_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, K2Node_DynamicCast_AsCamper_Player) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt, CallFunc_TriggerScreamEventsIfPossible_ReturnValue) == 0x000021, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Grunt::CallFunc_TriggerScreamEventsIfPossible_ReturnValue' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.HandleAnimNotify
// 0x0030 (0x0030 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   NotifyName;                                        // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDBasePlayer*                         K2Node_DynamicCast_AsDBDBase_Player;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Haptic_Notifies_Return_Value;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Specific_Return_Value;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_States_Special_Return_Value;              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_States_Return_Value;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Rush_and_Interactions_Return_Value;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Closet_Return_Value;                      // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Body_Return_Value;                        // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Footsteps_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Grunt_Return_Value;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Landing_Return_Value;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify) == 0x000030, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, NotifyName) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, ReturnValue) == 0x000014, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, K2Node_DynamicCast_AsDBDBase_Player) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::K2Node_DynamicCast_AsDBDBase_Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Haptic_Notifies_Return_Value) == 0x000021, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Haptic_Notifies_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Specific_Return_Value) == 0x000022, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Specific_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_States_Special_Return_Value) == 0x000023, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_States_Special_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_States_Return_Value) == 0x000024, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_States_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Rush_and_Interactions_Return_Value) == 0x000025, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Rush_and_Interactions_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Closet_Return_Value) == 0x000026, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Closet_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Body_Return_Value) == 0x000027, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Body_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Footsteps_ReturnValue) == 0x000028, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Footsteps_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Grunt_Return_Value) == 0x000029, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Grunt_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_Landing_Return_Value) == 0x00002A, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_Landing_Return_Value' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.Haptic Notifies
// 0x0030 (0x0030 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies final
{
public:
	class FName                                   Notify_Name;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDBasePlayer*                         Player;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_DynamicCast_AsDBDPlayer;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies) == 0x000030, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, Notify_Name) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, Player) == 0x000010, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, Return_Value) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, K2Node_DynamicCast_AsDBDPlayer) == 0x000020, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::K2Node_DynamicCast_AsDBDPlayer' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, K2Node_SwitchName_CmpSuccess) == 0x000029, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, CallFunc_IsLocallyControlled_ReturnValue) == 0x00002A, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, CallFunc_IsPlayerControlled_ReturnValue) == 0x00002B, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Haptic_Notifies::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.KillerHasBearTrapNoDamageModifier
// 0x0020 (0x0020 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBearTrapNoDamageModifier;                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         CallFunc_GetKiller_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier) == 0x000020, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, Return) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::Return' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, HasBearTrapNoDamageModifier) == 0x000001, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::HasBearTrapNoDamageModifier' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, CallFunc_GetKiller_ReturnValue) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::CallFunc_GetKiller_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, CallFunc_GetPerkManager_ReturnValue) == 0x000010, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier, CallFunc_HasPerkFlag_ReturnValue) == 0x00001A, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_KillerHasBearTrapNoDamageModifier::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.Landing
// 0x0180 (0x0180 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_Landing final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Notify_Name;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAudioComponent_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCustomizedAudioComponent*              CallFunc_GetCustomizedAudio_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_GetAudioComponent_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAudioSwitchState_ReturnValue;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCustomizedAudioComponent*              CallFunc_GetCustomizedAudio_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCustomizedAudioComponent*              CallFunc_GetCustomizedAudio_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAudioSwitchState_ReturnValue_1;        // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAudioSwitchState_ReturnValue_2;        // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_GetAudioComponent_ReturnValue_2;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_1;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_2;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_3;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue_2;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue_3;                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_2;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_3;          // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_4;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_5;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_Landing");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing) == 0x000180, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_Landing");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, Notify_Name) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, Return_Value) == 0x000014, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::Return_Value' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_MakeLiteralString_ReturnValue) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetAudioComponent_ReturnValue) == 0x000030, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetAudioComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetCustomizedAudio_ReturnValue) == 0x000038, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetCustomizedAudio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetAudioComponent_ReturnValue_1) == 0x000040, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetAudioComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetAudioSwitchState_ReturnValue) == 0x000048, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetAudioSwitchState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetCustomizedAudio_ReturnValue_1) == 0x000058, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetCustomizedAudio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetCustomizedAudio_ReturnValue_2) == 0x000060, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetCustomizedAudio_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetAudioSwitchState_ReturnValue_1) == 0x000068, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetAudioSwitchState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetAudioSwitchState_ReturnValue_2) == 0x000078, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetAudioSwitchState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_GetAudioComponent_ReturnValue_2) == 0x000088, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_GetAudioComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_AsCamper_Player) == 0x000090, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_AsCamper_Player_1) == 0x0000A0, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_AsCamper_Player_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_HasPerkFlag_ReturnValue) == 0x0000A9, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_HasPerkFlag_ReturnValue_1) == 0x0000AA, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_HasPerkFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Not_PreBool_ReturnValue) == 0x0000AB, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AC, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_AsCamper_Player_2) == 0x0000B0, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_AsCamper_Player_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_AsCamper_Player_3) == 0x0000C0, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_AsCamper_Player_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_HasPerkFlag_ReturnValue_2) == 0x0000C9, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_HasPerkFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_HasPerkFlag_ReturnValue_3) == 0x0000CA, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_HasPerkFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000CB, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000CC, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_MakeLiteralString_ReturnValue_1) == 0x0000D0, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_MakeLiteralString_ReturnValue_2) == 0x0000E0, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_MakeLiteralString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000100, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000110, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_MakeLiteralString_ReturnValue_3) == 0x000120, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_MakeLiteralString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_MakeLiteralString_ReturnValue_4) == 0x000130, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_MakeLiteralString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_MakeLiteralString_ReturnValue_5) == 0x000140, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_MakeLiteralString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000150, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000160, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_Landing, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000170, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_Landing::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.OnGruntBeartrap
// 0x0010 (0x0010 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_KillerHasBearTrapNoDamageModifier_return; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Audio_Survivor_Grunt_Hurt_Light_Return_Value; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap) == 0x000010, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap, CallFunc_KillerHasBearTrapNoDamageModifier_return) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap::CallFunc_KillerHasBearTrapNoDamageModifier_return' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap, CallFunc_Audio_Survivor_Grunt_Hurt_Light_Return_Value) == 0x000009, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntBeartrap::CallFunc_Audio_Survivor_Grunt_Hurt_Light_Return_Value' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.OnGruntScreamMoriK17
// 0x0068 (0x0068 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17 final
{
public:
	class ADBDBasePlayer*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_GetAudioComponent_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCustomizedAudioComponent*              CallFunc_GetCustomizedAudio_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAudioSwitchState_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17) == 0x000008, "Wrong alignment on BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17");
static_assert(sizeof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17) == 0x000068, "Wrong size on BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, Player) == 0x000000, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::Player' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_MakeLiteralString_ReturnValue) == 0x000008, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_GetAudioComponent_ReturnValue) == 0x000018, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_GetAudioComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_GetCustomizedAudio_ReturnValue) == 0x000020, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_GetCustomizedAudio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000028, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_GetAudioSwitchState_ReturnValue) == 0x000038, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_GetAudioSwitchState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK17::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BP_Audio_Survivor_AnimNotifies_Handler.BP_Audio_Survivor_AnimNotifies_Handler_C.OnGruntScreamMoriK25
// 0x0068 (0x0068 - 0x0000)
struct BP_Audio_Survivor_AnimNotifies_Handler_C_OnGruntScreamMoriK25 final
{
public:
