#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Audio_KLR_Base

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Audio_KLR_Base.BP_Audio_KLR_Base_C
// 0x0048 (0x0210 - 0x01C8)
class UBP_Audio_KLR_Base_C : public UKillerAudioHandlerComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkAudioBank*                           _killerAudioBank;                                  // 0x01D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          _defaultAudioStatusStartEvent;                     // 0x01D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           _audioComponent;                                   // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          _isInMenu;                                         // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _audioCharacterName;                               // 0x01EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UAkAudioEvent*                          _audioStartEvent;                                  // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class ADBDBasePlayer*                         _ownerKiller;                                      // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          _hasRegisteredPawnAudio;                           // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TriggerSurvivorDamageHitAudioSFX(class ACamperPlayer* Camper, EAttackType AttackType, bool CausedKO, bool IsWeaponHit, bool IsLightHit);
	void SelectAudioStatusStartEvent(bool IsInMenu, class UAkAudioEvent** AudioEvent);
	void OnKillerSoundbankLoaded(EAkResult Result);
	void OnKillerAudioEnabled();
	void OnKillerAudioDisabled();
	void InititializeComponent();
	void HitImpactOnSurvivorSFX(class ACamperPlayer* Camper, EAttackType AttackType, bool IsWeaponHit);
	void GetAudioCharacterName(class ADBDBasePlayer* Player, class FName* AudioCharacterName);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_Audio_KLR_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Audio_KLR_Base_C">();
	}
	static class UBP_Audio_KLR_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Audio_KLR_Base_C>();
	}
};
static_assert(alignof(UBP_Audio_KLR_Base_C) == 0x000008, "Wrong alignment on UBP_Audio_KLR_Base_C");
static_assert(sizeof(UBP_Audio_KLR_Base_C) == 0x000210, "Wrong size on UBP_Audio_KLR_Base_C");
static_assert(offsetof(UBP_Audio_KLR_Base_C, UberGraphFrame) == 0x0001C8, "Member 'UBP_Audio_KLR_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _killerAudioBank) == 0x0001D0, "Member 'UBP_Audio_KLR_Base_C::_killerAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _defaultAudioStatusStartEvent) == 0x0001D8, "Member 'UBP_Audio_KLR_Base_C::_defaultAudioStatusStartEvent' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _audioComponent) == 0x0001E0, "Member 'UBP_Audio_KLR_Base_C::_audioComponent' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _isInMenu) == 0x0001E8, "Member 'UBP_Audio_KLR_Base_C::_isInMenu' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _audioCharacterName) == 0x0001EC, "Member 'UBP_Audio_KLR_Base_C::_audioCharacterName' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _audioStartEvent) == 0x0001F8, "Member 'UBP_Audio_KLR_Base_C::_audioStartEvent' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _ownerKiller) == 0x000200, "Member 'UBP_Audio_KLR_Base_C::_ownerKiller' has a wrong offset!");
static_assert(offsetof(UBP_Audio_KLR_Base_C, _hasRegisteredPawnAudio) == 0x000208, "Member 'UBP_Audio_KLR_Base_C::_hasRegisteredPawnAudio' has a wrong offset!");

}

