#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Audio_SVR_Base

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Audio_SVR_Base.BP_Audio_SVR_Base_C.ExecuteUbergraph_BP_Audio_SVR_Base
// 0x0008 (0x0008 - 0x0000)
struct BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     CallFunc_DBD_LoadAudioBankSynchronous_ReturnValue; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base) == 0x000004, "Wrong alignment on BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base");
static_assert(sizeof(BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base) == 0x000008, "Wrong size on BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base");
static_assert(offsetof(BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base, EntryPoint) == 0x000000, "Member 'BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base, CallFunc_DBD_LoadAudioBankSynchronous_ReturnValue) == 0x000005, "Member 'BP_Audio_SVR_Base_C_ExecuteUbergraph_BP_Audio_SVR_Base::CallFunc_DBD_LoadAudioBankSynchronous_ReturnValue' has a wrong offset!");

// Function BP_Audio_SVR_Base.BP_Audio_SVR_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Audio_SVR_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Audio_SVR_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Audio_SVR_Base_C_ReceiveEndPlay");
static_assert(sizeof(BP_Audio_SVR_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Audio_SVR_Base_C_ReceiveEndPlay");
static_assert(offsetof(BP_Audio_SVR_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Audio_SVR_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

