#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Base_Decal_Mori

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Base_Decal_Mori.BP_Base_Decal_Mori_C.CreateMaterialInstance
// 0x0010 (0x0010 - 0x0000)
struct BP_Base_Decal_Mori_C_CreateMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               MatInst;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Base_Decal_Mori_C_CreateMaterialInstance) == 0x000008, "Wrong alignment on BP_Base_Decal_Mori_C_CreateMaterialInstance");
static_assert(sizeof(BP_Base_Decal_Mori_C_CreateMaterialInstance) == 0x000010, "Wrong size on BP_Base_Decal_Mori_C_CreateMaterialInstance");
static_assert(offsetof(BP_Base_Decal_Mori_C_CreateMaterialInstance, MatInst) == 0x000000, "Member 'BP_Base_Decal_Mori_C_CreateMaterialInstance::MatInst' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_CreateMaterialInstance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_Base_Decal_Mori_C_CreateMaterialInstance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Base_Decal_Mori.BP_Base_Decal_Mori_C.ExecuteUbergraph_BP_Base_Decal_Mori
// 0x0148 (0x0148 - 0x0000)
struct BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0028(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateMaterialInstance_MatInst;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_A_ImplicitCast;       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori) == 0x000008, "Wrong alignment on BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori");
static_assert(sizeof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori) == 0x000148, "Wrong size on BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, EntryPoint) == 0x000000, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000028, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_GetTimelineLength_ReturnValue) == 0x000118, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00011C, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_CreateMaterialInstance_MatInst) == 0x000120, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_CreateMaterialInstance_MatInst' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_Lerp_ReturnValue) == 0x000128, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000130, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_Delay_Duration_ImplicitCast) == 0x000138, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00013C, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_Subtract_FloatFloat_A_ImplicitCast) == 0x000140, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_Subtract_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000144, "Member 'BP_Base_Decal_Mori_C_ExecuteUbergraph_BP_Base_Decal_Mori::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_Base_Decal_Mori.BP_Base_Decal_Mori_C.GetPhysmat
// 0x0230 (0x0230 - 0x0000)
struct BP_Base_Decal_Mori_C_GetPhysmat final
{
public:
	class UPhysicalMaterial*                      PhysMat;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0060(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Base_Decal_Mori_C_GetPhysmat) == 0x000008, "Wrong alignment on BP_Base_Decal_Mori_C_GetPhysmat");
static_assert(sizeof(BP_Base_Decal_Mori_C_GetPhysmat) == 0x000230, "Wrong size on BP_Base_Decal_Mori_C_GetPhysmat");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, PhysMat) == 0x000000, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, Temp_object_Variable) == 0x000008, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000030, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_LineTraceSingle_OutHit) == 0x000060, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_LineTraceSingle_ReturnValue) == 0x000150, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_bBlockingHit) == 0x000151, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_bInitialOverlap) == 0x000152, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_Time) == 0x000154, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_Distance) == 0x000158, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_Location) == 0x000160, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_BoneName) == 0x0001E4, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_HitItem) == 0x0001F0, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_ElementIndex) == 0x0001F4, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_FaceIndex) == 0x0001F8, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_TraceStart) == 0x000200, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_GetPhysmat, CallFunc_BreakHitResult_TraceEnd) == 0x000218, "Member 'BP_Base_Decal_Mori_C_GetPhysmat::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function BP_Base_Decal_Mori.BP_Base_Decal_Mori_C.SaveOpacity
// 0x0018 (0x0018 - 0x0000)
struct BP_Base_Decal_Mori_C_SaveOpacity final
{
public:
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_OriginalOpacity_ImplicitCast;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Base_Decal_Mori_C_SaveOpacity) == 0x000008, "Wrong alignment on BP_Base_Decal_Mori_C_SaveOpacity");
static_assert(sizeof(BP_Base_Decal_Mori_C_SaveOpacity) == 0x000018, "Wrong size on BP_Base_Decal_Mori_C_SaveOpacity");
static_assert(offsetof(BP_Base_Decal_Mori_C_SaveOpacity, MaterialInstance) == 0x000000, "Member 'BP_Base_Decal_Mori_C_SaveOpacity::MaterialInstance' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_SaveOpacity, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'BP_Base_Decal_Mori_C_SaveOpacity::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Base_Decal_Mori_C_SaveOpacity, K2Node_VariableSet_OriginalOpacity_ImplicitCast) == 0x000010, "Member 'BP_Base_Decal_Mori_C_SaveOpacity::K2Node_VariableSet_OriginalOpacity_ImplicitCast' has a wrong offset!");

}

