#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BubbleIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_BubbleIndicator.BP_BubbleIndicator_C.ActivateBubbleFX
// 0x0004 (0x0004 - 0x0000)
struct BP_BubbleIndicator_C_ActivateBubbleFX final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BubbleIndicator_C_ActivateBubbleFX) == 0x000004, "Wrong alignment on BP_BubbleIndicator_C_ActivateBubbleFX");
static_assert(sizeof(BP_BubbleIndicator_C_ActivateBubbleFX) == 0x000004, "Wrong size on BP_BubbleIndicator_C_ActivateBubbleFX");
static_assert(offsetof(BP_BubbleIndicator_C_ActivateBubbleFX, Duration) == 0x000000, "Member 'BP_BubbleIndicator_C_ActivateBubbleFX::Duration' has a wrong offset!");

// Function BP_BubbleIndicator.BP_BubbleIndicator_C.ExecuteUbergraph_BP_BubbleIndicator
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x002C(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Event_staticMesh;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_duration;                             // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible;                            // 0x0098(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EqualEqual_FloatFloat_A_ImplicitCast;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast_1;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EqualEqual_FloatFloat_A_ImplicitCast_1;   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator) == 0x000008, "Wrong alignment on BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator");
static_assert(sizeof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator) == 0x0000C0, "Wrong size on BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, EntryPoint) == 0x000000, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, Temp_delegate_Variable) == 0x000004, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, Temp_delegate_Variable_1) == 0x00002C, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_FMax_ReturnValue) == 0x000048, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000051, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, K2Node_Event_staticMesh) == 0x000060, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::K2Node_Event_staticMesh' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, K2Node_Event_duration) == 0x000068, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::K2Node_Event_duration' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_Not_PreBool_ReturnValue) == 0x00006C, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000070, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_FMax_ReturnValue_1) == 0x000078, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000081, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000088, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_PostAkEvent_ReturnValue) == 0x000094, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, K2Node_Event_isVisible) == 0x000098, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::K2Node_Event_isVisible' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_PostAkEvent_ReturnValue_1) == 0x00009C, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_FMax_A_ImplicitCast) == 0x0000A0, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000A8, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_EqualEqual_FloatFloat_A_ImplicitCast) == 0x0000AC, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_EqualEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_FMax_A_ImplicitCast_1) == 0x0000B0, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_FMax_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0000B8, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator, CallFunc_EqualEqual_FloatFloat_A_ImplicitCast_1) == 0x0000BC, "Member 'BP_BubbleIndicator_C_ExecuteUbergraph_BP_BubbleIndicator::CallFunc_EqualEqual_FloatFloat_A_ImplicitCast_1' has a wrong offset!");

// Function BP_BubbleIndicator.BP_BubbleIndicator_C.RefreshBubbleVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_BubbleIndicator_C_RefreshBubbleVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BubbleIndicator_C_RefreshBubbleVisibility) == 0x000001, "Wrong alignment on BP_BubbleIndicator_C_RefreshBubbleVisibility");
static_assert(sizeof(BP_BubbleIndicator_C_RefreshBubbleVisibility) == 0x000001, "Wrong size on BP_BubbleIndicator_C_RefreshBubbleVisibility");
static_assert(offsetof(BP_BubbleIndicator_C_RefreshBubbleVisibility, IsVisible) == 0x000000, "Member 'BP_BubbleIndicator_C_RefreshBubbleVisibility::IsVisible' has a wrong offset!");

// Function BP_BubbleIndicator.BP_BubbleIndicator_C.SetSilhouette
// 0x0008 (0x0008 - 0x0000)
struct BP_BubbleIndicator_C_SetSilhouette final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BubbleIndicator_C_SetSilhouette) == 0x000008, "Wrong alignment on BP_BubbleIndicator_C_SetSilhouette");
static_assert(sizeof(BP_BubbleIndicator_C_SetSilhouette) == 0x000008, "Wrong size on BP_BubbleIndicator_C_SetSilhouette");
static_assert(offsetof(BP_BubbleIndicator_C_SetSilhouette, StaticMesh) == 0x000000, "Member 'BP_BubbleIndicator_C_SetSilhouette::StaticMesh' has a wrong offset!");

// Function BP_BubbleIndicator.BP_BubbleIndicator_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_BubbleIndicator_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BubbleIndicator_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_BubbleIndicator_C_UserConstructionScript");
static_assert(sizeof(BP_BubbleIndicator_C_UserConstructionScript) == 0x000002, "Wrong size on BP_BubbleIndicator_C_UserConstructionScript");
static_assert(offsetof(BP_BubbleIndicator_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_BubbleIndicator_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BubbleIndicator_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_BubbleIndicator_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

