#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Blood_Decal_TT_Mori_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Blood_Decal_TT_Mori_1.BP_Blood_Decal_TT_Mori_1_C.ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1
// 0x0260 (0x0260 - 0x0000)
struct BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UDecalComponent*>                K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0048(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0160(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1) == 0x000008, "Wrong alignment on BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1");
static_assert(sizeof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1) == 0x000260, "Wrong size on BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, EntryPoint) == 0x000000, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000048, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000138, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_MakeVector_ReturnValue) == 0x000140, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, Temp_int_Loop_Counter_Variable) == 0x000158, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000160, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_Less_IntInt_ReturnValue) == 0x000250, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_Add_IntInt_ReturnValue) == 0x000254, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000258, "Member 'BP_Blood_Decal_TT_Mori_1_C_ExecuteUbergraph_BP_Blood_Decal_TT_Mori_1::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

