#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Car01_Damaged

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Car01_Damaged.BP_Car01_Damaged_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_Car01_Damaged_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Car01_Damaged;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Car01_Wheel04;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Car01_Wheel03;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Car01_Wheel02;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Car01_Wheel01;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Car01_Damaged_C">();
	}
	static class ABP_Car01_Damaged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Car01_Damaged_C>();
	}
};
static_assert(alignof(ABP_Car01_Damaged_C) == 0x000008, "Wrong alignment on ABP_Car01_Damaged_C");
static_assert(sizeof(ABP_Car01_Damaged_C) == 0x0002D0, "Wrong size on ABP_Car01_Damaged_C");
static_assert(offsetof(ABP_Car01_Damaged_C, SM_Car01_Damaged) == 0x0002A0, "Member 'ABP_Car01_Damaged_C::SM_Car01_Damaged' has a wrong offset!");
static_assert(offsetof(ABP_Car01_Damaged_C, SM_Car01_Wheel04) == 0x0002A8, "Member 'ABP_Car01_Damaged_C::SM_Car01_Wheel04' has a wrong offset!");
static_assert(offsetof(ABP_Car01_Damaged_C, SM_Car01_Wheel03) == 0x0002B0, "Member 'ABP_Car01_Damaged_C::SM_Car01_Wheel03' has a wrong offset!");
static_assert(offsetof(ABP_Car01_Damaged_C, SM_Car01_Wheel02) == 0x0002B8, "Member 'ABP_Car01_Damaged_C::SM_Car01_Wheel02' has a wrong offset!");
static_assert(offsetof(ABP_Car01_Damaged_C, SM_Car01_Wheel01) == 0x0002C0, "Member 'ABP_Car01_Damaged_C::SM_Car01_Wheel01' has a wrong offset!");
static_assert(offsetof(ABP_Car01_Damaged_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Car01_Damaged_C::DefaultSceneRoot' has a wrong offset!");

}

