#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CamperTakenByEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.AssignSacrificeMaterialToBase
// 0x0078 (0x0078 - 0x0000)
struct BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase final
{
public:
	TArray<class UDBDClipRegionComponent*>        Hook_Regions;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase");
static_assert(sizeof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase) == 0x000078, "Wrong size on BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, Hook_Regions) == 0x000000, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::Hook_Regions' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_GetMaterials_ReturnValue) == 0x000048, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_GetBaseMaterial_ReturnValue) == 0x000068, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_GetBaseMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Array_Contains_ReturnValue) == 0x000074, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x000075, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.AssignSacrificeMaterialToClone
// 0x0080 (0x0080 - 0x0000)
struct BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone final
{
public:
	TArray<class UDBDClipRegionComponent*>        HookClipRegions;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone");
static_assert(sizeof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone) == 0x000080, "Wrong size on BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, HookClipRegions) == 0x000000, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::HookClipRegions' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_GetMaterials_ReturnValue) == 0x000048, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_GetBaseMaterial_ReturnValue) == 0x000070, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_GetBaseMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone, CallFunc_Array_Contains_ReturnValue) == 0x000078, "Member 'BP_CamperTakenByEntity_C_AssignSacrificeMaterialToClone::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.DoTransitionBegin
// 0x0010 (0x0010 - 0x0000)
struct BP_CamperTakenByEntity_C_DoTransitionBegin final
{
public:
	TArray<class UDBDClipRegionComponent*>        Hook_Clip_Region;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_CamperTakenByEntity_C_DoTransitionBegin) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_DoTransitionBegin");
static_assert(sizeof(BP_CamperTakenByEntity_C_DoTransitionBegin) == 0x000010, "Wrong size on BP_CamperTakenByEntity_C_DoTransitionBegin");
static_assert(offsetof(BP_CamperTakenByEntity_C_DoTransitionBegin, Hook_Clip_Region) == 0x000000, "Member 'BP_CamperTakenByEntity_C_DoTransitionBegin::Hook_Clip_Region' has a wrong offset!");

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.DoTransitionEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_CamperTakenByEntity_C_DoTransitionEnd final
{
public:
	TArray<class UDBDClipRegionComponent*>        Hook_Clip_Regions;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_CamperTakenByEntity_C_DoTransitionEnd) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_DoTransitionEnd");
static_assert(sizeof(BP_CamperTakenByEntity_C_DoTransitionEnd) == 0x000010, "Wrong size on BP_CamperTakenByEntity_C_DoTransitionEnd");
static_assert(offsetof(BP_CamperTakenByEntity_C_DoTransitionEnd, Hook_Clip_Regions) == 0x000000, "Member 'BP_CamperTakenByEntity_C_DoTransitionEnd::Hook_Clip_Regions' has a wrong offset!");

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.DoTransitionUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_CamperTakenByEntity_C_DoTransitionUpdate final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CamperTakenByEntity_C_DoTransitionUpdate) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_DoTransitionUpdate");
static_assert(sizeof(BP_CamperTakenByEntity_C_DoTransitionUpdate) == 0x000008, "Wrong size on BP_CamperTakenByEntity_C_DoTransitionUpdate");
static_assert(offsetof(BP_CamperTakenByEntity_C_DoTransitionUpdate, Time) == 0x000000, "Member 'BP_CamperTakenByEntity_C_DoTransitionUpdate::Time' has a wrong offset!");

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.MakeBaseMaterialsDynamic
// 0x0060 (0x0060 - 0x0000)
struct BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic");
static_assert(sizeof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic) == 0x000060, "Wrong size on BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_GetMaterials_ReturnValue) == 0x000028, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic, CallFunc_Less_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_CamperTakenByEntity_C_MakeBaseMaterialsDynamic::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_CamperTakenByEntity.BP_CamperTakenByEntity_C.TransitionProgress
// 0x0088 (0x0088 - 0x0000)
struct BP_CamperTakenByEntity_C_TransitionProgress final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0038(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CamperTakenByEntity_C_TransitionProgress) == 0x000008, "Wrong alignment on BP_CamperTakenByEntity_C_TransitionProgress");
static_assert(sizeof(BP_CamperTakenByEntity_C_TransitionProgress) == 0x000088, "Wrong size on BP_CamperTakenByEntity_C_TransitionProgress");
static_assert(offsetof(BP_CamperTakenByEntity_C_TransitionProgress, Time) == 0x000000, "Member 'BP_CamperTakenByEntity_C_TransitionProgress::Time' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_TransitionProgress, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_CamperTakenByEntity_C_TransitionProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CamperTakenByEntity_C_TransitionProgress, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CamperTakenByEntity_C_TransitionProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
