#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chest

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Chest.BP_Chest_C
// 0x0108 (0x0600 - 0x04F8)
class ABP_Chest_C final : public ASearchable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Chest_Blocker;                                  // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Chest_Blocker_Burst;                            // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_EntitySpikes_Chest;                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChargeableComponent*                   RummageChargeable;                                 // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MK_InfectedObject_Chest;                         // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_Searchable;                               // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDOutlineComponent*                   DBDOutline;                                        // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDSkeletalMeshComponentBudgeted*      ChestMesh;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Character_Blocker_Collision;                       // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Chest_Collision_Projectiles;                       // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USleepingSkinnedMeshRegisterer*         SleepingSkinnedMeshRegisterer;                     // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCollectItemFromSearchable_C*           CollectItemFromSearchable;                         // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USearchOpenedChest_BP_C*                SearchOpenedChest;                                 // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInterruptAtInterrupteeLocation_C*      SearchInterrupt;                                   // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInterruptAtInterrupteeLocation_C*      OpenInterrupt;                                     // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInterruptionDefinition*                InterruptionDefinition1;                           // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMapActorComponent*                     MapActor;                                          // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USearchableOutlineUpdateStrategy*       SearchableOutlineUpdateStrategy;                   // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Validator01;                                       // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ChestCloth01;                                      // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChargeableComponent*                   OpenChestChargeable;                               // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ItemSpawnPoint;                                    // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOpenChest_C*                           OpenSearchable;                                    // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractor*                            Interactor1;                                       // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Interactor1Zone;                                   // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Interaction_OpenChest;                             // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TML_Spikes_Dissolve_Dissolve_0A0948EF45FAAC6F688308B64DAD898B; // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_Spikes_Dissolve__Direction_0A0948EF45FAAC6F688308B64DAD898B; // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D5[0x3];                                      // 0x05D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_Spikes_Dissolve;                               // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        StartTimer;                                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ObjectSpawned;                                     // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Interacting_Player;                                // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Spikes;                                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TML_Spikes_Dissolve__UpdateFunc();
	void TML_Spikes_Dissolve__MakeSpikesVisible__EventFunc();
	void TML_Spikes_Dissolve__FinishedFunc();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Chest(int32 EntryPoint);
	void CustomEvent_1(EAkResult Result);
	void CustomEvent_0(EAkResult Result);
	void Cosmetic_OnUnblockSearchable(class ADBDPlayer* Player);
	void Cosmetic_OnBlockSearchable(class ADBDPlayer* Player);

	bool IsInterruptionPossible(const class ADBDPlayer* Interruptor, const class ADBDPlayer* Interruptee, const class UInteractor* Interactor, const class UInteractionDefinition* Definition, const class UInterruptionDefinition* Interruption) const;
	class UPrimitiveComponent* GetInteractorPrimitiveComponent() const;
	void GetInfectedParticles(TArray<class UParticleSystemComponent*>* InfectedParticleArray) const;
	void GetInfectedDecals(TArray<class UDecalComponent*>* InfectedDecals) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Chest_C">();
	}
	static class ABP_Chest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Chest_C>();
	}
};
static_assert(alignof(ABP_Chest_C) == 0x000008, "Wrong alignment on ABP_Chest_C");
static_assert(sizeof(ABP_Chest_C) == 0x000600, "Wrong size on ABP_Chest_C");
static_assert(offsetof(ABP_Chest_C, UberGraphFrame) == 0x0004F8, "Member 'ABP_Chest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, NS_Chest_Blocker) == 0x000500, "Member 'ABP_Chest_C::NS_Chest_Blocker' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, NS_Chest_Blocker_Burst) == 0x000508, "Member 'ABP_Chest_C::NS_Chest_Blocker_Burst' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, SM_EntitySpikes_Chest) == 0x000510, "Member 'ABP_Chest_C::SM_EntitySpikes_Chest' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, RummageChargeable) == 0x000518, "Member 'ABP_Chest_C::RummageChargeable' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, P_MK_InfectedObject_Chest) == 0x000520, "Member 'ABP_Chest_C::P_MK_InfectedObject_Chest' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Ak_Audio_Searchable) == 0x000528, "Member 'ABP_Chest_C::Ak_Audio_Searchable' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, DBDOutline) == 0x000530, "Member 'ABP_Chest_C::DBDOutline' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, ChestMesh) == 0x000538, "Member 'ABP_Chest_C::ChestMesh' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Character_Blocker_Collision) == 0x000540, "Member 'ABP_Chest_C::Character_Blocker_Collision' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Chest_Collision_Projectiles) == 0x000548, "Member 'ABP_Chest_C::Chest_Collision_Projectiles' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, SleepingSkinnedMeshRegisterer) == 0x000550, "Member 'ABP_Chest_C::SleepingSkinnedMeshRegisterer' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, CollectItemFromSearchable) == 0x000558, "Member 'ABP_Chest_C::CollectItemFromSearchable' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, SearchOpenedChest) == 0x000560, "Member 'ABP_Chest_C::SearchOpenedChest' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, SearchInterrupt) == 0x000568, "Member 'ABP_Chest_C::SearchInterrupt' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, OpenInterrupt) == 0x000570, "Member 'ABP_Chest_C::OpenInterrupt' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, InterruptionDefinition1) == 0x000578, "Member 'ABP_Chest_C::InterruptionDefinition1' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, MapActor) == 0x000580, "Member 'ABP_Chest_C::MapActor' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, SearchableOutlineUpdateStrategy) == 0x000588, "Member 'ABP_Chest_C::SearchableOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Validator01) == 0x000590, "Member 'ABP_Chest_C::Validator01' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, ChestCloth01) == 0x000598, "Member 'ABP_Chest_C::ChestCloth01' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, OpenChestChargeable) == 0x0005A0, "Member 'ABP_Chest_C::OpenChestChargeable' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, ItemSpawnPoint) == 0x0005A8, "Member 'ABP_Chest_C::ItemSpawnPoint' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, OpenSearchable) == 0x0005B0, "Member 'ABP_Chest_C::OpenSearchable' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Interactor1) == 0x0005B8, "Member 'ABP_Chest_C::Interactor1' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Interactor1Zone) == 0x0005C0, "Member 'ABP_Chest_C::Interactor1Zone' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Interaction_OpenChest) == 0x0005C8, "Member 'ABP_Chest_C::Interaction_OpenChest' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, TML_Spikes_Dissolve_Dissolve_0A0948EF45FAAC6F688308B64DAD898B) == 0x0005D0, "Member 'ABP_Chest_C::TML_Spikes_Dissolve_Dissolve_0A0948EF45FAAC6F688308B64DAD898B' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, TML_Spikes_Dissolve__Direction_0A0948EF45FAAC6F688308B64DAD898B) == 0x0005D4, "Member 'ABP_Chest_C::TML_Spikes_Dissolve__Direction_0A0948EF45FAAC6F688308B64DAD898B' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, TML_Spikes_Dissolve) == 0x0005D8, "Member 'ABP_Chest_C::TML_Spikes_Dissolve' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, StartTimer) == 0x0005E0, "Member 'ABP_Chest_C::StartTimer' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, ObjectSpawned) == 0x0005E8, "Member 'ABP_Chest_C::ObjectSpawned' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, Interacting_Player) == 0x0005F0, "Member 'ABP_Chest_C::Interacting_Player' has a wrong offset!");
static_assert(offsetof(ABP_Chest_C, DMI_Spikes) == 0x0005F8, "Member 'ABP_Chest_C::DMI_Spikes' has a wrong offset!");

}

