#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CalamariCageInteractable

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Calamari_classes.hpp"
#include "TheClown_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CalamariCageInteractable.BP_CalamariCageInteractable_C
// 0x0168 (0x0840 - 0x06D8)
class ABP_CalamariCageInteractable_C final : public ACalamariCage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_CalamariCage_Smoke_IDLE;                        // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CalamariCage_Smoke_OUT;                         // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CalamariCage_Smoke;                             // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CalamariCage_BloodTrail1;                       // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CalamariCage_BloodTrail;                        // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialHelper*                        MaterialHelper;                                    // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCageHookOutlineUpdateStrategy*         CageHookOutlineUpdateStrategy;                     // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCalamariCageRescueInteraction_C*       CalamariCageRescueInteraction;                     // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDOutlineComponent*                   DBDOutline;                                        // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_CalamariCage;                             // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractor*                            Interactor;                                        // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Dissolve_Survivor_0A56ACFA4EFA8A5668DE348124CC9263; // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Dissolve_0A56ACFA4EFA8A5668DE348124CC9263; // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_0A56ACFA4EFA8A5668DE348124CC9263; // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveAbsorbPlayer_Dissolve_Survivor_23FEED05414AA7D8603F1FBB161F0EBB; // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveAbsorbPlayer_Dissolve_Cage_23FEED05414AA7D8603F1FBB161F0EBB; // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveAbsorbPlayer_Dissolve_23FEED05414AA7D8603F1FBB161F0EBB; // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DissolveAbsorbPlayer__Direction_23FEED05414AA7D8603F1FBB161F0EBB; // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_765[0x3];                                      // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DissolveAbsorbPlayer;                              // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveDecal_Relocation_Decal_186B04AD4384C7E22BCD2693724EAECC; // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DissolveDecal_Relocation__Direction_186B04AD4384C7E22BCD2693724EAECC; // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775[0x3];                                      // 0x0775(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DissolveDecal_Relocation;                          // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveCamperDeath_Dissolve_Survivor_F6600B794DFEF8B65E7BFCB873A46EE8; // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveCamperDeath_Dissolve_F6600B794DFEF8B65E7BFCB873A46EE8; // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DissolveCamperDeath__Direction_F6600B794DFEF8B65E7BFCB873A46EE8; // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DissolveCamperDeath;                               // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TML_DissolveOut_Dissolve_Cage_OUT_95FA24E647854CC4310F37845825A877; // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TML_DissolveOut_Smoke_Idle_Dissolve_95FA24E647854CC4310F37845825A877; // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TML_DissolveOut_Blood_Trail_Dissolve_95FA24E647854CC4310F37845825A877; // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TML_DissolveOut_Dissolve_Cage_IN_95FA24E647854CC4310F37845825A877; // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_DissolveOut__Direction_95FA24E647854CC4310F37845825A877; // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_DissolveOut;                                   // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TML_CameraFade_Vignette_775FFA454E916A993A5B058EC202A97C; // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_CameraFade__Direction_775FFA454E916A993A5B058EC202A97C; // 0x07BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BD[0x3];                                      // 0x07BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_CameraFade;                                    // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TML_Decal_Decal_76936AA44BB6A138345D6187B823EC44;  // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_Decal__Direction_76936AA44BB6A138345D6187B823EC44; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CD[0x3];                                      // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_Decal;                                         // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_DeathBed_Decal;                                // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PP_Vignette_Basic;                                 // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       BloodParticle;                                     // 0x07E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FVector>                        ContactPointLocation;                              // 0x07F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FWeightedBlendable                     PP_Vignette;                                       // 0x0808(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsRelocating;                                      // 0x0818(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      HookBlood2;                                        // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HookBlood1;                                        // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar;                                            // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SmokeIDLE;                                         // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TML_DissolveOut__UpdateFunc();
	void TML_DissolveOut__FinishedFunc();
	void TML_Decal__UpdateFunc();
	void TML_Decal__SpawnBlood__EventFunc();
	void TML_Decal__FinishedFunc();
	void TML_CameraFade__UpdateFunc();
	void TML_CameraFade__FinishedFunc();
	void Timeline__UpdateFunc();
	void Timeline__Hide_Attached_VFX__EventFunc();
	void Timeline__FinishedFunc();
	void Switch_Oni_Weapons_To_Normal();
	void Switch_Kanobo_to_Normal_Mode();
	void Switch_Kanobo_To_Demon_Mode();
	void Survivor_BoonRadius_Exit();
	void Survivor_BoonRadius_Enter();
	void Stop_Travelling_PP();
	void Stop_Travelling_Dissolve();
	void Stop_Saliva_VFX();
	void Stop_Pounce_VFX();
	void StartDeathBedRelocateVignette();
	void StartDeathBedDissolve();
	void Start_Travelling_PP();
	void Start_Travelling_Dissolve();
	void Start_Saliva_VFX();
	void Start_Pounce_VFX();
	void SpawnMissSkillcheckVFX();
	void SpawnFullScreenBlood();
	void SpawnFakeBullet();
	void ShowSyringe();
	void ShowGunBullet();
	void ShowDemonCosmetic();
	void Show_Oni_Katana();
	void SetPlayerExposedVFX();
	void SetHighlightedVFX();
	void ReturnToDemonMode();
	void ReturnOniToNormal();
	void RemoveBloodParticle();
	void ReceiveBeginPlay();
	void OnSurvivorDeath(const class ACamperPlayer* CagedSurvivor);
	void OnSkillCheckFailed_Cosmetic();
	void OnRescueCancelled();
	void On_Execution();
	void MoveRescuerSocketPositionIfCollisionDetected();
	void Killer_LungeAttack_Start();
	void Killer_LungeAttack_End();
	void K22_WrongLandingVignette(bool WrongLanding);
	void K22_WrongLanding(bool Wrong_Landing);
	void K22_SpawnWipeVFX();
	void K22_ReleaseBrother();
	void K22_QuickDissolveBrother();
	void K22_MembraneRecovery();
	void K22_MembraneDelete();
	void K22_JumpTrail_Deactivate();
	void K22_JumpTrail_Activate();
	void K22_Jump_Inactive();
	void K22_Jump_Active();
	void K22_IsAttachedLocker(bool IsAttachedLocker);
	void K22_HighlightSuccessfulAttackStop();
	void K22_HighlightSuccessfulAttack();
	void K22_HighlightMissJump_Stop();
	void K22_HighlightMissJump();
	void K22_HighlightDormantMain(bool IsDormantMain_);
	void K22_HighlightDormant(bool IsDormant_);
	void K22_DormantAttachedSlasher();
	void K22_DetachedFromSurvivor_VFX();
	void K22_BrotherDissolveLocker();
	void K22_BabyRespawn();
	void K22_BabyBloodDissolve();
	void K22_AttachedToSurvivor_VFX();
	void K12_Killer_RemoveVignette();
	void K12_Killer_PlaceVignette();
	void K12_Killer_BombSmokeColor();
	void K12_Killer_AntidoteEnd();
	void K12_Killer_AntidoteBegin();
	void K12_GetToxinVignette(EBombType Bomb_Type);
	void K12_GetAntidoteVignette();
	void K05_TrapImpactOff();
	void K05_TrapImpact();
	void K05_SetTrap();
	void K05_BloodDrops();
	void K04_TelekinesisOn();
	void K04_TelekinesisOff();
	void K04_InvisibleOn();
	void K04_InvisibleOff();
	void InitialiseInteractors();
	void HideSyringeOnStun();
	void HideSyringe();
	void HideGunBullet();
	void HideDemonCosmetic();
	void Hide_Oni_Katana_TPV();
	void Hide_Oni_Katana();
	void FX_SurvivorSavedFromCage();
	void FX_GoingUnder();
	void ExecuteUbergraph_BP_CalamariCageInteractable(int32 EntryPoint);
	void DissolveDecal_Relocation__UpdateFunc();
	void DissolveDecal_Relocation__SpawnBlood__EventFunc();
	void DissolveDecal_Relocation__FinishedFunc();
	void DissolveCamperDeath__UpdateFunc();
	void DissolveCamperDeath__Hide_Attached_VFX__EventFunc();
	void DissolveCamperDeath__FinishedFunc();
	void DissolveAbsorbPlayer__UpdateFunc();
	void DissolveAbsorbPlayer__FinishedFunc();
	void DisableDemonMode();
	void Destroy_Blood_Orb();
	void DeactivateKnockoutVFX();
	void Cosmetic_OnRelocateStart();
	void Cosmetic_OnPlayerAbsorbedByGround();
	void Cosmetic_OnGoingUpFinished(const bool IsAnticampRelocation, const class ACamperPlayer* CagedSurvivor);
	void Cosmetic_DisplayCage(const bool Display);
	void CheckRescuerSocketPosition();
	void Camper_AntidoteBoostVignette_Start();
	void Camper_AntidoteBoostVignette_End();
	void CageAppearSFX();
	void Boon_Unbound();
	void BankLoaded(EAkResult Result);
	void AttachBloodParticle();
	void AnimateLiquidSyringe();
	void AddBloodDrippingGKMoriMale();
	void ActivateVignetteOnWallCollision();
	void ActivateSacrificeCamBlood();
	void ActivatePounceStateVFX();
	void ActivatePlayerLightningVFX(const class UMaterialInstanceDynamic*& LightningFX, bool Intense);
	void ActivatePlayerGlitchVFX(const class UMaterialInstanceDynamic*& GlitchFX, const bool Face, bool Madness, bool Killer);
	void ActivatePlayerExposedVFX();
	void ActivateLocalPlayerExposedVFX();
	void ActivateKnockoutVFX();
	void ActivateEndGameVignette(bool IsActive);
	void ActivateAttemptEscapeVFX();

	bool IsInterruptionPossible(const class ADBDPlayer* Interruptor, const class ADBDPlayer* Interruptee, const class UInteractor* Param_Interactor, const class UInteractionDefinition* Definition, const class UInterruptionDefinition* Interruption) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CalamariCageInteractable_C">();
	}
	static class ABP_CalamariCageInteractable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CalamariCageInteractable_C>();
	}
};
static_assert(alignof(ABP_CalamariCageInteractable_C) == 0x000008, "Wrong alignment on ABP_CalamariCageInteractable_C");
static_assert(sizeof(ABP_CalamariCageInteractable_C) == 0x000840, "Wrong size on ABP_CalamariCageInteractable_C");
static_assert(offsetof(ABP_CalamariCageInteractable_C, UberGraphFrame) == 0x0006D8, "Member 'ABP_CalamariCageInteractable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, NS_CalamariCage_Smoke_IDLE) == 0x0006E0, "Member 'ABP_CalamariCageInteractable_C::NS_CalamariCage_Smoke_IDLE' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, NS_CalamariCage_Smoke_OUT) == 0x0006E8, "Member 'ABP_CalamariCageInteractable_C::NS_CalamariCage_Smoke_OUT' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, NS_CalamariCage_Smoke) == 0x0006F0, "Member 'ABP_CalamariCageInteractable_C::NS_CalamariCage_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, NS_CalamariCage_BloodTrail1) == 0x0006F8, "Member 'ABP_CalamariCageInteractable_C::NS_CalamariCage_BloodTrail1' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, NS_CalamariCage_BloodTrail) == 0x000700, "Member 'ABP_CalamariCageInteractable_C::NS_CalamariCage_BloodTrail' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, MaterialHelper) == 0x000708, "Member 'ABP_CalamariCageInteractable_C::MaterialHelper' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, StaticMesh) == 0x000710, "Member 'ABP_CalamariCageInteractable_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, CageHookOutlineUpdateStrategy) == 0x000718, "Member 'ABP_CalamariCageInteractable_C::CageHookOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, CalamariCageRescueInteraction) == 0x000720, "Member 'ABP_CalamariCageInteractable_C::CalamariCageRescueInteraction' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DBDOutline) == 0x000728, "Member 'ABP_CalamariCageInteractable_C::DBDOutline' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, Ak_Audio_CalamariCage) == 0x000730, "Member 'ABP_CalamariCageInteractable_C::Ak_Audio_CalamariCage' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, Interactor) == 0x000738, "Member 'ABP_CalamariCageInteractable_C::Interactor' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, Timeline_Dissolve_Survivor_0A56ACFA4EFA8A5668DE348124CC9263) == 0x000740, "Member 'ABP_CalamariCageInteractable_C::Timeline_Dissolve_Survivor_0A56ACFA4EFA8A5668DE348124CC9263' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, Timeline_Dissolve_0A56ACFA4EFA8A5668DE348124CC9263) == 0x000744, "Member 'ABP_CalamariCageInteractable_C::Timeline_Dissolve_0A56ACFA4EFA8A5668DE348124CC9263' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, Timeline__Direction_0A56ACFA4EFA8A5668DE348124CC9263) == 0x000748, "Member 'ABP_CalamariCageInteractable_C::Timeline__Direction_0A56ACFA4EFA8A5668DE348124CC9263' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, Timeline) == 0x000750, "Member 'ABP_CalamariCageInteractable_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveAbsorbPlayer_Dissolve_Survivor_23FEED05414AA7D8603F1FBB161F0EBB) == 0x000758, "Member 'ABP_CalamariCageInteractable_C::DissolveAbsorbPlayer_Dissolve_Survivor_23FEED05414AA7D8603F1FBB161F0EBB' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveAbsorbPlayer_Dissolve_Cage_23FEED05414AA7D8603F1FBB161F0EBB) == 0x00075C, "Member 'ABP_CalamariCageInteractable_C::DissolveAbsorbPlayer_Dissolve_Cage_23FEED05414AA7D8603F1FBB161F0EBB' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveAbsorbPlayer_Dissolve_23FEED05414AA7D8603F1FBB161F0EBB) == 0x000760, "Member 'ABP_CalamariCageInteractable_C::DissolveAbsorbPlayer_Dissolve_23FEED05414AA7D8603F1FBB161F0EBB' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveAbsorbPlayer__Direction_23FEED05414AA7D8603F1FBB161F0EBB) == 0x000764, "Member 'ABP_CalamariCageInteractable_C::DissolveAbsorbPlayer__Direction_23FEED05414AA7D8603F1FBB161F0EBB' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveAbsorbPlayer) == 0x000768, "Member 'ABP_CalamariCageInteractable_C::DissolveAbsorbPlayer' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveDecal_Relocation_Decal_186B04AD4384C7E22BCD2693724EAECC) == 0x000770, "Member 'ABP_CalamariCageInteractable_C::DissolveDecal_Relocation_Decal_186B04AD4384C7E22BCD2693724EAECC' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveDecal_Relocation__Direction_186B04AD4384C7E22BCD2693724EAECC) == 0x000774, "Member 'ABP_CalamariCageInteractable_C::DissolveDecal_Relocation__Direction_186B04AD4384C7E22BCD2693724EAECC' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveDecal_Relocation) == 0x000778, "Member 'ABP_CalamariCageInteractable_C::DissolveDecal_Relocation' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveCamperDeath_Dissolve_Survivor_F6600B794DFEF8B65E7BFCB873A46EE8) == 0x000780, "Member 'ABP_CalamariCageInteractable_C::DissolveCamperDeath_Dissolve_Survivor_F6600B794DFEF8B65E7BFCB873A46EE8' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveCamperDeath_Dissolve_F6600B794DFEF8B65E7BFCB873A46EE8) == 0x000784, "Member 'ABP_CalamariCageInteractable_C::DissolveCamperDeath_Dissolve_F6600B794DFEF8B65E7BFCB873A46EE8' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveCamperDeath__Direction_F6600B794DFEF8B65E7BFCB873A46EE8) == 0x000788, "Member 'ABP_CalamariCageInteractable_C::DissolveCamperDeath__Direction_F6600B794DFEF8B65E7BFCB873A46EE8' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, DissolveCamperDeath) == 0x000790, "Member 'ABP_CalamariCageInteractable_C::DissolveCamperDeath' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_DissolveOut_Dissolve_Cage_OUT_95FA24E647854CC4310F37845825A877) == 0x000798, "Member 'ABP_CalamariCageInteractable_C::TML_DissolveOut_Dissolve_Cage_OUT_95FA24E647854CC4310F37845825A877' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_DissolveOut_Smoke_Idle_Dissolve_95FA24E647854CC4310F37845825A877) == 0x00079C, "Member 'ABP_CalamariCageInteractable_C::TML_DissolveOut_Smoke_Idle_Dissolve_95FA24E647854CC4310F37845825A877' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_DissolveOut_Blood_Trail_Dissolve_95FA24E647854CC4310F37845825A877) == 0x0007A0, "Member 'ABP_CalamariCageInteractable_C::TML_DissolveOut_Blood_Trail_Dissolve_95FA24E647854CC4310F37845825A877' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_DissolveOut_Dissolve_Cage_IN_95FA24E647854CC4310F37845825A877) == 0x0007A4, "Member 'ABP_CalamariCageInteractable_C::TML_DissolveOut_Dissolve_Cage_IN_95FA24E647854CC4310F37845825A877' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_DissolveOut__Direction_95FA24E647854CC4310F37845825A877) == 0x0007A8, "Member 'ABP_CalamariCageInteractable_C::TML_DissolveOut__Direction_95FA24E647854CC4310F37845825A877' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_DissolveOut) == 0x0007B0, "Member 'ABP_CalamariCageInteractable_C::TML_DissolveOut' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_CameraFade_Vignette_775FFA454E916A993A5B058EC202A97C) == 0x0007B8, "Member 'ABP_CalamariCageInteractable_C::TML_CameraFade_Vignette_775FFA454E916A993A5B058EC202A97C' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_CameraFade__Direction_775FFA454E916A993A5B058EC202A97C) == 0x0007BC, "Member 'ABP_CalamariCageInteractable_C::TML_CameraFade__Direction_775FFA454E916A993A5B058EC202A97C' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_CameraFade) == 0x0007C0, "Member 'ABP_CalamariCageInteractable_C::TML_CameraFade' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_Decal_Decal_76936AA44BB6A138345D6187B823EC44) == 0x0007C8, "Member 'ABP_CalamariCageInteractable_C::TML_Decal_Decal_76936AA44BB6A138345D6187B823EC44' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_Decal__Direction_76936AA44BB6A138345D6187B823EC44) == 0x0007CC, "Member 'ABP_CalamariCageInteractable_C::TML_Decal__Direction_76936AA44BB6A138345D6187B823EC44' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, TML_Decal) == 0x0007D0, "Member 'ABP_CalamariCageInteractable_C::TML_Decal' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, MID_DeathBed_Decal) == 0x0007D8, "Member 'ABP_CalamariCageInteractable_C::MID_DeathBed_Decal' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, PP_Vignette_Basic) == 0x0007E0, "Member 'ABP_CalamariCageInteractable_C::PP_Vignette_Basic' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, BloodParticle) == 0x0007E8, "Member 'ABP_CalamariCageInteractable_C::BloodParticle' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, ContactPointLocation) == 0x0007F8, "Member 'ABP_CalamariCageInteractable_C::ContactPointLocation' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, PP_Vignette) == 0x000808, "Member 'ABP_CalamariCageInteractable_C::PP_Vignette' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, IsRelocating) == 0x000818, "Member 'ABP_CalamariCageInteractable_C::IsRelocating' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, HookBlood2) == 0x000820, "Member 'ABP_CalamariCageInteractable_C::HookBlood2' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, HookBlood1) == 0x000828, "Member 'ABP_CalamariCageInteractable_C::HookBlood1' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, NewVar) == 0x000830, "Member 'ABP_CalamariCageInteractable_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_CalamariCageInteractable_C, SmokeIDLE) == 0x000838, "Member 'ABP_CalamariCageInteractable_C::SmokeIDLE' has a wrong offset!");

}

