#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CratesGroup01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CratesGroup01.BP_CratesGroup01_C
// 0x0048 (0x02E8 - 0x02A0)
class ABP_CratesGroup01_C final : public AActor
{
public:
	class UConfigurableCollisionComponent*        CharacterBlockerCrate3;                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConfigurableCollisionComponent*        CharacterBlockerCrate2;                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConfigurableCollisionComponent*        CharacterBlockerCrate1;                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          Crow_Spawner_2;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          Crow_Spawner_1;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Crate01_1;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Crate02_1;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Crate03_1;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CratesGroup01_C">();
	}
	static class ABP_CratesGroup01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CratesGroup01_C>();
	}
};
static_assert(alignof(ABP_CratesGroup01_C) == 0x000008, "Wrong alignment on ABP_CratesGroup01_C");
static_assert(sizeof(ABP_CratesGroup01_C) == 0x0002E8, "Wrong size on ABP_CratesGroup01_C");
static_assert(offsetof(ABP_CratesGroup01_C, CharacterBlockerCrate3) == 0x0002A0, "Member 'ABP_CratesGroup01_C::CharacterBlockerCrate3' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, CharacterBlockerCrate2) == 0x0002A8, "Member 'ABP_CratesGroup01_C::CharacterBlockerCrate2' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, CharacterBlockerCrate1) == 0x0002B0, "Member 'ABP_CratesGroup01_C::CharacterBlockerCrate1' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, Crow_Spawner_2) == 0x0002B8, "Member 'ABP_CratesGroup01_C::Crow_Spawner_2' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, Crow_Spawner_1) == 0x0002C0, "Member 'ABP_CratesGroup01_C::Crow_Spawner_1' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, SM_Crate01_1) == 0x0002C8, "Member 'ABP_CratesGroup01_C::SM_Crate01_1' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, SM_Crate02_1) == 0x0002D0, "Member 'ABP_CratesGroup01_C::SM_Crate02_1' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, SM_Crate03_1) == 0x0002D8, "Member 'ABP_CratesGroup01_C::SM_Crate03_1' has a wrong offset!");
static_assert(offsetof(ABP_CratesGroup01_C, Root) == 0x0002E0, "Member 'ABP_CratesGroup01_C::Root' has a wrong offset!");

}

