#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DBD_HUD

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DBD_HUD.BP_DBD_HUD_C
// 0x0020 (0x03E8 - 0x03C8)
class ABP_DBD_HUD_C final : public ADBDInGameHud
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        AngleOffset;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Size;                                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFont*                                  Font;                                              // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DBD_HUD_C">();
	}
	static class ABP_DBD_HUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DBD_HUD_C>();
	}
};
static_assert(alignof(ABP_DBD_HUD_C) == 0x000008, "Wrong alignment on ABP_DBD_HUD_C");
static_assert(sizeof(ABP_DBD_HUD_C) == 0x0003E8, "Wrong size on ABP_DBD_HUD_C");
static_assert(offsetof(ABP_DBD_HUD_C, DefaultSceneRoot) == 0x0003C8, "Member 'ABP_DBD_HUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DBD_HUD_C, AngleOffset) == 0x0003D0, "Member 'ABP_DBD_HUD_C::AngleOffset' has a wrong offset!");
static_assert(offsetof(ABP_DBD_HUD_C, Size) == 0x0003D8, "Member 'ABP_DBD_HUD_C::Size' has a wrong offset!");
static_assert(offsetof(ABP_DBD_HUD_C, Font) == 0x0003E0, "Member 'ABP_DBD_HUD_C::Font' has a wrong offset!");

}

