#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecalEffect_PuddlesBlood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DecalEffect_PuddlesBlood.BP_DecalEffect_PuddlesBlood_C
// 0x0040 (0x02E8 - 0x02A8)
class ABP_DecalEffect_PuddlesBlood_C final : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FadeOut_Animation_C09D69124C51326C8EFAB89903172364; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOut__Direction_C09D69124C51326C8EFAB89903172364; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeOut;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     TexturesRandom;                                    // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     NormalsRandom;                                     // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TextureNumber;                                     // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DecalEffect_PuddlesBlood(int32 EntryPoint);
	void FadeOut__FinishedFunc();
	void FadeOut__UpdateFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DecalEffect_PuddlesBlood_C">();
	}
	static class ABP_DecalEffect_PuddlesBlood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DecalEffect_PuddlesBlood_C>();
	}
};
static_assert(alignof(ABP_DecalEffect_PuddlesBlood_C) == 0x000008, "Wrong alignment on ABP_DecalEffect_PuddlesBlood_C");
static_assert(sizeof(ABP_DecalEffect_PuddlesBlood_C) == 0x0002E8, "Wrong size on ABP_DecalEffect_PuddlesBlood_C");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_DecalEffect_PuddlesBlood_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, FadeOut_Animation_C09D69124C51326C8EFAB89903172364) == 0x0002B0, "Member 'ABP_DecalEffect_PuddlesBlood_C::FadeOut_Animation_C09D69124C51326C8EFAB89903172364' has a wrong offset!");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, FadeOut__Direction_C09D69124C51326C8EFAB89903172364) == 0x0002B4, "Member 'ABP_DecalEffect_PuddlesBlood_C::FadeOut__Direction_C09D69124C51326C8EFAB89903172364' has a wrong offset!");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, FadeOut) == 0x0002B8, "Member 'ABP_DecalEffect_PuddlesBlood_C::FadeOut' has a wrong offset!");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, TexturesRandom) == 0x0002C0, "Member 'ABP_DecalEffect_PuddlesBlood_C::TexturesRandom' has a wrong offset!");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, NormalsRandom) == 0x0002D0, "Member 'ABP_DecalEffect_PuddlesBlood_C::NormalsRandom' has a wrong offset!");
static_assert(offsetof(ABP_DecalEffect_PuddlesBlood_C, TextureNumber) == 0x0002E0, "Member 'ABP_DecalEffect_PuddlesBlood_C::TextureNumber' has a wrong offset!");

}

