#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestroyBreakableWallWithPowerAttack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AnimationUtilities_structs.hpp"


namespace SDK::Params
{

// Function BP_DestroyBreakableWallWithPowerAttack.BP_DestroyBreakableWallWithPowerAttack_C.ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_Killer;                               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPresenceTag_ReturnValue;               // 0x0060(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            K2Node_MakeStruct_AnimationMontageDescriptor;      // 0x0090(0x0020)()
};
static_assert(alignof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack) == 0x000008, "Wrong alignment on BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack");
static_assert(sizeof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack) == 0x0000B0, "Wrong size on BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, EntryPoint) == 0x000000, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, Temp_bool_Variable) == 0x000004, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, Temp_name_Variable) == 0x000008, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, Temp_name_Variable_1) == 0x000014, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, Temp_bool_Variable_1) == 0x000020, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, Temp_name_Variable_2) == 0x000024, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, Temp_name_Variable_3) == 0x000030, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, K2Node_Event_Killer) == 0x000040, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, K2Node_DynamicCast_AsSlasher_Player) == 0x000048, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, CallFunc_GetPerkManager_ReturnValue) == 0x000058, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, CallFunc_GetPresenceTag_ReturnValue) == 0x000060, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::CallFunc_GetPresenceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, CallFunc_HasPerkFlag_ReturnValue) == 0x00006C, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00006D, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, K2Node_Select_Default) == 0x000070, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, CallFunc_GetTunableValue_ReturnValue) == 0x00007C, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, K2Node_Select_Default_1) == 0x000080, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack, K2Node_MakeStruct_AnimationMontageDescriptor) == 0x000090, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_ExecuteUbergraph_BP_DestroyBreakableWallWithPowerAttack::K2Node_MakeStruct_AnimationMontageDescriptor' has a wrong offset!");

// Function BP_DestroyBreakableWallWithPowerAttack.BP_DestroyBreakableWallWithPowerAttack_C.CustomizePropertiesForBlight
// 0x0008 (0x0008 - 0x0000)
struct BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight) == 0x000008, "Wrong alignment on BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight");
static_assert(sizeof(BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight) == 0x000008, "Wrong size on BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight");
static_assert(offsetof(BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight, Killer) == 0x000000, "Member 'BP_DestroyBreakableWallWithPowerAttack_C_CustomizePropertiesForBlight::Killer' has a wrong offset!");

}

