#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntityWall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntityWall.BP_EntityWall_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_EntityWall_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_EscapeBlocker01;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EntityWall(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntityWall_C">();
	}
	static class ABP_EntityWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntityWall_C>();
	}
};
static_assert(alignof(ABP_EntityWall_C) == 0x000008, "Wrong alignment on ABP_EntityWall_C");
static_assert(sizeof(ABP_EntityWall_C) == 0x0002B8, "Wrong size on ABP_EntityWall_C");
static_assert(offsetof(ABP_EntityWall_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_EntityWall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EntityWall_C, SM_EscapeBlocker01) == 0x0002A8, "Member 'ABP_EntityWall_C::SM_EscapeBlocker01' has a wrong offset!");
static_assert(offsetof(ABP_EntityWall_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_EntityWall_C::DefaultSceneRoot' has a wrong offset!");

}

