#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EscapeBlocker

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EscapeBlocker.BP_EscapeBlocker_C
// 0x00A0 (0x0380 - 0x02E0)
class ABP_EscapeBlocker_C final : public AEscapeBlocker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BlinkBlocker;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PlayerDetectionZone;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CamperBlocker;                                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BaseRoot;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_Escape_Blocker;                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialHelper*                        MaterialHelper_WallBlocked;                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Entity_assets;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_WallRight;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_WallLeft;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Audio;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SlasherBlocker;                                    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Wall_Blocked_Assets;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SmokeFadeTimeline_Smoke_Fade_B1C8EA59428414A2E8680B8DD6D1993E; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SmokeFadeTimeline__Direction_B1C8EA59428414A2E8680B8DD6D1993E; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SmokeFadeTimeline;                                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         SpikesDissolveTimeline_Dissolve_80014C574D32E0339AC6AEA0D09A770D; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SpikesDissolveTimeline__Direction_80014C574D32E0339AC6AEA0D09A770D; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SpikesDissolveTimeline;                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CamperBlockerInitialLocation;                      // 0x0368(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivatePlayerBlockerFX();
	void DeactivatePlayerBlockerFX();
	void ExecuteUbergraph_BP_EscapeBlocker(int32 EntryPoint);
	void InitComponentValues();
	void SmokeFadeTimeline__FinishedFunc();
	void SmokeFadeTimeline__UpdateFunc();
	void SpikesDissolveTimeline__FinishedFunc();
	void SpikesDissolveTimeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EscapeBlocker_C">();
	}
	static class ABP_EscapeBlocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EscapeBlocker_C>();
	}
};
static_assert(alignof(ABP_EscapeBlocker_C) == 0x000008, "Wrong alignment on ABP_EscapeBlocker_C");
static_assert(sizeof(ABP_EscapeBlocker_C) == 0x000380, "Wrong size on ABP_EscapeBlocker_C");
static_assert(offsetof(ABP_EscapeBlocker_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_EscapeBlocker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, BlinkBlocker) == 0x0002E8, "Member 'ABP_EscapeBlocker_C::BlinkBlocker' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, PlayerDetectionZone) == 0x0002F0, "Member 'ABP_EscapeBlocker_C::PlayerDetectionZone' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, CamperBlocker) == 0x0002F8, "Member 'ABP_EscapeBlocker_C::CamperBlocker' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, BaseRoot) == 0x000300, "Member 'ABP_EscapeBlocker_C::BaseRoot' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, Ak_Audio_Escape_Blocker) == 0x000308, "Member 'ABP_EscapeBlocker_C::Ak_Audio_Escape_Blocker' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, MaterialHelper_WallBlocked) == 0x000310, "Member 'ABP_EscapeBlocker_C::MaterialHelper_WallBlocked' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, Entity_assets) == 0x000318, "Member 'ABP_EscapeBlocker_C::Entity_assets' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, P_WallRight) == 0x000320, "Member 'ABP_EscapeBlocker_C::P_WallRight' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, P_WallLeft) == 0x000328, "Member 'ABP_EscapeBlocker_C::P_WallLeft' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, Audio) == 0x000330, "Member 'ABP_EscapeBlocker_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SlasherBlocker) == 0x000338, "Member 'ABP_EscapeBlocker_C::SlasherBlocker' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, Wall_Blocked_Assets) == 0x000340, "Member 'ABP_EscapeBlocker_C::Wall_Blocked_Assets' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SmokeFadeTimeline_Smoke_Fade_B1C8EA59428414A2E8680B8DD6D1993E) == 0x000348, "Member 'ABP_EscapeBlocker_C::SmokeFadeTimeline_Smoke_Fade_B1C8EA59428414A2E8680B8DD6D1993E' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SmokeFadeTimeline__Direction_B1C8EA59428414A2E8680B8DD6D1993E) == 0x00034C, "Member 'ABP_EscapeBlocker_C::SmokeFadeTimeline__Direction_B1C8EA59428414A2E8680B8DD6D1993E' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SmokeFadeTimeline) == 0x000350, "Member 'ABP_EscapeBlocker_C::SmokeFadeTimeline' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SpikesDissolveTimeline_Dissolve_80014C574D32E0339AC6AEA0D09A770D) == 0x000358, "Member 'ABP_EscapeBlocker_C::SpikesDissolveTimeline_Dissolve_80014C574D32E0339AC6AEA0D09A770D' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SpikesDissolveTimeline__Direction_80014C574D32E0339AC6AEA0D09A770D) == 0x00035C, "Member 'ABP_EscapeBlocker_C::SpikesDissolveTimeline__Direction_80014C574D32E0339AC6AEA0D09A770D' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, SpikesDissolveTimeline) == 0x000360, "Member 'ABP_EscapeBlocker_C::SpikesDissolveTimeline' has a wrong offset!");
static_assert(offsetof(ABP_EscapeBlocker_C, CamperBlockerInitialLocation) == 0x000368, "Member 'ABP_EscapeBlocker_C::CamperBlockerInitialLocation' has a wrong offset!");

}

