#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EndGameEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EndGameEntity.BP_EndGameEntity_C
// 0x00A0 (0x0348 - 0x02A8)
class ABP_EndGameEntity_C final : public AEndGameEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialHelper*                        MaterialHelper;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Entity_Endgame_Smoke_Loop;                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElbowLT_06_Spine;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ShoulderLT_05_Spine;                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElbowLT_05_Spine;                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ShoulderLT_04_Spine;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElbowLT_04_Spine;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ShoulderLT_03_Spine;                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElbowLT_03_Spine;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ShoulderLT_02_Spine;                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElbowLT_02_Spine;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ShoulderLT_01_Spine;                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElbowLT_01_Spine;                               // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TML_SpineLoopAnimation_Frame_AC97168D49EB3CB43A2C97BB9ED473EB; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_SpineLoopAnimation__Direction_AC97168D49EB3CB43A2C97BB9ED473EB; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_SpineLoopAnimation;                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TML_SpineStartAnimation_Frame_4ED44783493578CC5617A88084F735F5; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_SpineStartAnimation__Direction_4ED44783493578CC5617A88084F735F5; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_SpineStartAnimation;                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           SpineArray;                                        // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_EndGameEntity(int32 EntryPoint);
	void StartSmokeLoop();
	void StartSpineAnimation();
	void TML_SpineLoopAnimation__FinishedFunc();
	void TML_SpineLoopAnimation__UpdateFunc();
	void TML_SpineStartAnimation__FinishedFunc();
	void TML_SpineStartAnimation__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EndGameEntity_C">();
	}
	static class ABP_EndGameEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EndGameEntity_C>();
	}
};
static_assert(alignof(ABP_EndGameEntity_C) == 0x000008, "Wrong alignment on ABP_EndGameEntity_C");
static_assert(sizeof(ABP_EndGameEntity_C) == 0x000348, "Wrong size on ABP_EndGameEntity_C");
static_assert(offsetof(ABP_EndGameEntity_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_EndGameEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, MaterialHelper) == 0x0002B0, "Member 'ABP_EndGameEntity_C::MaterialHelper' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, P_Entity_Endgame_Smoke_Loop) == 0x0002B8, "Member 'ABP_EndGameEntity_C::P_Entity_Endgame_Smoke_Loop' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ElbowLT_06_Spine) == 0x0002C0, "Member 'ABP_EndGameEntity_C::SM_ElbowLT_06_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ShoulderLT_05_Spine) == 0x0002C8, "Member 'ABP_EndGameEntity_C::SM_ShoulderLT_05_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ElbowLT_05_Spine) == 0x0002D0, "Member 'ABP_EndGameEntity_C::SM_ElbowLT_05_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ShoulderLT_04_Spine) == 0x0002D8, "Member 'ABP_EndGameEntity_C::SM_ShoulderLT_04_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ElbowLT_04_Spine) == 0x0002E0, "Member 'ABP_EndGameEntity_C::SM_ElbowLT_04_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ShoulderLT_03_Spine) == 0x0002E8, "Member 'ABP_EndGameEntity_C::SM_ShoulderLT_03_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ElbowLT_03_Spine) == 0x0002F0, "Member 'ABP_EndGameEntity_C::SM_ElbowLT_03_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ShoulderLT_02_Spine) == 0x0002F8, "Member 'ABP_EndGameEntity_C::SM_ShoulderLT_02_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ElbowLT_02_Spine) == 0x000300, "Member 'ABP_EndGameEntity_C::SM_ElbowLT_02_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ShoulderLT_01_Spine) == 0x000308, "Member 'ABP_EndGameEntity_C::SM_ShoulderLT_01_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SM_ElbowLT_01_Spine) == 0x000310, "Member 'ABP_EndGameEntity_C::SM_ElbowLT_01_Spine' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, TML_SpineLoopAnimation_Frame_AC97168D49EB3CB43A2C97BB9ED473EB) == 0x000318, "Member 'ABP_EndGameEntity_C::TML_SpineLoopAnimation_Frame_AC97168D49EB3CB43A2C97BB9ED473EB' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, TML_SpineLoopAnimation__Direction_AC97168D49EB3CB43A2C97BB9ED473EB) == 0x00031C, "Member 'ABP_EndGameEntity_C::TML_SpineLoopAnimation__Direction_AC97168D49EB3CB43A2C97BB9ED473EB' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, TML_SpineLoopAnimation) == 0x000320, "Member 'ABP_EndGameEntity_C::TML_SpineLoopAnimation' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, TML_SpineStartAnimation_Frame_4ED44783493578CC5617A88084F735F5) == 0x000328, "Member 'ABP_EndGameEntity_C::TML_SpineStartAnimation_Frame_4ED44783493578CC5617A88084F735F5' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, TML_SpineStartAnimation__Direction_4ED44783493578CC5617A88084F735F5) == 0x00032C, "Member 'ABP_EndGameEntity_C::TML_SpineStartAnimation__Direction_4ED44783493578CC5617A88084F735F5' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, TML_SpineStartAnimation) == 0x000330, "Member 'ABP_EndGameEntity_C::TML_SpineStartAnimation' has a wrong offset!");
static_assert(offsetof(ABP_EndGameEntity_C, SpineArray) == 0x000338, "Member 'ABP_EndGameEntity_C::SpineArray' has a wrong offset!");

}

