#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foundry_Vault_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foundry_Vault_01.BP_Foundry_Vault_01_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_Foundry_Vault_01_C final : public AActor
{
public:
	class UActorSpawner*                          ActorSpawner;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01Wall_vault;                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Foundry_Vault_01_C">();
	}
	static class ABP_Foundry_Vault_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Foundry_Vault_01_C>();
	}
};
static_assert(alignof(ABP_Foundry_Vault_01_C) == 0x000008, "Wrong alignment on ABP_Foundry_Vault_01_C");
static_assert(sizeof(ABP_Foundry_Vault_01_C) == 0x0002B8, "Wrong size on ABP_Foundry_Vault_01_C");
static_assert(offsetof(ABP_Foundry_Vault_01_C, ActorSpawner) == 0x0002A0, "Member 'ABP_Foundry_Vault_01_C::ActorSpawner' has a wrong offset!");
static_assert(offsetof(ABP_Foundry_Vault_01_C, SM_ST_Foundry01Wall_vault) == 0x0002A8, "Member 'ABP_Foundry_Vault_01_C::SM_ST_Foundry01Wall_vault' has a wrong offset!");
static_assert(offsetof(ABP_Foundry_Vault_01_C, Root) == 0x0002B0, "Member 'ABP_Foundry_Vault_01_C::Root' has a wrong offset!");

}

