#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Firecracker_FlashbangGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Firecracker_FlashbangGrenade.BP_Firecracker_FlashbangGrenade_C.WinterSparks
// 0x0018 (0x0018 - 0x0000)
struct BP_Firecracker_FlashbangGrenade_C_WinterSparks final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Firecracker_FlashbangGrenade_C_WinterSparks) == 0x000004, "Wrong alignment on BP_Firecracker_FlashbangGrenade_C_WinterSparks");
static_assert(sizeof(BP_Firecracker_FlashbangGrenade_C_WinterSparks) == 0x000018, "Wrong size on BP_Firecracker_FlashbangGrenade_C_WinterSparks");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_WinterSparks, Temp_delegate_Variable) == 0x000000, "Member 'BP_Firecracker_FlashbangGrenade_C_WinterSparks::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_WinterSparks, CallFunc_PostAkEvent_ReturnValue) == 0x000014, "Member 'BP_Firecracker_FlashbangGrenade_C_WinterSparks::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_Firecracker_FlashbangGrenade.BP_Firecracker_FlashbangGrenade_C.OnFuseBurnUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuseTimeLeftPercent;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate) == 0x000004, "Wrong alignment on BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate");
static_assert(sizeof(BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate) == 0x000008, "Wrong size on BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate, DeltaSeconds) == 0x000000, "Member 'BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate, FuseTimeLeftPercent) == 0x000004, "Member 'BP_Firecracker_FlashbangGrenade_C_OnFuseBurnUpdate::FuseTimeLeftPercent' has a wrong offset!");

// Function BP_Firecracker_FlashbangGrenade.BP_Firecracker_FlashbangGrenade_C.FX_Sparks
// 0x0018 (0x0018 - 0x0000)
struct BP_Firecracker_FlashbangGrenade_C_FX_Sparks final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Firecracker_FlashbangGrenade_C_FX_Sparks) == 0x000004, "Wrong alignment on BP_Firecracker_FlashbangGrenade_C_FX_Sparks");
static_assert(sizeof(BP_Firecracker_FlashbangGrenade_C_FX_Sparks) == 0x000018, "Wrong size on BP_Firecracker_FlashbangGrenade_C_FX_Sparks");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_FX_Sparks, Temp_delegate_Variable) == 0x000000, "Member 'BP_Firecracker_FlashbangGrenade_C_FX_Sparks::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_FX_Sparks, CallFunc_PostAkEvent_ReturnValue) == 0x000014, "Member 'BP_Firecracker_FlashbangGrenade_C_FX_Sparks::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_Firecracker_FlashbangGrenade.BP_Firecracker_FlashbangGrenade_C.ExecuteUbergraph_BP_Firecracker_FlashbangGrenade
// 0x0290 (0x0290 - 0x0000)
struct BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkResult Result)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0050(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     K2Node_CustomEvent_Result;                         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuseTimeLeftPercent;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0170(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_B_ImplicitCast;            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_A_ImplicitCast;            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade) == 0x000010, "Wrong alignment on BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade");
static_assert(sizeof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade) == 0x000290, "Wrong size on BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, EntryPoint) == 0x000000, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, Temp_delegate_Variable) == 0x000004, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000048, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, Temp_delegate_Variable_1) == 0x000050, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_BreakVector_X) == 0x000068, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_BreakVector_Y) == 0x000070, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_BreakVector_Z) == 0x000078, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeRotator_ReturnValue) == 0x000080, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_Add_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, K2Node_CustomEvent_Result) == 0x00009C, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, K2Node_Event_DeltaSeconds) == 0x0000A0, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, K2Node_Event_fuseTimeLeftPercent) == 0x0000A4, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::K2Node_Event_fuseTimeLeftPercent' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_PostAkEvent_ReturnValue) == 0x0000A8, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000AC, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000B0, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_BreakVector_X_1) == 0x0000D0, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_BreakVector_Y_1) == 0x0000D8, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_BreakVector_Z_1) == 0x0000E0, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000E8, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeVector_ReturnValue) == 0x0000F0, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000170, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000260, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000264, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000268, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_Add_FloatFloat_B_ImplicitCast) == 0x00026C, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_Add_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeVector_Z_ImplicitCast) == 0x000270, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_Add_FloatFloat_A_ImplicitCast) == 0x000278, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_Add_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade, CallFunc_MakeVector_X_ImplicitCast) == 0x000280, "Member 'BP_Firecracker_FlashbangGrenade_C_ExecuteUbergraph_BP_Firecracker_FlashbangGrenade::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");

// Function BP_Firecracker_FlashbangGrenade.BP_Firecracker_FlashbangGrenade_C.CustomEvent_1
// 0x0001 (0x0001 - 0x0000)
struct BP_Firecracker_FlashbangGrenade_C_CustomEvent_1 final
{
public:
	EAkResult                                     Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Firecracker_FlashbangGrenade_C_CustomEvent_1) == 0x000001, "Wrong alignment on BP_Firecracker_FlashbangGrenade_C_CustomEvent_1");
static_assert(sizeof(BP_Firecracker_FlashbangGrenade_C_CustomEvent_1) == 0x000001, "Wrong size on BP_Firecracker_FlashbangGrenade_C_CustomEvent_1");
static_assert(offsetof(BP_Firecracker_FlashbangGrenade_C_CustomEvent_1, Result) == 0x000000, "Member 'BP_Firecracker_FlashbangGrenade_C_CustomEvent_1::Result' has a wrong offset!");

}

