#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fire

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Fire.BP_Fire_C.Spawn
// 0x0090 (0x0090 - 0x0000)
struct BP_Fire_C_Spawn final
{
public:
	class UParticleSystemComponent*               Param_Spawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Smoke1;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Smoke2;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        F_Smoke2;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fire0;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        F_Fire0;                                           // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Flames1;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Flames2;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Flames3;                                           // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        F_Flames1;                                         // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        F_Flames2;                                         // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        F_Flames3;                                         // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_3;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_4;   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_5;   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_6;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_7;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_8;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_9;   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_10;  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fire_C_Spawn) == 0x000008, "Wrong alignment on BP_Fire_C_Spawn");
static_assert(sizeof(BP_Fire_C_Spawn) == 0x000090, "Wrong size on BP_Fire_C_Spawn");
static_assert(offsetof(BP_Fire_C_Spawn, Param_Spawn) == 0x000000, "Member 'BP_Fire_C_Spawn::Param_Spawn' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, Smoke1) == 0x000008, "Member 'BP_Fire_C_Spawn::Smoke1' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, Smoke2) == 0x000010, "Member 'BP_Fire_C_Spawn::Smoke2' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, F_Smoke2) == 0x000018, "Member 'BP_Fire_C_Spawn::F_Smoke2' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, Fire0) == 0x000020, "Member 'BP_Fire_C_Spawn::Fire0' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, F_Fire0) == 0x000028, "Member 'BP_Fire_C_Spawn::F_Fire0' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, Flames1) == 0x000030, "Member 'BP_Fire_C_Spawn::Flames1' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, Flames2) == 0x000038, "Member 'BP_Fire_C_Spawn::Flames2' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, Flames3) == 0x000040, "Member 'BP_Fire_C_Spawn::Flames3' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, F_Flames1) == 0x000048, "Member 'BP_Fire_C_Spawn::F_Flames1' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, F_Flames2) == 0x000050, "Member 'BP_Fire_C_Spawn::F_Flames2' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, F_Flames3) == 0x000058, "Member 'BP_Fire_C_Spawn::F_Flames3' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000060, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000064, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_2) == 0x000068, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_3) == 0x00006C, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_4) == 0x000070, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_5) == 0x000074, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_6) == 0x000078, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_7) == 0x00007C, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_8) == 0x000080, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_9) == 0x000084, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Spawn, CallFunc_SetFloatParameter_Param_ImplicitCast_10) == 0x000088, "Member 'BP_Fire_C_Spawn::CallFunc_SetFloatParameter_Param_ImplicitCast_10' has a wrong offset!");

// Function BP_Fire.BP_Fire_C.Fire_Smoke
// 0x0010 (0x0010 - 0x0000)
struct BP_Fire_C_Fire_Smoke final
{
public:
	class UParticleSystemComponent*               FX;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Smoke;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fire_C_Fire_Smoke) == 0x000008, "Wrong alignment on BP_Fire_C_Fire_Smoke");
static_assert(sizeof(BP_Fire_C_Fire_Smoke) == 0x000010, "Wrong size on BP_Fire_C_Fire_Smoke");
static_assert(offsetof(BP_Fire_C_Fire_Smoke, FX) == 0x000000, "Member 'BP_Fire_C_Fire_Smoke::FX' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Fire_Smoke, Smoke) == 0x000008, "Member 'BP_Fire_C_Fire_Smoke::Smoke' has a wrong offset!");

// Function BP_Fire.BP_Fire_C.Fire_Normal
// 0x0010 (0x0010 - 0x0000)
struct BP_Fire_C_Fire_Normal final
{
public:
	class UParticleSystemComponent*               FX;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Normal;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fire_C_Fire_Normal) == 0x000008, "Wrong alignment on BP_Fire_C_Fire_Normal");
static_assert(sizeof(BP_Fire_C_Fire_Normal) == 0x000010, "Wrong size on BP_Fire_C_Fire_Normal");
static_assert(offsetof(BP_Fire_C_Fire_Normal, FX) == 0x000000, "Member 'BP_Fire_C_Fire_Normal::FX' has a wrong offset!");
static_assert(offsetof(BP_Fire_C_Fire_Normal, Normal) == 0x000008, "Member 'BP_Fire_C_Fire_Normal::Normal' has a wrong offset!");

}

