#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FirecrackerSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FirecrackerSpawner.BP_FirecrackerSpawner_C
// 0x0028 (0x05D0 - 0x05A8)
class ABP_FirecrackerSpawner_C : public AFirecrackerSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFastThrowFirecracker_C*                FastThrowFirecracker;                              // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USleepingSkinnedMeshRegisterer*         SleepingSkinnedMeshRegisterer;                     // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TML_dissolve_Opacity_Dissolve_B3C81B804654F2180C44F6B5C3485FC6; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_dissolve__Direction_B3C81B804654F2180C44F6B5C3485FC6; // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_dissolve;                                      // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void TML_dissolve__UpdateFunc();
	void TML_dissolve__FinishedFunc();
	void TML_dissolve__Event_dissolve__EventFunc();
	void OnActivateDissolveItem();
	void ExecuteUbergraph_BP_FirecrackerSpawner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FirecrackerSpawner_C">();
	}
	static class ABP_FirecrackerSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FirecrackerSpawner_C>();
	}
};
static_assert(alignof(ABP_FirecrackerSpawner_C) == 0x000008, "Wrong alignment on ABP_FirecrackerSpawner_C");
static_assert(sizeof(ABP_FirecrackerSpawner_C) == 0x0005D0, "Wrong size on ABP_FirecrackerSpawner_C");
static_assert(offsetof(ABP_FirecrackerSpawner_C, UberGraphFrame) == 0x0005A8, "Member 'ABP_FirecrackerSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FirecrackerSpawner_C, FastThrowFirecracker) == 0x0005B0, "Member 'ABP_FirecrackerSpawner_C::FastThrowFirecracker' has a wrong offset!");
static_assert(offsetof(ABP_FirecrackerSpawner_C, SleepingSkinnedMeshRegisterer) == 0x0005B8, "Member 'ABP_FirecrackerSpawner_C::SleepingSkinnedMeshRegisterer' has a wrong offset!");
static_assert(offsetof(ABP_FirecrackerSpawner_C, TML_dissolve_Opacity_Dissolve_B3C81B804654F2180C44F6B5C3485FC6) == 0x0005C0, "Member 'ABP_FirecrackerSpawner_C::TML_dissolve_Opacity_Dissolve_B3C81B804654F2180C44F6B5C3485FC6' has a wrong offset!");
static_assert(offsetof(ABP_FirecrackerSpawner_C, TML_dissolve__Direction_B3C81B804654F2180C44F6B5C3485FC6) == 0x0005C4, "Member 'ABP_FirecrackerSpawner_C::TML_dissolve__Direction_B3C81B804654F2180C44F6B5C3485FC6' has a wrong offset!");
static_assert(offsetof(ABP_FirecrackerSpawner_C, TML_dissolve) == 0x0005C8, "Member 'ABP_FirecrackerSpawner_C::TML_dissolve' has a wrong offset!");

}

