#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fl_Fr_16x16_Basement01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fl_Fr_16x16_Basement01.BP_Fl_Fr_16x16_Basement01_C
// 0x0040 (0x02E0 - 0x02A0)
class ABP_Fl_Fr_16x16_Basement01_C final : public AActor
{
public:
	class UChildActorComponent*                   DBDChildActor_Blocker18;                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NavLinkFall02;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NavLinkFall05;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NavLinkFall04;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NavLinkFall03;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   NavLinkFall01;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        NavLinks;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_ShackFloor02;                                // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Fl_Fr_16x16_Basement01_C">();
	}
	static class ABP_Fl_Fr_16x16_Basement01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fl_Fr_16x16_Basement01_C>();
	}
};
static_assert(alignof(ABP_Fl_Fr_16x16_Basement01_C) == 0x000008, "Wrong alignment on ABP_Fl_Fr_16x16_Basement01_C");
static_assert(sizeof(ABP_Fl_Fr_16x16_Basement01_C) == 0x0002E0, "Wrong size on ABP_Fl_Fr_16x16_Basement01_C");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, DBDChildActor_Blocker18) == 0x0002A0, "Member 'ABP_Fl_Fr_16x16_Basement01_C::DBDChildActor_Blocker18' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, NavLinkFall02) == 0x0002A8, "Member 'ABP_Fl_Fr_16x16_Basement01_C::NavLinkFall02' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, NavLinkFall05) == 0x0002B0, "Member 'ABP_Fl_Fr_16x16_Basement01_C::NavLinkFall05' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, NavLinkFall04) == 0x0002B8, "Member 'ABP_Fl_Fr_16x16_Basement01_C::NavLinkFall04' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, NavLinkFall03) == 0x0002C0, "Member 'ABP_Fl_Fr_16x16_Basement01_C::NavLinkFall03' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, NavLinkFall01) == 0x0002C8, "Member 'ABP_Fl_Fr_16x16_Basement01_C::NavLinkFall01' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, NavLinks) == 0x0002D0, "Member 'ABP_Fl_Fr_16x16_Basement01_C::NavLinks' has a wrong offset!");
static_assert(offsetof(ABP_Fl_Fr_16x16_Basement01_C, SM_ST_ShackFloor02) == 0x0002D8, "Member 'ABP_Fl_Fr_16x16_Basement01_C::SM_ST_ShackFloor02' has a wrong offset!");

}

