#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireBarrel01

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_FireBarrel01.BP_FireBarrel01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FireBarrel01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireBarrel01_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FireBarrel01_C_ReceiveTick");
static_assert(sizeof(BP_FireBarrel01_C_ReceiveTick) == 0x000004, "Wrong size on BP_FireBarrel01_C_ReceiveTick");
static_assert(offsetof(BP_FireBarrel01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FireBarrel01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FireBarrel01.BP_FireBarrel01_C.ExecuteUbergraph_BP_FireBarrel01
// 0x0038 (0x0038 - 0x0000)
struct BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkResult Result)>             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01) == 0x000004, "Wrong alignment on BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01");
static_assert(sizeof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01) == 0x000038, "Wrong size on BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01");
static_assert(offsetof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01, EntryPoint) == 0x000000, "Member 'BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01, K2Node_CustomEvent_Result) == 0x000004, "Member 'BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01, Temp_delegate_Variable) == 0x000008, "Member 'BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000034, "Member 'BP_FireBarrel01_C_ExecuteUbergraph_BP_FireBarrel01::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");

// Function BP_FireBarrel01.BP_FireBarrel01_C.CustomEvent_1
// 0x0001 (0x0001 - 0x0000)
struct BP_FireBarrel01_C_CustomEvent_1 final
{
public:
	EAkResult                                     Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireBarrel01_C_CustomEvent_1) == 0x000001, "Wrong alignment on BP_FireBarrel01_C_CustomEvent_1");
static_assert(sizeof(BP_FireBarrel01_C_CustomEvent_1) == 0x000001, "Wrong size on BP_FireBarrel01_C_CustomEvent_1");
static_assert(offsetof(BP_FireBarrel01_C_CustomEvent_1, Result) == 0x000000, "Member 'BP_FireBarrel01_C_CustomEvent_1::Result' has a wrong offset!");

}

