#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FL_FoundaryFloor01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FL_FoundaryFloor01.BP_FL_FoundaryFloor01_C
// 0x0070 (0x0310 - 0x02A0)
class ABP_FL_FoundaryFloor01_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Character_Blocker;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundary01Floor02;                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FL_FoundaryFloor01_C">();
	}
	static class ABP_FL_FoundaryFloor01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FL_FoundaryFloor01_C>();
	}
};
static_assert(alignof(ABP_FL_FoundaryFloor01_C) == 0x000008, "Wrong alignment on ABP_FL_FoundaryFloor01_C");
static_assert(sizeof(ABP_FL_FoundaryFloor01_C) == 0x000310, "Wrong size on ABP_FL_FoundaryFloor01_C");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, Box) == 0x0002A0, "Member 'ABP_FL_FoundaryFloor01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, Character_Blocker) == 0x0002A8, "Member 'ABP_FL_FoundaryFloor01_C::Character_Blocker' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh10) == 0x0002B0, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh9) == 0x0002B8, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh8) == 0x0002C0, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh7) == 0x0002C8, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh4) == 0x0002D0, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh6) == 0x0002D8, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh5) == 0x0002E0, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh3) == 0x0002E8, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh2) == 0x0002F0, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh1) == 0x0002F8, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, StaticMesh) == 0x000300, "Member 'ABP_FL_FoundaryFloor01_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FL_FoundaryFloor01_C, SM_ST_Foundary01Floor02) == 0x000308, "Member 'ABP_FL_FoundaryFloor01_C::SM_ST_Foundary01Floor02' has a wrong offset!");

}

