#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlashLight

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FlashLight.BP_Flashlight_C
// 0x00C8 (0x0750 - 0x0688)
class ABP_Flashlight_C : public AFlashlight
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USleepingSkinnedMeshRegisterer*         SleepingSkinnedMeshRegisterer;                     // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FlashligthBeam;                                 // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAimPointPerlinNoise*                   AimPointPerlinNoise;                               // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFlashlightConeComponent*               FlashlightConeComponent;                           // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FlashlightFXComponent_C*            FlashlightFXComponent;                             // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   BeamSplineMesh;                                    // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Bottom;                                            // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CenterGlowFX;                                      // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CenterGlow;                                        // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip;                                               // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAimableComponent*                      Aimable;                                           // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFlashlightComponent*                   FlashlightComponent;                               // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialHelper*                        MaterialHelper_Glow;                               // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChargerComponent*                      Charger;                                           // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_Flashlight;                               // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TML_Dissolve_Opacity_Dissolve_7068C5EB4A1893C94229BC944F379432; // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_Dissolve__Direction_7068C5EB4A1893C94229BC944F379432; // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_dissolve;                                      // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        BeamHalfAngleWhenBlinding;                         // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BeamHalfAngleDuringFlash;                          // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugPrintKey;                                     // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpotLightHalfAngle;                                // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BeamSuccessRatio;                                  // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   SplineMeshBeam;                                    // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateNoiseSettings();
	void UpdateAimableSettings();
	void TML_dissolve__UpdateFunc();
	void TML_dissolve__FinishedFunc();
	void TML_dissolve__Event_dissolve__EventFunc();
	void SetVisibilityEvent(bool Visibility);
	void ReceiveBeginPlay();
	void PrintTextStat(const class FString& Title, const class FString& Value);
	void PrintStat(const class FString& Title, double Value);
	void OnUseReleased(class ADBDPlayer* Collector);
	void OnUse();
	void OnDropped(class ADBDPlayer* DroppingPlayer);
	void OnCollectorSet(class ADBDPlayer* Collector);
	void OnAddonsRemoved(const TArray<class UItemAddon*>& Addons);
	void OnAddonsAdded(const TArray<class UItemAddon*>& Addons);
	void OnActivateDissolveItem();
	void InitializeTunables();
	void Flashlight_bank_loaded(EAkResult Result);
	void ExecuteUbergraph_BP_Flashlight(int32 EntryPoint);
	void DoDebugPrintStats();
	void DebugPrintStats();
	void BndEvt__Flashlight_K2Node_ComponentBoundEvent_4_OnFlashlightTurnedOff__DelegateSignature();
	void BndEvt__Flashlight_K2Node_ComponentBoundEvent_3_OnFlashlightTurnedOn__DelegateSignature();
	void BndEvt__Charger_K2Node_ComponentBoundEvent_0_ChargeStateChangeDelegate__DelegateSignature(bool Empty);

	void GetEffectiveBeamInaccuracyFrequencyMultiplier(double* Result) const;
	void GetEffectiveBeamInaccuracyAmplitudeMultiplier(double* Result) const;
	void GetEffectiveBeamAccuracy(double* Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Flashlight_C">();
	}
	static class ABP_Flashlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Flashlight_C>();
	}
};
static_assert(alignof(ABP_Flashlight_C) == 0x000008, "Wrong alignment on ABP_Flashlight_C");
static_assert(sizeof(ABP_Flashlight_C) == 0x000750, "Wrong size on ABP_Flashlight_C");
static_assert(offsetof(ABP_Flashlight_C, UberGraphFrame) == 0x000688, "Member 'ABP_Flashlight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, SleepingSkinnedMeshRegisterer) == 0x000690, "Member 'ABP_Flashlight_C::SleepingSkinnedMeshRegisterer' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, NS_FlashligthBeam) == 0x000698, "Member 'ABP_Flashlight_C::NS_FlashligthBeam' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, AimPointPerlinNoise) == 0x0006A0, "Member 'ABP_Flashlight_C::AimPointPerlinNoise' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, FlashlightConeComponent) == 0x0006A8, "Member 'ABP_Flashlight_C::FlashlightConeComponent' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, FlashlightFXComponent) == 0x0006B0, "Member 'ABP_Flashlight_C::FlashlightFXComponent' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, BeamSplineMesh) == 0x0006B8, "Member 'ABP_Flashlight_C::BeamSplineMesh' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, Bottom) == 0x0006C0, "Member 'ABP_Flashlight_C::Bottom' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, CenterGlowFX) == 0x0006C8, "Member 'ABP_Flashlight_C::CenterGlowFX' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, SpotLight) == 0x0006D0, "Member 'ABP_Flashlight_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, CenterGlow) == 0x0006D8, "Member 'ABP_Flashlight_C::CenterGlow' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, Tip) == 0x0006E0, "Member 'ABP_Flashlight_C::Tip' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, Aimable) == 0x0006E8, "Member 'ABP_Flashlight_C::Aimable' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, FlashlightComponent) == 0x0006F0, "Member 'ABP_Flashlight_C::FlashlightComponent' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, MaterialHelper_Glow) == 0x0006F8, "Member 'ABP_Flashlight_C::MaterialHelper_Glow' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, Charger) == 0x000700, "Member 'ABP_Flashlight_C::Charger' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, Ak_Audio_Flashlight) == 0x000708, "Member 'ABP_Flashlight_C::Ak_Audio_Flashlight' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, TML_Dissolve_Opacity_Dissolve_7068C5EB4A1893C94229BC944F379432) == 0x000710, "Member 'ABP_Flashlight_C::TML_Dissolve_Opacity_Dissolve_7068C5EB4A1893C94229BC944F379432' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, TML_Dissolve__Direction_7068C5EB4A1893C94229BC944F379432) == 0x000714, "Member 'ABP_Flashlight_C::TML_Dissolve__Direction_7068C5EB4A1893C94229BC944F379432' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, TML_dissolve) == 0x000718, "Member 'ABP_Flashlight_C::TML_dissolve' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, BeamHalfAngleWhenBlinding) == 0x000720, "Member 'ABP_Flashlight_C::BeamHalfAngleWhenBlinding' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, BeamHalfAngleDuringFlash) == 0x000728, "Member 'ABP_Flashlight_C::BeamHalfAngleDuringFlash' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, DebugPrintKey) == 0x000730, "Member 'ABP_Flashlight_C::DebugPrintKey' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, SpotLightHalfAngle) == 0x000738, "Member 'ABP_Flashlight_C::SpotLightHalfAngle' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, BeamSuccessRatio) == 0x000740, "Member 'ABP_Flashlight_C::BeamSuccessRatio' has a wrong offset!");
static_assert(offsetof(ABP_Flashlight_C, SplineMeshBeam) == 0x000748, "Member 'ABP_Flashlight_C::SplineMeshBeam' has a wrong offset!");

}

