#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FirecrackerSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FirecrackerSpawner.BP_FirecrackerSpawner_C.ExecuteUbergraph_BP_FirecrackerSpawner
// 0x0028 (0x0028 - 0x0000)
struct BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner) == 0x000008, "Wrong alignment on BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner");
static_assert(sizeof(BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner) == 0x000028, "Wrong size on BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner");
static_assert(offsetof(BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner, EntryPoint) == 0x000000, "Member 'BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000020, "Member 'BP_FirecrackerSpawner_C_ExecuteUbergraph_BP_FirecrackerSpawner::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

