#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneratorFailSparks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GeneratorFailSparks.BP_GeneratorFailSparks_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_GeneratorFailSparks_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_lightningEndSparks;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_GeneratorFailSparks(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GeneratorFailSparks_C">();
	}
	static class ABP_GeneratorFailSparks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GeneratorFailSparks_C>();
	}
};
static_assert(alignof(ABP_GeneratorFailSparks_C) == 0x000008, "Wrong alignment on ABP_GeneratorFailSparks_C");
static_assert(sizeof(ABP_GeneratorFailSparks_C) == 0x0002B8, "Wrong size on ABP_GeneratorFailSparks_C");
static_assert(offsetof(ABP_GeneratorFailSparks_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_GeneratorFailSparks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorFailSparks_C, P_lightningEndSparks) == 0x0002A8, "Member 'ABP_GeneratorFailSparks_C::P_lightningEndSparks' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorFailSparks_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_GeneratorFailSparks_C::DefaultSceneRoot' has a wrong offset!");

}

