#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneratorEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GeneratorEntity.BP_GeneratorEntity_C
// 0x0048 (0x0318 - 0x02D0)
class ABP_GeneratorEntity_C final : public AGeneratorEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak_Audio_GeneratorEntity;                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Generator_BlockIndicator_Loop;                   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDSkeletalMeshComponentBudgeted*      EntityGenerator;                                   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TML_Smoke_SmokeFade_7FAAA1BD47BA81D06B6C9685CF2A7333; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_Smoke__Direction_7FAAA1BD47BA81D06B6C9685CF2A7333; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_Smoke;                                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TML_Dissolve_Dissolve_Amount_4E1BE6F642432EDDD079C496449B9A69; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_Dissolve__Direction_4E1BE6F642432EDDD079C496449B9A69; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_dissolve;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlockingGenerator;                               // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GeneratorEntity(int32 EntryPoint);
	void MakeEntityAppear();
	void MakeEntityDisappear();
	void MakeSmokeAppear();
	void MakeSmokeDisappear();
	void TML_dissolve__FinishedFunc();
	void TML_dissolve__UpdateFunc();
	void TML_Smoke__FinishedFunc();
	void TML_Smoke__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GeneratorEntity_C">();
	}
	static class ABP_GeneratorEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GeneratorEntity_C>();
	}
};
static_assert(alignof(ABP_GeneratorEntity_C) == 0x000008, "Wrong alignment on ABP_GeneratorEntity_C");
static_assert(sizeof(ABP_GeneratorEntity_C) == 0x000318, "Wrong size on ABP_GeneratorEntity_C");
static_assert(offsetof(ABP_GeneratorEntity_C, UberGraphFrame) == 0x0002D0, "Member 'ABP_GeneratorEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, Ak_Audio_GeneratorEntity) == 0x0002D8, "Member 'ABP_GeneratorEntity_C::Ak_Audio_GeneratorEntity' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, P_Generator_BlockIndicator_Loop) == 0x0002E0, "Member 'ABP_GeneratorEntity_C::P_Generator_BlockIndicator_Loop' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, EntityGenerator) == 0x0002E8, "Member 'ABP_GeneratorEntity_C::EntityGenerator' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, TML_Smoke_SmokeFade_7FAAA1BD47BA81D06B6C9685CF2A7333) == 0x0002F0, "Member 'ABP_GeneratorEntity_C::TML_Smoke_SmokeFade_7FAAA1BD47BA81D06B6C9685CF2A7333' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, TML_Smoke__Direction_7FAAA1BD47BA81D06B6C9685CF2A7333) == 0x0002F4, "Member 'ABP_GeneratorEntity_C::TML_Smoke__Direction_7FAAA1BD47BA81D06B6C9685CF2A7333' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, TML_Smoke) == 0x0002F8, "Member 'ABP_GeneratorEntity_C::TML_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, TML_Dissolve_Dissolve_Amount_4E1BE6F642432EDDD079C496449B9A69) == 0x000300, "Member 'ABP_GeneratorEntity_C::TML_Dissolve_Dissolve_Amount_4E1BE6F642432EDDD079C496449B9A69' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, TML_Dissolve__Direction_4E1BE6F642432EDDD079C496449B9A69) == 0x000304, "Member 'ABP_GeneratorEntity_C::TML_Dissolve__Direction_4E1BE6F642432EDDD079C496449B9A69' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, TML_dissolve) == 0x000308, "Member 'ABP_GeneratorEntity_C::TML_dissolve' has a wrong offset!");
static_assert(offsetof(ABP_GeneratorEntity_C, IsBlockingGenerator) == 0x000310, "Member 'ABP_GeneratorEntity_C::IsBlockingGenerator' has a wrong offset!");

}

