#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HookSurvivor

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_HookSurvivor.BP_HookSurvivor_C.OnInteractionCompletionStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_HookSurvivor_C_OnInteractionCompletionStateChanged final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Complete;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HookSurvivor_C_OnInteractionCompletionStateChanged) == 0x000008, "Wrong alignment on BP_HookSurvivor_C_OnInteractionCompletionStateChanged");
static_assert(sizeof(BP_HookSurvivor_C_OnInteractionCompletionStateChanged) == 0x000010, "Wrong size on BP_HookSurvivor_C_OnInteractionCompletionStateChanged");
static_assert(offsetof(BP_HookSurvivor_C_OnInteractionCompletionStateChanged, Player) == 0x000000, "Member 'BP_HookSurvivor_C_OnInteractionCompletionStateChanged::Player' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_OnInteractionCompletionStateChanged, Complete) == 0x000008, "Member 'BP_HookSurvivor_C_OnInteractionCompletionStateChanged::Complete' has a wrong offset!");

// Function BP_HookSurvivor.BP_HookSurvivor_C.ExecuteUbergraph_BP_HookSurvivor
// 0x0038 (0x0038 - 0x0000)
struct BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_complete;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAudioComponent_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor) == 0x000008, "Wrong alignment on BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor");
static_assert(sizeof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor) == 0x000038, "Wrong size on BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, EntryPoint) == 0x000000, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, K2Node_Event_player) == 0x000008, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, K2Node_Event_complete) == 0x000010, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::K2Node_Event_complete' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, CallFunc_GetAudioComponent_ReturnValue) == 0x000018, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::CallFunc_GetAudioComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, Temp_delegate_Variable) == 0x000020, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor, CallFunc_PostAkEvent_ReturnValue) == 0x000034, "Member 'BP_HookSurvivor_C_ExecuteUbergraph_BP_HookSurvivor::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

