#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ind_Fence02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ind_Fence02.BP_Ind_Fence02_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_Ind_Fence02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_COM_Fence02;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BlinkBlocker;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ind_Fence02_C">();
	}
	static class ABP_Ind_Fence02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ind_Fence02_C>();
	}
};
static_assert(alignof(ABP_Ind_Fence02_C) == 0x000008, "Wrong alignment on ABP_Ind_Fence02_C");
static_assert(sizeof(ABP_Ind_Fence02_C) == 0x0002C0, "Wrong size on ABP_Ind_Fence02_C");
static_assert(offsetof(ABP_Ind_Fence02_C, SM_COM_Fence02) == 0x0002A0, "Member 'ABP_Ind_Fence02_C::SM_COM_Fence02' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Fence02_C, Box) == 0x0002A8, "Member 'ABP_Ind_Fence02_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Fence02_C, BlinkBlocker) == 0x0002B0, "Member 'ABP_Ind_Fence02_C::BlinkBlocker' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Fence02_C, Scene) == 0x0002B8, "Member 'ABP_Ind_Fence02_C::Scene' has a wrong offset!");

}

