#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ind_WL_Br_T01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ind_WL_Br_T01.BP_Ind_WL_Br_T01_C
// 0x0040 (0x02E0 - 0x02A0)
class ABP_Ind_WL_Br_T01_C final : public AActor
{
public:
	class UBoxComponent*                          Box1;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_WL_Br_CapDamage03;                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_WL_Br_CapDamage02;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_WL_Br_CapDamage01;                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WallPipeMetal02;                                // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_Ind_WL_Br_T01;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ind_WL_Br_T01_C">();
	}
	static class ABP_Ind_WL_Br_T01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ind_WL_Br_T01_C>();
	}
};
static_assert(alignof(ABP_Ind_WL_Br_T01_C) == 0x000008, "Wrong alignment on ABP_Ind_WL_Br_T01_C");
static_assert(sizeof(ABP_Ind_WL_Br_T01_C) == 0x0002E0, "Wrong size on ABP_Ind_WL_Br_T01_C");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, Box1) == 0x0002A0, "Member 'ABP_Ind_WL_Br_T01_C::Box1' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, Box) == 0x0002A8, "Member 'ABP_Ind_WL_Br_T01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, SM_Ind_WL_Br_CapDamage03) == 0x0002B0, "Member 'ABP_Ind_WL_Br_T01_C::SM_Ind_WL_Br_CapDamage03' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, SM_Ind_WL_Br_CapDamage02) == 0x0002B8, "Member 'ABP_Ind_WL_Br_T01_C::SM_Ind_WL_Br_CapDamage02' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, SM_Ind_WL_Br_CapDamage01) == 0x0002C0, "Member 'ABP_Ind_WL_Br_T01_C::SM_Ind_WL_Br_CapDamage01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, SM_WallPipeMetal02) == 0x0002C8, "Member 'ABP_Ind_WL_Br_T01_C::SM_WallPipeMetal02' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, HISM_SM_Ind_WL_Br_T01) == 0x0002D0, "Member 'ABP_Ind_WL_Br_T01_C::HISM_SM_Ind_WL_Br_T01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_T01_C, Scene) == 0x0002D8, "Member 'ABP_Ind_WL_Br_T01_C::Scene' has a wrong offset!");

}

