#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ind_Foundry_MoltenBucket

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ind_Foundry_MoltenBucket.BP_Ind_Foundry_MoltenBucket_C
// 0x0068 (0x0308 - 0x02A0)
class ABP_Ind_Foundry_MoltenBucket_C final : public AActor
{
public:
	class UAkComponent*                           Ak_Audio_Emt_Foundry_MetalGroan;                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_09;                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_08;                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_07;                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_06;                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_05;                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_04;                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_03;                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_02;                   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_011;                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_010;                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_Foundry01_MotenBucket_01;                   // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ind_Foundry_MoltenBucket_C">();
	}
	static class ABP_Ind_Foundry_MoltenBucket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ind_Foundry_MoltenBucket_C>();
	}
};
static_assert(alignof(ABP_Ind_Foundry_MoltenBucket_C) == 0x000008, "Wrong alignment on ABP_Ind_Foundry_MoltenBucket_C");
static_assert(sizeof(ABP_Ind_Foundry_MoltenBucket_C) == 0x000308, "Wrong size on ABP_Ind_Foundry_MoltenBucket_C");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, Ak_Audio_Emt_Foundry_MetalGroan) == 0x0002A0, "Member 'ABP_Ind_Foundry_MoltenBucket_C::Ak_Audio_Emt_Foundry_MetalGroan' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_09) == 0x0002A8, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_09' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_08) == 0x0002B0, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_08' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_07) == 0x0002B8, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_07' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_06) == 0x0002C0, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_06' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_05) == 0x0002C8, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_05' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_04) == 0x0002D0, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_04' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_03) == 0x0002D8, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_03' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_02) == 0x0002E0, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_02' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_011) == 0x0002E8, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_011' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_010) == 0x0002F0, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_010' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, SM_Ind_Foundry01_MotenBucket_01) == 0x0002F8, "Member 'ABP_Ind_Foundry_MoltenBucket_C::SM_Ind_Foundry01_MotenBucket_01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Foundry_MoltenBucket_C, DefaultSceneRoot) == 0x000300, "Member 'ABP_Ind_Foundry_MoltenBucket_C::DefaultSceneRoot' has a wrong offset!");

}

