#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IND_MediumTree01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_IND_MediumTree01.BP_IND_MediumTree01_C.Start Sound
// 0x0001 (0x0001 - 0x0000)
struct BP_IND_MediumTree01_C_Start_Sound final
{
public:
	EAkResult                                     Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IND_MediumTree01_C_Start_Sound) == 0x000001, "Wrong alignment on BP_IND_MediumTree01_C_Start_Sound");
static_assert(sizeof(BP_IND_MediumTree01_C_Start_Sound) == 0x000001, "Wrong size on BP_IND_MediumTree01_C_Start_Sound");
static_assert(offsetof(BP_IND_MediumTree01_C_Start_Sound, Result) == 0x000000, "Member 'BP_IND_MediumTree01_C_Start_Sound::Result' has a wrong offset!");

// Function BP_IND_MediumTree01.BP_IND_MediumTree01_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_IND_MediumTree01_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IND_MediumTree01_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_IND_MediumTree01_C_ReceiveEndPlay");
static_assert(sizeof(BP_IND_MediumTree01_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_IND_MediumTree01_C_ReceiveEndPlay");
static_assert(offsetof(BP_IND_MediumTree01_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_IND_MediumTree01_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_IND_MediumTree01.BP_IND_MediumTree01_C.ExecuteUbergraph_BP_IND_MediumTree01
// 0x004C (0x004C - 0x0000)
struct BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkResult Result)>             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkResult Result)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     K2Node_CustomEvent_Result_1;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01) == 0x000004, "Wrong alignment on BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01");
static_assert(sizeof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01) == 0x00004C, "Wrong size on BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, EntryPoint) == 0x000000, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, K2Node_CustomEvent_Result) == 0x000004, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, Temp_delegate_Variable) == 0x000008, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, K2Node_CustomEvent_Result_1) == 0x000044, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, K2Node_Event_EndPlayReason) == 0x000045, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000048, "Member 'BP_IND_MediumTree01_C_ExecuteUbergraph_BP_IND_MediumTree01::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");

// Function BP_IND_MediumTree01.BP_IND_MediumTree01_C.Bank Unloaded
// 0x0001 (0x0001 - 0x0000)
struct BP_IND_MediumTree01_C_Bank_Unloaded final
{
public:
	EAkResult                                     Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IND_MediumTree01_C_Bank_Unloaded) == 0x000001, "Wrong alignment on BP_IND_MediumTree01_C_Bank_Unloaded");
static_assert(sizeof(BP_IND_MediumTree01_C_Bank_Unloaded) == 0x000001, "Wrong size on BP_IND_MediumTree01_C_Bank_Unloaded");
static_assert(offsetof(BP_IND_MediumTree01_C_Bank_Unloaded, Result) == 0x000000, "Member 'BP_IND_MediumTree01_C_Bank_Unloaded::Result' has a wrong offset!");

}

