#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ind_Boulder02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ind_Boulder02.BP_Ind_Boulder02_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_Ind_Boulder02_C final : public AActor
{
public:
	class UConfigurableCollisionComponent*        CharacterBlocker3;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConfigurableCollisionComponent*        CharacterBlocker2;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConfigurableCollisionComponent*        CharacterBlocker1;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Rock06;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner1;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ind_Boulder02_C">();
	}
	static class ABP_Ind_Boulder02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ind_Boulder02_C>();
	}
};
static_assert(alignof(ABP_Ind_Boulder02_C) == 0x000008, "Wrong alignment on ABP_Ind_Boulder02_C");
static_assert(sizeof(ABP_Ind_Boulder02_C) == 0x0002D0, "Wrong size on ABP_Ind_Boulder02_C");
static_assert(offsetof(ABP_Ind_Boulder02_C, CharacterBlocker3) == 0x0002A0, "Member 'ABP_Ind_Boulder02_C::CharacterBlocker3' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Boulder02_C, CharacterBlocker2) == 0x0002A8, "Member 'ABP_Ind_Boulder02_C::CharacterBlocker2' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Boulder02_C, CharacterBlocker1) == 0x0002B0, "Member 'ABP_Ind_Boulder02_C::CharacterBlocker1' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Boulder02_C, SM_COM_Rock06) == 0x0002B8, "Member 'ABP_Ind_Boulder02_C::SM_COM_Rock06' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Boulder02_C, ActorSpawner1) == 0x0002C0, "Member 'ABP_Ind_Boulder02_C::ActorSpawner1' has a wrong offset!");
static_assert(offsetof(ABP_Ind_Boulder02_C, Root) == 0x0002C8, "Member 'ABP_Ind_Boulder02_C::Root' has a wrong offset!");

}

