#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IND_Escape_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_IND_Escape_01.BP_IND_Escape_01_C.UserConstructionScript
// 0x0003 (0x0003 - 0x0000)
struct BP_IND_Escape_01_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IND_Escape_01_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_IND_Escape_01_C_UserConstructionScript");
static_assert(sizeof(BP_IND_Escape_01_C_UserConstructionScript) == 0x000003, "Wrong size on BP_IND_Escape_01_C_UserConstructionScript");
static_assert(offsetof(BP_IND_Escape_01_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_IND_Escape_01_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IND_Escape_01_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000001, "Member 'BP_IND_Escape_01_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IND_Escape_01_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000002, "Member 'BP_IND_Escape_01_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");

}

