#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ind_WL_Br_2mStraight01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ind_WL_Br_2mStraight01.BP_Ind_WL_Br_2mStraight01_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_Ind_WL_Br_2mStraight01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Ind_WL_Br_CapDamage01;                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ind_WL_Br_2mStraight01;                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WallFrameWood01;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WallPipeMetal01;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ind_WL_Br_2mStraight01_C">();
	}
	static class ABP_Ind_WL_Br_2mStraight01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ind_WL_Br_2mStraight01_C>();
	}
};
static_assert(alignof(ABP_Ind_WL_Br_2mStraight01_C) == 0x000008, "Wrong alignment on ABP_Ind_WL_Br_2mStraight01_C");
static_assert(sizeof(ABP_Ind_WL_Br_2mStraight01_C) == 0x0002D0, "Wrong size on ABP_Ind_WL_Br_2mStraight01_C");
static_assert(offsetof(ABP_Ind_WL_Br_2mStraight01_C, SM_Ind_WL_Br_CapDamage01) == 0x0002A0, "Member 'ABP_Ind_WL_Br_2mStraight01_C::SM_Ind_WL_Br_CapDamage01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_2mStraight01_C, SM_Ind_WL_Br_2mStraight01) == 0x0002A8, "Member 'ABP_Ind_WL_Br_2mStraight01_C::SM_Ind_WL_Br_2mStraight01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_2mStraight01_C, Box) == 0x0002B0, "Member 'ABP_Ind_WL_Br_2mStraight01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_2mStraight01_C, SM_WallFrameWood01) == 0x0002B8, "Member 'ABP_Ind_WL_Br_2mStraight01_C::SM_WallFrameWood01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_2mStraight01_C, SM_WallPipeMetal01) == 0x0002C0, "Member 'ABP_Ind_WL_Br_2mStraight01_C::SM_WallPipeMetal01' has a wrong offset!");
static_assert(offsetof(ABP_Ind_WL_Br_2mStraight01_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Ind_WL_Br_2mStraight01_C::DefaultSceneRoot' has a wrong offset!");

}

