#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_K27_BrokenBones_Mori_01_Leg_Female

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_K27_BrokenBones_Mori_01_Leg_Female.BP_K27_BrokenBones_Mori_01_Leg_Female_C.ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female
// 0x0018 (0x0018 - 0x0000)
struct BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_CustomEvent_mesh;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female) == 0x000008, "Wrong alignment on BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female");
static_assert(sizeof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female) == 0x000018, "Wrong size on BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female");
static_assert(offsetof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female, EntryPoint) == 0x000000, "Member 'BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female, K2Node_CustomEvent_mesh) == 0x000008, "Member 'BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female::K2Node_CustomEvent_mesh' has a wrong offset!");
static_assert(offsetof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000011, "Member 'BP_K27_BrokenBones_Mori_01_Leg_Female_C_ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Leg_Female::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

// Function BP_K27_BrokenBones_Mori_01_Leg_Female.BP_K27_BrokenBones_Mori_01_Leg_Female_C.Spawn_BoneOnCamper_02
// 0x0008 (0x0008 - 0x0000)
struct BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02 final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02) == 0x000008, "Wrong alignment on BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02");
static_assert(sizeof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02) == 0x000008, "Wrong size on BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02");
static_assert(offsetof(BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02, Mesh) == 0x000000, "Member 'BP_K27_BrokenBones_Mori_01_Leg_Female_C_Spawn_BoneOnCamper_02::Mesh' has a wrong offset!");

}

