#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_k27_MiniMori_Vignette

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_k27_MiniMori_Vignette.BP_k27_MiniMori_Vignette_C
// 0x0038 (0x02D8 - 0x02A0)
class ABP_k27_MiniMori_Vignette_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  Actor_PostProcess_K27_MiniMori;                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TML_PP_MiniMori_StaticVisibility_A1A82C3541163EFF5F1708927D275561; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TML_PP_MiniMori_Int_Vignette_A1A82C3541163EFF5F1708927D275561; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_PP_MiniMori__Direction_A1A82C3541163EFF5F1708927D275561; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_PP_MiniMori;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PP_K27_MiniMori;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Add_PP_MiniMori();
	void ExecuteUbergraph_BP_k27_MiniMori_Vignette(int32 EntryPoint);
	void TML_PP_MiniMori__FinishedFunc();
	void TML_PP_MiniMori__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_k27_MiniMori_Vignette_C">();
	}
	static class ABP_k27_MiniMori_Vignette_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_k27_MiniMori_Vignette_C>();
	}
};
static_assert(alignof(ABP_k27_MiniMori_Vignette_C) == 0x000008, "Wrong alignment on ABP_k27_MiniMori_Vignette_C");
static_assert(sizeof(ABP_k27_MiniMori_Vignette_C) == 0x0002D8, "Wrong size on ABP_k27_MiniMori_Vignette_C");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_k27_MiniMori_Vignette_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, Actor_PostProcess_K27_MiniMori) == 0x0002A8, "Member 'ABP_k27_MiniMori_Vignette_C::Actor_PostProcess_K27_MiniMori' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_k27_MiniMori_Vignette_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, TML_PP_MiniMori_StaticVisibility_A1A82C3541163EFF5F1708927D275561) == 0x0002B8, "Member 'ABP_k27_MiniMori_Vignette_C::TML_PP_MiniMori_StaticVisibility_A1A82C3541163EFF5F1708927D275561' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, TML_PP_MiniMori_Int_Vignette_A1A82C3541163EFF5F1708927D275561) == 0x0002BC, "Member 'ABP_k27_MiniMori_Vignette_C::TML_PP_MiniMori_Int_Vignette_A1A82C3541163EFF5F1708927D275561' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, TML_PP_MiniMori__Direction_A1A82C3541163EFF5F1708927D275561) == 0x0002C0, "Member 'ABP_k27_MiniMori_Vignette_C::TML_PP_MiniMori__Direction_A1A82C3541163EFF5F1708927D275561' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, TML_PP_MiniMori) == 0x0002C8, "Member 'ABP_k27_MiniMori_Vignette_C::TML_PP_MiniMori' has a wrong offset!");
static_assert(offsetof(ABP_k27_MiniMori_Vignette_C, PP_K27_MiniMori) == 0x0002D0, "Member 'ABP_k27_MiniMori_Vignette_C::PP_K27_MiniMori' has a wrong offset!");

}

