#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_K27_BrokenBones_Mori_01_Arm_Male

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_K27_BrokenBones_Mori_01_Arm_Male.BP_K27_BrokenBones_Mori_01_Arm_Male_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_K27_BrokenBones_Mori_01_Arm_Male_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDSkeletalMeshComponentBudgeted*      K27_Bone_02Mesh;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDSkeletalMeshComponentBudgeted*      K27_BoneMesh;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_K27_BrokenBones_Mori_01_Arm_Male(int32 EntryPoint);
	void Spawn_BoneOnCamper_01(class USkeletalMeshComponent* Mesh);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_K27_BrokenBones_Mori_01_Arm_Male_C">();
	}
	static class ABP_K27_BrokenBones_Mori_01_Arm_Male_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_K27_BrokenBones_Mori_01_Arm_Male_C>();
	}
};
static_assert(alignof(ABP_K27_BrokenBones_Mori_01_Arm_Male_C) == 0x000008, "Wrong alignment on ABP_K27_BrokenBones_Mori_01_Arm_Male_C");
static_assert(sizeof(ABP_K27_BrokenBones_Mori_01_Arm_Male_C) == 0x0002C0, "Wrong size on ABP_K27_BrokenBones_Mori_01_Arm_Male_C");
static_assert(offsetof(ABP_K27_BrokenBones_Mori_01_Arm_Male_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_K27_BrokenBones_Mori_01_Arm_Male_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_K27_BrokenBones_Mori_01_Arm_Male_C, K27_Bone_02Mesh) == 0x0002A8, "Member 'ABP_K27_BrokenBones_Mori_01_Arm_Male_C::K27_Bone_02Mesh' has a wrong offset!");
static_assert(offsetof(ABP_K27_BrokenBones_Mori_01_Arm_Male_C, K27_BoneMesh) == 0x0002B0, "Member 'ABP_K27_BrokenBones_Mori_01_Arm_Male_C::K27_BoneMesh' has a wrong offset!");
static_assert(offsetof(ABP_K27_BrokenBones_Mori_01_Arm_Male_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_K27_BrokenBones_Mori_01_Arm_Male_C::DefaultSceneRoot' has a wrong offset!");

}

