#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_K34TipToeDistraction

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_K34TipToeDistraction.BP_K34TipToeDistraction_C.ExecuteUbergraph_BP_K34TipToeDistraction
// 0x0030 (0x0030 - 0x0000)
struct BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction) == 0x000008, "Wrong alignment on BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction");
static_assert(sizeof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction) == 0x000030, "Wrong size on BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, EntryPoint) == 0x000000, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_GetPerkManager_ReturnValue) == 0x000010, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_HasPerkFlag_ReturnValue) == 0x000018, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_GetLocallyObservedCharacter_ReturnValue) == 0x000020, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_GetLocallyObservedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'BP_K34TipToeDistraction_C_ExecuteUbergraph_BP_K34TipToeDistraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

