#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_K23_ShowKnife_OnSurvivor_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_K23_ShowKnife_OnSurvivor_Master.BP_K23_ShowKnife_OnSurvivor_Master_C
// 0x0060 (0x0300 - 0x02A0)
class ABP_K23_ShowKnife_OnSurvivor_Master_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TML_ShowKnife__Direction_AA84A2734AF05F9099782F8D5F81D81C; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TML_ShowKnife;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_01_C*      KnifeHit_01;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_02;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_03;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_04;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_05;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_06;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_07;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_K23_ShowKnife_OnSurvivor_02_C*      KnifeHit_08;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_K23_ShowKnife_OnSurvivor_Master(int32 EntryPoint);
	void ShowKnife_OnSurvivor(class USkeletalMeshComponent* Mesh);
	void TML_ShowKnife__FinishedFunc();
	void TML_ShowKnife__ShowKnifeHit_01__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_02__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_03__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_04__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_05__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_06__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_07__EventFunc();
	void TML_ShowKnife__ShowKnifeHit_08__EventFunc();
	void TML_ShowKnife__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_K23_ShowKnife_OnSurvivor_Master_C">();
	}
	static class ABP_K23_ShowKnife_OnSurvivor_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_K23_ShowKnife_OnSurvivor_Master_C>();
	}
};
static_assert(alignof(ABP_K23_ShowKnife_OnSurvivor_Master_C) == 0x000008, "Wrong alignment on ABP_K23_ShowKnife_OnSurvivor_Master_C");
static_assert(sizeof(ABP_K23_ShowKnife_OnSurvivor_Master_C) == 0x000300, "Wrong size on ABP_K23_ShowKnife_OnSurvivor_Master_C");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, TML_ShowKnife__Direction_AA84A2734AF05F9099782F8D5F81D81C) == 0x0002B0, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::TML_ShowKnife__Direction_AA84A2734AF05F9099782F8D5F81D81C' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, TML_ShowKnife) == 0x0002B8, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::TML_ShowKnife' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_01) == 0x0002C0, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_01' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_02) == 0x0002C8, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_02' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_03) == 0x0002D0, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_03' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_04) == 0x0002D8, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_04' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_05) == 0x0002E0, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_05' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_06) == 0x0002E8, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_06' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_07) == 0x0002F0, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_07' has a wrong offset!");
static_assert(offsetof(ABP_K23_ShowKnife_OnSurvivor_Master_C, KnifeHit_08) == 0x0002F8, "Member 'ABP_K23_ShowKnife_OnSurvivor_Master_C::KnifeHit_08' has a wrong offset!");

}

