#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Key

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Key.BP_Key_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Key_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Key_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Key_C_ReceiveEndPlay");
static_assert(sizeof(BP_Key_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Key_C_ReceiveEndPlay");
static_assert(offsetof(BP_Key_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Key_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Key.BP_Key_C.OnDropped
// 0x0008 (0x0008 - 0x0000)
struct BP_Key_C_OnDropped final
{
public:
	class ADBDPlayer*                             DroppingPlayer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Key_C_OnDropped) == 0x000008, "Wrong alignment on BP_Key_C_OnDropped");
static_assert(sizeof(BP_Key_C_OnDropped) == 0x000008, "Wrong size on BP_Key_C_OnDropped");
static_assert(offsetof(BP_Key_C_OnDropped, DroppingPlayer) == 0x000000, "Member 'BP_Key_C_OnDropped::DroppingPlayer' has a wrong offset!");

// Function BP_Key.BP_Key_C.ExecuteUbergraph_BP_Key
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Key_C_ExecuteUbergraph_BP_Key final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Empty;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_droppingPlayer;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Key_C_ExecuteUbergraph_BP_Key) == 0x000010, "Wrong alignment on BP_Key_C_ExecuteUbergraph_BP_Key");
static_assert(sizeof(BP_Key_C_ExecuteUbergraph_BP_Key) == 0x0000D0, "Wrong size on BP_Key_C_ExecuteUbergraph_BP_Key");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, EntryPoint) == 0x000000, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, Temp_delegate_Variable) == 0x000004, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, Temp_struct_Variable) == 0x000020, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, K2Node_ComponentBoundEvent_Empty) == 0x000080, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::K2Node_ComponentBoundEvent_Empty' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_AddComponent_ReturnValue) == 0x000088, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, K2Node_Event_droppingPlayer) == 0x000098, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::K2Node_Event_droppingPlayer' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A0, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_PostAkEvent_ReturnValue) == 0x0000B8, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000C0, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_BooleanAND_ReturnValue) == 0x0000C8, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_HasAuthority_ReturnValue) == 0x0000C9, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, K2Node_Event_EndPlayReason) == 0x0000CA, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Key_C_ExecuteUbergraph_BP_Key, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CB, "Member 'BP_Key_C_ExecuteUbergraph_BP_Key::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_Key.BP_Key_C.BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature final
{
public:
	bool                                          Empty;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature");
static_assert(sizeof(BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature");
static_assert(offsetof(BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature, Empty) == 0x000000, "Member 'BP_Key_C_BndEvt__Charger_K2Node_ComponentBoundEvent_150_ChargeStateChangeDelegate__DelegateSignature::Empty' has a wrong offset!");

// Function BP_Key.BP_Key_C.Authority_UseCharge
// 0x0010 (0x0010 - 0x0000)
struct BP_Key_C_Authority_UseCharge final
{
public:
	double                                        ChargeToUse;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UseEnergy_seconds_ImplicitCast;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Key_C_Authority_UseCharge) == 0x000008, "Wrong alignment on BP_Key_C_Authority_UseCharge");
static_assert(sizeof(BP_Key_C_Authority_UseCharge) == 0x000010, "Wrong size on BP_Key_C_Authority_UseCharge");
static_assert(offsetof(BP_Key_C_Authority_UseCharge, ChargeToUse) == 0x000000, "Member 'BP_Key_C_Authority_UseCharge::ChargeToUse' has a wrong offset!");
static_assert(offsetof(BP_Key_C_Authority_UseCharge, CallFunc_UseEnergy_seconds_ImplicitCast) == 0x000008, "Member 'BP_Key_C_Authority_UseCharge::CallFunc_UseEnergy_seconds_ImplicitCast' has a wrong offset!");

// Function BP_Key.BP_Key_C.GetUsePercentLeft
// 0x0008 (0x0008 - 0x0000)
struct BP_Key_C_GetUsePercentLeft final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedEnergyLevel_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Key_C_GetUsePercentLeft) == 0x000004, "Wrong alignment on BP_Key_C_GetUsePercentLeft");
static_assert(sizeof(BP_Key_C_GetUsePercentLeft) == 0x000008, "Wrong size on BP_Key_C_GetUsePercentLeft");
static_assert(offsetof(BP_Key_C_GetUsePercentLeft, ReturnValue) == 0x000000, "Member 'BP_Key_C_GetUsePercentLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Key_C_GetUsePercentLeft, CallFunc_GetNormalizedEnergyLevel_ReturnValue) == 0x000004, "Member 'BP_Key_C_GetUsePercentLeft::CallFunc_GetNormalizedEnergyLevel_ReturnValue' has a wrong offset!");

}

