#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoudNoiseLevelObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LoudNoiseLevelObject.BP_LoudNoiseLevelObject_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_LoudNoiseLevelObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        ThresholdUntilDestroy;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_LoudNoiseLevelObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LoudNoiseLevelObject_C">();
	}
	static class ABP_LoudNoiseLevelObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LoudNoiseLevelObject_C>();
	}
};
static_assert(alignof(ABP_LoudNoiseLevelObject_C) == 0x000008, "Wrong alignment on ABP_LoudNoiseLevelObject_C");
static_assert(sizeof(ABP_LoudNoiseLevelObject_C) == 0x0002B8, "Wrong size on ABP_LoudNoiseLevelObject_C");
static_assert(offsetof(ABP_LoudNoiseLevelObject_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_LoudNoiseLevelObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LoudNoiseLevelObject_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_LoudNoiseLevelObject_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LoudNoiseLevelObject_C, ThresholdUntilDestroy) == 0x0002B0, "Member 'ABP_LoudNoiseLevelObject_C::ThresholdUntilDestroy' has a wrong offset!");

}

