#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LM_WaterTower01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LM_WaterTower01.BP_LM_WaterTower01_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_LM_WaterTower01_C final : public AActor
{
public:
	class UChildActorComponent*                   BP_SM_LM_WaterTower01_Wall01;                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_SM_LM_WaterTower01_Floor01;                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LM_WaterTower01;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LM_WaterTower01_C">();
	}
	static class ABP_LM_WaterTower01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LM_WaterTower01_C>();
	}
};
static_assert(alignof(ABP_LM_WaterTower01_C) == 0x000008, "Wrong alignment on ABP_LM_WaterTower01_C");
static_assert(sizeof(ABP_LM_WaterTower01_C) == 0x0002C0, "Wrong size on ABP_LM_WaterTower01_C");
static_assert(offsetof(ABP_LM_WaterTower01_C, BP_SM_LM_WaterTower01_Wall01) == 0x0002A0, "Member 'ABP_LM_WaterTower01_C::BP_SM_LM_WaterTower01_Wall01' has a wrong offset!");
static_assert(offsetof(ABP_LM_WaterTower01_C, BP_SM_LM_WaterTower01_Floor01) == 0x0002A8, "Member 'ABP_LM_WaterTower01_C::BP_SM_LM_WaterTower01_Floor01' has a wrong offset!");
static_assert(offsetof(ABP_LM_WaterTower01_C, SM_LM_WaterTower01) == 0x0002B0, "Member 'ABP_LM_WaterTower01_C::SM_LM_WaterTower01' has a wrong offset!");
static_assert(offsetof(ABP_LM_WaterTower01_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_LM_WaterTower01_C::DefaultSceneRoot' has a wrong offset!");

}

