#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoudNoiseLevelObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LoudNoiseLevelObject.BP_LoudNoiseLevelObject_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LoudNoiseLevelObject_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoudNoiseLevelObject_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LoudNoiseLevelObject_C_ReceiveTick");
static_assert(sizeof(BP_LoudNoiseLevelObject_C_ReceiveTick) == 0x000004, "Wrong size on BP_LoudNoiseLevelObject_C_ReceiveTick");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LoudNoiseLevelObject_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LoudNoiseLevelObject.BP_LoudNoiseLevelObject_C.ExecuteUbergraph_BP_LoudNoiseLevelObject
// 0x00A8 (0x00A8 - 0x0000)
struct BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Less_FloatFloat_B_ImplicitCast;           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Less_FloatFloat_A_ImplicitCast;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject) == 0x000008, "Wrong alignment on BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject");
static_assert(sizeof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject) == 0x0000A8, "Wrong size on BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, EntryPoint) == 0x000000, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_GetLocallyObservedCharacter_ReturnValue) == 0x000008, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_GetLocallyObservedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_GetLocallyObservedCharacter_ReturnValue_1) == 0x000010, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_GetLocallyObservedCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, K2Node_DynamicCast_AsSlasher_Player) == 0x000020, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, K2Node_DynamicCast_AsCamper_Player) == 0x000030, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, K2Node_Event_DeltaSeconds) == 0x000058, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_VSize_ReturnValue) == 0x000090, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_Less_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_Less_FloatFloat_B_ImplicitCast) == 0x00009C, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_Less_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject, CallFunc_Less_FloatFloat_A_ImplicitCast) == 0x0000A0, "Member 'BP_LoudNoiseLevelObject_C_ExecuteUbergraph_BP_LoudNoiseLevelObject::CallFunc_Less_FloatFloat_A_ImplicitCast' has a wrong offset!");

}

