#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightsOnInBox_Fade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LightsOnInBox_Fade.BP_LightsOnInBox_Fade_C.GetPointToTestAgainstBox
// 0x00A8 (0x00A8 - 0x0000)
struct BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayerControllerBase*               CallFunc_GetLocalDBDPlayerController_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox) == 0x000008, "Wrong alignment on BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox");
static_assert(sizeof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox) == 0x0000A8, "Wrong size on BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, Point) == 0x000000, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::Point' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_GetCameraLocation_ReturnValue) == 0x000028, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000040, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_GetLocalDBDPlayerController_ReturnValue) == 0x000048, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_GetLocalDBDPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_K2_GetPawn_ReturnValue) == 0x000058, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_GetObjectClass_ReturnValue) == 0x000080, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_IsValid_ReturnValue_3) == 0x000088, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000089, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_BooleanAND_ReturnValue) == 0x00008A, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox, CallFunc_GetCameraLocation_ReturnValue_1) == 0x000090, "Member 'BP_LightsOnInBox_Fade_C_GetPointToTestAgainstBox::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");

// Function BP_LightsOnInBox_Fade.BP_LightsOnInBox_Fade_C.ExecuteUbergraph_BP_LightsOnInBox_Fade
// 0x0100 (0x0100 - 0x0000)
struct BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPointToTestAgainstBox_Point;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue;    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDGameState*                          CallFunc_GetDBDGameState_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelReadyToPlay_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade) == 0x000010, "Wrong alignment on BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade");
static_assert(sizeof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade) == 0x000100, "Wrong size on BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, EntryPoint) == 0x000000, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_GetPointToTestAgainstBox_Point) == 0x000008, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_GetPointToTestAgainstBox_Point' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x000028, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_IsPointInBoxWithTransform_ReturnValue) == 0x0000A4, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_IsPointInBoxWithTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_GetDBDGameState_ReturnValue) == 0x0000B0, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_GetDBDGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_IsLevelReadyToPlay_ReturnValue) == 0x0000B8, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_IsLevelReadyToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Lerp_ReturnValue) == 0x0000D0, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0000E0, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_Lerp_B_ImplicitCast) == 0x0000E8, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x0000F0, "Member 'BP_LightsOnInBox_Fade_C_ExecuteUbergraph_BP_LightsOnInBox_Fade::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");

// Function BP_LightsOnInBox_Fade.BP_LightsOnInBox_Fade_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LightsOnInBox_Fade_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightsOnInBox_Fade_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LightsOnInBox_Fade_C_ReceiveTick");
static_assert(sizeof(BP_LightsOnInBox_Fade_C_ReceiveTick) == 0x000004, "Wrong size on BP_LightsOnInBox_Fade_C_ReceiveTick");
static_assert(offsetof(BP_LightsOnInBox_Fade_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LightsOnInBox_Fade_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

