#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lightbulb

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lightbulb.BP_Lightbulb_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_Lightbulb_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_LightSourceFx;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lightbull_01;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lightbulb_C">();
	}
	static class ABP_Lightbulb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lightbulb_C>();
	}
};
static_assert(alignof(ABP_Lightbulb_C) == 0x000008, "Wrong alignment on ABP_Lightbulb_C");
static_assert(sizeof(ABP_Lightbulb_C) == 0x0002B8, "Wrong size on ABP_Lightbulb_C");
static_assert(offsetof(ABP_Lightbulb_C, SpotLight) == 0x0002A0, "Member 'ABP_Lightbulb_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Lightbulb_C, P_LightSourceFx) == 0x0002A8, "Member 'ABP_Lightbulb_C::P_LightSourceFx' has a wrong offset!");
static_assert(offsetof(ABP_Lightbulb_C, SM_Lightbull_01) == 0x0002B0, "Member 'ABP_Lightbulb_C::SM_Lightbull_01' has a wrong offset!");

}

