#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelCrow

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelCrow.BP_LevelCrow_C
// 0x0040 (0x02E0 - 0x02A0)
class ABP_LevelCrow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USleepingSkinnedMeshRegisterer*         SleepingSkinnedMeshRegisterer;                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCrowTriggerComponent_C*                CrowTriggerComponent;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_Crow;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULevelCrowMeshComponent_C*              LevelCrowMeshComponent;                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       ConditionalTakeoffRange;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AutoTakeoffRange;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void OnTriggerReset_Event_0();
	void OnTriggered_Event_0(class AActor* Param_Instigator, const struct FVector& Location);
	double GetLandingDuration();
	void ExecuteUbergraph_BP_LevelCrow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LevelCrow_C">();
	}
	static class ABP_LevelCrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelCrow_C>();
	}
};
static_assert(alignof(ABP_LevelCrow_C) == 0x000008, "Wrong alignment on ABP_LevelCrow_C");
static_assert(sizeof(ABP_LevelCrow_C) == 0x0002E0, "Wrong size on ABP_LevelCrow_C");
static_assert(offsetof(ABP_LevelCrow_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_LevelCrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, SleepingSkinnedMeshRegisterer) == 0x0002A8, "Member 'ABP_LevelCrow_C::SleepingSkinnedMeshRegisterer' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, CrowTriggerComponent) == 0x0002B0, "Member 'ABP_LevelCrow_C::CrowTriggerComponent' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, Ak_Audio_Crow) == 0x0002B8, "Member 'ABP_LevelCrow_C::Ak_Audio_Crow' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, LevelCrowMeshComponent) == 0x0002C0, "Member 'ABP_LevelCrow_C::LevelCrowMeshComponent' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, ConditionalTakeoffRange) == 0x0002C8, "Member 'ABP_LevelCrow_C::ConditionalTakeoffRange' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, AutoTakeoffRange) == 0x0002D0, "Member 'ABP_LevelCrow_C::AutoTakeoffRange' has a wrong offset!");
static_assert(offsetof(ABP_LevelCrow_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_LevelCrow_C::DefaultSceneRoot' has a wrong offset!");

}

