#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoudNoise

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LoudNoise.BP_LoudNoise_C.ExecuteUbergraph_BP_LoudNoise
// 0x001C (0x001C - 0x0000)
struct BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise) == 0x000004, "Wrong alignment on BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise");
static_assert(sizeof(BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise) == 0x00001C, "Wrong size on BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise");
static_assert(offsetof(BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise, EntryPoint) == 0x000000, "Member 'BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise, Temp_delegate_Variable) == 0x000004, "Member 'BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise, CallFunc_PostAkEvent_ReturnValue) == 0x000018, "Member 'BP_LoudNoise_C_ExecuteUbergraph_BP_LoudNoise::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

