#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LogPile01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LogPile01.BP_LogPile01_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_LogPile01_C final : public AActor
{
public:
	class UBoxComponent*                          WoodPileColl;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LogPile_01;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LogPile01_C">();
	}
	static class ABP_LogPile01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LogPile01_C>();
	}
};
static_assert(alignof(ABP_LogPile01_C) == 0x000008, "Wrong alignment on ABP_LogPile01_C");
static_assert(sizeof(ABP_LogPile01_C) == 0x0002B8, "Wrong size on ABP_LogPile01_C");
static_assert(offsetof(ABP_LogPile01_C, WoodPileColl) == 0x0002A0, "Member 'ABP_LogPile01_C::WoodPileColl' has a wrong offset!");
static_assert(offsetof(ABP_LogPile01_C, SM_LogPile_01) == 0x0002A8, "Member 'ABP_LogPile01_C::SM_LogPile_01' has a wrong offset!");
static_assert(offsetof(ABP_LogPile01_C, Root) == 0x0002B0, "Member 'ABP_LogPile01_C::Root' has a wrong offset!");

}

