#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightsOnInBox_Fade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LightsOnInBox_Fade.BP_LightsOnInBox_Fade_C
// 0x0030 (0x02F8 - 0x02C8)
class ABP_LightsOnInBox_Fade_C final : public AMultipleLightsFader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InfluenceBox;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FAdeIn_30DB78634D87B6E702B7D8B81F1415FC; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_30DB78634D87B6E702B7D8B81F1415FC; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     Fade;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void ReceiveBeginPlay();
	void GetPointToTestAgainstBox(struct FVector* Point);
	void ExecuteUbergraph_BP_LightsOnInBox_Fade(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LightsOnInBox_Fade_C">();
	}
	static class ABP_LightsOnInBox_Fade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LightsOnInBox_Fade_C>();
	}
};
static_assert(alignof(ABP_LightsOnInBox_Fade_C) == 0x000008, "Wrong alignment on ABP_LightsOnInBox_Fade_C");
static_assert(sizeof(ABP_LightsOnInBox_Fade_C) == 0x0002F8, "Wrong size on ABP_LightsOnInBox_Fade_C");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_LightsOnInBox_Fade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, Billboard) == 0x0002D0, "Member 'ABP_LightsOnInBox_Fade_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, InfluenceBox) == 0x0002D8, "Member 'ABP_LightsOnInBox_Fade_C::InfluenceBox' has a wrong offset!");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, Timeline_0_FAdeIn_30DB78634D87B6E702B7D8B81F1415FC) == 0x0002E0, "Member 'ABP_LightsOnInBox_Fade_C::Timeline_0_FAdeIn_30DB78634D87B6E702B7D8B81F1415FC' has a wrong offset!");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, Timeline_0__Direction_30DB78634D87B6E702B7D8B81F1415FC) == 0x0002E4, "Member 'ABP_LightsOnInBox_Fade_C::Timeline_0__Direction_30DB78634D87B6E702B7D8B81F1415FC' has a wrong offset!");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, Timeline_0) == 0x0002E8, "Member 'ABP_LightsOnInBox_Fade_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_LightsOnInBox_Fade_C, Fade) == 0x0002F0, "Member 'ABP_LightsOnInBox_Fade_C::Fade' has a wrong offset!");

}

