#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mori_StatusEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mori_StatusEffect.BP_Mori_StatusEffect_C.ExecuteUbergraph_BP_Mori_StatusEffect
// 0x0050 (0x0050 - 0x0000)
struct BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConditionReceiver>    CallFunc_Or_conditionReceiver_CastInput;           // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UOrModifierCondition*                   CallFunc_Or_ReturnValue;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEventDrivenModifierCondition*          CallFunc_CreateAndReceiveConditionForBP_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEventDrivenModifierCondition*          CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect) == 0x000008, "Wrong alignment on BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect");
static_assert(sizeof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect) == 0x000050, "Wrong size on BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, EntryPoint) == 0x000000, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, CallFunc_Or_conditionReceiver_CastInput) == 0x000008, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::CallFunc_Or_conditionReceiver_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, CallFunc_Or_ReturnValue) == 0x000018, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::CallFunc_Or_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput) == 0x000020, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, CallFunc_CreateAndReceiveConditionForBP_ReturnValue) == 0x000030, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::CallFunc_CreateAndReceiveConditionForBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1) == 0x000038, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect, CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1) == 0x000048, "Member 'BP_Mori_StatusEffect_C_ExecuteUbergraph_BP_Mori_StatusEffect::CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1' has a wrong offset!");

}

