#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeatLocker01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MeatHook_Shared_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeatLocker01.BP_MeatLocker01_C
// 0x0050 (0x0840 - 0x07F0)
class ABP_MeatLocker01_C : public ABP_MeatHook_Shared_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MeatLocker01_C;                  // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        UnhookSnapPoint_005;                               // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        UnhookSnapPoint_004;                               // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        UnhookSnapPoint_003;                               // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        UnhookSnapPoint_002;                               // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        UnhookSnapPoint_001;                               // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          MapActorPrimitive;                                 // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   HookSocketName;                                    // 0x0830(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnOwnerReplicated();
	void TrySetMapActor();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_MeatLocker01(int32 EntryPoint);

	void GetMesh(class USkeletalMeshComponent** Mesh) const;
	struct FVector GetHookPosition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MeatLocker01_C">();
	}
	static class ABP_MeatLocker01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MeatLocker01_C>();
	}
};
static_assert(alignof(ABP_MeatLocker01_C) == 0x000008, "Wrong alignment on ABP_MeatLocker01_C");
static_assert(sizeof(ABP_MeatLocker01_C) == 0x000840, "Wrong size on ABP_MeatLocker01_C");
static_assert(offsetof(ABP_MeatLocker01_C, UberGraphFrame_BP_MeatLocker01_C) == 0x0007F0, "Member 'ABP_MeatLocker01_C::UberGraphFrame_BP_MeatLocker01_C' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, UnhookSnapPoint_005) == 0x0007F8, "Member 'ABP_MeatLocker01_C::UnhookSnapPoint_005' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, UnhookSnapPoint_004) == 0x000800, "Member 'ABP_MeatLocker01_C::UnhookSnapPoint_004' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, UnhookSnapPoint_003) == 0x000808, "Member 'ABP_MeatLocker01_C::UnhookSnapPoint_003' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, UnhookSnapPoint_002) == 0x000810, "Member 'ABP_MeatLocker01_C::UnhookSnapPoint_002' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, UnhookSnapPoint_001) == 0x000818, "Member 'ABP_MeatLocker01_C::UnhookSnapPoint_001' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, MapActorPrimitive) == 0x000820, "Member 'ABP_MeatLocker01_C::MapActorPrimitive' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, Arrow) == 0x000828, "Member 'ABP_MeatLocker01_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_MeatLocker01_C, HookSocketName) == 0x000830, "Member 'ABP_MeatLocker01_C::HookSocketName' has a wrong offset!");

}

