#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeatLockerBasement03

#include "Basic.hpp"

#include "BP_MeatLocker01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeatLockerBasement03.BP_MeatLockerBasement03_C
// 0x0018 (0x0858 - 0x0840)
class ABP_MeatLockerBasement03_C final : public ABP_MeatLocker01_C
{
public:
	class UDBDSkeletalMeshComponentBudgeted*      SK_BasementDeerHangerMesh;                         // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USleepingSkinnedMeshRegisterer*         SleepingSkinnedMeshRegisterer;                     // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Entity;                                            // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void GetMesh(class USkeletalMeshComponent** Mesh) const;
	class AEntity* GetEntity() const;
	class UAnimInstance* GetAnimInstance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MeatLockerBasement03_C">();
	}
	static class ABP_MeatLockerBasement03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MeatLockerBasement03_C>();
	}
};
static_assert(alignof(ABP_MeatLockerBasement03_C) == 0x000008, "Wrong alignment on ABP_MeatLockerBasement03_C");
static_assert(sizeof(ABP_MeatLockerBasement03_C) == 0x000858, "Wrong size on ABP_MeatLockerBasement03_C");
static_assert(offsetof(ABP_MeatLockerBasement03_C, SK_BasementDeerHangerMesh) == 0x000840, "Member 'ABP_MeatLockerBasement03_C::SK_BasementDeerHangerMesh' has a wrong offset!");
static_assert(offsetof(ABP_MeatLockerBasement03_C, SleepingSkinnedMeshRegisterer) == 0x000848, "Member 'ABP_MeatLockerBasement03_C::SleepingSkinnedMeshRegisterer' has a wrong offset!");
static_assert(offsetof(ABP_MeatLockerBasement03_C, Entity) == 0x000850, "Member 'ABP_MeatLockerBasement03_C::Entity' has a wrong offset!");

}

