#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeatHook_Shared

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_UserConstructionScript final
{
public:
	class UCharacterPusherComponent*              CallFunc_GetCharacterPusher_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_UserConstructionScript");
static_assert(sizeof(BP_MeatHook_Shared_C_UserConstructionScript) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_UserConstructionScript");
static_assert(offsetof(BP_MeatHook_Shared_C_UserConstructionScript, CallFunc_GetCharacterPusher_ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_UserConstructionScript::CallFunc_GetCharacterPusher_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.UpdateStrugglePercent
// 0x0010 (0x0010 - 0x0000)
struct BP_MeatHook_Shared_C_UpdateStrugglePercent final
{
public:
	class AEntity*                                CallFunc_GetEntity_ReturnValue;                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStrugglePercent_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_UpdateStrugglePercent) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_UpdateStrugglePercent");
static_assert(sizeof(BP_MeatHook_Shared_C_UpdateStrugglePercent) == 0x000010, "Wrong size on BP_MeatHook_Shared_C_UpdateStrugglePercent");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateStrugglePercent, CallFunc_GetEntity_ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_UpdateStrugglePercent::CallFunc_GetEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateStrugglePercent, CallFunc_GetStrugglePercent_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_UpdateStrugglePercent::CallFunc_GetStrugglePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateStrugglePercent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_MeatHook_Shared_C_UpdateStrugglePercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.UpdateIK
// 0x00E0 (0x00E0 - 0x0000)
struct BP_MeatHook_Shared_C_UpdateIK final
{
public:
	class ACamperPlayer*                          CallFunc_GetHookedCamper_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_UpdateIK) == 0x000010, "Wrong alignment on BP_MeatHook_Shared_C_UpdateIK");
static_assert(sizeof(BP_MeatHook_Shared_C_UpdateIK) == 0x0000E0, "Wrong size on BP_MeatHook_Shared_C_UpdateIK");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateIK, CallFunc_GetHookedCamper_ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_UpdateIK::CallFunc_GetHookedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateIK, CallFunc_GetEntity_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_UpdateIK::CallFunc_GetEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateIK, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_UpdateIK::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateIK, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'BP_MeatHook_Shared_C_UpdateIK::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_UpdateIK, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000080, "Member 'BP_MeatHook_Shared_C_UpdateIK::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.SurvivorHooking
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_SurvivorHooking final
{
public:
	class ACamperPlayer*                          CallFunc_GetHookedCamper_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_SurvivorHooking) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_SurvivorHooking");
static_assert(sizeof(BP_MeatHook_Shared_C_SurvivorHooking) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_SurvivorHooking");
static_assert(offsetof(BP_MeatHook_Shared_C_SurvivorHooking, CallFunc_GetHookedCamper_ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_SurvivorHooking::CallFunc_GetHookedCamper_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.SetIsStrugglingAnims
// 0x0010 (0x0010 - 0x0000)
struct BP_MeatHook_Shared_C_SetIsStrugglingAnims final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEntity*                                CallFunc_GetEntity_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_SetIsStrugglingAnims) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_SetIsStrugglingAnims");
static_assert(sizeof(BP_MeatHook_Shared_C_SetIsStrugglingAnims) == 0x000010, "Wrong size on BP_MeatHook_Shared_C_SetIsStrugglingAnims");
static_assert(offsetof(BP_MeatHook_Shared_C_SetIsStrugglingAnims, Value) == 0x000000, "Member 'BP_MeatHook_Shared_C_SetIsStrugglingAnims::Value' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_SetIsStrugglingAnims, CallFunc_GetEntity_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_SetIsStrugglingAnims::CallFunc_GetEntity_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.SetCamperCameraMode
// 0x0018 (0x0018 - 0x0000)
struct BP_MeatHook_Shared_C_SetCamperCameraMode final
{
public:
	EDBDCameraSocketID                            SocketId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideVignette;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideVignetteHook;                                  // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Camper_Character_C*                 CallFunc_GetHookedBPCamper_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_SetCamperCameraMode) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_SetCamperCameraMode");
static_assert(sizeof(BP_MeatHook_Shared_C_SetCamperCameraMode) == 0x000018, "Wrong size on BP_MeatHook_Shared_C_SetCamperCameraMode");
static_assert(offsetof(BP_MeatHook_Shared_C_SetCamperCameraMode, SocketId) == 0x000000, "Member 'BP_MeatHook_Shared_C_SetCamperCameraMode::SocketId' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_SetCamperCameraMode, HideVignette) == 0x000001, "Member 'BP_MeatHook_Shared_C_SetCamperCameraMode::HideVignette' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_SetCamperCameraMode, HideVignetteHook) == 0x000002, "Member 'BP_MeatHook_Shared_C_SetCamperCameraMode::HideVignetteHook' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_SetCamperCameraMode, CallFunc_GetHookedBPCamper_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_SetCamperCameraMode::CallFunc_GetHookedBPCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_SetCamperCameraMode, CallFunc_IsLocallyObserved_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_SetCamperCameraMode::CallFunc_IsLocallyObserved_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.OnTickStruggle
// 0x0004 (0x0004 - 0x0000)
struct BP_MeatHook_Shared_C_OnTickStruggle final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_OnTickStruggle) == 0x000004, "Wrong alignment on BP_MeatHook_Shared_C_OnTickStruggle");
static_assert(sizeof(BP_MeatHook_Shared_C_OnTickStruggle) == 0x000004, "Wrong size on BP_MeatHook_Shared_C_OnTickStruggle");
static_assert(offsetof(BP_MeatHook_Shared_C_OnTickStruggle, DeltaTime) == 0x000000, "Member 'BP_MeatHook_Shared_C_OnTickStruggle::DeltaTime' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.OnSurvivorHookingFXStart
// 0x0018 (0x0018 - 0x0000)
struct BP_MeatHook_Shared_C_OnSurvivorHookingFXStart final
{
public:
	class ACamperPlayer*                          CallFunc_GetHookedCamper_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetHookedCamper_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObservingASurvivor_ReturnValue;  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_OnSurvivorHookingFXStart) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_OnSurvivorHookingFXStart");
static_assert(sizeof(BP_MeatHook_Shared_C_OnSurvivorHookingFXStart) == 0x000018, "Wrong size on BP_MeatHook_Shared_C_OnSurvivorHookingFXStart");
static_assert(offsetof(BP_MeatHook_Shared_C_OnSurvivorHookingFXStart, CallFunc_GetHookedCamper_ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_OnSurvivorHookingFXStart::CallFunc_GetHookedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_OnSurvivorHookingFXStart, CallFunc_GetHookedCamper_ReturnValue_1) == 0x000008, "Member 'BP_MeatHook_Shared_C_OnSurvivorHookingFXStart::CallFunc_GetHookedCamper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_OnSurvivorHookingFXStart, CallFunc_IsLocallyObserved_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_OnSurvivorHookingFXStart::CallFunc_IsLocallyObserved_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_OnSurvivorHookingFXStart, CallFunc_IsLocallyObservingASurvivor_ReturnValue) == 0x000011, "Member 'BP_MeatHook_Shared_C_OnSurvivorHookingFXStart::CallFunc_IsLocallyObservingASurvivor_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.OnHookedSurvivorChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_MeatHook_Shared_C_OnHookedSurvivorChanged final
{
public:
	class ACamperPlayer*                          before;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          After;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_OnHookedSurvivorChanged) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_OnHookedSurvivorChanged");
static_assert(sizeof(BP_MeatHook_Shared_C_OnHookedSurvivorChanged) == 0x000010, "Wrong size on BP_MeatHook_Shared_C_OnHookedSurvivorChanged");
static_assert(offsetof(BP_MeatHook_Shared_C_OnHookedSurvivorChanged, before) == 0x000000, "Member 'BP_MeatHook_Shared_C_OnHookedSurvivorChanged::before' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_OnHookedSurvivorChanged, After) == 0x000008, "Member 'BP_MeatHook_Shared_C_OnHookedSurvivorChanged::After' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.ExecuteUbergraph_BP_MeatHook_Shared
// 0x02A0 (0x02A0 - 0x0000)
struct BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEntity*                                CallFunc_GetEntity_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetHookedSurvivor_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue_1;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue_2;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue_3;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue_4;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0080(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0170(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ACamperPlayer*                          K2Node_Event_before;                               // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_Event_after;                                // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_deltaTime;                            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerkModifierMaxValue_ReturnValue;      // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkModifierOfType_ReturnValue;        // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSacrificed_ReturnValue;              // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue_5;                  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B[0x5];                                      // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEntity*                                CallFunc_GetEntity_ReturnValue_6;                  // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEntity*                                CallFunc_GetEntity_ReturnValue_7;                  // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared");
static_assert(sizeof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared) == 0x0002A0, "Wrong size on BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, EntryPoint) == 0x000000, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetHookedSurvivor_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetHookedSurvivor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_1) == 0x000018, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_2) == 0x000020, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_3) == 0x000028, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_4) == 0x000048, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetSocketLocation_ReturnValue) == 0x000050, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000068, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000080, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000170, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, K2Node_Event_before) == 0x000260, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::K2Node_Event_before' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, K2Node_Event_after) == 0x000268, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::K2Node_Event_after' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, K2Node_Event_deltaTime) == 0x000270, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000274, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_IsValid_ReturnValue) == 0x000275, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetPerkModifierMaxValue_ReturnValue) == 0x000278, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetPerkModifierMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_HasPerkModifierOfType_ReturnValue) == 0x00027C, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_HasPerkModifierOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetIsSacrificed_ReturnValue) == 0x00027D, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetIsSacrificed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_Not_PreBool_ReturnValue) == 0x00027E, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_BooleanAND_ReturnValue) == 0x00027F, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_5) == 0x000280, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_IsValid_ReturnValue_1) == 0x000288, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_BooleanAND_ReturnValue_1) == 0x000289, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_BooleanAND_ReturnValue_2) == 0x00028A, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_6) == 0x000290, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared, CallFunc_GetEntity_ReturnValue_7) == 0x000298, "Member 'BP_MeatHook_Shared_C_ExecuteUbergraph_BP_MeatHook_Shared::CallFunc_GetEntity_ReturnValue_7' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.IsInterruptionPossible
// 0x0030 (0x0030 - 0x0000)
struct BP_MeatHook_Shared_C_IsInterruptionPossible final
{
public:
	const class ADBDPlayer*                       Interruptor;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class ADBDPlayer*                       Interruptee;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UInteractor*                      Interactor;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UInteractionDefinition*           Definition;                                        // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UInterruptionDefinition*          Interruption;                                      // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_IsInterruptionPossible) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_IsInterruptionPossible");
static_assert(sizeof(BP_MeatHook_Shared_C_IsInterruptionPossible) == 0x000030, "Wrong size on BP_MeatHook_Shared_C_IsInterruptionPossible");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInterruptionPossible, Interruptor) == 0x000000, "Member 'BP_MeatHook_Shared_C_IsInterruptionPossible::Interruptor' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInterruptionPossible, Interruptee) == 0x000008, "Member 'BP_MeatHook_Shared_C_IsInterruptionPossible::Interruptee' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInterruptionPossible, Interactor) == 0x000010, "Member 'BP_MeatHook_Shared_C_IsInterruptionPossible::Interactor' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInterruptionPossible, Definition) == 0x000018, "Member 'BP_MeatHook_Shared_C_IsInterruptionPossible::Definition' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInterruptionPossible, Interruption) == 0x000020, "Member 'BP_MeatHook_Shared_C_IsInterruptionPossible::Interruption' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInterruptionPossible, ReturnValue) == 0x000028, "Member 'BP_MeatHook_Shared_C_IsInterruptionPossible::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.IsInteractionPossibleInternal
// 0x0020 (0x0020 - 0x0000)
struct BP_MeatHook_Shared_C_IsInteractionPossibleInternal final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UInteractor*                      Interactor;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UInteractionDefinition*           Definition;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_IsInteractionPossibleInternal");
static_assert(sizeof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal) == 0x000020, "Wrong size on BP_MeatHook_Shared_C_IsInteractionPossibleInternal");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal, Player) == 0x000000, "Member 'BP_MeatHook_Shared_C_IsInteractionPossibleInternal::Player' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal, Interactor) == 0x000008, "Member 'BP_MeatHook_Shared_C_IsInteractionPossibleInternal::Interactor' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal, Definition) == 0x000010, "Member 'BP_MeatHook_Shared_C_IsInteractionPossibleInternal::Definition' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal, InteractionType) == 0x000018, "Member 'BP_MeatHook_Shared_C_IsInteractionPossibleInternal::InteractionType' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsInteractionPossibleInternal, ReturnValue) == 0x000019, "Member 'BP_MeatHook_Shared_C_IsInteractionPossibleInternal::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.IsHookedCamperHooked
// 0x0018 (0x0018 - 0x0000)
struct BP_MeatHook_Shared_C_IsHookedCamperHooked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeingUnhooked_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetHookedCamper_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHooked_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_IsHookedCamperHooked) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_IsHookedCamperHooked");
static_assert(sizeof(BP_MeatHook_Shared_C_IsHookedCamperHooked) == 0x000018, "Wrong size on BP_MeatHook_Shared_C_IsHookedCamperHooked");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, Result) == 0x000001, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::Result' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, CallFunc_BeingUnhooked_ReturnValue) == 0x000002, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::CallFunc_BeingUnhooked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, CallFunc_GetHookedCamper_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::CallFunc_GetHookedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, CallFunc_IsHooked_ReturnValue) == 0x000011, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::CallFunc_IsHooked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_IsHookedCamperHooked, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BP_MeatHook_Shared_C_IsHookedCamperHooked::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.IsBroken
// 0x0001 (0x0001 - 0x0000)
struct BP_MeatHook_Shared_C_IsBroken final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_IsBroken) == 0x000001, "Wrong alignment on BP_MeatHook_Shared_C_IsBroken");
static_assert(sizeof(BP_MeatHook_Shared_C_IsBroken) == 0x000001, "Wrong size on BP_MeatHook_Shared_C_IsBroken");
static_assert(offsetof(BP_MeatHook_Shared_C_IsBroken, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_IsBroken::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetUnhookInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetUnhookInteraction final
{
public:
	class UChargeableInteractionDefinition*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetUnhookInteraction) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetUnhookInteraction");
static_assert(sizeof(BP_MeatHook_Shared_C_GetUnhookInteraction) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetUnhookInteraction");
static_assert(offsetof(BP_MeatHook_Shared_C_GetUnhookInteraction, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetUnhookInteraction::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetPercentDrainTimer
// 0x0038 (0x0038 - 0x0000)
struct BP_MeatHook_Shared_C_GetPercentDrainTimer final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetHookedCamper_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHookableComponent*                     CallFunc_GetHookableComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDrainTimerPercentLeft_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_result_ImplicitCast;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetPercentDrainTimer) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetPercentDrainTimer");
static_assert(sizeof(BP_MeatHook_Shared_C_GetPercentDrainTimer) == 0x000038, "Wrong size on BP_MeatHook_Shared_C_GetPercentDrainTimer");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, Result) == 0x000008, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::Result' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, CallFunc_GetHookedCamper_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::CallFunc_GetHookedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, CallFunc_GetHookableComponent_ReturnValue) == 0x000020, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::CallFunc_GetHookableComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, CallFunc_GetDrainTimerPercentLeft_ReturnValue) == 0x000028, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::CallFunc_GetDrainTimerPercentLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetPercentDrainTimer, K2Node_VariableSet_result_ImplicitCast) == 0x000030, "Member 'BP_MeatHook_Shared_C_GetPercentDrainTimer::K2Node_VariableSet_result_ImplicitCast' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetMeatHookAkAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent final
{
public:
	class UAkComponent*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent");
static_assert(sizeof(BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent");
static_assert(offsetof(BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetMeatHookAkAudioComponent::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetMainInteractor
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetMainInteractor final
{
public:
	class UInteractor*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetMainInteractor) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetMainInteractor");
static_assert(sizeof(BP_MeatHook_Shared_C_GetMainInteractor) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetMainInteractor");
static_assert(offsetof(BP_MeatHook_Shared_C_GetMainInteractor, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetMainInteractor::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetKickSlasherDetectionZone
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetKickSlasherDetectionZone final
{
public:
	class USphereComponent*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetKickSlasherDetectionZone) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetKickSlasherDetectionZone");
static_assert(sizeof(BP_MeatHook_Shared_C_GetKickSlasherDetectionZone) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetKickSlasherDetectionZone");
static_assert(offsetof(BP_MeatHook_Shared_C_GetKickSlasherDetectionZone, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetKickSlasherDetectionZone::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetInteractorPrimitiveComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent");
static_assert(sizeof(BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent");
static_assert(offsetof(BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetInteractorPrimitiveComponent::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetHookPosition
// 0x0030 (0x0030 - 0x0000)
struct BP_MeatHook_Shared_C_GetHookPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetHookPosition) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetHookPosition");
static_assert(sizeof(BP_MeatHook_Shared_C_GetHookPosition) == 0x000030, "Wrong size on BP_MeatHook_Shared_C_GetHookPosition");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookPosition, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetHookPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookPosition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_MeatHook_Shared_C_GetHookPosition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetHookedCamper
// 0x0020 (0x0020 - 0x0000)
struct BP_MeatHook_Shared_C_GetHookedCamper final
{
public:
	class ACamperPlayer*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          Result;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetHookedSurvivor_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetHookedCamper) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetHookedCamper");
static_assert(sizeof(BP_MeatHook_Shared_C_GetHookedCamper) == 0x000020, "Wrong size on BP_MeatHook_Shared_C_GetHookedCamper");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedCamper, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetHookedCamper::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedCamper, Result) == 0x000008, "Member 'BP_MeatHook_Shared_C_GetHookedCamper::Result' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedCamper, CallFunc_GetHookedSurvivor_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_GetHookedCamper::CallFunc_GetHookedSurvivor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedCamper, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_MeatHook_Shared_C_GetHookedCamper::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetHookedBPCamper
// 0x0020 (0x0020 - 0x0000)
struct BP_MeatHook_Shared_C_GetHookedBPCamper final
{
public:
	class ABP_Camper_Character_C*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetHookedSurvivor_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Camper_Character_C*                 K2Node_DynamicCast_AsBP_Camper_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetHookedBPCamper) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetHookedBPCamper");
static_assert(sizeof(BP_MeatHook_Shared_C_GetHookedBPCamper) == 0x000020, "Wrong size on BP_MeatHook_Shared_C_GetHookedBPCamper");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedBPCamper, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetHookedBPCamper::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedBPCamper, CallFunc_GetHookedSurvivor_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_GetHookedBPCamper::CallFunc_GetHookedSurvivor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedBPCamper, K2Node_DynamicCast_AsBP_Camper_Character) == 0x000010, "Member 'BP_MeatHook_Shared_C_GetHookedBPCamper::K2Node_DynamicCast_AsBP_Camper_Character' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_GetHookedBPCamper, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MeatHook_Shared_C_GetHookedBPCamper::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetEscapeHookInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetEscapeHookInteraction final
{
public:
	class UChargeableInteractionDefinition*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetEscapeHookInteraction) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetEscapeHookInteraction");
static_assert(sizeof(BP_MeatHook_Shared_C_GetEscapeHookInteraction) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetEscapeHookInteraction");
static_assert(offsetof(BP_MeatHook_Shared_C_GetEscapeHookInteraction, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetEscapeHookInteraction::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetEntity
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetEntity final
{
public:
	class AEntity*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetEntity) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetEntity");
static_assert(sizeof(BP_MeatHook_Shared_C_GetEntity) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetEntity");
static_assert(offsetof(BP_MeatHook_Shared_C_GetEntity, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetEntity::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetCamperUnkookFocalPointTransform
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform");
static_assert(sizeof(BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform");
static_assert(offsetof(BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetCamperUnkookFocalPointTransform::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetCamperHookedSnapTransform
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetCamperHookedSnapTransform final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetCamperHookedSnapTransform) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetCamperHookedSnapTransform");
static_assert(sizeof(BP_MeatHook_Shared_C_GetCamperHookedSnapTransform) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetCamperHookedSnapTransform");
static_assert(offsetof(BP_MeatHook_Shared_C_GetCamperHookedSnapTransform, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetCamperHookedSnapTransform::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.GetAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatHook_Shared_C_GetAnimInstance final
{
public:
	class UAnimInstance*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_GetAnimInstance) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_GetAnimInstance");
static_assert(sizeof(BP_MeatHook_Shared_C_GetAnimInstance) == 0x000008, "Wrong size on BP_MeatHook_Shared_C_GetAnimInstance");
static_assert(offsetof(BP_MeatHook_Shared_C_GetAnimInstance, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_GetAnimInstance::ReturnValue' has a wrong offset!");

// Function BP_MeatHook_Shared.BP_MeatHook_Shared_C.BeingUnhooked
// 0x0018 (0x0018 - 0x0000)
struct BP_MeatHook_Shared_C_BeingUnhooked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractionDefinition*                 CallFunc_GetCurrentInteraction_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatHook_Shared_C_BeingUnhooked) == 0x000008, "Wrong alignment on BP_MeatHook_Shared_C_BeingUnhooked");
static_assert(sizeof(BP_MeatHook_Shared_C_BeingUnhooked) == 0x000018, "Wrong size on BP_MeatHook_Shared_C_BeingUnhooked");
static_assert(offsetof(BP_MeatHook_Shared_C_BeingUnhooked, ReturnValue) == 0x000000, "Member 'BP_MeatHook_Shared_C_BeingUnhooked::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_BeingUnhooked, CallFunc_GetCurrentInteraction_ReturnValue) == 0x000008, "Member 'BP_MeatHook_Shared_C_BeingUnhooked::CallFunc_GetCurrentInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatHook_Shared_C_BeingUnhooked, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_MeatHook_Shared_C_BeingUnhooked::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

