#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeatLocker01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MeatLocker01.BP_MeatLocker01_C.TrySetMapActor
// 0x0018 (0x0018 - 0x0000)
struct BP_MeatLocker01_C_TrySetMapActor final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMapActorComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatLocker01_C_TrySetMapActor) == 0x000008, "Wrong alignment on BP_MeatLocker01_C_TrySetMapActor");
static_assert(sizeof(BP_MeatLocker01_C_TrySetMapActor) == 0x000018, "Wrong size on BP_MeatLocker01_C_TrySetMapActor");
static_assert(offsetof(BP_MeatLocker01_C_TrySetMapActor, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_MeatLocker01_C_TrySetMapActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatLocker01_C_TrySetMapActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_MeatLocker01_C_TrySetMapActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatLocker01_C_TrySetMapActor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MeatLocker01_C_TrySetMapActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MeatLocker01.BP_MeatLocker01_C.ExecuteUbergraph_BP_MeatLocker01
// 0x0004 (0x0004 - 0x0000)
struct BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01) == 0x000004, "Wrong alignment on BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01");
static_assert(sizeof(BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01) == 0x000004, "Wrong size on BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01");
static_assert(offsetof(BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01, EntryPoint) == 0x000000, "Member 'BP_MeatLocker01_C_ExecuteUbergraph_BP_MeatLocker01::EntryPoint' has a wrong offset!");

// Function BP_MeatLocker01.BP_MeatLocker01_C.GetMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_MeatLocker01_C_GetMesh final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatLocker01_C_GetMesh) == 0x000008, "Wrong alignment on BP_MeatLocker01_C_GetMesh");
static_assert(sizeof(BP_MeatLocker01_C_GetMesh) == 0x000008, "Wrong size on BP_MeatLocker01_C_GetMesh");
static_assert(offsetof(BP_MeatLocker01_C_GetMesh, Mesh) == 0x000000, "Member 'BP_MeatLocker01_C_GetMesh::Mesh' has a wrong offset!");

// Function BP_MeatLocker01.BP_MeatLocker01_C.GetHookPosition
// 0x0058 (0x0058 - 0x0000)
struct BP_MeatLocker01_C_GetHookPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh_Mesh;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHookPosition_ReturnValue;              // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MeatLocker01_C_GetHookPosition) == 0x000008, "Wrong alignment on BP_MeatLocker01_C_GetHookPosition");
static_assert(sizeof(BP_MeatLocker01_C_GetHookPosition) == 0x000058, "Wrong size on BP_MeatLocker01_C_GetHookPosition");
static_assert(offsetof(BP_MeatLocker01_C_GetHookPosition, ReturnValue) == 0x000000, "Member 'BP_MeatLocker01_C_GetHookPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatLocker01_C_GetHookPosition, CallFunc_GetMesh_Mesh) == 0x000018, "Member 'BP_MeatLocker01_C_GetHookPosition::CallFunc_GetMesh_Mesh' has a wrong offset!");
static_assert(offsetof(BP_MeatLocker01_C_GetHookPosition, CallFunc_GetHookPosition_ReturnValue) == 0x000020, "Member 'BP_MeatLocker01_C_GetHookPosition::CallFunc_GetHookPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatLocker01_C_GetHookPosition, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_MeatLocker01_C_GetHookPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MeatLocker01_C_GetHookPosition, CallFunc_GetSocketLocation_ReturnValue) == 0x000040, "Member 'BP_MeatLocker01_C_GetHookPosition::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

}

