#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivorBloodFX

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SurvivorBloodFX.BP_SurvivorBloodFX_C.SpawnBloodSpurts
// 0x0028 (0x0028 - 0x0000)
struct BP_SurvivorBloodFX_C_SpawnBloodSpurts final
{
public:
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnBloodSpurtsParticles_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivorBloodFX_C_SpawnBloodSpurts) == 0x000008, "Wrong alignment on BP_SurvivorBloodFX_C_SpawnBloodSpurts");
static_assert(sizeof(BP_SurvivorBloodFX_C_SpawnBloodSpurts) == 0x000028, "Wrong size on BP_SurvivorBloodFX_C_SpawnBloodSpurts");
static_assert(offsetof(BP_SurvivorBloodFX_C_SpawnBloodSpurts, ReturnValue) == 0x000000, "Member 'BP_SurvivorBloodFX_C_SpawnBloodSpurts::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivorBloodFX_C_SpawnBloodSpurts, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_SurvivorBloodFX_C_SpawnBloodSpurts::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivorBloodFX_C_SpawnBloodSpurts, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BP_SurvivorBloodFX_C_SpawnBloodSpurts::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_SurvivorBloodFX_C_SpawnBloodSpurts, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SurvivorBloodFX_C_SpawnBloodSpurts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SurvivorBloodFX_C_SpawnBloodSpurts, CallFunc_SpawnBloodSpurtsParticles_ReturnValue) == 0x000020, "Member 'BP_SurvivorBloodFX_C_SpawnBloodSpurts::CallFunc_SpawnBloodSpurtsParticles_ReturnValue' has a wrong offset!");

}

