#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SacrificeEnd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SacrificeEnd.BP_SacrificeEnd_C
// 0x0030 (0x0320 - 0x02F0)
class ABP_SacrificeEnd_C final : public ASacrificeEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialHelper*                        MaterialHelper;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_Fade2_DC51705C4B1EDCB6491A9385841B9474;       // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_Fade_DC51705C4B1EDCB6491A9385841B9474;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade__Direction_DC51705C4B1EDCB6491A9385841B9474;  // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fade;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Current_Object;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void FX_SacrificeEnd_Basement();
	void FX_SacrificeEnd();
	void Fade__UpdateFunc();
	void Fade__FinishedFunc();
	void ExecuteUbergraph_BP_SacrificeEnd(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SacrificeEnd_C">();
	}
	static class ABP_SacrificeEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SacrificeEnd_C>();
	}
};
static_assert(alignof(ABP_SacrificeEnd_C) == 0x000008, "Wrong alignment on ABP_SacrificeEnd_C");
static_assert(sizeof(ABP_SacrificeEnd_C) == 0x000320, "Wrong size on ABP_SacrificeEnd_C");
static_assert(offsetof(ABP_SacrificeEnd_C, UberGraphFrame) == 0x0002F0, "Member 'ABP_SacrificeEnd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SacrificeEnd_C, MaterialHelper) == 0x0002F8, "Member 'ABP_SacrificeEnd_C::MaterialHelper' has a wrong offset!");
static_assert(offsetof(ABP_SacrificeEnd_C, Fade_Fade2_DC51705C4B1EDCB6491A9385841B9474) == 0x000300, "Member 'ABP_SacrificeEnd_C::Fade_Fade2_DC51705C4B1EDCB6491A9385841B9474' has a wrong offset!");
static_assert(offsetof(ABP_SacrificeEnd_C, Fade_Fade_DC51705C4B1EDCB6491A9385841B9474) == 0x000304, "Member 'ABP_SacrificeEnd_C::Fade_Fade_DC51705C4B1EDCB6491A9385841B9474' has a wrong offset!");
static_assert(offsetof(ABP_SacrificeEnd_C, Fade__Direction_DC51705C4B1EDCB6491A9385841B9474) == 0x000308, "Member 'ABP_SacrificeEnd_C::Fade__Direction_DC51705C4B1EDCB6491A9385841B9474' has a wrong offset!");
static_assert(offsetof(ABP_SacrificeEnd_C, Fade) == 0x000310, "Member 'ABP_SacrificeEnd_C::Fade' has a wrong offset!");
static_assert(offsetof(ABP_SacrificeEnd_C, Current_Object) == 0x000318, "Member 'ABP_SacrificeEnd_C::Current_Object' has a wrong offset!");

}

