#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SM_LM_WaterTower01_Floor01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SM_LM_WaterTower01_Floor01.BP_SM_LM_WaterTower01_Floor01_C
// 0x0028 (0x02C8 - 0x02A0)
class ABP_SM_LM_WaterTower01_Floor01_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_DebrisBricks01;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_DebrisBricks02;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_BP_SM_LM_WaterTower01_Floor01;                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SM_LM_WaterTower01_Floor01_C">();
	}
	static class ABP_SM_LM_WaterTower01_Floor01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SM_LM_WaterTower01_Floor01_C>();
	}
};
static_assert(alignof(ABP_SM_LM_WaterTower01_Floor01_C) == 0x000008, "Wrong alignment on ABP_SM_LM_WaterTower01_Floor01_C");
static_assert(sizeof(ABP_SM_LM_WaterTower01_Floor01_C) == 0x0002C8, "Wrong size on ABP_SM_LM_WaterTower01_Floor01_C");
static_assert(offsetof(ABP_SM_LM_WaterTower01_Floor01_C, Box) == 0x0002A0, "Member 'ABP_SM_LM_WaterTower01_Floor01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_SM_LM_WaterTower01_Floor01_C, ISM_SM_DebrisBricks01) == 0x0002A8, "Member 'ABP_SM_LM_WaterTower01_Floor01_C::ISM_SM_DebrisBricks01' has a wrong offset!");
static_assert(offsetof(ABP_SM_LM_WaterTower01_Floor01_C, ISM_SM_DebrisBricks02) == 0x0002B0, "Member 'ABP_SM_LM_WaterTower01_Floor01_C::ISM_SM_DebrisBricks02' has a wrong offset!");
static_assert(offsetof(ABP_SM_LM_WaterTower01_Floor01_C, HISM_BP_SM_LM_WaterTower01_Floor01) == 0x0002B8, "Member 'ABP_SM_LM_WaterTower01_Floor01_C::HISM_BP_SM_LM_WaterTower01_Floor01' has a wrong offset!");
static_assert(offsetof(ABP_SM_LM_WaterTower01_Floor01_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_SM_LM_WaterTower01_Floor01_C::DefaultSceneRoot' has a wrong offset!");

}

