#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ST_Foundry01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ST_Foundry01.BP_ST_Foundry01_C
// 0x0220 (0x04C0 - 0x02A0)
class ABP_ST_Foundry01_C final : public AActor
{
public:
	class UBoxComponent*                          RampCollider23;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider24;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider21;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider22;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider20;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider19;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider18;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider17;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider15;                                    // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider16;                                    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider14;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider13;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider12;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider6;                                     // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider11;                                    // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider10;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider9;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider8;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider7;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider5;                                     // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider4;                                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider3;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider2;                                     // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider1;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RampCollider;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Stairs01;                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_ST_Foundry01_ExtPipes01;                   // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_ST_Foundry01_ExtPipes03;                   // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_ST_Foundry01_ExtPipes02;                   // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube2;                                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_StoreHouse01_Door01;                            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_SR_Windows01;                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowLarge02;                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowStandard06;                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowStandard05;                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowStandard03;                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowTall02;                      // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowTall01;                      // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowStandard02;                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowStandard01;                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_WindowLarge01;                     // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Windows;                                           // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Ind_Foundry_MoltenBucket;                       // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Pipes01;                           // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Concrete;                          // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Roof;                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_SteelBeam;                         // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_IntWalls;                          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_ExtWalls;                          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Pipes010;                          // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Pipes07;                           // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Pipes08;                           // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Pipes09;                           // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_PanelMetalCorrugate04;                      // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_PanelMetalCorrugate06;                      // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_ST_Foundry01_Floor01;                      // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_ST_Foundry01_ExtStairs01;                  // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_ST_Foundry01_CeilingBeam02;                // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_ST_Foundry01_CeilingBeam01;                 // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Machinery01;                       // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_Machinery02;                       // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ST_Foundry01_SR_Walls01;                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Foundry;                                           // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ST_Foundry01_C">();
	}
	static class ABP_ST_Foundry01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ST_Foundry01_C>();
	}
};
static_assert(alignof(ABP_ST_Foundry01_C) == 0x000008, "Wrong alignment on ABP_ST_Foundry01_C");
static_assert(sizeof(ABP_ST_Foundry01_C) == 0x0004C0, "Wrong size on ABP_ST_Foundry01_C");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider23) == 0x0002A0, "Member 'ABP_ST_Foundry01_C::RampCollider23' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider24) == 0x0002A8, "Member 'ABP_ST_Foundry01_C::RampCollider24' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider21) == 0x0002B0, "Member 'ABP_ST_Foundry01_C::RampCollider21' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider22) == 0x0002B8, "Member 'ABP_ST_Foundry01_C::RampCollider22' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider20) == 0x0002C0, "Member 'ABP_ST_Foundry01_C::RampCollider20' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider19) == 0x0002C8, "Member 'ABP_ST_Foundry01_C::RampCollider19' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider18) == 0x0002D0, "Member 'ABP_ST_Foundry01_C::RampCollider18' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider17) == 0x0002D8, "Member 'ABP_ST_Foundry01_C::RampCollider17' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider15) == 0x0002E0, "Member 'ABP_ST_Foundry01_C::RampCollider15' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider16) == 0x0002E8, "Member 'ABP_ST_Foundry01_C::RampCollider16' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider14) == 0x0002F0, "Member 'ABP_ST_Foundry01_C::RampCollider14' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider13) == 0x0002F8, "Member 'ABP_ST_Foundry01_C::RampCollider13' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider12) == 0x000300, "Member 'ABP_ST_Foundry01_C::RampCollider12' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider6) == 0x000308, "Member 'ABP_ST_Foundry01_C::RampCollider6' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider11) == 0x000310, "Member 'ABP_ST_Foundry01_C::RampCollider11' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider10) == 0x000318, "Member 'ABP_ST_Foundry01_C::RampCollider10' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider9) == 0x000320, "Member 'ABP_ST_Foundry01_C::RampCollider9' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider8) == 0x000328, "Member 'ABP_ST_Foundry01_C::RampCollider8' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider7) == 0x000330, "Member 'ABP_ST_Foundry01_C::RampCollider7' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider5) == 0x000338, "Member 'ABP_ST_Foundry01_C::RampCollider5' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider4) == 0x000340, "Member 'ABP_ST_Foundry01_C::RampCollider4' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider3) == 0x000348, "Member 'ABP_ST_Foundry01_C::RampCollider3' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider2) == 0x000350, "Member 'ABP_ST_Foundry01_C::RampCollider2' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider1) == 0x000358, "Member 'ABP_ST_Foundry01_C::RampCollider1' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, RampCollider) == 0x000360, "Member 'ABP_ST_Foundry01_C::RampCollider' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Box2) == 0x000368, "Member 'ABP_ST_Foundry01_C::Box2' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Box1) == 0x000370, "Member 'ABP_ST_Foundry01_C::Box1' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Stairs01) == 0x000378, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Stairs01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Box) == 0x000380, "Member 'ABP_ST_Foundry01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, HISM_SM_ST_Foundry01_ExtPipes01) == 0x000388, "Member 'ABP_ST_Foundry01_C::HISM_SM_ST_Foundry01_ExtPipes01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, HISM_SM_ST_Foundry01_ExtPipes03) == 0x000390, "Member 'ABP_ST_Foundry01_C::HISM_SM_ST_Foundry01_ExtPipes03' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, HISM_SM_ST_Foundry01_ExtPipes02) == 0x000398, "Member 'ABP_ST_Foundry01_C::HISM_SM_ST_Foundry01_ExtPipes02' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Cube2) == 0x0003A0, "Member 'ABP_ST_Foundry01_C::Cube2' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Cube1) == 0x0003A8, "Member 'ABP_ST_Foundry01_C::Cube1' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_StoreHouse01_Door01) == 0x0003B0, "Member 'ABP_ST_Foundry01_C::SM_StoreHouse01_Door01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_SR_Windows01) == 0x0003B8, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_SR_Windows01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowLarge02) == 0x0003C0, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowLarge02' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowStandard06) == 0x0003C8, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowStandard06' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowStandard05) == 0x0003D0, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowStandard05' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowStandard03) == 0x0003D8, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowStandard03' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowTall02) == 0x0003E0, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowTall02' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowTall01) == 0x0003E8, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowTall01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowStandard02) == 0x0003F0, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowStandard02' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowStandard01) == 0x0003F8, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowStandard01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_WindowLarge01) == 0x000400, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_WindowLarge01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Windows) == 0x000408, "Member 'ABP_ST_Foundry01_C::Windows' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, BP_Ind_Foundry_MoltenBucket) == 0x000410, "Member 'ABP_ST_Foundry01_C::BP_Ind_Foundry_MoltenBucket' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Cube) == 0x000418, "Member 'ABP_ST_Foundry01_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Pipes01) == 0x000420, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Pipes01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Concrete) == 0x000428, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Concrete' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Roof) == 0x000430, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Roof' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_SteelBeam) == 0x000438, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_SteelBeam' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_IntWalls) == 0x000440, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_IntWalls' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_ExtWalls) == 0x000448, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_ExtWalls' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Pipes010) == 0x000450, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Pipes010' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Pipes07) == 0x000458, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Pipes07' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Pipes08) == 0x000460, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Pipes08' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Pipes09) == 0x000468, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Pipes09' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, ISM_SM_PanelMetalCorrugate04) == 0x000470, "Member 'ABP_ST_Foundry01_C::ISM_SM_PanelMetalCorrugate04' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, ISM_SM_PanelMetalCorrugate06) == 0x000478, "Member 'ABP_ST_Foundry01_C::ISM_SM_PanelMetalCorrugate06' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, HISM_SM_ST_Foundry01_Floor01) == 0x000480, "Member 'ABP_ST_Foundry01_C::HISM_SM_ST_Foundry01_Floor01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, HISM_SM_ST_Foundry01_ExtStairs01) == 0x000488, "Member 'ABP_ST_Foundry01_C::HISM_SM_ST_Foundry01_ExtStairs01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, HISM_SM_ST_Foundry01_CeilingBeam02) == 0x000490, "Member 'ABP_ST_Foundry01_C::HISM_SM_ST_Foundry01_CeilingBeam02' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, ISM_SM_ST_Foundry01_CeilingBeam01) == 0x000498, "Member 'ABP_ST_Foundry01_C::ISM_SM_ST_Foundry01_CeilingBeam01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Machinery01) == 0x0004A0, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Machinery01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_Machinery02) == 0x0004A8, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_Machinery02' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, SM_ST_Foundry01_SR_Walls01) == 0x0004B0, "Member 'ABP_ST_Foundry01_C::SM_ST_Foundry01_SR_Walls01' has a wrong offset!");
static_assert(offsetof(ABP_ST_Foundry01_C, Foundry) == 0x0004B8, "Member 'ABP_ST_Foundry01_C::Foundry' has a wrong offset!");

}

