#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SelfUnhook

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SelfUnhook.BP_SelfUnhook_C.GetSuccessProbability
// 0x0020 (0x0020 - 0x0000)
struct BP_SelfUnhook_C_GetSuccessProbability final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDDesignTunables*                     CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSuccessProbability_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfUnhook_C_GetSuccessProbability) == 0x000008, "Wrong alignment on BP_SelfUnhook_C_GetSuccessProbability");
static_assert(sizeof(BP_SelfUnhook_C_GetSuccessProbability) == 0x000020, "Wrong size on BP_SelfUnhook_C_GetSuccessProbability");
static_assert(offsetof(BP_SelfUnhook_C_GetSuccessProbability, ReturnValue) == 0x000000, "Member 'BP_SelfUnhook_C_GetSuccessProbability::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetSuccessProbability, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'BP_SelfUnhook_C_GetSuccessProbability::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetSuccessProbability, CallFunc_GetSuccessProbability_ReturnValue) == 0x000010, "Member 'BP_SelfUnhook_C_GetSuccessProbability::CallFunc_GetSuccessProbability_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetSuccessProbability, CallFunc_GetTunableValue_ReturnValue) == 0x000014, "Member 'BP_SelfUnhook_C_GetSuccessProbability::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetSuccessProbability, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_SelfUnhook_C_GetSuccessProbability::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_SelfUnhook.BP_SelfUnhook_C.GetMultiplicativeLuckBonus
// 0x0018 (0x0018 - 0x0000)
struct BP_SelfUnhook_C_GetMultiplicativeLuckBonus final
{
public:
	const class ADBDPlayer*                       Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMultiplicativeLuckBonus_ReturnValue;   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerkModifier_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus) == 0x000008, "Wrong alignment on BP_SelfUnhook_C_GetMultiplicativeLuckBonus");
static_assert(sizeof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus) == 0x000018, "Wrong size on BP_SelfUnhook_C_GetMultiplicativeLuckBonus");
static_assert(offsetof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus, Character) == 0x000000, "Member 'BP_SelfUnhook_C_GetMultiplicativeLuckBonus::Character' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus, ReturnValue) == 0x000008, "Member 'BP_SelfUnhook_C_GetMultiplicativeLuckBonus::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus, CallFunc_GetMultiplicativeLuckBonus_ReturnValue) == 0x00000C, "Member 'BP_SelfUnhook_C_GetMultiplicativeLuckBonus::CallFunc_GetMultiplicativeLuckBonus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus, CallFunc_GetPerkModifier_ReturnValue) == 0x000010, "Member 'BP_SelfUnhook_C_GetMultiplicativeLuckBonus::CallFunc_GetPerkModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetMultiplicativeLuckBonus, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_SelfUnhook_C_GetMultiplicativeLuckBonus::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_SelfUnhook.BP_SelfUnhook_C.GetAdditiveLuckBonus
// 0x0018 (0x0018 - 0x0000)
struct BP_SelfUnhook_C_GetAdditiveLuckBonus final
{
public:
	const class ADBDPlayer*                       Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdditiveLuckBonus_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerkModifier_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SelfUnhook_C_GetAdditiveLuckBonus) == 0x000008, "Wrong alignment on BP_SelfUnhook_C_GetAdditiveLuckBonus");
static_assert(sizeof(BP_SelfUnhook_C_GetAdditiveLuckBonus) == 0x000018, "Wrong size on BP_SelfUnhook_C_GetAdditiveLuckBonus");
static_assert(offsetof(BP_SelfUnhook_C_GetAdditiveLuckBonus, Character) == 0x000000, "Member 'BP_SelfUnhook_C_GetAdditiveLuckBonus::Character' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetAdditiveLuckBonus, ReturnValue) == 0x000008, "Member 'BP_SelfUnhook_C_GetAdditiveLuckBonus::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetAdditiveLuckBonus, CallFunc_GetAdditiveLuckBonus_ReturnValue) == 0x00000C, "Member 'BP_SelfUnhook_C_GetAdditiveLuckBonus::CallFunc_GetAdditiveLuckBonus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetAdditiveLuckBonus, CallFunc_GetPerkModifier_ReturnValue) == 0x000010, "Member 'BP_SelfUnhook_C_GetAdditiveLuckBonus::CallFunc_GetPerkModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SelfUnhook_C_GetAdditiveLuckBonus, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_SelfUnhook_C_GetAdditiveLuckBonus::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

