#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SacrificeEnd

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SacrificeEnd.BP_SacrificeEnd_C.ExecuteUbergraph_BP_SacrificeEnd
// 0x0238 (0x0238 - 0x0000)
struct BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindParentOfClass_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMeatHook*                              K2Node_DynamicCast_AsMeat_Hook;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDBDClipRegionComponent*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_CreateDynamicMaterialInstanceForParticleSystem_ReturnValue; // 0x00D8(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0140(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd) == 0x000008, "Wrong alignment on BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd");
static_assert(sizeof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd) == 0x000238, "Wrong size on BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, EntryPoint) == 0x000000, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_FindParentOfClass_ReturnValue) == 0x000008, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_FindParentOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, K2Node_DynamicCast_AsMeat_Hook) == 0x000018, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::K2Node_DynamicCast_AsMeat_Hook' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000030, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_GetComponentBounds_Origin) == 0x000048, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_GetComponentBounds_BoxExtent) == 0x000060, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_GetComponentBounds_SphereRadius) == 0x000078, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000080, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_BreakVector_X) == 0x0000B8, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_CreateDynamicMaterialInstanceForParticleSystem_ReturnValue) == 0x0000D8, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_CreateDynamicMaterialInstanceForParticleSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_BreakVector_X_1) == 0x000110, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_BreakVector_Y_1) == 0x000118, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_BreakVector_Z_1) == 0x000120, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_MakeVector_ReturnValue) == 0x000128, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000140, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000230, "Member 'BP_SacrificeEnd_C_ExecuteUbergraph_BP_SacrificeEnd::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

