#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Slasher_Character_01

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Slasher_Character_01.BP_Slasher_Character_01_C.IsTrapPlacementValid
// 0x0002 (0x0002 - 0x0000)
struct BP_Slasher_Character_01_C_IsTrapPlacementValid final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacementValid_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Slasher_Character_01_C_IsTrapPlacementValid) == 0x000001, "Wrong alignment on BP_Slasher_Character_01_C_IsTrapPlacementValid");
static_assert(sizeof(BP_Slasher_Character_01_C_IsTrapPlacementValid) == 0x000002, "Wrong size on BP_Slasher_Character_01_C_IsTrapPlacementValid");
static_assert(offsetof(BP_Slasher_Character_01_C_IsTrapPlacementValid, Result) == 0x000000, "Member 'BP_Slasher_Character_01_C_IsTrapPlacementValid::Result' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_IsTrapPlacementValid, CallFunc_IsPlacementValid_ReturnValue) == 0x000001, "Member 'BP_Slasher_Character_01_C_IsTrapPlacementValid::CallFunc_IsPlacementValid_ReturnValue' has a wrong offset!");

// Function BP_Slasher_Character_01.BP_Slasher_Character_01_C.ExecuteUbergraph_BP_Slasher_Character_01
// 0x0118 (0x0118 - 0x0000)
struct BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioCustomizationCategory                   K2Node_ComponentBoundEvent_category;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_switchState;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDGameState*                          CallFunc_GetDBDGameState_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsGameEnded_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue;            // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterInventoryComponent*           CallFunc_GetCharacterInventoryComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACollectable*                           CallFunc_SpawnAndCollectItem_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0054(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x006C(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_gameEventType;                  // 0x0090(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         K2Node_CustomEvent_gameEventData;                  // 0x00A0(0x0030)(ConstParm, NoDestructor)
	TDelegate<void(struct FGameplayTag& GameEventType, struct FGameEventData& GameEventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D0(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABearTrap*                              K2Node_DynamicCast_AsBear_Trap;                    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterInventoryComponent*           CallFunc_GetCharacterInventoryComponent_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaximumItemCount_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01) == 0x000008, "Wrong alignment on BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01");
static_assert(sizeof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01) == 0x000118, "Wrong size on BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, EntryPoint) == 0x000000, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_ComponentBoundEvent_category) == 0x000004, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_ComponentBoundEvent_category' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_ComponentBoundEvent_switchState) == 0x000008, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_ComponentBoundEvent_switchState' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_GetDBDGameState_ReturnValue) == 0x000030, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_GetDBDGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_GetIsGameEnded_ReturnValue) == 0x000038, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_GetIsGameEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_IsLocallyObserved_ReturnValue) == 0x00003B, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_IsLocallyObserved_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_GetCharacterInventoryComponent_ReturnValue) == 0x000040, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_GetCharacterInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_SpawnAndCollectItem_ReturnValue) == 0x000048, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_SpawnAndCollectItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_GetTunableValue_ReturnValue) == 0x000050, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, Temp_delegate_Variable) == 0x000054, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, Temp_delegate_Variable_1) == 0x00006C, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, Temp_int_Variable) == 0x000084, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_CustomEvent_gameEventType) == 0x000090, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_CustomEvent_gameEventType' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_CustomEvent_gameEventData) == 0x0000A0, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_CustomEvent_gameEventData' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D0, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_DynamicCast_AsBear_Trap) == 0x0000E8, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_DynamicCast_AsBear_Trap' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_GetCharacterInventoryComponent_ReturnValue_1) == 0x0000F8, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_GetCharacterInventoryComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_HasMaximumItemCount_ReturnValue) == 0x000100, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_HasMaximumItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_PostAkEvent_ReturnValue) == 0x000104, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_PostAkEvent_ReturnValue_1) == 0x000108, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01, CallFunc_FTrunc_A_ImplicitCast) == 0x000110, "Member 'BP_Slasher_Character_01_C_ExecuteUbergraph_BP_Slasher_Character_01::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function BP_Slasher_Character_01.BP_Slasher_Character_01_C.BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature final
{
public:
	EAudioCustomizationCategory                   Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SwitchState;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature");
static_assert(sizeof(BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature) == 0x000018, "Wrong size on BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature");
static_assert(offsetof(BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature, Category) == 0x000000, "Member 'BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature::Category' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature, SwitchState) == 0x000008, "Member 'BP_Slasher_Character_01_C_BndEvt__BP_Slasher_Character_14_CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature::SwitchState' has a wrong offset!");

// Function BP_Slasher_Character_01.BP_Slasher_Character_01_C.Trap Collected
// 0x0040 (0x0040 - 0x0000)
struct BP_Slasher_Character_01_C_Trap_Collected final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_Slasher_Character_01_C_Trap_Collected) == 0x000008, "Wrong alignment on BP_Slasher_Character_01_C_Trap_Collected");
static_assert(sizeof(BP_Slasher_Character_01_C_Trap_Collected) == 0x000040, "Wrong size on BP_Slasher_Character_01_C_Trap_Collected");
static_assert(offsetof(BP_Slasher_Character_01_C_Trap_Collected, GameEventType) == 0x000000, "Member 'BP_Slasher_Character_01_C_Trap_Collected::GameEventType' has a wrong offset!");
static_assert(offsetof(BP_Slasher_Character_01_C_Trap_Collected, GameEventData) == 0x000010, "Member 'BP_Slasher_Character_01_C_Trap_Collected::GameEventData' has a wrong offset!");

}

