#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SacrificeSequence

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SacrificeSequence.BP_SacrificeSequence_C.ExecuteUbergraph_BP_SacrificeSequence
// 0x0090 (0x0090 - 0x0000)
struct BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AClipManager*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	class AClipManager*                           CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast;       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphericalDissolveAt_radius_ImplicitCast;  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence) == 0x000008, "Wrong alignment on BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence");
static_assert(sizeof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence) == 0x000090, "Wrong size on BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, EntryPoint) == 0x000000, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, Temp_delegate_Variable) == 0x000004, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_Add_VectorVector_ReturnValue) == 0x000038, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000050, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_PostAkEvent_ReturnValue) == 0x000080, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_Multiply_FloatFloat_B_ImplicitCast) == 0x000084, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_Multiply_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence, CallFunc_SphericalDissolveAt_radius_ImplicitCast) == 0x000088, "Member 'BP_SacrificeSequence_C_ExecuteUbergraph_BP_SacrificeSequence::CallFunc_SphericalDissolveAt_radius_ImplicitCast' has a wrong offset!");

}

