#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sky_Post

#include "Basic.hpp"

#include "LightingInterfaceEnum_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Sky_Post.BP_Sky_Post_C.CreateDynamicMaterialInstances
// 0x0020 (0x0020 - 0x0000)
struct BP_Sky_Post_C_CreateDynamicMaterialInstances final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_CreateDynamicMaterialInstances) == 0x000008, "Wrong alignment on BP_Sky_Post_C_CreateDynamicMaterialInstances");
static_assert(sizeof(BP_Sky_Post_C_CreateDynamicMaterialInstances) == 0x000020, "Wrong size on BP_Sky_Post_C_CreateDynamicMaterialInstances");
static_assert(offsetof(BP_Sky_Post_C_CreateDynamicMaterialInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Sky_Post_C_CreateDynamicMaterialInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_CreateDynamicMaterialInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_Sky_Post_C_CreateDynamicMaterialInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_CreateDynamicMaterialInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000010, "Member 'BP_Sky_Post_C_CreateDynamicMaterialInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_CreateDynamicMaterialInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000018, "Member 'BP_Sky_Post_C_CreateDynamicMaterialInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.ExecuteUbergraph_BP_Sky_Post
// 0x08D0 (0x08D0 - 0x0000)
struct BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_Event_PostSettings;                         // 0x0020(0x06E0)(ConstParm)
	class UPostProcessComponent*                  K2Node_Event_PostProcess;                          // 0x0700(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_newAlpha;                             // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_other_1;                              // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Sky_Post_C*                         K2Node_DynamicCast_AsBP_Sky_Post;                  // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue;                 // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_ReturnValue_1;               // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast_1;       // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_2;               // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_other;                                // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Sky_Post_C*                         K2Node_DynamicCast_AsBP_Sky_Post_1;                // 0x0760(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_769[0x3];                                      // 0x0769(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_Select_Default;                             // 0x0780(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShadowSystem                                 CallFunc_GetActiveShadowSystem_ReturnValue;        // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_Select_Default_2;                           // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Start;                          // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Flat;                           // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Opacity;                        // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Density;                        // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x07D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDBDGameInstance*                       K2Node_DynamicCast_AsDBDGame_Instance;             // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightingHelper*                        CallFunc_GetLightingHelper_ReturnValue;            // 0x07E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetASMController_ReturnValue;             // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetSourceLevelLightingClass_ReturnValue;  // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UGMAdaptiveShadowMapControllerComponent*> CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0800(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UGMAdaptiveShadowMapControllerComponent* CallFunc_Array_Get_Item;                           // 0x0810(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x081C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D[0x3];                                      // 0x081D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Sky_Post;             // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_IBLNightmareBooster_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0830(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_toggleOn;                             // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83A[0x2];                                      // 0x083A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_themeName;                            // 0x083C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_x_ImplicitCast;              // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_x_ImplicitCast_1;            // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_x_ImplicitCast_2;            // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Greater_FloatFloat_B_ImplicitCast;        // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BlendWeight_ImplicitCast;       // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BlendWeight_ImplicitCast_1;     // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast;       // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_894[0x4];                                      // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast_1;                    // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Greater_FloatFloat_A_ImplicitCast;        // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartDistance_Value_ImplicitCast;      // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFogMaxOpacity_Value_ImplicitCast;      // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFogDensity_Value_ImplicitCast;         // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_A_ImplicitCast;            // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_B_ImplicitCast;            // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post) == 0x000010, "Wrong alignment on BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post");
static_assert(sizeof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post) == 0x0008D0, "Wrong size on BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, EntryPoint) == 0x000000, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, Temp_bool_Variable) == 0x000004, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, Temp_bool_Variable_1) == 0x000005, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x00000C, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_PostSettings) == 0x000020, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_PostSettings' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_PostProcess) == 0x000700, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_PostProcess' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_newAlpha) == 0x000708, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_newAlpha' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_other_1) == 0x000710, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_other_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_DynamicCast_AsBP_Sky_Post) == 0x000718, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_DynamicCast_AsBP_Sky_Post' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_DynamicCast_bSuccess) == 0x000720, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Lerp_ReturnValue) == 0x000728, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_MathExpression_ReturnValue) == 0x000730, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Multiply_IntFloat_B_ImplicitCast) == 0x000738, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Multiply_IntFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_MathExpression_ReturnValue_1) == 0x000740, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Multiply_IntFloat_B_ImplicitCast_1) == 0x000748, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Multiply_IntFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_MathExpression_ReturnValue_2) == 0x000750, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_MathExpression_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_other) == 0x000758, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_other' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_DynamicCast_AsBP_Sky_Post_1) == 0x000760, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_DynamicCast_AsBP_Sky_Post_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_DynamicCast_bSuccess_1) == 0x000768, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x00076C, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Lerp_ReturnValue_1) == 0x000770, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000778, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, Temp_bool_Variable_2) == 0x000779, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Select_Default) == 0x000780, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Select_Default_1) == 0x000788, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_GetActiveShadowSystem_ReturnValue) == 0x000790, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_GetActiveShadowSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Select_Default_2) == 0x000798, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0007A0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_CustomEvent_Start) == 0x0007A8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_CustomEvent_Start' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_CustomEvent_Flat) == 0x0007B0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_CustomEvent_Flat' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_CustomEvent_Opacity) == 0x0007B8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_CustomEvent_Opacity' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_CustomEvent_Density) == 0x0007C0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_CustomEvent_Density' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Add_FloatFloat_ReturnValue) == 0x0007C8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_GetGameInstance_ReturnValue) == 0x0007D0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_DynamicCast_AsDBDGame_Instance) == 0x0007D8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_DynamicCast_AsDBDGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_DynamicCast_bSuccess_2) == 0x0007E0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_GetLightingHelper_ReturnValue) == 0x0007E8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_GetLightingHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_GetASMController_ReturnValue) == 0x0007F0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_GetASMController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_GetSourceLevelLightingClass_ReturnValue) == 0x0007F8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_GetSourceLevelLightingClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000800, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Array_Get_Item) == 0x000810, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Array_Length_ReturnValue) == 0x000818, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Less_IntInt_ReturnValue) == 0x00081C, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_ClassDynamicCast_AsBP_Sky_Post) == 0x000820, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_ClassDynamicCast_AsBP_Sky_Post' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_ClassDynamicCast_bSuccess) == 0x000828, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_GetComponentByClass_ReturnValue) == 0x000830, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_IsValid_ReturnValue) == 0x000838, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_toggleOn) == 0x000839, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_toggleOn' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Event_themeName) == 0x00083C, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Event_themeName' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Lerp_A_ImplicitCast) == 0x000848, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_MathExpression_x_ImplicitCast) == 0x000850, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_MathExpression_x_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Select_Option_1_ImplicitCast) == 0x000858, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_MathExpression_x_ImplicitCast_1) == 0x000860, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_MathExpression_x_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_MathExpression_x_ImplicitCast_2) == 0x000868, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_MathExpression_x_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000870, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000878, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000880, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Greater_FloatFloat_B_ImplicitCast) == 0x000884, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Greater_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_VariableSet_BlendWeight_ImplicitCast) == 0x000888, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_VariableSet_BlendWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_VariableSet_BlendWeight_ImplicitCast_1) == 0x00088C, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_VariableSet_BlendWeight_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Subtract_FloatFloat_B_ImplicitCast) == 0x000890, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Subtract_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_FClamp_Value_ImplicitCast) == 0x000898, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, K2Node_Select_Option_0_ImplicitCast) == 0x0008A0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Lerp_A_ImplicitCast_1) == 0x0008A8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Lerp_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0008B0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Greater_FloatFloat_A_ImplicitCast) == 0x0008B4, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Greater_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0008B8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_SetStartDistance_Value_ImplicitCast) == 0x0008BC, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_SetStartDistance_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_SetFogMaxOpacity_Value_ImplicitCast) == 0x0008C0, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_SetFogMaxOpacity_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_SetFogDensity_Value_ImplicitCast) == 0x0008C4, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_SetFogDensity_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Add_FloatFloat_A_ImplicitCast) == 0x0008C8, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Add_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post, CallFunc_Add_FloatFloat_B_ImplicitCast) == 0x0008CC, "Member 'BP_Sky_Post_C_ExecuteUbergraph_BP_Sky_Post::CallFunc_Add_FloatFloat_B_ImplicitCast' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.Fog
// 0x0020 (0x0020 - 0x0000)
struct BP_Sky_Post_C_Fog final
{
public:
	double                                        Start;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Flat;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Opacity;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Density;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_Fog) == 0x000008, "Wrong alignment on BP_Sky_Post_C_Fog");
static_assert(sizeof(BP_Sky_Post_C_Fog) == 0x000020, "Wrong size on BP_Sky_Post_C_Fog");
static_assert(offsetof(BP_Sky_Post_C_Fog, Start) == 0x000000, "Member 'BP_Sky_Post_C_Fog::Start' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_Fog, Flat) == 0x000008, "Member 'BP_Sky_Post_C_Fog::Flat' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_Fog, Opacity) == 0x000010, "Member 'BP_Sky_Post_C_Fog::Opacity' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_Fog, Density) == 0x000018, "Member 'BP_Sky_Post_C_Fog::Density' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.GetBasementPost
// 0x0008 (0x0008 - 0x0000)
struct BP_Sky_Post_C_GetBasementPost final
{
public:
	ELightingInterfaceEnum                        BP_Type;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDPerPlatformFloat                   Override;                                          // 0x0004(0x0004)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_Sky_Post_C_GetBasementPost) == 0x000004, "Wrong alignment on BP_Sky_Post_C_GetBasementPost");
static_assert(sizeof(BP_Sky_Post_C_GetBasementPost) == 0x000008, "Wrong size on BP_Sky_Post_C_GetBasementPost");
static_assert(offsetof(BP_Sky_Post_C_GetBasementPost, BP_Type) == 0x000000, "Member 'BP_Sky_Post_C_GetBasementPost::BP_Type' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_GetBasementPost, Override) == 0x000004, "Member 'BP_Sky_Post_C_GetBasementPost::Override' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.GetCondemnedStatusVignetteIntensity
// 0x0010 (0x0010 - 0x0000)
struct BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity final
{
public:
	ELightingInterfaceEnum                        BP_Type;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CondemnedStatusIntensityOverride;                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity) == 0x000008, "Wrong alignment on BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity");
static_assert(sizeof(BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity) == 0x000010, "Wrong size on BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity");
static_assert(offsetof(BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity, BP_Type) == 0x000000, "Member 'BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity::BP_Type' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity, CondemnedStatusIntensityOverride) == 0x000008, "Member 'BP_Sky_Post_C_GetCondemnedStatusVignetteIntensity::CondemnedStatusIntensityOverride' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.GetDetectionZoneIntensity
// 0x0018 (0x0018 - 0x0000)
struct BP_Sky_Post_C_GetDetectionZoneIntensity final
{
public:
	ELightingInterfaceEnum                        BP_Type;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DetectionZoneCylinderIntensityOverride;            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetectionZoneDecalIntensityOverride;               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_GetDetectionZoneIntensity) == 0x000008, "Wrong alignment on BP_Sky_Post_C_GetDetectionZoneIntensity");
static_assert(sizeof(BP_Sky_Post_C_GetDetectionZoneIntensity) == 0x000018, "Wrong size on BP_Sky_Post_C_GetDetectionZoneIntensity");
static_assert(offsetof(BP_Sky_Post_C_GetDetectionZoneIntensity, BP_Type) == 0x000000, "Member 'BP_Sky_Post_C_GetDetectionZoneIntensity::BP_Type' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_GetDetectionZoneIntensity, DetectionZoneCylinderIntensityOverride) == 0x000008, "Member 'BP_Sky_Post_C_GetDetectionZoneIntensity::DetectionZoneCylinderIntensityOverride' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_GetDetectionZoneIntensity, DetectionZoneDecalIntensityOverride) == 0x000010, "Member 'BP_Sky_Post_C_GetDetectionZoneIntensity::DetectionZoneDecalIntensityOverride' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.GetLightingPost
// 0x0028 (0x0028 - 0x0000)
struct BP_Sky_Post_C_GetLightingPost final
{
public:
	TArray<class UPostProcessComponent*>          PostProcess;                                       // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	ELightingInterfaceEnum                        BP_Type;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPostProcessComponent*>          K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Sky_Post_C_GetLightingPost) == 0x000008, "Wrong alignment on BP_Sky_Post_C_GetLightingPost");
static_assert(sizeof(BP_Sky_Post_C_GetLightingPost) == 0x000028, "Wrong size on BP_Sky_Post_C_GetLightingPost");
static_assert(offsetof(BP_Sky_Post_C_GetLightingPost, PostProcess) == 0x000000, "Member 'BP_Sky_Post_C_GetLightingPost::PostProcess' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_GetLightingPost, BP_Type) == 0x000010, "Member 'BP_Sky_Post_C_GetLightingPost::BP_Type' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_GetLightingPost, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_Sky_Post_C_GetLightingPost::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.GetPostprocessComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Sky_Post_C_GetPostprocessComponent final
{
public:
	class UPostProcessComponent*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_GetPostprocessComponent) == 0x000008, "Wrong alignment on BP_Sky_Post_C_GetPostprocessComponent");
static_assert(sizeof(BP_Sky_Post_C_GetPostprocessComponent) == 0x000008, "Wrong size on BP_Sky_Post_C_GetPostprocessComponent");
static_assert(offsetof(BP_Sky_Post_C_GetPostprocessComponent, ReturnValue) == 0x000000, "Member 'BP_Sky_Post_C_GetPostprocessComponent::ReturnValue' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.OnAlphaChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_Sky_Post_C_OnAlphaChanged final
{
public:
	float                                         NewAlpha;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_OnAlphaChanged) == 0x000008, "Wrong alignment on BP_Sky_Post_C_OnAlphaChanged");
static_assert(sizeof(BP_Sky_Post_C_OnAlphaChanged) == 0x000010, "Wrong size on BP_Sky_Post_C_OnAlphaChanged");
static_assert(offsetof(BP_Sky_Post_C_OnAlphaChanged, NewAlpha) == 0x000000, "Member 'BP_Sky_Post_C_OnAlphaChanged::NewAlpha' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_OnAlphaChanged, Other) == 0x000008, "Member 'BP_Sky_Post_C_OnAlphaChanged::Other' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.OnFadeBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_Sky_Post_C_OnFadeBegin final
{
public:
	class AActor*                                 Other;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_OnFadeBegin) == 0x000008, "Wrong alignment on BP_Sky_Post_C_OnFadeBegin");
static_assert(sizeof(BP_Sky_Post_C_OnFadeBegin) == 0x000008, "Wrong size on BP_Sky_Post_C_OnFadeBegin");
static_assert(offsetof(BP_Sky_Post_C_OnFadeBegin, Other) == 0x000000, "Member 'BP_Sky_Post_C_OnFadeBegin::Other' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.Reset Global Parameters
// 0x0004 (0x0004 - 0x0000)
struct BP_Sky_Post_C_Reset_Global_Parameters final
{
public:
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_Reset_Global_Parameters) == 0x000004, "Wrong alignment on BP_Sky_Post_C_Reset_Global_Parameters");
static_assert(sizeof(BP_Sky_Post_C_Reset_Global_Parameters) == 0x000004, "Wrong size on BP_Sky_Post_C_Reset_Global_Parameters");
static_assert(offsetof(BP_Sky_Post_C_Reset_Global_Parameters, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000000, "Member 'BP_Sky_Post_C_Reset_Global_Parameters::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.SetPostOverride
// 0x06F0 (0x06F0 - 0x0000)
struct BP_Sky_Post_C_SetPostOverride final
{
public:
	struct FPostProcessSettings                   PostSettings;                                      // 0x0000(0x06E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	class UPostProcessComponent*                  PostProcess;                                       // 0x06E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_SetPostOverride) == 0x000010, "Wrong alignment on BP_Sky_Post_C_SetPostOverride");
static_assert(sizeof(BP_Sky_Post_C_SetPostOverride) == 0x0006F0, "Wrong size on BP_Sky_Post_C_SetPostOverride");
static_assert(offsetof(BP_Sky_Post_C_SetPostOverride, PostSettings) == 0x000000, "Member 'BP_Sky_Post_C_SetPostOverride::PostSettings' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_SetPostOverride, PostProcess) == 0x0006E0, "Member 'BP_Sky_Post_C_SetPostOverride::PostProcess' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.ToggleLightingChange
// 0x0010 (0x0010 - 0x0000)
struct BP_Sky_Post_C_ToggleLightingChange final
{
public:
	bool                                          ToggleOn;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThemeName;                                         // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sky_Post_C_ToggleLightingChange) == 0x000004, "Wrong alignment on BP_Sky_Post_C_ToggleLightingChange");
static_assert(sizeof(BP_Sky_Post_C_ToggleLightingChange) == 0x000010, "Wrong size on BP_Sky_Post_C_ToggleLightingChange");
static_assert(offsetof(BP_Sky_Post_C_ToggleLightingChange, ToggleOn) == 0x000000, "Member 'BP_Sky_Post_C_ToggleLightingChange::ToggleOn' has a wrong offset!");
static_assert(offsetof(BP_Sky_Post_C_ToggleLightingChange, ThemeName) == 0x000004, "Member 'BP_Sky_Post_C_ToggleLightingChange::ThemeName' has a wrong offset!");

// Function BP_Sky_Post.BP_Sky_Post_C.UpdateMaterials
// 0x02E8 (0x02E8 - 0x0000)
struct BP_Sky_Post_C_UpdateMaterials final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeUnclamped_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeUnclamped_ReturnValue_1;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_1;        // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue_2;        // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue_1;       // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
