#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TL_Paradise

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TL_Paradise.BP_TL_Paradise_C
// 0x01F8 (0x0678 - 0x0480)
class ABP_TL_Paradise_C final : public ABorderTile
{
public:
	class UStaticMeshComponent*                   SM_COM_Grass01_18;                                 // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_17;                                 // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_16;                                 // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_15;                                 // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_14;                                 // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01;                                    // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_27;                                 // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_FieldGrass_02;                         // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_Grass02;                               // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Rock05;                                     // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Rock02;                                     // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Rock01;                                     // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_14;                             // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_26;                                 // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_25;                                 // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_24;                                 // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_23;                                 // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_22;                                 // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_21;                                 // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_20;                                 // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_19;                                 // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_18;                                 // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_17;                                 // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_16;                                 // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_15;                                 // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_14;                                 // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_13;                                 // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_12;                                 // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_11;                                 // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_Grass05_1;                       // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_10;                                 // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_9;                                  // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_8;                                  // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_7;                                  // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_6;                                  // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_5;                                  // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_4;                                  // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_3;                                  // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_2;                                  // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_1;                                  // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass05_0;                                  // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_Grass05_0;                       // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_13;                             // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_12;                             // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_11;                             // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_9;                              // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_8;                              // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_7;                              // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_6;                              // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_5;                              // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_4;                              // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_3;                              // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_2;                              // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_1;                              // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_0;                              // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_PlantFern01_0;                   // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_13;                                 // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_12;                                 // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Inst_Large_Rock_01;                                // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GT_Fr_32x32_Plain01;                            // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root_0;                                            // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TL_Paradise_C">();
	}
	static class ABP_TL_Paradise_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TL_Paradise_C>();
	}
};
static_assert(alignof(ABP_TL_Paradise_C) == 0x000008, "Wrong alignment on ABP_TL_Paradise_C");
static_assert(sizeof(ABP_TL_Paradise_C) == 0x000678, "Wrong size on ABP_TL_Paradise_C");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_18) == 0x000480, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_18' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_17) == 0x000488, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_17' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_16) == 0x000490, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_16' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_15) == 0x000498, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_15' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_14) == 0x0004A0, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_14' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01) == 0x0004A8, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_27) == 0x0004B0, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_27' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, HISM_SM_COM_FieldGrass_02) == 0x0004B8, "Member 'ABP_TL_Paradise_C::HISM_SM_COM_FieldGrass_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, HISM_SM_COM_Grass02) == 0x0004C0, "Member 'ABP_TL_Paradise_C::HISM_SM_COM_Grass02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Rock05) == 0x0004C8, "Member 'ABP_TL_Paradise_C::SM_COM_Rock05' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Rock02) == 0x0004D0, "Member 'ABP_TL_Paradise_C::SM_COM_Rock02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, InstancedStaticMesh) == 0x0004D8, "Member 'ABP_TL_Paradise_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Rock01) == 0x0004E0, "Member 'ABP_TL_Paradise_C::SM_COM_Rock01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_14) == 0x0004E8, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_14' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_26) == 0x0004F0, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_26' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_25) == 0x0004F8, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_25' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_24) == 0x000500, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_24' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_23) == 0x000508, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_23' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_22) == 0x000510, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_22' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_21) == 0x000518, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_21' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_20) == 0x000520, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_20' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_19) == 0x000528, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_19' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_18) == 0x000530, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_18' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_17) == 0x000538, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_17' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_16) == 0x000540, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_16' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_15) == 0x000548, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_15' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_14) == 0x000550, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_14' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_13) == 0x000558, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_13' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_12) == 0x000560, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_12' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_11) == 0x000568, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_11' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, HISM_SPLIT_SM_COM_Grass05_1) == 0x000570, "Member 'ABP_TL_Paradise_C::HISM_SPLIT_SM_COM_Grass05_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_10) == 0x000578, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_10' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_9) == 0x000580, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_9' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_8) == 0x000588, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_8' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_7) == 0x000590, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_7' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_6) == 0x000598, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_6' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_5) == 0x0005A0, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_5' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_4) == 0x0005A8, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_4' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_3) == 0x0005B0, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_2) == 0x0005B8, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_1) == 0x0005C0, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass05_0) == 0x0005C8, "Member 'ABP_TL_Paradise_C::SM_COM_Grass05_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, HISM_SPLIT_SM_COM_Grass05_0) == 0x0005D0, "Member 'ABP_TL_Paradise_C::HISM_SPLIT_SM_COM_Grass05_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_13) == 0x0005D8, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_13' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_12) == 0x0005E0, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_12' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_11) == 0x0005E8, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_11' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_9) == 0x0005F0, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_9' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_8) == 0x0005F8, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_8' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_7) == 0x000600, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_7' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_6) == 0x000608, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_6' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_5) == 0x000610, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_5' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_4) == 0x000618, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_4' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_3) == 0x000620, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_2) == 0x000628, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_1) == 0x000630, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_PlantFern01_0) == 0x000638, "Member 'ABP_TL_Paradise_C::SM_COM_PlantFern01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, HISM_SPLIT_SM_COM_PlantFern01_0) == 0x000640, "Member 'ABP_TL_Paradise_C::HISM_SPLIT_SM_COM_PlantFern01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_13) == 0x000648, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_13' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_COM_Grass01_12) == 0x000650, "Member 'ABP_TL_Paradise_C::SM_COM_Grass01_12' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, Inst_Large_Rock_01) == 0x000658, "Member 'ABP_TL_Paradise_C::Inst_Large_Rock_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, SM_GT_Fr_32x32_Plain01) == 0x000660, "Member 'ABP_TL_Paradise_C::SM_GT_Fr_32x32_Plain01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, Root_0) == 0x000668, "Member 'ABP_TL_Paradise_C::Root_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Paradise_C, NewVar_0) == 0x000670, "Member 'ABP_TL_Paradise_C::NewVar_0' has a wrong offset!");

}

