#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TL_Bd_16x16_Fence01_In

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function BP_TL_Bd_16x16_Fence01_In.BP_TL_Bd_16x16_Fence01_In_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript final
{
public:
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_2;                          // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_3;                          // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FBorderElements                        K2Node_MakeStruct_BorderElements;                  // 0x0040(0x0018)(ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_4;                          // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FBorderElements                        K2Node_MakeStruct_BorderElements_1;                // 0x0068(0x0018)(ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_5;                          // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FBorderElements                        K2Node_MakeStruct_BorderElements_2;                // 0x0090(0x0018)(ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_6;                          // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FBorderElements                        K2Node_MakeStruct_BorderElements_3;                // 0x00B8(0x0018)(ContainsInstancedReference)
	TArray<struct FBorderElements>                K2Node_MakeArray_Array_7;                          // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript");
static_assert(sizeof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript) == 0x0000E0, "Wrong size on BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000010, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_2) == 0x000020, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_3) == 0x000030, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeStruct_BorderElements) == 0x000040, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeStruct_BorderElements' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_4) == 0x000058, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeStruct_BorderElements_1) == 0x000068, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeStruct_BorderElements_1' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_5) == 0x000080, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeStruct_BorderElements_2) == 0x000090, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeStruct_BorderElements_2' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_6) == 0x0000A8, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeStruct_BorderElements_3) == 0x0000B8, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeStruct_BorderElements_3' has a wrong offset!");
static_assert(offsetof(BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript, K2Node_MakeArray_Array_7) == 0x0000D0, "Member 'BP_TL_Bd_16x16_Fence01_In_C_UserConstructionScript::K2Node_MakeArray_Array_7' has a wrong offset!");

}

