#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TL_Wl_16x16_HD04

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TL_Wl_16x16_HD04.BP_TL_Wl_16x16_HD04_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_TL_Wl_16x16_HD04_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_RandomBoolFromStream_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorSpawner*>                  K2Node_MakeArray_Array_3;                          // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_TL_Wl_16x16_HD04_C_UserConstructionScript");
static_assert(sizeof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript) == 0x000048, "Wrong size on BP_TL_Wl_16x16_HD04_C_UserConstructionScript");
static_assert(offsetof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript, CallFunc_RandomBoolFromStream_ReturnValue) == 0x000000, "Member 'BP_TL_Wl_16x16_HD04_C_UserConstructionScript::CallFunc_RandomBoolFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_TL_Wl_16x16_HD04_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000018, "Member 'BP_TL_Wl_16x16_HD04_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript, K2Node_MakeArray_Array_2) == 0x000028, "Member 'BP_TL_Wl_16x16_HD04_C_UserConstructionScript::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_TL_Wl_16x16_HD04_C_UserConstructionScript, K2Node_MakeArray_Array_3) == 0x000038, "Member 'BP_TL_Wl_16x16_HD04_C_UserConstructionScript::K2Node_MakeArray_Array_3' has a wrong offset!");

}

