#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TL_Fr_16x16_MD04

#include "Basic.hpp"

#include "TileBase01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TL_Fr_16x16_MD04.BP_TL_Fr_16x16_MD04_C
// 0x01B8 (0x07B8 - 0x0600)
class ABP_TL_Fr_16x16_MD04_C final : public ATileBase01_C
{
public:
	class UActorSpawner*                          CalamariCageSpawner;                               // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Rock01;                                     // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_IND_TallTree04_2;                               // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_IND_TallTree04_1;                               // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_IND_TallTree04_0;                               // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Rock03;                                     // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Ind_BrokenTree_02;                              // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNatAudioAmbienceBox*                   AudioAmbBox_Forest;                                // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_Grass04;                               // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_Grass03;                               // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_Grass02;                               // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_Grass01;                               // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_FieldGrass_01;                         // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_IND_TallTree04_0;                    // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree03_3;                              // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree03_2;                              // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree03_1;                              // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree03_0;                              // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_SmallTree03_0;                   // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_5;                              // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_4;                              // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_3;                              // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_2;                              // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_1;                              // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_0;                              // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_PlantFern01_0;                   // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_FieldGrass_01_89;                           // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_FieldGrass_01_79;                           // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_FieldGrass_01_72;                           // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_FieldGrass_01_1;                 // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDSphereReflectionCaptureSpawnerComponent* Mobile__Reflection01;                              // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorVariationSpawner*                 AVS_TreevStump_01;                                 // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_TallTree04_Leaves;                            // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_TallTree04_Leaves_shadow;                     // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_06;                            // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_05;                            // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_BigTree01_05;                               // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_BigTree01_03;                               // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_04;                            // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_BK_Boulder02_01;                                // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_BigTree01_04;                               // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_02;                            // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_BigTree01_01;                               // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_01;                            // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_BK_Boulder02_03;                                // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_BK_Boulder02_02;                                // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_BigTree01_02;                               // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_03;                            // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Falling_Pine_Leaves;                            // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ground;                                            // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Small_grass;                                       // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner8;                                     // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner7;                                     // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Trees;                                             // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root_0;                                            // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TL_Fr_16x16_MD04_C">();
	}
	static class ABP_TL_Fr_16x16_MD04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TL_Fr_16x16_MD04_C>();
	}
};
static_assert(alignof(ABP_TL_Fr_16x16_MD04_C) == 0x000008, "Wrong alignment on ABP_TL_Fr_16x16_MD04_C");
static_assert(sizeof(ABP_TL_Fr_16x16_MD04_C) == 0x0007B8, "Wrong size on ABP_TL_Fr_16x16_MD04_C");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, CalamariCageSpawner) == 0x000600, "Member 'ABP_TL_Fr_16x16_MD04_C::CalamariCageSpawner' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_Rock01) == 0x000608, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_Rock01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_IND_TallTree04_2) == 0x000610, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_IND_TallTree04_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_IND_TallTree04_1) == 0x000618, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_IND_TallTree04_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_IND_TallTree04_0) == 0x000620, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_IND_TallTree04_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_Rock03) == 0x000628, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_Rock03' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_Ind_BrokenTree_02) == 0x000630, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_Ind_BrokenTree_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, AudioAmbBox_Forest) == 0x000638, "Member 'ABP_TL_Fr_16x16_MD04_C::AudioAmbBox_Forest' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SM_COM_Grass04) == 0x000640, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SM_COM_Grass04' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SM_COM_Grass03) == 0x000648, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SM_COM_Grass03' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SM_COM_Grass02) == 0x000650, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SM_COM_Grass02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SM_COM_Grass01) == 0x000658, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SM_COM_Grass01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SM_COM_FieldGrass_01) == 0x000660, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SM_COM_FieldGrass_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SPLIT_SM_IND_TallTree04_0) == 0x000668, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SPLIT_SM_IND_TallTree04_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_SmallTree03_3) == 0x000670, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_SmallTree03_3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_SmallTree03_2) == 0x000678, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_SmallTree03_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_SmallTree03_1) == 0x000680, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_SmallTree03_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_SmallTree03_0) == 0x000688, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_SmallTree03_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SPLIT_SM_COM_SmallTree03_0) == 0x000690, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SPLIT_SM_COM_SmallTree03_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_PlantFern01_5) == 0x000698, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_PlantFern01_5' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_PlantFern01_4) == 0x0006A0, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_PlantFern01_4' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_PlantFern01_3) == 0x0006A8, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_PlantFern01_3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_PlantFern01_2) == 0x0006B0, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_PlantFern01_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_PlantFern01_1) == 0x0006B8, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_PlantFern01_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_PlantFern01_0) == 0x0006C0, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_PlantFern01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SPLIT_SM_COM_PlantFern01_0) == 0x0006C8, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SPLIT_SM_COM_PlantFern01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_FieldGrass_01_89) == 0x0006D0, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_FieldGrass_01_89' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_FieldGrass_01_79) == 0x0006D8, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_FieldGrass_01_79' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, SM_COM_FieldGrass_01_72) == 0x0006E0, "Member 'ABP_TL_Fr_16x16_MD04_C::SM_COM_FieldGrass_01_72' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_SPLIT_SM_COM_FieldGrass_01_1) == 0x0006E8, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_SPLIT_SM_COM_FieldGrass_01_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, Mobile__Reflection01) == 0x0006F0, "Member 'ABP_TL_Fr_16x16_MD04_C::Mobile__Reflection01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, AVS_TreevStump_01) == 0x0006F8, "Member 'ABP_TL_Fr_16x16_MD04_C::AVS_TreevStump_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_TallTree04_Leaves) == 0x000700, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_TallTree04_Leaves' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, HISM_TallTree04_Leaves_shadow) == 0x000708, "Member 'ABP_TL_Fr_16x16_MD04_C::HISM_TallTree04_Leaves_shadow' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_MediumTree01_06) == 0x000710, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_MediumTree01_06' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_MediumTree01_05) == 0x000718, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_MediumTree01_05' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_BigTree01_05) == 0x000720, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_BigTree01_05' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_BigTree01_03) == 0x000728, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_BigTree01_03' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_MediumTree01_04) == 0x000730, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_MediumTree01_04' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_BK_Boulder02_01) == 0x000738, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_BK_Boulder02_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_BigTree01_04) == 0x000740, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_BigTree01_04' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_MediumTree01_02) == 0x000748, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_MediumTree01_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_BigTree01_01) == 0x000750, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_BigTree01_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_MediumTree01_01) == 0x000758, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_MediumTree01_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_BK_Boulder02_03) == 0x000760, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_BK_Boulder02_03' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_BK_Boulder02_02) == 0x000768, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_BK_Boulder02_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_BigTree01_02) == 0x000770, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_BigTree01_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, BP_IND_MediumTree01_03) == 0x000778, "Member 'ABP_TL_Fr_16x16_MD04_C::BP_IND_MediumTree01_03' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, FX_Falling_Pine_Leaves) == 0x000780, "Member 'ABP_TL_Fr_16x16_MD04_C::FX_Falling_Pine_Leaves' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, Ground) == 0x000788, "Member 'ABP_TL_Fr_16x16_MD04_C::Ground' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, Small_grass) == 0x000790, "Member 'ABP_TL_Fr_16x16_MD04_C::Small_grass' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, ActorSpawner8) == 0x000798, "Member 'ABP_TL_Fr_16x16_MD04_C::ActorSpawner8' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, ActorSpawner7) == 0x0007A0, "Member 'ABP_TL_Fr_16x16_MD04_C::ActorSpawner7' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, Trees) == 0x0007A8, "Member 'ABP_TL_Fr_16x16_MD04_C::Trees' has a wrong offset!");
static_assert(offsetof(ABP_TL_Fr_16x16_MD04_C, Root_0) == 0x0007B0, "Member 'ABP_TL_Fr_16x16_MD04_C::Root_0' has a wrong offset!");

}

