#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trash02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trash02.BP_Trash02_C
// 0x0058 (0x02F8 - 0x02A0)
class ABP_Trash02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Trash01_Collision;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_WoodPlank02;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_WoodPlank03;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        WoodPieces;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Barrel_Spilled01;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_Barrel_Open01;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_Barrel_Closed01;                                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Barrels;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_PanelMetalCorrugate05;                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BK_Tire01;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Trash02;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trash02_C">();
	}
	static class ABP_Trash02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trash02_C>();
	}
};
static_assert(alignof(ABP_Trash02_C) == 0x000008, "Wrong alignment on ABP_Trash02_C");
static_assert(sizeof(ABP_Trash02_C) == 0x0002F8, "Wrong size on ABP_Trash02_C");
static_assert(offsetof(ABP_Trash02_C, SM_Trash01_Collision) == 0x0002A0, "Member 'ABP_Trash02_C::SM_Trash01_Collision' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_WoodPlank02) == 0x0002A8, "Member 'ABP_Trash02_C::SM_WoodPlank02' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_WoodPlank03) == 0x0002B0, "Member 'ABP_Trash02_C::SM_WoodPlank03' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, WoodPieces) == 0x0002B8, "Member 'ABP_Trash02_C::WoodPieces' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_Barrel_Spilled01) == 0x0002C0, "Member 'ABP_Trash02_C::SM_Barrel_Spilled01' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_Barrel_Open01) == 0x0002C8, "Member 'ABP_Trash02_C::SM_Barrel_Open01' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_Barrel_Closed01) == 0x0002D0, "Member 'ABP_Trash02_C::SM_Barrel_Closed01' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, Barrels) == 0x0002D8, "Member 'ABP_Trash02_C::Barrels' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_PanelMetalCorrugate05) == 0x0002E0, "Member 'ABP_Trash02_C::SM_PanelMetalCorrugate05' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, SM_BK_Tire01) == 0x0002E8, "Member 'ABP_Trash02_C::SM_BK_Tire01' has a wrong offset!");
static_assert(offsetof(ABP_Trash02_C, BP_Trash02) == 0x0002F0, "Member 'ABP_Trash02_C::BP_Trash02' has a wrong offset!");

}

