#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TL_Lm_16x16_LumberPile01

#include "Basic.hpp"

#include "TileBase01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TL_Lm_16x16_LumberPile01.BP_TL_Lm_16x16_LumberPile01_C
// 0x0208 (0x0808 - 0x0600)
class ABP_TL_Lm_16x16_LumberPile01_C final : public ATileBase01_C
{
public:
	class UActorSpawner*                          CalamariCageSpawner;                               // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_CollisionTool1;                                 // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_CollisionTool;                                  // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDInstancedFoliageComponent*          InstancedFoliageActor;                             // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_EMT_LumberPile_01;                        // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTileSpawnPoint*                        MoriFinisher1;                                     // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner4;                                     // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner5;                                     // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNatAudioAmbienceBox*                   AudioAmbBox_Forest;                                // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          Fire2;                                             // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_Grass01;                               // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HISM_SM_COM_FieldGrass_01;                         // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BK_Machinery01_0;                               // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_BK_Machinery01_0;                    // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_40;                                 // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_Grass01_27;                                 // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_Grass01_2;                       // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_17;                             // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_16;                             // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_15;                             // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_14;                             // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_13;                             // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_12;                             // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_11;                             // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_10;                             // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_9;                              // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_8;                              // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_7;                              // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_6;                              // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_5;                              // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_4;                              // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_3;                              // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_2;                              // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_1;                              // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_SmallTree02_0;                              // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_SmallTree02_0;                   // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_11;                             // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_10;                             // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_9;                              // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_8;                              // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_7;                              // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_6;                              // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_5;                              // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_4;                              // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_3;                              // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_2;                              // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_1;                              // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_COM_PlantFern01_0;                              // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HISM_SPLIT_SM_COM_PlantFern01_0;                   // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner3;                                     // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner2;                                     // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner;                                      // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          ActorSpawner1;                                     // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          HexSpawner02;                                      // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ground;                                            // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Vegetation;                                        // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LM_LumberPile01;                                // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDSphereReflectionCaptureSpawnerComponent* MobileReflection;                                  // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          Fire1;                                             // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_03;                            // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_LogPile01_02;                                   // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_LogPile01_01;                                   // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_02;                            // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSpawner*                          BP_IND_MediumTree01_01;                            // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TL_Lm_16x16_LumberPile01_C">();
	}
	static class ABP_TL_Lm_16x16_LumberPile01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TL_Lm_16x16_LumberPile01_C>();
	}
};
static_assert(alignof(ABP_TL_Lm_16x16_LumberPile01_C) == 0x000008, "Wrong alignment on ABP_TL_Lm_16x16_LumberPile01_C");
static_assert(sizeof(ABP_TL_Lm_16x16_LumberPile01_C) == 0x000808, "Wrong size on ABP_TL_Lm_16x16_LumberPile01_C");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, CalamariCageSpawner) == 0x000600, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::CalamariCageSpawner' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_CollisionTool1) == 0x000608, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_CollisionTool1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_CollisionTool) == 0x000610, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_CollisionTool' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, InstancedFoliageActor) == 0x000618, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::InstancedFoliageActor' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, Ak_Audio_EMT_LumberPile_01) == 0x000620, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::Ak_Audio_EMT_LumberPile_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, MoriFinisher1) == 0x000628, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::MoriFinisher1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, ActorSpawner4) == 0x000630, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::ActorSpawner4' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, ActorSpawner5) == 0x000638, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::ActorSpawner5' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, AudioAmbBox_Forest) == 0x000640, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::AudioAmbBox_Forest' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, Fire2) == 0x000648, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::Fire2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HISM_SM_COM_Grass01) == 0x000650, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HISM_SM_COM_Grass01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HISM_SM_COM_FieldGrass_01) == 0x000658, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HISM_SM_COM_FieldGrass_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_BK_Machinery01_0) == 0x000660, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_BK_Machinery01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HISM_SPLIT_SM_BK_Machinery01_0) == 0x000668, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HISM_SPLIT_SM_BK_Machinery01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_Grass01_40) == 0x000670, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_Grass01_40' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_Grass01_27) == 0x000678, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_Grass01_27' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HISM_SPLIT_SM_COM_Grass01_2) == 0x000680, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HISM_SPLIT_SM_COM_Grass01_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_17) == 0x000688, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_17' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_16) == 0x000690, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_16' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_15) == 0x000698, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_15' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_14) == 0x0006A0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_14' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_13) == 0x0006A8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_13' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_12) == 0x0006B0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_12' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_11) == 0x0006B8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_11' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_10) == 0x0006C0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_10' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_9) == 0x0006C8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_9' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_8) == 0x0006D0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_8' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_7) == 0x0006D8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_7' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_6) == 0x0006E0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_6' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_5) == 0x0006E8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_5' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_4) == 0x0006F0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_4' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_3) == 0x0006F8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_2) == 0x000700, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_1) == 0x000708, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_SmallTree02_0) == 0x000710, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_SmallTree02_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HISM_SPLIT_SM_COM_SmallTree02_0) == 0x000718, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HISM_SPLIT_SM_COM_SmallTree02_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_11) == 0x000720, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_11' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_10) == 0x000728, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_10' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_9) == 0x000730, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_9' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_8) == 0x000738, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_8' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_7) == 0x000740, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_7' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_6) == 0x000748, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_6' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_5) == 0x000750, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_5' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_4) == 0x000758, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_4' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_3) == 0x000760, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_2) == 0x000768, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_1) == 0x000770, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_COM_PlantFern01_0) == 0x000778, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_COM_PlantFern01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HISM_SPLIT_SM_COM_PlantFern01_0) == 0x000780, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HISM_SPLIT_SM_COM_PlantFern01_0' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, ActorSpawner3) == 0x000788, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::ActorSpawner3' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, ActorSpawner2) == 0x000790, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::ActorSpawner2' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, ActorSpawner) == 0x000798, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::ActorSpawner' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, ActorSpawner1) == 0x0007A0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::ActorSpawner1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, HexSpawner02) == 0x0007A8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::HexSpawner02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, Ground) == 0x0007B0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::Ground' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, Vegetation) == 0x0007B8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::Vegetation' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, SM_LM_LumberPile01) == 0x0007C0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::SM_LM_LumberPile01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, MobileReflection) == 0x0007C8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::MobileReflection' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, Fire1) == 0x0007D0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::Fire1' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_IND_MediumTree01_03) == 0x0007D8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_IND_MediumTree01_03' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_LogPile01_02) == 0x0007E0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_LogPile01_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_LogPile01_01) == 0x0007E8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_LogPile01_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_IND_MediumTree01_02) == 0x0007F0, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_IND_MediumTree01_02' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, BP_IND_MediumTree01_01) == 0x0007F8, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::BP_IND_MediumTree01_01' has a wrong offset!");
static_assert(offsetof(ABP_TL_Lm_16x16_LumberPile01_C, Scene1) == 0x000800, "Member 'ABP_TL_Lm_16x16_LumberPile01_C::Scene1' has a wrong offset!");

}

