#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_Killer_AnimNotifies_Handler

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VFX_Killer_AnimNotifies_Handler.BP_VFX_Killer_AnimNotifies_Handler_C.HandleAnimNotify
// 0x0050 (0x0050 - 0x0000)
struct BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   NotifyName;                                        // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VFXNotifyName;                                     // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         My_Slasher;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ADBDBasePlayer*                         K2Node_DynamicCast_AsDBDBase_Player;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleKillerNotifies_WallBreak_Return_Value; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleKillerNotifies_Footsteps_ReturnValue; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleKillerNotifies_General_ReturnValue; // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify) == 0x000008, "Wrong alignment on BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify");
static_assert(sizeof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify) == 0x000050, "Wrong size on BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, Player) == 0x000000, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::Player' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, NotifyName) == 0x000008, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::NotifyName' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, ReturnValue) == 0x000014, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, VFXNotifyName) == 0x000018, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::VFXNotifyName' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, My_Slasher) == 0x000028, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::My_Slasher' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, K2Node_DynamicCast_AsDBDBase_Player) == 0x000030, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::K2Node_DynamicCast_AsDBDBase_Player' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, K2Node_DynamicCast_AsSlasher_Player) == 0x000040, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_HandleKillerNotifies_WallBreak_Return_Value) == 0x000049, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_HandleKillerNotifies_WallBreak_Return_Value' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_HandleKillerNotifies_Footsteps_ReturnValue) == 0x00004A, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_HandleKillerNotifies_Footsteps_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify, CallFunc_HandleKillerNotifies_General_ReturnValue) == 0x00004B, "Member 'BP_VFX_Killer_AnimNotifies_Handler_C_HandleAnimNotify::CallFunc_HandleKillerNotifies_General_ReturnValue' has a wrong offset!");

}

