#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_IBLNightmareBooster

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_IBLNightmareBooster.BPC_IBLNightmareBooster_C.ExecuteUbergraph_BPC_IBLNightmareBooster
// 0x0020 (0x0020 - 0x0000)
struct BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Sky_Post_C*                         K2Node_DynamicCast_AsBP_Sky_Post;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster) == 0x000008, "Wrong alignment on BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster");
static_assert(sizeof(BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster) == 0x000020, "Wrong size on BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster");
static_assert(offsetof(BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster, EntryPoint) == 0x000000, "Member 'BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster, K2Node_DynamicCast_AsBP_Sky_Post) == 0x000010, "Member 'BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster::K2Node_DynamicCast_AsBP_Sky_Post' has a wrong offset!");
static_assert(offsetof(BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_IBLNightmareBooster_C_ExecuteUbergraph_BPC_IBLNightmareBooster::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

