#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_EventFunctions

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function BPFL_EventFunctions.BPFL_EventFunctions_C.LocallyDispatchEvent
// 0x0070 (0x0070 - 0x0000)
struct BPFL_EventFunctions_C_LocallyDispatchEvent final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Instigator;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Value;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameEventDispatcher*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameEventData                         K2Node_MakeStruct_GameEventData;                   // 0x0038(0x0030)(NoDestructor)
	float                                         K2Node_MakeStruct_CustomValue_ImplicitCast;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventFunctions_C_LocallyDispatchEvent) == 0x000008, "Wrong alignment on BPFL_EventFunctions_C_LocallyDispatchEvent");
static_assert(sizeof(BPFL_EventFunctions_C_LocallyDispatchEvent) == 0x000070, "Wrong size on BPFL_EventFunctions_C_LocallyDispatchEvent");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, GameEventType) == 0x000000, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::GameEventType' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, Instigator) == 0x000010, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::Instigator' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, Target) == 0x000018, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::Target' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, Custom_Value) == 0x000020, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::Custom_Value' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, __WorldContext) == 0x000028, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, K2Node_MakeStruct_GameEventData) == 0x000038, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::K2Node_MakeStruct_GameEventData' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_LocallyDispatchEvent, K2Node_MakeStruct_CustomValue_ImplicitCast) == 0x000068, "Member 'BPFL_EventFunctions_C_LocallyDispatchEvent::K2Node_MakeStruct_CustomValue_ImplicitCast' has a wrong offset!");

// Function BPFL_EventFunctions.BPFL_EventFunctions_C.RegisterEventListener
// 0x0070 (0x0070 - 0x0000)
struct BPFL_EventFunctions_C_RegisterEventListener final
{
public:
	TDelegate<void(struct FGameplayTag& GameEventType, struct FGameEventData& GameEventData)> Game_Event_Delegate;                               // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Filter;                                            // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameEventDispatcherHandleBP           GameEventDispatcherHandle;                         // 0x0028(0x0020)(Parm, OutParm, NoDestructor, ContainsInstancedReference)
	struct FGameEventDispatcherHandleBP           K2Node_MakeStruct_GameEventDispatcherHandleBP;     // 0x0048(0x0020)(NoDestructor, ContainsInstancedReference)
	class UGameEventDispatcher*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventFunctions_C_RegisterEventListener) == 0x000008, "Wrong alignment on BPFL_EventFunctions_C_RegisterEventListener");
static_assert(sizeof(BPFL_EventFunctions_C_RegisterEventListener) == 0x000070, "Wrong size on BPFL_EventFunctions_C_RegisterEventListener");
static_assert(offsetof(BPFL_EventFunctions_C_RegisterEventListener, Game_Event_Delegate) == 0x000000, "Member 'BPFL_EventFunctions_C_RegisterEventListener::Game_Event_Delegate' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RegisterEventListener, Filter) == 0x000014, "Member 'BPFL_EventFunctions_C_RegisterEventListener::Filter' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RegisterEventListener, __WorldContext) == 0x000020, "Member 'BPFL_EventFunctions_C_RegisterEventListener::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RegisterEventListener, GameEventDispatcherHandle) == 0x000028, "Member 'BPFL_EventFunctions_C_RegisterEventListener::GameEventDispatcherHandle' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RegisterEventListener, K2Node_MakeStruct_GameEventDispatcherHandleBP) == 0x000048, "Member 'BPFL_EventFunctions_C_RegisterEventListener::K2Node_MakeStruct_GameEventDispatcherHandleBP' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RegisterEventListener, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000068, "Member 'BPFL_EventFunctions_C_RegisterEventListener::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function BPFL_EventFunctions.BPFL_EventFunctions_C.RemotelyDispatchEvent
// 0x0070 (0x0070 - 0x0000)
struct BPFL_EventFunctions_C_RemotelyDispatchEvent final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Instigator;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Custom_Value;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameEventDispatcher*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameEventData                         K2Node_MakeStruct_GameEventData;                   // 0x0038(0x0030)(NoDestructor)
	float                                         K2Node_MakeStruct_CustomValue_ImplicitCast;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventFunctions_C_RemotelyDispatchEvent) == 0x000008, "Wrong alignment on BPFL_EventFunctions_C_RemotelyDispatchEvent");
static_assert(sizeof(BPFL_EventFunctions_C_RemotelyDispatchEvent) == 0x000070, "Wrong size on BPFL_EventFunctions_C_RemotelyDispatchEvent");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, GameEventType) == 0x000000, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::GameEventType' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, Instigator) == 0x000010, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::Instigator' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, Target) == 0x000018, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::Target' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, Custom_Value) == 0x000020, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::Custom_Value' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, __WorldContext) == 0x000028, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, K2Node_MakeStruct_GameEventData) == 0x000038, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::K2Node_MakeStruct_GameEventData' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_RemotelyDispatchEvent, K2Node_MakeStruct_CustomValue_ImplicitCast) == 0x000068, "Member 'BPFL_EventFunctions_C_RemotelyDispatchEvent::K2Node_MakeStruct_CustomValue_ImplicitCast' has a wrong offset!");

// Function BPFL_EventFunctions.BPFL_EventFunctions_C.UnregisterEventListener
// 0x0030 (0x0030 - 0x0000)
struct BPFL_EventFunctions_C_UnregisterEventListener final
{
public:
	struct FGameEventDispatcherHandleBP           Game_Event_Delegate_Handle;                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameEventDispatcher*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventFunctions_C_UnregisterEventListener) == 0x000008, "Wrong alignment on BPFL_EventFunctions_C_UnregisterEventListener");
static_assert(sizeof(BPFL_EventFunctions_C_UnregisterEventListener) == 0x000030, "Wrong size on BPFL_EventFunctions_C_UnregisterEventListener");
static_assert(offsetof(BPFL_EventFunctions_C_UnregisterEventListener, Game_Event_Delegate_Handle) == 0x000000, "Member 'BPFL_EventFunctions_C_UnregisterEventListener::Game_Event_Delegate_Handle' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_UnregisterEventListener, __WorldContext) == 0x000020, "Member 'BPFL_EventFunctions_C_UnregisterEventListener::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventFunctions_C_UnregisterEventListener, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'BPFL_EventFunctions_C_UnregisterEventListener::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

}

