#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_CustomizationFunctions

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_CustomizationFunctions.BPFL_CustomizationFunctions_C.GetOwningSkeletalMesh
// 0x0030 (0x0030 - 0x0000)
struct BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh final
{
public:
	class UAnimInstance*                          Anim_Instance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Skeletal_Mesh_Component;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOuterMostActor_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh) == 0x000008, "Wrong alignment on BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh");
static_assert(sizeof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh) == 0x000030, "Wrong size on BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh");
static_assert(offsetof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh, Anim_Instance) == 0x000000, "Member 'BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh::Anim_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh, __WorldContext) == 0x000008, "Member 'BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh, Skeletal_Mesh_Component) == 0x000010, "Member 'BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh::Skeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh, CallFunc_GetOuterMostActor_ReturnValue) == 0x000018, "Member 'BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh::CallFunc_GetOuterMostActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BPFL_CustomizationFunctions_C_GetOwningSkeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

