#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_UI_DebugConstructors

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function BPFL_UI_DebugConstructors.BPFL_UI_DebugConstructors_C.Debug_MakePriceTag
// 0x00C8 (0x00C8 - 0x0000)
struct BPFL_UI_DebugConstructors_C_Debug_MakePriceTag final
{
public:
	ECurrencyType                                 Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPriceTagViewData                      PriceTag;                                          // 0x0010(0x0050)(Parm, OutParm)
	int32                                         FullAmount;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPriceTagViewData                      K2Node_MakeStruct_PriceTagViewData;                // 0x0078(0x0050)()
};
static_assert(alignof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag) == 0x000008, "Wrong alignment on BPFL_UI_DebugConstructors_C_Debug_MakePriceTag");
static_assert(sizeof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag) == 0x0000C8, "Wrong size on BPFL_UI_DebugConstructors_C_Debug_MakePriceTag");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, Type) == 0x000000, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::Type' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, __WorldContext) == 0x000008, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, PriceTag) == 0x000010, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::PriceTag' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, FullAmount) == 0x000060, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::FullAmount' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, Amount) == 0x000064, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::Amount' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, CallFunc_RandomBool_ReturnValue) == 0x000068, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, CallFunc_Multiply_IntInt_ReturnValue) == 0x00006C, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, CallFunc_RandomBool_ReturnValue_1) == 0x000070, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000074, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTag, K2Node_MakeStruct_PriceTagViewData) == 0x000078, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTag::K2Node_MakeStruct_PriceTagViewData' has a wrong offset!");

// Function BPFL_UI_DebugConstructors.BPFL_UI_DebugConstructors_C.Debug_MakePriceTagArray
// 0x00C8 (0x00C8 - 0x0000)
struct BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPriceTagViewData>              PriceTagArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	struct FPriceTagViewData                      CallFunc_Debug_MakePriceTag_PriceTag;              // 0x0018(0x0050)()
	struct FPriceTagViewData                      CallFunc_Debug_MakePriceTag_PriceTag_1;            // 0x0068(0x0050)()
	TArray<struct FPriceTagViewData>              K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
};
static_assert(alignof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray) == 0x000008, "Wrong alignment on BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray");
static_assert(sizeof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray) == 0x0000C8, "Wrong size on BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray, __WorldContext) == 0x000000, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray, PriceTagArray) == 0x000008, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray::PriceTagArray' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray, CallFunc_Debug_MakePriceTag_PriceTag) == 0x000018, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray::CallFunc_Debug_MakePriceTag_PriceTag' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray, CallFunc_Debug_MakePriceTag_PriceTag_1) == 0x000068, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray::CallFunc_Debug_MakePriceTag_PriceTag_1' has a wrong offset!");
static_assert(offsetof(BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BPFL_UI_DebugConstructors_C_Debug_MakePriceTagArray::K2Node_MakeArray_Array' has a wrong offset!");

}

