#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BWEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BWEffect.BWEffect_C.DecrementNumBleedingOutPlayers
// 0x000C (0x000C - 0x0000)
struct BWEffect_C_DecrementNumBleedingOutPlayers final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BWEffect_C_DecrementNumBleedingOutPlayers) == 0x000004, "Wrong alignment on BWEffect_C_DecrementNumBleedingOutPlayers");
static_assert(sizeof(BWEffect_C_DecrementNumBleedingOutPlayers) == 0x00000C, "Wrong size on BWEffect_C_DecrementNumBleedingOutPlayers");
static_assert(offsetof(BWEffect_C_DecrementNumBleedingOutPlayers, Temp_int_Variable) == 0x000000, "Member 'BWEffect_C_DecrementNumBleedingOutPlayers::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BWEffect_C_DecrementNumBleedingOutPlayers, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'BWEffect_C_DecrementNumBleedingOutPlayers::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_DecrementNumBleedingOutPlayers, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BWEffect_C_DecrementNumBleedingOutPlayers::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BWEffect.BWEffect_C.ExecuteUbergraph_BWEffect
// 0x0740 (0x0740 - 0x0000)
struct BWEffect_C_ExecuteUbergraph_BWEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPercentInjuredBleedoutTimer_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInInjuredBleedout_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0050(0x06E0)()
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_VignetteIntensity_ImplicitCast;  // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BWEffect_C_ExecuteUbergraph_BWEffect) == 0x000010, "Wrong alignment on BWEffect_C_ExecuteUbergraph_BWEffect");
static_assert(sizeof(BWEffect_C_ExecuteUbergraph_BWEffect) == 0x000740, "Wrong size on BWEffect_C_ExecuteUbergraph_BWEffect");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, EntryPoint) == 0x000000, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_GetLocallyObservedCharacter_ReturnValue) == 0x000008, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_GetLocallyObservedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_DynamicCast_AsSlasher_Player) == 0x000010, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_DynamicCast_AsCamper_Player) == 0x000020, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_GetHealthComponent_ReturnValue) == 0x000030, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_GetPercentInjuredBleedoutTimer_ReturnValue) == 0x000038, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_GetPercentInjuredBleedoutTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_IsInInjuredBleedout_ReturnValue) == 0x00003C, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_IsInInjuredBleedout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_Lerp_ReturnValue) == 0x000040, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_MakeStruct_PostProcessSettings) == 0x000050, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000730, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BWEffect_C_ExecuteUbergraph_BWEffect, K2Node_MakeStruct_VignetteIntensity_ImplicitCast) == 0x000738, "Member 'BWEffect_C_ExecuteUbergraph_BWEffect::K2Node_MakeStruct_VignetteIntensity_ImplicitCast' has a wrong offset!");

// Function BWEffect.BWEffect_C.IncrementNumBleedingOutPlayers
// 0x000C (0x000C - 0x0000)
struct BWEffect_C_IncrementNumBleedingOutPlayers final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BWEffect_C_IncrementNumBleedingOutPlayers) == 0x000004, "Wrong alignment on BWEffect_C_IncrementNumBleedingOutPlayers");
static_assert(sizeof(BWEffect_C_IncrementNumBleedingOutPlayers) == 0x00000C, "Wrong size on BWEffect_C_IncrementNumBleedingOutPlayers");
static_assert(offsetof(BWEffect_C_IncrementNumBleedingOutPlayers, Temp_int_Variable) == 0x000000, "Member 'BWEffect_C_IncrementNumBleedingOutPlayers::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BWEffect_C_IncrementNumBleedingOutPlayers, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'BWEffect_C_IncrementNumBleedingOutPlayers::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BWEffect_C_IncrementNumBleedingOutPlayers, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BWEffect_C_IncrementNumBleedingOutPlayers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BWEffect.BWEffect_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BWEffect_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BWEffect_C_ReceiveTick) == 0x000004, "Wrong alignment on BWEffect_C_ReceiveTick");
static_assert(sizeof(BWEffect_C_ReceiveTick) == 0x000004, "Wrong size on BWEffect_C_ReceiveTick");
static_assert(offsetof(BWEffect_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BWEffect_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

