#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BWEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BWEffect.BWEffect_C
// 0x0020 (0x02C0 - 0x02A0)
class ABWEffect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PP_Bleedout;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         NumBleedingOutPlayers;                             // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Activate();
	void Deactivate();
	void DecrementNumBleedingOutPlayers();
	void ExecuteUbergraph_BWEffect(int32 EntryPoint);
	void IncrementNumBleedingOutPlayers();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BWEffect_C">();
	}
	static class ABWEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABWEffect_C>();
	}
};
static_assert(alignof(ABWEffect_C) == 0x000008, "Wrong alignment on ABWEffect_C");
static_assert(sizeof(ABWEffect_C) == 0x0002C0, "Wrong size on ABWEffect_C");
static_assert(offsetof(ABWEffect_C, UberGraphFrame) == 0x0002A0, "Member 'ABWEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABWEffect_C, PP_Bleedout) == 0x0002A8, "Member 'ABWEffect_C::PP_Bleedout' has a wrong offset!");
static_assert(offsetof(ABWEffect_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABWEffect_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABWEffect_C, NumBleedingOutPlayers) == 0x0002B8, "Member 'ABWEffect_C::NumBleedingOutPlayers' has a wrong offset!");

}

