#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetExitFast

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function ClosetExitFast.ClosetExitFast_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct ClosetExitFast_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetExitFast_C_OnInteractionFinished) == 0x000008, "Wrong alignment on ClosetExitFast_C_OnInteractionFinished");
static_assert(sizeof(ClosetExitFast_C_OnInteractionFinished) == 0x000010, "Wrong size on ClosetExitFast_C_OnInteractionFinished");
static_assert(offsetof(ClosetExitFast_C_OnInteractionFinished, Player) == 0x000000, "Member 'ClosetExitFast_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'ClosetExitFast_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function ClosetExitFast.ClosetExitFast_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct ClosetExitFast_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetExitFast_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on ClosetExitFast_C_OnInteractionEnterStart");
static_assert(sizeof(ClosetExitFast_C_OnInteractionEnterStart) == 0x000010, "Wrong size on ClosetExitFast_C_OnInteractionEnterStart");
static_assert(offsetof(ClosetExitFast_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'ClosetExitFast_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'ClosetExitFast_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function ClosetExitFast.ClosetExitFast_C.ExecuteUbergraph_ClosetExitFast
// 0x0050 (0x0050 - 0x0000)
struct ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALocker*                                CallFunc_GetLocker_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimationMontageSlave*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMontagePlayer*                         CallFunc_GetMontagePlayer_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALocker*                                CallFunc_GetLocker_ReturnValue_1;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationMontageSlave*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast) == 0x000008, "Wrong alignment on ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast");
static_assert(sizeof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast) == 0x000050, "Wrong size on ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, EntryPoint) == 0x000000, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, CallFunc_GetLocker_ReturnValue) == 0x000008, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::CallFunc_GetLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, K2Node_Event_player_1) == 0x000018, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, K2Node_Event_actualSnapTime) == 0x000020, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, CallFunc_GetMontagePlayer_ReturnValue) == 0x000028, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::CallFunc_GetMontagePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, CallFunc_GetLocker_ReturnValue_1) == 0x000030, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::CallFunc_GetLocker_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, K2Node_Event_player) == 0x000038, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, K2Node_Event_hasInteractionStarted) == 0x000040, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::K2Node_Event_hasInteractionStarted' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'ClosetExitFast_C_ExecuteUbergraph_ClosetExitFast::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");

// Function ClosetExitFast.ClosetExitFast_C.IsInteractionPossibleClient
// 0x0028 (0x0028 - 0x0000)
struct ClosetExitFast_C_IsInteractionPossibleClient final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectStateProvider>  CallFunc_HasStateTag_objectStateProvider_CastInput; // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasStateTag_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetExitFast_C_IsInteractionPossibleClient) == 0x000008, "Wrong alignment on ClosetExitFast_C_IsInteractionPossibleClient");
static_assert(sizeof(ClosetExitFast_C_IsInteractionPossibleClient) == 0x000028, "Wrong size on ClosetExitFast_C_IsInteractionPossibleClient");
static_assert(offsetof(ClosetExitFast_C_IsInteractionPossibleClient, Player) == 0x000000, "Member 'ClosetExitFast_C_IsInteractionPossibleClient::Player' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_IsInteractionPossibleClient, InteractionType) == 0x000008, "Member 'ClosetExitFast_C_IsInteractionPossibleClient::InteractionType' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_IsInteractionPossibleClient, ReturnValue) == 0x000009, "Member 'ClosetExitFast_C_IsInteractionPossibleClient::ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_IsInteractionPossibleClient, CallFunc_HasStateTag_objectStateProvider_CastInput) == 0x000010, "Member 'ClosetExitFast_C_IsInteractionPossibleClient::CallFunc_HasStateTag_objectStateProvider_CastInput' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_IsInteractionPossibleClient, CallFunc_HasStateTag_ReturnValue) == 0x000020, "Member 'ClosetExitFast_C_IsInteractionPossibleClient::CallFunc_HasStateTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetExitFast_C_IsInteractionPossibleClient, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'ClosetExitFast_C_IsInteractionPossibleClient::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

