#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetEnterFail

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimationUtilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ClosetEnterFail.ClosetEnterFail_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct ClosetEnterFail_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetEnterFail_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on ClosetEnterFail_C_OnInteractionUpdateStart");
static_assert(sizeof(ClosetEnterFail_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on ClosetEnterFail_C_OnInteractionUpdateStart");
static_assert(offsetof(ClosetEnterFail_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'ClosetEnterFail_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function ClosetEnterFail.ClosetEnterFail_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct ClosetEnterFail_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetEnterFail_C_OnInteractionFinished) == 0x000008, "Wrong alignment on ClosetEnterFail_C_OnInteractionFinished");
static_assert(sizeof(ClosetEnterFail_C_OnInteractionFinished) == 0x000010, "Wrong size on ClosetEnterFail_C_OnInteractionFinished");
static_assert(offsetof(ClosetEnterFail_C_OnInteractionFinished, Player) == 0x000000, "Member 'ClosetEnterFail_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'ClosetEnterFail_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function ClosetEnterFail.ClosetEnterFail_C.ExecuteUbergraph_ClosetEnterFail
// 0x0198 (0x0198 - 0x0000)
struct ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class ALocker*                                CallFunc_GetLocker_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimationMontageDescriptor            K2Node_MakeStruct_AnimationMontageDescriptor;      // 0x0020(0x0020)()
	class ADBDPlayer*                             CallFunc_GetPlayerInLocker_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayMontage_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPlayerInClosetLocation_ReturnValue;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh_ReturnValue;                      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationByBottomCapsule_sweepHitResult; // 0x0070(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationByBottomCapsule_ReturnValue; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALocker*                                CallFunc_GetLocker_ReturnValue_1;                  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail) == 0x000008, "Wrong alignment on ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail");
static_assert(sizeof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail) == 0x000198, "Wrong size on ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, EntryPoint) == 0x000000, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, K2Node_MakeArray_Array) == 0x000008, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_GetLocker_ReturnValue) == 0x000018, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_GetLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, K2Node_MakeStruct_AnimationMontageDescriptor) == 0x000020, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::K2Node_MakeStruct_AnimationMontageDescriptor' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_GetPlayerInLocker_ReturnValue) == 0x000040, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_GetPlayerInLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_PlayMontage_ReturnValue) == 0x000048, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_PlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_GetPlayerInClosetLocation_ReturnValue) == 0x000050, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_GetPlayerInClosetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_GetMesh_ReturnValue) == 0x000068, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_GetMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_K2_SetActorLocationByBottomCapsule_sweepHitResult) == 0x000070, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_K2_SetActorLocationByBottomCapsule_sweepHitResult' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_K2_SetActorLocationByBottomCapsule_ReturnValue) == 0x000160, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_K2_SetActorLocationByBottomCapsule_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_GetAnimInstance_ReturnValue) == 0x000168, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_GetLocker_ReturnValue_1) == 0x000170, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_GetLocker_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, CallFunc_Montage_Play_ReturnValue) == 0x000178, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, K2Node_Event_player) == 0x000180, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, K2Node_Event_hasInteractionStarted) == 0x000188, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::K2Node_Event_hasInteractionStarted' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail, K2Node_Event_player_1) == 0x000190, "Member 'ClosetEnterFail_C_ExecuteUbergraph_ClosetEnterFail::K2Node_Event_player_1' has a wrong offset!");

// Function ClosetEnterFail.ClosetEnterFail_C.GetActorsToIgnoreOverlap
// 0x0048 (0x0048 - 0x0000)
struct ClosetEnterFail_C_GetActorsToIgnoreOverlap final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class ADBDPlayer*>                     Ret;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ALocker*                                CallFunc_GetLocker_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetPlayerInLocker_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADBDPlayer*>                     K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(ClosetEnterFail_C_GetActorsToIgnoreOverlap) == 0x000008, "Wrong alignment on ClosetEnterFail_C_GetActorsToIgnoreOverlap");
static_assert(sizeof(ClosetEnterFail_C_GetActorsToIgnoreOverlap) == 0x000048, "Wrong size on ClosetEnterFail_C_GetActorsToIgnoreOverlap");
static_assert(offsetof(ClosetEnterFail_C_GetActorsToIgnoreOverlap, ReturnValue) == 0x000000, "Member 'ClosetEnterFail_C_GetActorsToIgnoreOverlap::ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_GetActorsToIgnoreOverlap, Ret) == 0x000010, "Member 'ClosetEnterFail_C_GetActorsToIgnoreOverlap::Ret' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_GetActorsToIgnoreOverlap, CallFunc_GetLocker_ReturnValue) == 0x000020, "Member 'ClosetEnterFail_C_GetActorsToIgnoreOverlap::CallFunc_GetLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_GetActorsToIgnoreOverlap, CallFunc_GetPlayerInLocker_ReturnValue) == 0x000028, "Member 'ClosetEnterFail_C_GetActorsToIgnoreOverlap::CallFunc_GetPlayerInLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_GetActorsToIgnoreOverlap, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ClosetEnterFail_C_GetActorsToIgnoreOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetEnterFail_C_GetActorsToIgnoreOverlap, K2Node_MakeArray_Array) == 0x000038, "Member 'ClosetEnterFail_C_GetActorsToIgnoreOverlap::K2Node_MakeArray_Array' has a wrong offset!");

}

