#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetHideExit

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function ClosetHideExit.ClosetHideExit_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct ClosetHideExit_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetHideExit_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on ClosetHideExit_C_OnInteractionUpdateStart");
static_assert(sizeof(ClosetHideExit_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on ClosetHideExit_C_OnInteractionUpdateStart");
static_assert(offsetof(ClosetHideExit_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'ClosetHideExit_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function ClosetHideExit.ClosetHideExit_C.OnInteractionInterruptStart
// 0x0018 (0x0018 - 0x0000)
struct ClosetHideExit_C_OnInteractionInterruptStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInterruptionDefinition*                CurrentInterruption;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             InterruptingPlayer;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetHideExit_C_OnInteractionInterruptStart) == 0x000008, "Wrong alignment on ClosetHideExit_C_OnInteractionInterruptStart");
static_assert(sizeof(ClosetHideExit_C_OnInteractionInterruptStart) == 0x000018, "Wrong size on ClosetHideExit_C_OnInteractionInterruptStart");
static_assert(offsetof(ClosetHideExit_C_OnInteractionInterruptStart, Player) == 0x000000, "Member 'ClosetHideExit_C_OnInteractionInterruptStart::Player' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_OnInteractionInterruptStart, CurrentInterruption) == 0x000008, "Member 'ClosetHideExit_C_OnInteractionInterruptStart::CurrentInterruption' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_OnInteractionInterruptStart, InterruptingPlayer) == 0x000010, "Member 'ClosetHideExit_C_OnInteractionInterruptStart::InterruptingPlayer' has a wrong offset!");

// Function ClosetHideExit.ClosetHideExit_C.ExecuteUbergraph_ClosetHideExit
// 0x0068 (0x0068 - 0x0000)
struct ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInterruptionDefinition*                K2Node_Event_currentInterruption;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_interruptingPlayer;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScoreEventData                        K2Node_MakeStruct_ScoreEventData;                  // 0x0038(0x0018)(NoDestructor)
	bool                                          CallFunc_IsInTerrorRadius_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit) == 0x000008, "Wrong alignment on ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit");
static_assert(sizeof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit) == 0x000068, "Wrong size on ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, EntryPoint) == 0x000000, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_Event_player) == 0x000008, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_Event_player_1) == 0x000010, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_Event_currentInterruption) == 0x000018, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_Event_currentInterruption' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_Event_interruptingPlayer) == 0x000020, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_Event_interruptingPlayer' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_DynamicCast_AsCamper_Player) == 0x000028, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_MakeStruct_ScoreEventData) == 0x000038, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_MakeStruct_ScoreEventData' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, CallFunc_IsInTerrorRadius_ReturnValue) == 0x000050, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::CallFunc_IsInTerrorRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_DynamicCast_AsCamper_Player_1) == 0x000058, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_DynamicCast_AsCamper_Player_1' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'ClosetHideExit_C_ExecuteUbergraph_ClosetHideExit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ClosetHideExit.ClosetHideExit_C.IsInteractionPossibleBP
// 0x0010 (0x0010 - 0x0000)
struct ClosetHideExit_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOccupied_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionPossibleBP_ReturnValue;      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractingPlayerInsideCloset_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetHideExit_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on ClosetHideExit_C_IsInteractionPossibleBP");
static_assert(sizeof(ClosetHideExit_C_IsInteractionPossibleBP) == 0x000010, "Wrong size on ClosetHideExit_C_IsInteractionPossibleBP");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, CallFunc_IsOccupied_ReturnValue) == 0x00000A, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::CallFunc_IsOccupied_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, CallFunc_IsInteractionPossibleBP_ReturnValue) == 0x00000B, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::CallFunc_IsInteractionPossibleBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, CallFunc_IsInteractingPlayerInsideCloset_ReturnValue) == 0x00000C, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::CallFunc_IsInteractingPlayerInsideCloset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00000E, "Member 'ClosetHideExit_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ClosetHideExit.ClosetHideExit_C.GetActorsToIgnoreOverlap
// 0x0020 (0x0020 - 0x0000)
struct ClosetHideExit_C_GetActorsToIgnoreOverlap final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(ClosetHideExit_C_GetActorsToIgnoreOverlap) == 0x000008, "Wrong alignment on ClosetHideExit_C_GetActorsToIgnoreOverlap");
static_assert(sizeof(ClosetHideExit_C_GetActorsToIgnoreOverlap) == 0x000020, "Wrong size on ClosetHideExit_C_GetActorsToIgnoreOverlap");
static_assert(offsetof(ClosetHideExit_C_GetActorsToIgnoreOverlap, ReturnValue) == 0x000000, "Member 'ClosetHideExit_C_GetActorsToIgnoreOverlap::ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetHideExit_C_GetActorsToIgnoreOverlap, K2Node_MakeArray_Array) == 0x000010, "Member 'ClosetHideExit_C_GetActorsToIgnoreOverlap::K2Node_MakeArray_Array' has a wrong offset!");

}

