#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetStandardAnimBP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ClosetStandardAnimBP.ClosetStandardAnimBP_C.ExecuteUbergraph_ClosetStandardAnimBP
// 0x0128 (0x0128 - 0x0000)
struct ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAKComponent_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0030(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0044(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x005C(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0070(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0084(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_2;         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_1;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAKComponent_ReturnValue_1;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_2;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAKComponent_ReturnValue_2;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_3;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_4;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_3;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAKComponent_ReturnValue_3;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_4;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAKComponent_ReturnValue_4;             // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_5;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_5;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAKComponent_ReturnValue_5;             // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP) == 0x000008, "Wrong alignment on ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP");
static_assert(sizeof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP) == 0x000128, "Wrong size on ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, EntryPoint) == 0x000000, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, Temp_delegate_Variable) == 0x000010, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAkComponent_ComponentCreated) == 0x000024, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAKComponent_ReturnValue) == 0x000028, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAKComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, Temp_delegate_Variable_1) == 0x000030, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, Temp_delegate_Variable_2) == 0x000044, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_PostAkEvent_ReturnValue) == 0x000058, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, Temp_delegate_Variable_3) == 0x00005C, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, Temp_delegate_Variable_4) == 0x000070, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, Temp_delegate_Variable_5) == 0x000084, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetOwningComponent_ReturnValue_1) == 0x000098, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetOwningComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetOwningComponent_ReturnValue_2) == 0x0000A0, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetOwningComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAkComponent_ComponentCreated_1) == 0x0000A8, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAkComponent_ComponentCreated_1' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAKComponent_ReturnValue_1) == 0x0000B0, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAKComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAkComponent_ComponentCreated_2) == 0x0000B8, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAkComponent_ComponentCreated_2' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAKComponent_ReturnValue_2) == 0x0000C0, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAKComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000C8, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_PostAkEvent_ReturnValue_2) == 0x0000CC, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetOwningComponent_ReturnValue_3) == 0x0000D0, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetOwningComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetOwningComponent_ReturnValue_4) == 0x0000D8, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetOwningComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAkComponent_ComponentCreated_3) == 0x0000E0, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAkComponent_ComponentCreated_3' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAKComponent_ReturnValue_3) == 0x0000E8, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAKComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAkComponent_ComponentCreated_4) == 0x0000F0, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAkComponent_ComponentCreated_4' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAKComponent_ReturnValue_4) == 0x0000F8, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAKComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_PostAkEvent_ReturnValue_3) == 0x000100, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_PostAkEvent_ReturnValue_4) == 0x000104, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetOwningComponent_ReturnValue_5) == 0x000108, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetOwningComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAkComponent_ComponentCreated_5) == 0x000110, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAkComponent_ComponentCreated_5' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_GetAKComponent_ReturnValue_5) == 0x000118, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_GetAKComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP, CallFunc_PostAkEvent_ReturnValue_5) == 0x000120, "Member 'ClosetStandardAnimBP_C_ExecuteUbergraph_ClosetStandardAnimBP::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");

// Function ClosetStandardAnimBP.ClosetStandardAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ClosetStandardAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ClosetStandardAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ClosetStandardAnimBP_C_AnimGraph");
static_assert(sizeof(ClosetStandardAnimBP_C_AnimGraph) == 0x000010, "Wrong size on ClosetStandardAnimBP_C_AnimGraph");
static_assert(offsetof(ClosetStandardAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ClosetStandardAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

