#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetStandard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ClosetStandard.ClosetStandard_C.StopMinNearOutlineDistLerp
// 0x0008 (0x0008 - 0x0000)
struct ClosetStandard_C_StopMinNearOutlineDistLerp final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_StopMinNearOutlineDistLerp) == 0x000008, "Wrong alignment on ClosetStandard_C_StopMinNearOutlineDistLerp");
static_assert(sizeof(ClosetStandard_C_StopMinNearOutlineDistLerp) == 0x000008, "Wrong size on ClosetStandard_C_StopMinNearOutlineDistLerp");
static_assert(offsetof(ClosetStandard_C_StopMinNearOutlineDistLerp, Player) == 0x000000, "Member 'ClosetStandard_C_StopMinNearOutlineDistLerp::Player' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.StartMinNearOutlineDistLerp
// 0x0008 (0x0008 - 0x0000)
struct ClosetStandard_C_StartMinNearOutlineDistLerp final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_StartMinNearOutlineDistLerp) == 0x000008, "Wrong alignment on ClosetStandard_C_StartMinNearOutlineDistLerp");
static_assert(sizeof(ClosetStandard_C_StartMinNearOutlineDistLerp) == 0x000008, "Wrong size on ClosetStandard_C_StartMinNearOutlineDistLerp");
static_assert(offsetof(ClosetStandard_C_StartMinNearOutlineDistLerp, Player) == 0x000000, "Member 'ClosetStandard_C_StartMinNearOutlineDistLerp::Player' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ClosetStandard_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ClosetStandard_C_ReceiveEndPlay");
static_assert(sizeof(ClosetStandard_C_ReceiveEndPlay) == 0x000001, "Wrong size on ClosetStandard_C_ReceiveEndPlay");
static_assert(offsetof(ClosetStandard_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ClosetStandard_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.OnPlayerInLockerChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct ClosetStandard_C_OnPlayerInLockerChangedEvent final
{
public:
	class ADBDPlayer*                             PlayerWhoWasInLocker;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             PlayerNowInLocker;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_OnPlayerInLockerChangedEvent) == 0x000008, "Wrong alignment on ClosetStandard_C_OnPlayerInLockerChangedEvent");
static_assert(sizeof(ClosetStandard_C_OnPlayerInLockerChangedEvent) == 0x000010, "Wrong size on ClosetStandard_C_OnPlayerInLockerChangedEvent");
static_assert(offsetof(ClosetStandard_C_OnPlayerInLockerChangedEvent, PlayerWhoWasInLocker) == 0x000000, "Member 'ClosetStandard_C_OnPlayerInLockerChangedEvent::PlayerWhoWasInLocker' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_OnPlayerInLockerChangedEvent, PlayerNowInLocker) == 0x000008, "Member 'ClosetStandard_C_OnPlayerInLockerChangedEvent::PlayerNowInLocker' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.GetExposerInteriorZone
// 0x0008 (0x0008 - 0x0000)
struct ClosetStandard_C_GetExposerInteriorZone final
{
public:
	class UExposerInteriorZoneComponent*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_GetExposerInteriorZone) == 0x000008, "Wrong alignment on ClosetStandard_C_GetExposerInteriorZone");
static_assert(sizeof(ClosetStandard_C_GetExposerInteriorZone) == 0x000008, "Wrong size on ClosetStandard_C_GetExposerInteriorZone");
static_assert(offsetof(ClosetStandard_C_GetExposerInteriorZone, ReturnValue) == 0x000000, "Member 'ClosetStandard_C_GetExposerInteriorZone::ReturnValue' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.ExecuteUbergraph_ClosetStandard
// 0x00C0 (0x00C0 - 0x0000)
struct ClosetStandard_C_ExecuteUbergraph_ClosetStandard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_CustomEvent_playerWhoWasInLocker;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_CustomEvent_playerNowInLocker;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomizedSkeletalMesh*                CallFunc_GetCustomizedSkeletalMesh_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizedSkeletalMesh*                CallFunc_GetCustomizedSkeletalMesh_ReturnValue_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetSurvivorInLocker_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryInteraction_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDOutlineComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDOutlineComponent*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ADBDPlayer* PlayerWhoWasInLocker, class ADBDPlayer* PlayerNowInLocker)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinimumOutlineDistance_distance_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard) == 0x000008, "Wrong alignment on ClosetStandard_C_ExecuteUbergraph_ClosetStandard");
static_assert(sizeof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard) == 0x0000C0, "Wrong size on ClosetStandard_C_ExecuteUbergraph_ClosetStandard");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, EntryPoint) == 0x000000, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_CustomEvent_playerWhoWasInLocker) == 0x000008, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_CustomEvent_playerWhoWasInLocker' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_CustomEvent_playerNowInLocker) == 0x000010, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_CustomEvent_playerNowInLocker' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_GetCustomizedSkeletalMesh_ReturnValue) == 0x000018, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_GetCustomizedSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_GetCustomizedSkeletalMesh_ReturnValue_1) == 0x000028, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_GetCustomizedSkeletalMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_Event_player_1) == 0x000038, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_GetSurvivorInLocker_ReturnValue) == 0x000040, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_GetSurvivorInLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_DynamicCast_AsCamper_Player) == 0x000048, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_TryInteraction_ReturnValue) == 0x000051, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_TryInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_IsLocallyControlled_ReturnValue) == 0x000060, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_Event_player) == 0x000068, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_Event_EndPlayReason) == 0x000070, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_DynamicCast_AsCamper_Player_1) == 0x000078, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_DynamicCast_AsCamper_Player_1' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000088, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_Lerp_ReturnValue) == 0x0000A8, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0000B0, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_ExecuteUbergraph_ClosetStandard, CallFunc_SetMinimumOutlineDistance_distance_ImplicitCast) == 0x0000B8, "Member 'ClosetStandard_C_ExecuteUbergraph_ClosetStandard::CallFunc_SetMinimumOutlineDistance_distance_ImplicitCast' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.IsInterruptionPossible
// 0x0030 (0x0030 - 0x0000)
struct ClosetStandard_C_IsInterruptionPossible final
{
public:
	const class ADBDPlayer*                       Interruptor;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class ADBDPlayer*                       Interruptee;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UInteractor*                      Interactor;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UInteractionDefinition*           Definition;                                        // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UInterruptionDefinition*          Interruption;                                      // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_IsInterruptionPossible) == 0x000008, "Wrong alignment on ClosetStandard_C_IsInterruptionPossible");
static_assert(sizeof(ClosetStandard_C_IsInterruptionPossible) == 0x000030, "Wrong size on ClosetStandard_C_IsInterruptionPossible");
static_assert(offsetof(ClosetStandard_C_IsInterruptionPossible, Interruptor) == 0x000000, "Member 'ClosetStandard_C_IsInterruptionPossible::Interruptor' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_IsInterruptionPossible, Interruptee) == 0x000008, "Member 'ClosetStandard_C_IsInterruptionPossible::Interruptee' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_IsInterruptionPossible, Interactor) == 0x000010, "Member 'ClosetStandard_C_IsInterruptionPossible::Interactor' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_IsInterruptionPossible, Definition) == 0x000018, "Member 'ClosetStandard_C_IsInterruptionPossible::Definition' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_IsInterruptionPossible, Interruption) == 0x000020, "Member 'ClosetStandard_C_IsInterruptionPossible::Interruption' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_IsInterruptionPossible, ReturnValue) == 0x000028, "Member 'ClosetStandard_C_IsInterruptionPossible::ReturnValue' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.GetStunZone
// 0x0008 (0x0008 - 0x0000)
struct ClosetStandard_C_GetStunZone final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_GetStunZone) == 0x000008, "Wrong alignment on ClosetStandard_C_GetStunZone");
static_assert(sizeof(ClosetStandard_C_GetStunZone) == 0x000008, "Wrong size on ClosetStandard_C_GetStunZone");
static_assert(offsetof(ClosetStandard_C_GetStunZone, ReturnValue) == 0x000000, "Member 'ClosetStandard_C_GetStunZone::ReturnValue' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.GetInfectedParticles
// 0x0020 (0x0020 - 0x0000)
struct ClosetStandard_C_GetInfectedParticles final
{
public:
	TArray<class UParticleSystemComponent*>       InfectedParticleArray;                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ClosetStandard_C_GetInfectedParticles) == 0x000008, "Wrong alignment on ClosetStandard_C_GetInfectedParticles");
static_assert(sizeof(ClosetStandard_C_GetInfectedParticles) == 0x000020, "Wrong size on ClosetStandard_C_GetInfectedParticles");
static_assert(offsetof(ClosetStandard_C_GetInfectedParticles, InfectedParticleArray) == 0x000000, "Member 'ClosetStandard_C_GetInfectedParticles::InfectedParticleArray' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_GetInfectedParticles, K2Node_MakeArray_Array) == 0x000010, "Member 'ClosetStandard_C_GetInfectedParticles::K2Node_MakeArray_Array' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.GetInfectedDecals
// 0x0010 (0x0010 - 0x0000)
struct ClosetStandard_C_GetInfectedDecals final
{
public:
	TArray<class UDecalComponent*>                InfectedDecals;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(ClosetStandard_C_GetInfectedDecals) == 0x000008, "Wrong alignment on ClosetStandard_C_GetInfectedDecals");
static_assert(sizeof(ClosetStandard_C_GetInfectedDecals) == 0x000010, "Wrong size on ClosetStandard_C_GetInfectedDecals");
static_assert(offsetof(ClosetStandard_C_GetInfectedDecals, InfectedDecals) == 0x000000, "Member 'ClosetStandard_C_GetInfectedDecals::InfectedDecals' has a wrong offset!");

// Function ClosetStandard.ClosetStandard_C.GetFocalPointPosition
// 0x0040 (0x0040 - 0x0000)
struct ClosetStandard_C_GetFocalPointPosition final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UInteractionDefinition*           Definition;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClosetStandard_C_GetFocalPointPosition) == 0x000008, "Wrong alignment on ClosetStandard_C_GetFocalPointPosition");
static_assert(sizeof(ClosetStandard_C_GetFocalPointPosition) == 0x000040, "Wrong size on ClosetStandard_C_GetFocalPointPosition");
static_assert(offsetof(ClosetStandard_C_GetFocalPointPosition, Player) == 0x000000, "Member 'ClosetStandard_C_GetFocalPointPosition::Player' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_GetFocalPointPosition, Definition) == 0x000008, "Member 'ClosetStandard_C_GetFocalPointPosition::Definition' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_GetFocalPointPosition, ReturnValue) == 0x000010, "Member 'ClosetStandard_C_GetFocalPointPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(ClosetStandard_C_GetFocalPointPosition, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'ClosetStandard_C_GetFocalPointPosition::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

}

