#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetStandard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ClosetStandard.ClosetStandard_C
// 0x0150 (0x06B8 - 0x0568)
class AClosetStandard_C final : public ALocker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        FrontLocation;                                     // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          StunZone;                                          // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDOutlineComponent*                   DBDOutline;                                        // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDBDSkeletalMeshComponentBudgeted*      SkeletalMeshComponent;                             // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FocalPoint;                                        // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FrontInteractorZone;                               // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExposerInteriorZoneComponent*          ExposerInteriorZone;                               // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ExposerSpawn2;                                     // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ExposerSpawn1;                                     // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ExposerSpawn3;                                     // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialHelper*                        MaterialHelper;                                    // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   KillerInteractionChildActor;                       // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MK_InfectedObject_Closet_Door_Side_02;           // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MK_InfectedObject_Closet_Door_Side_01;           // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MK_InfectedObject_Closet_Door_RT;                // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MK_InfectedObject_Closet_Door_LT;                // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Audio_Closet;                                   // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetFlashbangCraft_BP_C*             ClosetFlashbangCraft;                              // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULockerOutlineUpdateStrategy*           LockerOutlineUpdateStrategy;                       // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FakeClosetEnterZone;                               // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USleepingSkinnedMeshRegisterer*         SleepingSkinnedMeshRegisterer;                     // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetFakeEnter_BP_C*                  ClosetFakeEnterInteraction;                        // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideInterruption_C*              HideExitFastInterruption;                          // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideInterruption_C*              HideExitSneakInterruption;                         // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideInterruption_C*              HideEnterSneakInterruption;                        // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideInterruption_C*              HideEnterFastInterruption;                         // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetExitSwing_C*                     ClosetExitSwing;                                   // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetExitFast_C*                      ClosetReverseBearTrapExecutionExit;                // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetExitFast_C*                      ClosetExitFast;                                    // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideExit_C*                      ClosetHideExitSneak;                               // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideExit_C*                      ClosetHideExitRushed;                              // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetEnterFail_C*                     ClosetEnterFail;                                   // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USearchPlayer_C*                        SearchPlayer;                                      // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USearchEmpty_C*                         SearchEmpty;                                       // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideEnter_C*                     ClosetHideEnterRushed;                             // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetHideEnter_C*                     ClosetHideEnterSneak;                              // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractor*                            MainInteractor;                                    // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LerpIntersectunitOnPlayer_SelfIntersectValue_AB29C9894AD46338FFB08EB2629A565E; // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LerpIntersectunitOnPlayer__Direction_AB29C9894AD46338FFB08EB2629A565E; // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A5[0x3];                                      // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LerpIntersectunitOnPlayer;                         // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDBDOutlineComponent*                   CharacterOutlineComponent;                         // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void StopMinNearOutlineDistLerp(class ADBDPlayer* Player);
	void StartMinNearOutlineDistLerp(class ADBDPlayer* Player);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnPlayerInLockerChangedEvent(class ADBDPlayer* PlayerWhoWasInLocker, class ADBDPlayer* PlayerNowInLocker);
	void LerpIntersectunitOnPlayer__UpdateFunc();
	void LerpIntersectunitOnPlayer__FinishedFunc();
	class UExposerInteriorZoneComponent* GetExposerInteriorZone();
	void ExecuteUbergraph_ClosetStandard(int32 EntryPoint);
	void EjectSurvivor();

	bool IsInterruptionPossible(const class ADBDPlayer* Interruptor, const class ADBDPlayer* Interruptee, const class UInteractor* Interactor, const class UInteractionDefinition* Definition, const class UInterruptionDefinition* Interruption) const;
	class UPrimitiveComponent* GetStunZone() const;
	void GetInfectedParticles(TArray<class UParticleSystemComponent*>* InfectedParticleArray) const;
	void GetInfectedDecals(TArray<class UDecalComponent*>* InfectedDecals) const;
	struct FVector GetFocalPointPosition(const class ADBDPlayer* Player, const class UInteractionDefinition* Definition) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ClosetStandard_C">();
	}
	static class AClosetStandard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AClosetStandard_C>();
	}
};
static_assert(alignof(AClosetStandard_C) == 0x000008, "Wrong alignment on AClosetStandard_C");
static_assert(sizeof(AClosetStandard_C) == 0x0006B8, "Wrong size on AClosetStandard_C");
static_assert(offsetof(AClosetStandard_C, UberGraphFrame) == 0x000568, "Member 'AClosetStandard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, FrontLocation) == 0x000570, "Member 'AClosetStandard_C::FrontLocation' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, StunZone) == 0x000578, "Member 'AClosetStandard_C::StunZone' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, DBDOutline) == 0x000580, "Member 'AClosetStandard_C::DBDOutline' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, SkeletalMeshComponent) == 0x000588, "Member 'AClosetStandard_C::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, FocalPoint) == 0x000590, "Member 'AClosetStandard_C::FocalPoint' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, FrontInteractorZone) == 0x000598, "Member 'AClosetStandard_C::FrontInteractorZone' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ExposerInteriorZone) == 0x0005A0, "Member 'AClosetStandard_C::ExposerInteriorZone' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ExposerSpawn2) == 0x0005A8, "Member 'AClosetStandard_C::ExposerSpawn2' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ExposerSpawn1) == 0x0005B0, "Member 'AClosetStandard_C::ExposerSpawn1' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, Box) == 0x0005B8, "Member 'AClosetStandard_C::Box' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ExposerSpawn3) == 0x0005C0, "Member 'AClosetStandard_C::ExposerSpawn3' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, MaterialHelper) == 0x0005C8, "Member 'AClosetStandard_C::MaterialHelper' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, KillerInteractionChildActor) == 0x0005D0, "Member 'AClosetStandard_C::KillerInteractionChildActor' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, P_MK_InfectedObject_Closet_Door_Side_02) == 0x0005D8, "Member 'AClosetStandard_C::P_MK_InfectedObject_Closet_Door_Side_02' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, P_MK_InfectedObject_Closet_Door_Side_01) == 0x0005E0, "Member 'AClosetStandard_C::P_MK_InfectedObject_Closet_Door_Side_01' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, P_MK_InfectedObject_Closet_Door_RT) == 0x0005E8, "Member 'AClosetStandard_C::P_MK_InfectedObject_Closet_Door_RT' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, P_MK_InfectedObject_Closet_Door_LT) == 0x0005F0, "Member 'AClosetStandard_C::P_MK_InfectedObject_Closet_Door_LT' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, Ak_Audio_Closet) == 0x0005F8, "Member 'AClosetStandard_C::Ak_Audio_Closet' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetFlashbangCraft) == 0x000600, "Member 'AClosetStandard_C::ClosetFlashbangCraft' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, LockerOutlineUpdateStrategy) == 0x000608, "Member 'AClosetStandard_C::LockerOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, FakeClosetEnterZone) == 0x000610, "Member 'AClosetStandard_C::FakeClosetEnterZone' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, SleepingSkinnedMeshRegisterer) == 0x000618, "Member 'AClosetStandard_C::SleepingSkinnedMeshRegisterer' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetFakeEnterInteraction) == 0x000620, "Member 'AClosetStandard_C::ClosetFakeEnterInteraction' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, HideExitFastInterruption) == 0x000628, "Member 'AClosetStandard_C::HideExitFastInterruption' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, HideExitSneakInterruption) == 0x000630, "Member 'AClosetStandard_C::HideExitSneakInterruption' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, HideEnterSneakInterruption) == 0x000638, "Member 'AClosetStandard_C::HideEnterSneakInterruption' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, HideEnterFastInterruption) == 0x000640, "Member 'AClosetStandard_C::HideEnterFastInterruption' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetExitSwing) == 0x000648, "Member 'AClosetStandard_C::ClosetExitSwing' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetReverseBearTrapExecutionExit) == 0x000650, "Member 'AClosetStandard_C::ClosetReverseBearTrapExecutionExit' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetExitFast) == 0x000658, "Member 'AClosetStandard_C::ClosetExitFast' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetHideExitSneak) == 0x000660, "Member 'AClosetStandard_C::ClosetHideExitSneak' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetHideExitRushed) == 0x000668, "Member 'AClosetStandard_C::ClosetHideExitRushed' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetEnterFail) == 0x000670, "Member 'AClosetStandard_C::ClosetEnterFail' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, SearchPlayer) == 0x000678, "Member 'AClosetStandard_C::SearchPlayer' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, SearchEmpty) == 0x000680, "Member 'AClosetStandard_C::SearchEmpty' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetHideEnterRushed) == 0x000688, "Member 'AClosetStandard_C::ClosetHideEnterRushed' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, ClosetHideEnterSneak) == 0x000690, "Member 'AClosetStandard_C::ClosetHideEnterSneak' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, MainInteractor) == 0x000698, "Member 'AClosetStandard_C::MainInteractor' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, LerpIntersectunitOnPlayer_SelfIntersectValue_AB29C9894AD46338FFB08EB2629A565E) == 0x0006A0, "Member 'AClosetStandard_C::LerpIntersectunitOnPlayer_SelfIntersectValue_AB29C9894AD46338FFB08EB2629A565E' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, LerpIntersectunitOnPlayer__Direction_AB29C9894AD46338FFB08EB2629A565E) == 0x0006A4, "Member 'AClosetStandard_C::LerpIntersectunitOnPlayer__Direction_AB29C9894AD46338FFB08EB2629A565E' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, LerpIntersectunitOnPlayer) == 0x0006A8, "Member 'AClosetStandard_C::LerpIntersectunitOnPlayer' has a wrong offset!");
static_assert(offsetof(AClosetStandard_C, CharacterOutlineComponent) == 0x0006B0, "Member 'AClosetStandard_C::CharacterOutlineComponent' has a wrong offset!");

}

