#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClosetStandardAnimBP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ClosetStandardAnimBP.ClosetStandardAnimBP_C
// 0x00A0 (0x0400 - 0x0360)
class UClosetStandardAnimBP_C final : public ULockerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0398(0x0050)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x03E8(0x0010)()

public:
	void ExecuteUbergraph_ClosetStandardAnimBP(int32 EntryPoint);
	void AnimNotify_Audio_Closet_Squeak_Slow();
	void AnimNotify_Audio_Closet_Squeak_Fast();
	void AnimNotify_Audio_Closet_Open_Slow();
	void AnimNotify_Audio_Closet_Open_Fast();
	void AnimNotify_Audio_Closet_Close_Slow();
	void AnimNotify_Audio_Closet_Close_Fast();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ClosetStandardAnimBP_C">();
	}
	static class UClosetStandardAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClosetStandardAnimBP_C>();
	}
};
static_assert(alignof(UClosetStandardAnimBP_C) == 0x000010, "Wrong alignment on UClosetStandardAnimBP_C");
static_assert(sizeof(UClosetStandardAnimBP_C) == 0x000400, "Wrong size on UClosetStandardAnimBP_C");
static_assert(offsetof(UClosetStandardAnimBP_C, UberGraphFrame) == 0x000360, "Member 'UClosetStandardAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UClosetStandardAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UClosetStandardAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UClosetStandardAnimBP_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UClosetStandardAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UClosetStandardAnimBP_C, AnimGraphNode_Root) == 0x000378, "Member 'UClosetStandardAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UClosetStandardAnimBP_C, AnimGraphNode_Slot) == 0x000398, "Member 'UClosetStandardAnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UClosetStandardAnimBP_C, AnimGraphNode_LocalRefPose) == 0x0003E8, "Member 'UClosetStandardAnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

