#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsecutiveWakeUpPenaltyProficiency

#include "Basic.hpp"


namespace SDK::Params
{

// Function ConsecutiveWakeUpPenaltyProficiency.ConsecutiveWakeUpPenaltyProficiency_C.GetValue
// 0x0068 (0x0068 - 0x0000)
struct ConsecutiveWakeUpPenaltyProficiency_C_GetValue final
{
public:
	const class UChargeableInteractionDefinition* ChargeableInteraction;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class ADBDPlayer*                       Player;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDreamworldComponent*          CallFunc_GetDreamworldComponent_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCamperDreamworldComponent*             K2Node_DynamicCast_AsCamper_Dreamworld_Component;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWakeUpByOtherCount_ReturnValue;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue) == 0x000008, "Wrong alignment on ConsecutiveWakeUpPenaltyProficiency_C_GetValue");
static_assert(sizeof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue) == 0x000068, "Wrong size on ConsecutiveWakeUpPenaltyProficiency_C_GetValue");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, ChargeableInteraction) == 0x000000, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::ChargeableInteraction' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, Player) == 0x000008, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::Player' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, ReturnValue) == 0x000010, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_GetOwner_ReturnValue_1) == 0x000020, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, K2Node_DynamicCast_AsCamper_Player) == 0x000030, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_GetDreamworldComponent_ReturnValue) == 0x000040, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_GetDreamworldComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, K2Node_DynamicCast_AsCamper_Dreamworld_Component) == 0x000048, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::K2Node_DynamicCast_AsCamper_Dreamworld_Component' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_GetWakeUpByOtherCount_ReturnValue) == 0x000054, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_GetWakeUpByOtherCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsecutiveWakeUpPenaltyProficiency_C_GetValue, CallFunc_Subtract_FloatFloat_B_ImplicitCast) == 0x000064, "Member 'ConsecutiveWakeUpPenaltyProficiency_C_GetValue::CallFunc_Subtract_FloatFloat_B_ImplicitCast' has a wrong offset!");

}

