#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreCommonUIUtils

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreCommonUIUtils_structs.hpp"


namespace SDK::Params
{

// Function CoreCommonUIUtils.CoreCommonUIUtils.BeautifyName
// 0x0028 (0x0028 - 0x0000)
struct CoreCommonUIUtils_BeautifyName final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCharacters;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_BeautifyName) == 0x000008, "Wrong alignment on CoreCommonUIUtils_BeautifyName");
static_assert(sizeof(CoreCommonUIUtils_BeautifyName) == 0x000028, "Wrong size on CoreCommonUIUtils_BeautifyName");
static_assert(offsetof(CoreCommonUIUtils_BeautifyName, Param_Name) == 0x000000, "Member 'CoreCommonUIUtils_BeautifyName::Param_Name' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_BeautifyName, MaxCharacters) == 0x000010, "Member 'CoreCommonUIUtils_BeautifyName::MaxCharacters' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_BeautifyName, ReturnValue) == 0x000018, "Member 'CoreCommonUIUtils_BeautifyName::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.BeautifyNarrativeText
// 0x0028 (0x0028 - 0x0000)
struct CoreCommonUIUtils_BeautifyNarrativeText final
{
public:
	class FString                                 Str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharLimit;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_BeautifyNarrativeText) == 0x000008, "Wrong alignment on CoreCommonUIUtils_BeautifyNarrativeText");
static_assert(sizeof(CoreCommonUIUtils_BeautifyNarrativeText) == 0x000028, "Wrong size on CoreCommonUIUtils_BeautifyNarrativeText");
static_assert(offsetof(CoreCommonUIUtils_BeautifyNarrativeText, Str) == 0x000000, "Member 'CoreCommonUIUtils_BeautifyNarrativeText::Str' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_BeautifyNarrativeText, CharLimit) == 0x000010, "Member 'CoreCommonUIUtils_BeautifyNarrativeText::CharLimit' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_BeautifyNarrativeText, ReturnValue) == 0x000018, "Member 'CoreCommonUIUtils_BeautifyNarrativeText::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.DivideWithRemainder
// 0x0010 (0x0010 - 0x0000)
struct CoreCommonUIUtils_DivideWithRemainder final
{
public:
	int32                                         Dividend;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Divisor;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Remainder;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_DivideWithRemainder) == 0x000004, "Wrong alignment on CoreCommonUIUtils_DivideWithRemainder");
static_assert(sizeof(CoreCommonUIUtils_DivideWithRemainder) == 0x000010, "Wrong size on CoreCommonUIUtils_DivideWithRemainder");
static_assert(offsetof(CoreCommonUIUtils_DivideWithRemainder, Dividend) == 0x000000, "Member 'CoreCommonUIUtils_DivideWithRemainder::Dividend' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_DivideWithRemainder, Divisor) == 0x000004, "Member 'CoreCommonUIUtils_DivideWithRemainder::Divisor' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_DivideWithRemainder, Remainder) == 0x000008, "Member 'CoreCommonUIUtils_DivideWithRemainder::Remainder' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_DivideWithRemainder, ReturnValue) == 0x00000C, "Member 'CoreCommonUIUtils_DivideWithRemainder::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.GetBeautifiedNumericString
// 0x0018 (0x0018 - 0x0000)
struct CoreCommonUIUtils_GetBeautifiedNumericString final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_GetBeautifiedNumericString) == 0x000008, "Wrong alignment on CoreCommonUIUtils_GetBeautifiedNumericString");
static_assert(sizeof(CoreCommonUIUtils_GetBeautifiedNumericString) == 0x000018, "Wrong size on CoreCommonUIUtils_GetBeautifiedNumericString");
static_assert(offsetof(CoreCommonUIUtils_GetBeautifiedNumericString, Value) == 0x000000, "Member 'CoreCommonUIUtils_GetBeautifiedNumericString::Value' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetBeautifiedNumericString, ReturnValue) == 0x000008, "Member 'CoreCommonUIUtils_GetBeautifiedNumericString::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.GetBeautifiedNumericText
// 0x0020 (0x0020 - 0x0000)
struct CoreCommonUIUtils_GetBeautifiedNumericText final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_GetBeautifiedNumericText) == 0x000008, "Wrong alignment on CoreCommonUIUtils_GetBeautifiedNumericText");
static_assert(sizeof(CoreCommonUIUtils_GetBeautifiedNumericText) == 0x000020, "Wrong size on CoreCommonUIUtils_GetBeautifiedNumericText");
static_assert(offsetof(CoreCommonUIUtils_GetBeautifiedNumericText, Value) == 0x000000, "Member 'CoreCommonUIUtils_GetBeautifiedNumericText::Value' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetBeautifiedNumericText, ReturnValue) == 0x000008, "Member 'CoreCommonUIUtils_GetBeautifiedNumericText::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.GetDPIScale
// 0x0004 (0x0004 - 0x0000)
struct CoreCommonUIUtils_GetDPIScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_GetDPIScale) == 0x000004, "Wrong alignment on CoreCommonUIUtils_GetDPIScale");
static_assert(sizeof(CoreCommonUIUtils_GetDPIScale) == 0x000004, "Wrong size on CoreCommonUIUtils_GetDPIScale");
static_assert(offsetof(CoreCommonUIUtils_GetDPIScale, ReturnValue) == 0x000000, "Member 'CoreCommonUIUtils_GetDPIScale::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.GetNextUpdateRate
// 0x0010 (0x0010 - 0x0000)
struct CoreCommonUIUtils_GetNextUpdateRate final
{
public:
	struct FDateTime                              EndTime;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreCommonUIUtils_GetNextUpdateRate) == 0x000008, "Wrong alignment on CoreCommonUIUtils_GetNextUpdateRate");
static_assert(sizeof(CoreCommonUIUtils_GetNextUpdateRate) == 0x000010, "Wrong size on CoreCommonUIUtils_GetNextUpdateRate");
static_assert(offsetof(CoreCommonUIUtils_GetNextUpdateRate, EndTime) == 0x000000, "Member 'CoreCommonUIUtils_GetNextUpdateRate::EndTime' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetNextUpdateRate, ReturnValue) == 0x000008, "Member 'CoreCommonUIUtils_GetNextUpdateRate::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.GetRemainingTimeText
// 0x0028 (0x0028 - 0x0000)
struct CoreCommonUIUtils_GetRemainingTimeText final
{
public:
	struct FDateTime                              EndDateTime;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERemainingTimeFormat                          TimeFormat;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfDigits;                                    // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_GetRemainingTimeText) == 0x000008, "Wrong alignment on CoreCommonUIUtils_GetRemainingTimeText");
static_assert(sizeof(CoreCommonUIUtils_GetRemainingTimeText) == 0x000028, "Wrong size on CoreCommonUIUtils_GetRemainingTimeText");
static_assert(offsetof(CoreCommonUIUtils_GetRemainingTimeText, EndDateTime) == 0x000000, "Member 'CoreCommonUIUtils_GetRemainingTimeText::EndDateTime' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetRemainingTimeText, TimeFormat) == 0x000008, "Member 'CoreCommonUIUtils_GetRemainingTimeText::TimeFormat' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetRemainingTimeText, NumberOfDigits) == 0x00000C, "Member 'CoreCommonUIUtils_GetRemainingTimeText::NumberOfDigits' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetRemainingTimeText, ReturnValue) == 0x000010, "Member 'CoreCommonUIUtils_GetRemainingTimeText::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.GetTextBasedOnRarity
// 0x0020 (0x0020 - 0x0000)
struct CoreCommonUIUtils_GetTextBasedOnRarity final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_GetTextBasedOnRarity) == 0x000008, "Wrong alignment on CoreCommonUIUtils_GetTextBasedOnRarity");
static_assert(sizeof(CoreCommonUIUtils_GetTextBasedOnRarity) == 0x000020, "Wrong size on CoreCommonUIUtils_GetTextBasedOnRarity");
static_assert(offsetof(CoreCommonUIUtils_GetTextBasedOnRarity, Rarity) == 0x000000, "Member 'CoreCommonUIUtils_GetTextBasedOnRarity::Rarity' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_GetTextBasedOnRarity, ReturnValue) == 0x000008, "Member 'CoreCommonUIUtils_GetTextBasedOnRarity::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.HasOuter
// 0x0018 (0x0018 - 0x0000)
struct CoreCommonUIUtils_HasOuter final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Root;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreCommonUIUtils_HasOuter) == 0x000008, "Wrong alignment on CoreCommonUIUtils_HasOuter");
static_assert(sizeof(CoreCommonUIUtils_HasOuter) == 0x000018, "Wrong size on CoreCommonUIUtils_HasOuter");
static_assert(offsetof(CoreCommonUIUtils_HasOuter, Object) == 0x000000, "Member 'CoreCommonUIUtils_HasOuter::Object' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_HasOuter, Root) == 0x000008, "Member 'CoreCommonUIUtils_HasOuter::Root' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_HasOuter, ReturnValue) == 0x000010, "Member 'CoreCommonUIUtils_HasOuter::ReturnValue' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.SetConditionalWidgetVisibility
// 0x0010 (0x0010 - 0x0000)
struct CoreCommonUIUtils_SetConditionalWidgetVisibility final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Condition;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              TrueVisibility;                                    // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              FalseVisibility;                                   // 0x000A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreCommonUIUtils_SetConditionalWidgetVisibility) == 0x000008, "Wrong alignment on CoreCommonUIUtils_SetConditionalWidgetVisibility");
static_assert(sizeof(CoreCommonUIUtils_SetConditionalWidgetVisibility) == 0x000010, "Wrong size on CoreCommonUIUtils_SetConditionalWidgetVisibility");
static_assert(offsetof(CoreCommonUIUtils_SetConditionalWidgetVisibility, Widget) == 0x000000, "Member 'CoreCommonUIUtils_SetConditionalWidgetVisibility::Widget' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_SetConditionalWidgetVisibility, Condition) == 0x000008, "Member 'CoreCommonUIUtils_SetConditionalWidgetVisibility::Condition' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_SetConditionalWidgetVisibility, TrueVisibility) == 0x000009, "Member 'CoreCommonUIUtils_SetConditionalWidgetVisibility::TrueVisibility' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_SetConditionalWidgetVisibility, FalseVisibility) == 0x00000A, "Member 'CoreCommonUIUtils_SetConditionalWidgetVisibility::FalseVisibility' has a wrong offset!");

// Function CoreCommonUIUtils.CoreCommonUIUtils.WrapTextWithStyleTag
// 0x0048 (0x0048 - 0x0000)
struct CoreCommonUIUtils_WrapTextWithStyleTag final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Style;                                             // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreCommonUIUtils_WrapTextWithStyleTag) == 0x000008, "Wrong alignment on CoreCommonUIUtils_WrapTextWithStyleTag");
static_assert(sizeof(CoreCommonUIUtils_WrapTextWithStyleTag) == 0x000048, "Wrong size on CoreCommonUIUtils_WrapTextWithStyleTag");
static_assert(offsetof(CoreCommonUIUtils_WrapTextWithStyleTag, Text) == 0x000000, "Member 'CoreCommonUIUtils_WrapTextWithStyleTag::Text' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_WrapTextWithStyleTag, Style) == 0x000018, "Member 'CoreCommonUIUtils_WrapTextWithStyleTag::Style' has a wrong offset!");
static_assert(offsetof(CoreCommonUIUtils_WrapTextWithStyleTag, ReturnValue) == 0x000030, "Member 'CoreCommonUIUtils_WrapTextWithStyleTag::ReturnValue' has a wrong offset!");

}

