#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrowTriggerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CrowTriggerComponent.CrowTriggerComponent_C
// 0x0020 (0x0160 - 0x0140)
class UCrowTriggerComponent_C final : public UTriggerableWorldObjectComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Takeoff_Speed_Threshold;                           // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NumberOfCrow;                                      // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        bubbleIndicatorLifetime;                           // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TriggerLoudNoise(class AActor* Instigator);
	void ReceiveBeginPlay();
	void OnTriggered_Event_0(class AActor* Instigator, const struct FVector& Location);
	void GetConditionalModifiers(class ADBDPlayer* Player, float* OutAdditive, float* OutMultiplicative);
	void ExecuteUbergraph_CrowTriggerComponent(int32 EntryPoint);
	bool CanPlayerTriggerGuaranteed(class ADBDPlayer* Player);
	bool CanPlayerTriggerConditional(class ADBDPlayer* Player);

	void IsActorCloaked(class AActor* Actor, bool* IsCloaked) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrowTriggerComponent_C">();
	}
	static class UCrowTriggerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrowTriggerComponent_C>();
	}
};
static_assert(alignof(UCrowTriggerComponent_C) == 0x000008, "Wrong alignment on UCrowTriggerComponent_C");
static_assert(sizeof(UCrowTriggerComponent_C) == 0x000160, "Wrong size on UCrowTriggerComponent_C");
static_assert(offsetof(UCrowTriggerComponent_C, UberGraphFrame) == 0x000140, "Member 'UCrowTriggerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrowTriggerComponent_C, Takeoff_Speed_Threshold) == 0x000148, "Member 'UCrowTriggerComponent_C::Takeoff_Speed_Threshold' has a wrong offset!");
static_assert(offsetof(UCrowTriggerComponent_C, NumberOfCrow) == 0x000150, "Member 'UCrowTriggerComponent_C::NumberOfCrow' has a wrong offset!");
static_assert(offsetof(UCrowTriggerComponent_C, bubbleIndicatorLifetime) == 0x000158, "Member 'UCrowTriggerComponent_C::bubbleIndicatorLifetime' has a wrong offset!");

}

