#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrowTriggerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CrowTriggerComponent.CrowTriggerComponent_C.TriggerLoudNoise
// 0x00C0 (0x00C0 - 0x0000)
struct CrowTriggerComponent_C_TriggerLoudNoise final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayModifierContainer*             CallFunc_GetPerkModifierMaxValueAndSource_outSource; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerkModifierMaxValueAndSource_ReturnValue; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRollResultByDiceRollType_ReturnValue;  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SpawnBubbleIndicator_lifetime_ImplicitCast; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_TriggerLoudNoise) == 0x000010, "Wrong alignment on CrowTriggerComponent_C_TriggerLoudNoise");
static_assert(sizeof(CrowTriggerComponent_C_TriggerLoudNoise) == 0x0000C0, "Wrong size on CrowTriggerComponent_C_TriggerLoudNoise");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, Instigator) == 0x000000, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::Instigator' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, K2Node_DynamicCast_AsCamper_Player) == 0x000008, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetLocallyObservedCharacter_ReturnValue) == 0x000018, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetLocallyObservedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetPerkManager_ReturnValue) == 0x000028, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetPerkModifierMaxValueAndSource_outSource) == 0x000098, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetPerkModifierMaxValueAndSource_outSource' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetPerkModifierMaxValueAndSource_ReturnValue) == 0x0000A0, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetPerkModifierMaxValueAndSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_GetRollResultByDiceRollType_ReturnValue) == 0x0000A4, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_GetRollResultByDiceRollType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_BooleanAND_ReturnValue) == 0x0000A5, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, K2Node_DynamicCast_AsSlasher_Player) == 0x0000A8, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_TriggerLoudNoise, CallFunc_SpawnBubbleIndicator_lifetime_ImplicitCast) == 0x0000B4, "Member 'CrowTriggerComponent_C_TriggerLoudNoise::CallFunc_SpawnBubbleIndicator_lifetime_ImplicitCast' has a wrong offset!");

// Function CrowTriggerComponent.CrowTriggerComponent_C.OnTriggered_Event_0
// 0x0020 (0x0020 - 0x0000)
struct CrowTriggerComponent_C_OnTriggered_Event_0 final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_OnTriggered_Event_0) == 0x000008, "Wrong alignment on CrowTriggerComponent_C_OnTriggered_Event_0");
static_assert(sizeof(CrowTriggerComponent_C_OnTriggered_Event_0) == 0x000020, "Wrong size on CrowTriggerComponent_C_OnTriggered_Event_0");
static_assert(offsetof(CrowTriggerComponent_C_OnTriggered_Event_0, Instigator) == 0x000000, "Member 'CrowTriggerComponent_C_OnTriggered_Event_0::Instigator' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_OnTriggered_Event_0, Location) == 0x000008, "Member 'CrowTriggerComponent_C_OnTriggered_Event_0::Location' has a wrong offset!");

// Function CrowTriggerComponent.CrowTriggerComponent_C.GetConditionalModifiers
// 0x0048 (0x0048 - 0x0000)
struct CrowTriggerComponent_C_GetConditionalModifiers final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         OutAdditive;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutMultiplicative;                                 // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMultiplicativeModifierValue_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_GetConditionalModifiers) == 0x000008, "Wrong alignment on CrowTriggerComponent_C_GetConditionalModifiers");
static_assert(sizeof(CrowTriggerComponent_C_GetConditionalModifiers) == 0x000048, "Wrong size on CrowTriggerComponent_C_GetConditionalModifiers");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, Player) == 0x000000, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::Player' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, OutAdditive) == 0x000008, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::OutAdditive' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, OutMultiplicative) == 0x00000C, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::OutMultiplicative' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_VSize_ReturnValue) == 0x000028, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_GetMultiplicativeModifierValue_ReturnValue) == 0x000030, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_GetMultiplicativeModifierValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_Divide_FloatFloat_B_ImplicitCast) == 0x00003C, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_Divide_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_GetConditionalModifiers, CallFunc_Divide_FloatFloat_A_ImplicitCast) == 0x000040, "Member 'CrowTriggerComponent_C_GetConditionalModifiers::CallFunc_Divide_FloatFloat_A_ImplicitCast' has a wrong offset!");

// Function CrowTriggerComponent.CrowTriggerComponent_C.ExecuteUbergraph_CrowTriggerComponent
// 0x0098 (0x0098 - 0x0000)
struct CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_DynamicCast_AsDBDPlayer;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_DynamicCast_AsDBDPlayer_1;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDDesignTunables*                     CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayerState*                        CallFunc_GetDBDPlayerState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFinishedPlayingState_ReturnValue;     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTunableValue_ReturnValue_1;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue_2;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Instigator, const struct FVector& Location)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Takeoff_Speed_Threshold_ImplicitCast; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LocallyDispatchGameEvent_customValue_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent) == 0x000008, "Wrong alignment on CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent");
static_assert(sizeof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent) == 0x000098, "Wrong size on CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, EntryPoint) == 0x000000, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_CustomEvent_Instigator) == 0x000010, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_CustomEvent_Location) == 0x000018, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_DynamicCast_AsDBDPlayer) == 0x000030, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_DynamicCast_AsDBDPlayer' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_DynamicCast_AsDBDPlayer_1) == 0x000040, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_DynamicCast_AsDBDPlayer_1' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000050, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_GetDBDPlayerState_ReturnValue) == 0x000058, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_GetDBDPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_GetTunableValue_ReturnValue) == 0x000060, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_IsInFinishedPlayingState_ReturnValue) == 0x000064, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_IsInFinishedPlayingState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_GetTunableValue_ReturnValue_1) == 0x000068, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_GetTunableValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_GetTunableValue_ReturnValue_2) == 0x00006C, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_GetTunableValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, K2Node_VariableSet_Takeoff_Speed_Threshold_ImplicitCast) == 0x000088, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::K2Node_VariableSet_Takeoff_Speed_Threshold_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent, CallFunc_LocallyDispatchGameEvent_customValue_ImplicitCast) == 0x000090, "Member 'CrowTriggerComponent_C_ExecuteUbergraph_CrowTriggerComponent::CallFunc_LocallyDispatchGameEvent_customValue_ImplicitCast' has a wrong offset!");

// Function CrowTriggerComponent.CrowTriggerComponent_C.CanPlayerTriggerGuaranteed
// 0x0010 (0x0010 - 0x0000)
struct CrowTriggerComponent_C_CanPlayerTriggerGuaranteed final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorCloaked_IsCloaked;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed) == 0x000008, "Wrong alignment on CrowTriggerComponent_C_CanPlayerTriggerGuaranteed");
static_assert(sizeof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed) == 0x000010, "Wrong size on CrowTriggerComponent_C_CanPlayerTriggerGuaranteed");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed, Player) == 0x000000, "Member 'CrowTriggerComponent_C_CanPlayerTriggerGuaranteed::Player' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed, ReturnValue) == 0x000008, "Member 'CrowTriggerComponent_C_CanPlayerTriggerGuaranteed::ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed, CallFunc_IsActorCloaked_IsCloaked) == 0x000009, "Member 'CrowTriggerComponent_C_CanPlayerTriggerGuaranteed::CallFunc_IsActorCloaked_IsCloaked' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'CrowTriggerComponent_C_CanPlayerTriggerGuaranteed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerGuaranteed, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'CrowTriggerComponent_C_CanPlayerTriggerGuaranteed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CrowTriggerComponent.CrowTriggerComponent_C.CanPlayerTriggerConditional
// 0x0030 (0x0030 - 0x0000)
struct CrowTriggerComponent_C_CanPlayerTriggerConditional final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorCloaked_IsCloaked;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_CanPlayerTriggerConditional) == 0x000008, "Wrong alignment on CrowTriggerComponent_C_CanPlayerTriggerConditional");
static_assert(sizeof(CrowTriggerComponent_C_CanPlayerTriggerConditional) == 0x000030, "Wrong size on CrowTriggerComponent_C_CanPlayerTriggerConditional");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, Player) == 0x000000, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::Player' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, ReturnValue) == 0x000008, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, Result) == 0x000009, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::Result' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, K2Node_DynamicCast_AsCamper_Player) == 0x000010, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, CallFunc_IsCrouching_ReturnValue) == 0x000019, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, CallFunc_GetHealthComponent_ReturnValue) == 0x000020, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, CallFunc_IsActorCloaked_IsCloaked) == 0x000028, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::CallFunc_IsActorCloaked_IsCloaked' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, CallFunc_IsDead_ReturnValue) == 0x000029, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_CanPlayerTriggerConditional, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'CrowTriggerComponent_C_CanPlayerTriggerConditional::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CrowTriggerComponent.CrowTriggerComponent_C.IsActorCloaked
// 0x0020 (0x0020 - 0x0000)
struct CrowTriggerComponent_C_IsActorCloaked final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCloaked;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_DynamicCast_AsDBDPlayer;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloaked_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrowTriggerComponent_C_IsActorCloaked) == 0x000008, "Wrong alignment on CrowTriggerComponent_C_IsActorCloaked");
static_assert(sizeof(CrowTriggerComponent_C_IsActorCloaked) == 0x000020, "Wrong size on CrowTriggerComponent_C_IsActorCloaked");
static_assert(offsetof(CrowTriggerComponent_C_IsActorCloaked, Actor) == 0x000000, "Member 'CrowTriggerComponent_C_IsActorCloaked::Actor' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_IsActorCloaked, IsCloaked) == 0x000008, "Member 'CrowTriggerComponent_C_IsActorCloaked::IsCloaked' has a wrong offset!");
static_assert(offsetof(CrowTriggerComponent_C_IsActorCloaked, Result) == 0x000009, "Member 'CrowTriggerComponent_C_IsActorCloaked::Result' has a wrong offset!");
