#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Customization

#include "Basic.hpp"


namespace SDK::Params
{

// Function Customization.Accessory.BP_DestroyComponent
// 0x0008 (0x0008 - 0x0000)
struct Accessory_BP_DestroyComponent final
{
public:
	class UActorComponent*                        ComponentToDestroy;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Accessory_BP_DestroyComponent) == 0x000008, "Wrong alignment on Accessory_BP_DestroyComponent");
static_assert(sizeof(Accessory_BP_DestroyComponent) == 0x000008, "Wrong size on Accessory_BP_DestroyComponent");
static_assert(offsetof(Accessory_BP_DestroyComponent, ComponentToDestroy) == 0x000000, "Member 'Accessory_BP_DestroyComponent::ComponentToDestroy' has a wrong offset!");

// Function Customization.AccessoryUtilities.AddBoneSocketLocalVelocityEvaluatorToAccessory
// 0x0020 (0x0020 - 0x0000)
struct AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory final
{
public:
	class UAccessory*                             Accessory;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           TrackedBoneSocketNames;                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UBoneSocketLocalVelocityEvaluator*      ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory) == 0x000008, "Wrong alignment on AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory");
static_assert(sizeof(AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory) == 0x000020, "Wrong size on AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory");
static_assert(offsetof(AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory, Accessory) == 0x000000, "Member 'AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory::Accessory' has a wrong offset!");
static_assert(offsetof(AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory, TrackedBoneSocketNames) == 0x000008, "Member 'AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory::TrackedBoneSocketNames' has a wrong offset!");
static_assert(offsetof(AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory, ReturnValue) == 0x000018, "Member 'AccessoryUtilities_AddBoneSocketLocalVelocityEvaluatorToAccessory::ReturnValue' has a wrong offset!");

}

