#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct DataflowCore.DataflowConnection
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FDataflowConnection
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowConnection) == 0x000008, "Wrong alignment on FDataflowConnection");
static_assert(sizeof(FDataflowConnection) == 0x000048, "Wrong size on FDataflowConnection");

// ScriptStruct DataflowCore.DataflowInput
// 0x0008 (0x0050 - 0x0048)
struct FDataflowInput final : public FDataflowConnection
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowInput) == 0x000008, "Wrong alignment on FDataflowInput");
static_assert(sizeof(FDataflowInput) == 0x000050, "Wrong size on FDataflowInput");

// ScriptStruct DataflowCore.DataflowNode
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x08) FDataflowNode
{
public:
	uint8                                         Pad_0[0xD0];                                       // 0x0000(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActive;                                           // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x1F];                                      // 0x00D1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowNode) == 0x000008, "Wrong alignment on FDataflowNode");
static_assert(sizeof(FDataflowNode) == 0x0000F0, "Wrong size on FDataflowNode");
static_assert(offsetof(FDataflowNode, bActive) == 0x0000D0, "Member 'FDataflowNode::bActive' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowTerminalNode
// 0x0000 (0x00F0 - 0x00F0)
struct FDataflowTerminalNode : public FDataflowNode
{
};
static_assert(alignof(FDataflowTerminalNode) == 0x000008, "Wrong alignment on FDataflowTerminalNode");
static_assert(sizeof(FDataflowTerminalNode) == 0x0000F0, "Wrong size on FDataflowTerminalNode");

// ScriptStruct DataflowCore.DataflowSelection
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FDataflowSelection
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowSelection) == 0x000008, "Wrong alignment on FDataflowSelection");
static_assert(sizeof(FDataflowSelection) == 0x000020, "Wrong size on FDataflowSelection");

// ScriptStruct DataflowCore.DataflowFaceSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowFaceSelection final : public FDataflowSelection
{
};
static_assert(alignof(FDataflowFaceSelection) == 0x000008, "Wrong alignment on FDataflowFaceSelection");
static_assert(sizeof(FDataflowFaceSelection) == 0x000020, "Wrong size on FDataflowFaceSelection");

// ScriptStruct DataflowCore.DataflowVertexSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowVertexSelection final : public FDataflowSelection
{
};
static_assert(alignof(FDataflowVertexSelection) == 0x000008, "Wrong alignment on FDataflowVertexSelection");
static_assert(sizeof(FDataflowVertexSelection) == 0x000020, "Wrong size on FDataflowVertexSelection");

// ScriptStruct DataflowCore.DataflowTransformSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowTransformSelection final : public FDataflowSelection
{
};
static_assert(alignof(FDataflowTransformSelection) == 0x000008, "Wrong alignment on FDataflowTransformSelection");
static_assert(sizeof(FDataflowTransformSelection) == 0x000020, "Wrong size on FDataflowTransformSelection");

// ScriptStruct DataflowCore.DataflowOutput
// 0x0028 (0x0070 - 0x0048)
struct FDataflowOutput final : public FDataflowConnection
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowOutput) == 0x000008, "Wrong alignment on FDataflowOutput");
static_assert(sizeof(FDataflowOutput) == 0x000070, "Wrong size on FDataflowOutput");

// ScriptStruct DataflowCore.NodeColors
// 0x0020 (0x0020 - 0x0000)
struct FNodeColors final
{
public:
	struct FLinearColor                           NodeTitleColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeBodyTintColor;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNodeColors) == 0x000004, "Wrong alignment on FNodeColors");
static_assert(sizeof(FNodeColors) == 0x000020, "Wrong size on FNodeColors");
static_assert(offsetof(FNodeColors, NodeTitleColor) == 0x000000, "Member 'FNodeColors::NodeTitleColor' has a wrong offset!");
static_assert(offsetof(FNodeColors, NodeBodyTintColor) == 0x000010, "Member 'FNodeColors::NodeBodyTintColor' has a wrong offset!");

}

