#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDAnalytics

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "BHVRAnalytics_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DBDAnalytics.EDBDAnalyticsGameMode
// NumValues: 0x0009
enum class EDBDAnalyticsGameMode : uint8
{
	AnalyticsServer                          = 0,
	AnalyticsClient                          = 1,
	AnalyticsLoading                         = 2,
	AnalyticsLobby                           = 3,
	AnalyticsMenu                            = 4,
	AnalyticsPostGame                        = 5,
	AnalyticsPerfTests                       = 6,
	AnalyticsSplashScreen                    = 7,
	EDBDAnalyticsGameMode_MAX                = 8,
};

// Enum DBDAnalytics.EHatchStatus
// NumValues: 0x0006
enum class EHatchStatus : uint8
{
	Hidden                                   = 0,
	Visible                                  = 1,
	Open                                     = 2,
	Closed                                   = 3,
	ClosedOrHidden                           = 4,
	EHatchStatus_MAX                         = 5,
};

// Enum DBDAnalytics.EDoorStatus
// NumValues: 0x0004
enum class EDoorStatus : uint8
{
	Closed                                   = 0,
	Powered                                  = 1,
	Open                                     = 2,
	EDoorStatus_MAX                          = 3,
};

// Enum DBDAnalytics.EHealthStatus
// NumValues: 0x0005
enum class EHealthStatus : uint8
{
	Healthy                                  = 0,
	Wounded                                  = 1,
	DeepWounded                              = 2,
	Dying                                    = 3,
	EHealthStatus_MAX                        = 4,
};

// Enum DBDAnalytics.ECharacterStatus
// NumValues: 0x000B
enum class ECharacterStatus : uint8
{
	Crawling                                 = 0,
	BeingPickedUp                            = 1,
	BeingCarried                             = 2,
	BeingHealed                              = 3,
	BeingMended                              = 4,
	BeingPutDown                             = 5,
	BeingPutOnHook                           = 6,
	BeingPulledFromCloset                    = 7,
	BeingKilled                              = 8,
	OnHook                                   = 9,
	ECharacterStatus_MAX                     = 10,
};

// ScriptStruct DBDAnalytics.UniquelyIdentifiedAnalytic
// 0x00A0 (0x00B8 - 0x0018)
struct FUniquelyIdentifiedAnalytic : public FBaseSingleStructIndexAnalytics
{
public:
	class FString                                 Version;                                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Branch;                                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Changelist;                                        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Configuration;                                     // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MirrorsId;                                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientId;                                          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Platform;                                          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendEnv;                                        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DataContentVersion;                                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RunContext;                                        // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUniquelyIdentifiedAnalytic) == 0x000008, "Wrong alignment on FUniquelyIdentifiedAnalytic");
static_assert(sizeof(FUniquelyIdentifiedAnalytic) == 0x0000B8, "Wrong size on FUniquelyIdentifiedAnalytic");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, Version) == 0x000018, "Member 'FUniquelyIdentifiedAnalytic::Version' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, Branch) == 0x000028, "Member 'FUniquelyIdentifiedAnalytic::Branch' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, Changelist) == 0x000038, "Member 'FUniquelyIdentifiedAnalytic::Changelist' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, Configuration) == 0x000048, "Member 'FUniquelyIdentifiedAnalytic::Configuration' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, MirrorsId) == 0x000058, "Member 'FUniquelyIdentifiedAnalytic::MirrorsId' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, ClientId) == 0x000068, "Member 'FUniquelyIdentifiedAnalytic::ClientId' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, Platform) == 0x000078, "Member 'FUniquelyIdentifiedAnalytic::Platform' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, BackendEnv) == 0x000088, "Member 'FUniquelyIdentifiedAnalytic::BackendEnv' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, DataContentVersion) == 0x000098, "Member 'FUniquelyIdentifiedAnalytic::DataContentVersion' has a wrong offset!");
static_assert(offsetof(FUniquelyIdentifiedAnalytic, RunContext) == 0x0000A8, "Member 'FUniquelyIdentifiedAnalytic::RunContext' has a wrong offset!");

// ScriptStruct DBDAnalytics.ChatAnalytics
// 0x0070 (0x0128 - 0x00B8)
struct FChatAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 SenderMirrorsId;                                   // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SenderPlayerName;                                  // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchID;                                           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChatContent;                                       // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OriginalChatContent;                               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChatContext;                                       // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGameTimestamp;                                   // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatAnalytics) == 0x000008, "Wrong alignment on FChatAnalytics");
static_assert(sizeof(FChatAnalytics) == 0x000128, "Wrong size on FChatAnalytics");
static_assert(offsetof(FChatAnalytics, SenderMirrorsId) == 0x0000B8, "Member 'FChatAnalytics::SenderMirrorsId' has a wrong offset!");
static_assert(offsetof(FChatAnalytics, SenderPlayerName) == 0x0000C8, "Member 'FChatAnalytics::SenderPlayerName' has a wrong offset!");
static_assert(offsetof(FChatAnalytics, MatchID) == 0x0000D8, "Member 'FChatAnalytics::MatchID' has a wrong offset!");
static_assert(offsetof(FChatAnalytics, ChatContent) == 0x0000E8, "Member 'FChatAnalytics::ChatContent' has a wrong offset!");
static_assert(offsetof(FChatAnalytics, OriginalChatContent) == 0x0000F8, "Member 'FChatAnalytics::OriginalChatContent' has a wrong offset!");
static_assert(offsetof(FChatAnalytics, ChatContext) == 0x000108, "Member 'FChatAnalytics::ChatContext' has a wrong offset!");
static_assert(offsetof(FChatAnalytics, InGameTimestamp) == 0x000118, "Member 'FChatAnalytics::InGameTimestamp' has a wrong offset!");

// ScriptStruct DBDAnalytics.LevelLoadingStepAnalytics
// 0x0048 (0x0100 - 0x00B8)
struct FLevelLoadingStepAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 MatchID;                                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeElapsed;                                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeElapsedInStep;                                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LoadingStep;                                       // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTimeout;                                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLevelLoadingStepAnalytics) == 0x000008, "Wrong alignment on FLevelLoadingStepAnalytics");
static_assert(sizeof(FLevelLoadingStepAnalytics) == 0x000100, "Wrong size on FLevelLoadingStepAnalytics");
static_assert(offsetof(FLevelLoadingStepAnalytics, MatchID) == 0x0000B8, "Member 'FLevelLoadingStepAnalytics::MatchID' has a wrong offset!");
static_assert(offsetof(FLevelLoadingStepAnalytics, MapName) == 0x0000C8, "Member 'FLevelLoadingStepAnalytics::MapName' has a wrong offset!");
static_assert(offsetof(FLevelLoadingStepAnalytics, Seed) == 0x0000D8, "Member 'FLevelLoadingStepAnalytics::Seed' has a wrong offset!");
static_assert(offsetof(FLevelLoadingStepAnalytics, TimeElapsed) == 0x0000DC, "Member 'FLevelLoadingStepAnalytics::TimeElapsed' has a wrong offset!");
static_assert(offsetof(FLevelLoadingStepAnalytics, TimeElapsedInStep) == 0x0000E0, "Member 'FLevelLoadingStepAnalytics::TimeElapsedInStep' has a wrong offset!");
static_assert(offsetof(FLevelLoadingStepAnalytics, LoadingStep) == 0x0000E8, "Member 'FLevelLoadingStepAnalytics::LoadingStep' has a wrong offset!");
static_assert(offsetof(FLevelLoadingStepAnalytics, IsTimeout) == 0x0000F8, "Member 'FLevelLoadingStepAnalytics::IsTimeout' has a wrong offset!");

// ScriptStruct DBDAnalytics.BaseAnalyticController
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FBaseAnalyticController
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBaseAnalyticController) == 0x000008, "Wrong alignment on FBaseAnalyticController");
static_assert(sizeof(FBaseAnalyticController) == 0x000010, "Wrong size on FBaseAnalyticController");

// ScriptStruct DBDAnalytics.ArchiveNewTomePopupAnalytics
// 0x0028 (0x00E0 - 0x00B8)
struct FArchiveNewTomePopupAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 ArchiveId;                                         // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 buttonId;                                          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VideoProgress;                                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasVideoWatchUntilEnd;                             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FArchiveNewTomePopupAnalytics) == 0x000008, "Wrong alignment on FArchiveNewTomePopupAnalytics");
static_assert(sizeof(FArchiveNewTomePopupAnalytics) == 0x0000E0, "Wrong size on FArchiveNewTomePopupAnalytics");
static_assert(offsetof(FArchiveNewTomePopupAnalytics, ArchiveId) == 0x0000B8, "Member 'FArchiveNewTomePopupAnalytics::ArchiveId' has a wrong offset!");
static_assert(offsetof(FArchiveNewTomePopupAnalytics, buttonId) == 0x0000C8, "Member 'FArchiveNewTomePopupAnalytics::buttonId' has a wrong offset!");
static_assert(offsetof(FArchiveNewTomePopupAnalytics, VideoProgress) == 0x0000D8, "Member 'FArchiveNewTomePopupAnalytics::VideoProgress' has a wrong offset!");
static_assert(offsetof(FArchiveNewTomePopupAnalytics, WasVideoWatchUntilEnd) == 0x0000DC, "Member 'FArchiveNewTomePopupAnalytics::WasVideoWatchUntilEnd' has a wrong offset!");

// ScriptStruct DBDAnalytics.ArchiveVignetteEntryAnalytics
// 0x0060 (0x0118 - 0x00B8)
struct FArchiveVignetteEntryAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 ArchiveId;                                         // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VignetteId;                                        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EntryId;                                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectEntryTimestamp;                              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EntryTimeSpent;                                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTaggedAsNew;                                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasVoiceOver;                                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartWithAutoplayEnable;                           // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoplayEnableWhenDeselectingEntry;              // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StartVoiceoverTimestamp;                           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        VoiceoverLongestTimeSpent;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FArchiveVignetteEntryAnalytics) == 0x000008, "Wrong alignment on FArchiveVignetteEntryAnalytics");
static_assert(sizeof(FArchiveVignetteEntryAnalytics) == 0x000118, "Wrong size on FArchiveVignetteEntryAnalytics");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, ArchiveId) == 0x0000B8, "Member 'FArchiveVignetteEntryAnalytics::ArchiveId' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, VignetteId) == 0x0000C8, "Member 'FArchiveVignetteEntryAnalytics::VignetteId' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, EntryId) == 0x0000D8, "Member 'FArchiveVignetteEntryAnalytics::EntryId' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, SelectEntryTimestamp) == 0x0000E0, "Member 'FArchiveVignetteEntryAnalytics::SelectEntryTimestamp' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, EntryTimeSpent) == 0x0000F0, "Member 'FArchiveVignetteEntryAnalytics::EntryTimeSpent' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, IsTaggedAsNew) == 0x0000F8, "Member 'FArchiveVignetteEntryAnalytics::IsTaggedAsNew' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, HasVoiceOver) == 0x0000F9, "Member 'FArchiveVignetteEntryAnalytics::HasVoiceOver' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, StartWithAutoplayEnable) == 0x0000FA, "Member 'FArchiveVignetteEntryAnalytics::StartWithAutoplayEnable' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, IsAutoplayEnableWhenDeselectingEntry) == 0x0000FB, "Member 'FArchiveVignetteEntryAnalytics::IsAutoplayEnableWhenDeselectingEntry' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, StartVoiceoverTimestamp) == 0x000100, "Member 'FArchiveVignetteEntryAnalytics::StartVoiceoverTimestamp' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteEntryAnalytics, VoiceoverLongestTimeSpent) == 0x000110, "Member 'FArchiveVignetteEntryAnalytics::VoiceoverLongestTimeSpent' has a wrong offset!");

// ScriptStruct DBDAnalytics.ArchiveVignetteVideoAnalytics
// 0x0050 (0x0108 - 0x00B8)
struct FArchiveVignetteVideoAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 ArchiveId;                                         // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VignetteId;                                        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoId;                                           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartVideoTimestamp;                               // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        VideoTimeSpent;                                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasVideoWatchUntilEnd;                             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FArchiveVignetteVideoAnalytics) == 0x000008, "Wrong alignment on FArchiveVignetteVideoAnalytics");
static_assert(sizeof(FArchiveVignetteVideoAnalytics) == 0x000108, "Wrong size on FArchiveVignetteVideoAnalytics");
static_assert(offsetof(FArchiveVignetteVideoAnalytics, ArchiveId) == 0x0000B8, "Member 'FArchiveVignetteVideoAnalytics::ArchiveId' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteVideoAnalytics, VignetteId) == 0x0000C8, "Member 'FArchiveVignetteVideoAnalytics::VignetteId' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteVideoAnalytics, VideoId) == 0x0000D8, "Member 'FArchiveVignetteVideoAnalytics::VideoId' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteVideoAnalytics, StartVideoTimestamp) == 0x0000E8, "Member 'FArchiveVignetteVideoAnalytics::StartVideoTimestamp' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteVideoAnalytics, VideoTimeSpent) == 0x0000F8, "Member 'FArchiveVignetteVideoAnalytics::VideoTimeSpent' has a wrong offset!");
static_assert(offsetof(FArchiveVignetteVideoAnalytics, WasVideoWatchUntilEnd) == 0x000100, "Member 'FArchiveVignetteVideoAnalytics::WasVideoWatchUntilEnd' has a wrong offset!");

// ScriptStruct DBDAnalytics.BotReplacementAnalytics
// 0x0050 (0x0108 - 0x00B8)
struct FBotReplacementAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 MatchID;                                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 KrakenMatchId;                                     // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerRole                                   Role;                                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MatchTime;                                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterName;                                     // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReplacedCharacterMirrorsId;                        // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIDifficultyLevel                            BotDifficultyLevel;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBotReplacementAnalytics) == 0x000008, "Wrong alignment on FBotReplacementAnalytics");
static_assert(sizeof(FBotReplacementAnalytics) == 0x000108, "Wrong size on FBotReplacementAnalytics");
static_assert(offsetof(FBotReplacementAnalytics, MatchID) == 0x0000B8, "Member 'FBotReplacementAnalytics::MatchID' has a wrong offset!");
static_assert(offsetof(FBotReplacementAnalytics, KrakenMatchId) == 0x0000C8, "Member 'FBotReplacementAnalytics::KrakenMatchId' has a wrong offset!");
static_assert(offsetof(FBotReplacementAnalytics, Role) == 0x0000D8, "Member 'FBotReplacementAnalytics::Role' has a wrong offset!");
static_assert(offsetof(FBotReplacementAnalytics, MatchTime) == 0x0000DC, "Member 'FBotReplacementAnalytics::MatchTime' has a wrong offset!");
static_assert(offsetof(FBotReplacementAnalytics, CharacterName) == 0x0000E0, "Member 'FBotReplacementAnalytics::CharacterName' has a wrong offset!");
static_assert(offsetof(FBotReplacementAnalytics, ReplacedCharacterMirrorsId) == 0x0000F0, "Member 'FBotReplacementAnalytics::ReplacedCharacterMirrorsId' has a wrong offset!");
static_assert(offsetof(FBotReplacementAnalytics, BotDifficultyLevel) == 0x000100, "Member 'FBotReplacementAnalytics::BotDifficultyLevel' has a wrong offset!");

// ScriptStruct DBDAnalytics.Gameplay_ChaseAnalytics
// 0x00F0 (0x01A8 - 0x00B8)
struct FGameplay_ChaseAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 MatchID;                                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameMode;                                          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsABot;                                            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MirrorsIdSurvivor;                                 // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordXStartKiller;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordYStartKiller;                                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordZStartKiller;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordXEndKiller;                                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordYEndKiller;                                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordZEndKiller;                                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PalletsDestroyedByKiller;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WindowsVaultedByKiller;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PalletsVaultedByKiller;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BasicAttackSwingsByKiller;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BasicAttackHitsByKiller;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpecialAttackAttemptsByKiller;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpecialAttackHitsByKiller;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceCoveredKiller;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordXStartSurvivor;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordYStartSurvivor;                               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordZStartSurvivor;                               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordXEndSurvivor;                                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordYEndSurvivor;                                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoordZEndSurvivor;                                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PalletsDroppedBySurvivor;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PalletsStunnedBySurvivor;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WindowsVaultedBySurvivor;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PalletsVaultedBySurvivor;                          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartingHealthOfSurvivor;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndingHealthOfSurvivor;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountHealedOfSurvivor;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StartingTileSurvivor;                              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndingTileSurvivor;                                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfTilesVisitedSurvivor;                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TilesVisitedSurvivor;                              // 0x0188(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DistanceCoveredSurvivor;                           // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplacementSurvivor;                              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChaseStartTimeInSecond;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChaseEndTimeInSecond;                              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameplay_ChaseAnalytics) == 0x000008, "Wrong alignment on FGameplay_ChaseAnalytics");
static_assert(sizeof(FGameplay_ChaseAnalytics) == 0x0001A8, "Wrong size on FGameplay_ChaseAnalytics");
static_assert(offsetof(FGameplay_ChaseAnalytics, MatchID) == 0x0000B8, "Member 'FGameplay_ChaseAnalytics::MatchID' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, GameMode) == 0x0000C8, "Member 'FGameplay_ChaseAnalytics::GameMode' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, IsABot) == 0x0000D8, "Member 'FGameplay_ChaseAnalytics::IsABot' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, MirrorsIdSurvivor) == 0x0000E0, "Member 'FGameplay_ChaseAnalytics::MirrorsIdSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordXStartKiller) == 0x0000F0, "Member 'FGameplay_ChaseAnalytics::CoordXStartKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordYStartKiller) == 0x0000F4, "Member 'FGameplay_ChaseAnalytics::CoordYStartKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordZStartKiller) == 0x0000F8, "Member 'FGameplay_ChaseAnalytics::CoordZStartKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordXEndKiller) == 0x0000FC, "Member 'FGameplay_ChaseAnalytics::CoordXEndKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordYEndKiller) == 0x000100, "Member 'FGameplay_ChaseAnalytics::CoordYEndKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordZEndKiller) == 0x000104, "Member 'FGameplay_ChaseAnalytics::CoordZEndKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, PalletsDestroyedByKiller) == 0x000108, "Member 'FGameplay_ChaseAnalytics::PalletsDestroyedByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, WindowsVaultedByKiller) == 0x00010C, "Member 'FGameplay_ChaseAnalytics::WindowsVaultedByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, PalletsVaultedByKiller) == 0x000110, "Member 'FGameplay_ChaseAnalytics::PalletsVaultedByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, BasicAttackSwingsByKiller) == 0x000114, "Member 'FGameplay_ChaseAnalytics::BasicAttackSwingsByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, BasicAttackHitsByKiller) == 0x000118, "Member 'FGameplay_ChaseAnalytics::BasicAttackHitsByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, SpecialAttackAttemptsByKiller) == 0x00011C, "Member 'FGameplay_ChaseAnalytics::SpecialAttackAttemptsByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, SpecialAttackHitsByKiller) == 0x000120, "Member 'FGameplay_ChaseAnalytics::SpecialAttackHitsByKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, DistanceCoveredKiller) == 0x000124, "Member 'FGameplay_ChaseAnalytics::DistanceCoveredKiller' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordXStartSurvivor) == 0x000128, "Member 'FGameplay_ChaseAnalytics::CoordXStartSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordYStartSurvivor) == 0x00012C, "Member 'FGameplay_ChaseAnalytics::CoordYStartSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordZStartSurvivor) == 0x000130, "Member 'FGameplay_ChaseAnalytics::CoordZStartSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordXEndSurvivor) == 0x000134, "Member 'FGameplay_ChaseAnalytics::CoordXEndSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordYEndSurvivor) == 0x000138, "Member 'FGameplay_ChaseAnalytics::CoordYEndSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, CoordZEndSurvivor) == 0x00013C, "Member 'FGameplay_ChaseAnalytics::CoordZEndSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, PalletsDroppedBySurvivor) == 0x000140, "Member 'FGameplay_ChaseAnalytics::PalletsDroppedBySurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, PalletsStunnedBySurvivor) == 0x000144, "Member 'FGameplay_ChaseAnalytics::PalletsStunnedBySurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, WindowsVaultedBySurvivor) == 0x000148, "Member 'FGameplay_ChaseAnalytics::WindowsVaultedBySurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, PalletsVaultedBySurvivor) == 0x00014C, "Member 'FGameplay_ChaseAnalytics::PalletsVaultedBySurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, StartingHealthOfSurvivor) == 0x000150, "Member 'FGameplay_ChaseAnalytics::StartingHealthOfSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, EndingHealthOfSurvivor) == 0x000154, "Member 'FGameplay_ChaseAnalytics::EndingHealthOfSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, AmountHealedOfSurvivor) == 0x000158, "Member 'FGameplay_ChaseAnalytics::AmountHealedOfSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, StartingTileSurvivor) == 0x000160, "Member 'FGameplay_ChaseAnalytics::StartingTileSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, EndingTileSurvivor) == 0x000170, "Member 'FGameplay_ChaseAnalytics::EndingTileSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, AmountOfTilesVisitedSurvivor) == 0x000180, "Member 'FGameplay_ChaseAnalytics::AmountOfTilesVisitedSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, TilesVisitedSurvivor) == 0x000188, "Member 'FGameplay_ChaseAnalytics::TilesVisitedSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, DistanceCoveredSurvivor) == 0x000198, "Member 'FGameplay_ChaseAnalytics::DistanceCoveredSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, DisplacementSurvivor) == 0x00019C, "Member 'FGameplay_ChaseAnalytics::DisplacementSurvivor' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, ChaseStartTimeInSecond) == 0x0001A0, "Member 'FGameplay_ChaseAnalytics::ChaseStartTimeInSecond' has a wrong offset!");
static_assert(offsetof(FGameplay_ChaseAnalytics, ChaseEndTimeInSecond) == 0x0001A4, "Member 'FGameplay_ChaseAnalytics::ChaseEndTimeInSecond' has a wrong offset!");

// ScriptStruct DBDAnalytics.BaseCheatAnalytics
// 0x0088 (0x0140 - 0x00B8)
struct FBaseCheatAnalytics : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 Location;                                          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NetMode;                                           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Requester;                                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequesterPlatform;                                 // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequesterRole;                                     // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequesterCharacterId;                              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RequesterCharacterName;                            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchID;                                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchType;                                         // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseCheatAnalytics) == 0x000008, "Wrong alignment on FBaseCheatAnalytics");
static_assert(sizeof(FBaseCheatAnalytics) == 0x000140, "Wrong size on FBaseCheatAnalytics");
static_assert(offsetof(FBaseCheatAnalytics, Location) == 0x0000B8, "Member 'FBaseCheatAnalytics::Location' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, NetMode) == 0x0000C8, "Member 'FBaseCheatAnalytics::NetMode' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, Requester) == 0x0000D8, "Member 'FBaseCheatAnalytics::Requester' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, RequesterPlatform) == 0x0000E8, "Member 'FBaseCheatAnalytics::RequesterPlatform' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, RequesterRole) == 0x0000F8, "Member 'FBaseCheatAnalytics::RequesterRole' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, RequesterCharacterId) == 0x000108, "Member 'FBaseCheatAnalytics::RequesterCharacterId' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, RequesterCharacterName) == 0x000110, "Member 'FBaseCheatAnalytics::RequesterCharacterName' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, MatchID) == 0x000120, "Member 'FBaseCheatAnalytics::MatchID' has a wrong offset!");
static_assert(offsetof(FBaseCheatAnalytics, MatchType) == 0x000130, "Member 'FBaseCheatAnalytics::MatchType' has a wrong offset!");

// ScriptStruct DBDAnalytics.CheatValidatedAnalytics
// 0x0028 (0x0168 - 0x0140)
struct FCheatValidatedAnalytics final : public FBaseCheatAnalytics
{
public:
	class FString                                 Command;                                           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Validated;                                         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCheatValidatedAnalytics) == 0x000008, "Wrong alignment on FCheatValidatedAnalytics");
static_assert(sizeof(FCheatValidatedAnalytics) == 0x000168, "Wrong size on FCheatValidatedAnalytics");
static_assert(offsetof(FCheatValidatedAnalytics, Command) == 0x000140, "Member 'FCheatValidatedAnalytics::Command' has a wrong offset!");
static_assert(offsetof(FCheatValidatedAnalytics, Type) == 0x000150, "Member 'FCheatValidatedAnalytics::Type' has a wrong offset!");
static_assert(offsetof(FCheatValidatedAnalytics, Validated) == 0x000160, "Member 'FCheatValidatedAnalytics::Validated' has a wrong offset!");

// ScriptStruct DBDAnalytics.CheatExecutedAnalytics
// 0x0028 (0x0168 - 0x0140)
struct FCheatExecutedAnalytics final : public FBaseCheatAnalytics
{
public:
	class FString                                 Command;                                           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Successful;                                        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCheatExecutedAnalytics) == 0x000008, "Wrong alignment on FCheatExecutedAnalytics");
static_assert(sizeof(FCheatExecutedAnalytics) == 0x000168, "Wrong size on FCheatExecutedAnalytics");
static_assert(offsetof(FCheatExecutedAnalytics, Command) == 0x000140, "Member 'FCheatExecutedAnalytics::Command' has a wrong offset!");
static_assert(offsetof(FCheatExecutedAnalytics, Type) == 0x000150, "Member 'FCheatExecutedAnalytics::Type' has a wrong offset!");
static_assert(offsetof(FCheatExecutedAnalytics, Successful) == 0x000160, "Member 'FCheatExecutedAnalytics::Successful' has a wrong offset!");

// ScriptStruct DBDAnalytics.ExecExecutedAnalytics
// 0x0018 (0x0158 - 0x0140)
struct FExecExecutedAnalytics final : public FBaseCheatAnalytics
{
public:
	class FString                                 Command;                                           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Executed;                                          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExecExecutedAnalytics) == 0x000008, "Wrong alignment on FExecExecutedAnalytics");
static_assert(sizeof(FExecExecutedAnalytics) == 0x000158, "Wrong size on FExecExecutedAnalytics");
static_assert(offsetof(FExecExecutedAnalytics, Command) == 0x000140, "Member 'FExecExecutedAnalytics::Command' has a wrong offset!");
static_assert(offsetof(FExecExecutedAnalytics, Executed) == 0x000150, "Member 'FExecExecutedAnalytics::Executed' has a wrong offset!");

// ScriptStruct DBDAnalytics.SuspiciousBehaviourAnalytics
// 0x0050 (0x0190 - 0x0140)
struct FSuspiciousBehaviourAnalytics final : public FBaseCheatAnalytics
{
public:
	class FString                                 Type;                                              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExtraField1String;                                 // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExtraField1Integer;                                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExtraField1Floating;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExtraField2String;                                 // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExtraField2Integer;                                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExtraField2Floating;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSuspiciousBehaviourAnalytics) == 0x000008, "Wrong alignment on FSuspiciousBehaviourAnalytics");
static_assert(sizeof(FSuspiciousBehaviourAnalytics) == 0x000190, "Wrong size on FSuspiciousBehaviourAnalytics");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, Type) == 0x000140, "Member 'FSuspiciousBehaviourAnalytics::Type' has a wrong offset!");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, ExtraField1String) == 0x000150, "Member 'FSuspiciousBehaviourAnalytics::ExtraField1String' has a wrong offset!");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, ExtraField1Integer) == 0x000160, "Member 'FSuspiciousBehaviourAnalytics::ExtraField1Integer' has a wrong offset!");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, ExtraField1Floating) == 0x000168, "Member 'FSuspiciousBehaviourAnalytics::ExtraField1Floating' has a wrong offset!");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, ExtraField2String) == 0x000170, "Member 'FSuspiciousBehaviourAnalytics::ExtraField2String' has a wrong offset!");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, ExtraField2Integer) == 0x000180, "Member 'FSuspiciousBehaviourAnalytics::ExtraField2Integer' has a wrong offset!");
static_assert(offsetof(FSuspiciousBehaviourAnalytics, ExtraField2Floating) == 0x000188, "Member 'FSuspiciousBehaviourAnalytics::ExtraField2Floating' has a wrong offset!");

// ScriptStruct DBDAnalytics.ClientConnectionBaseAnalytics
// 0x00B0 (0x0168 - 0x00B8)
struct FClientConnectionBaseAnalytics : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 ClientRole;                                        // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientSurvivorIndex;                               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientKillerIndex;                                 // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientPlatformAccountId;                           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientMirrorsId;                                   // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientPlatform;                                    // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientProvider;                                    // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientName;                                        // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientContentVersion;                              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchID;                                           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameType;                                          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClientConnectionBaseAnalytics) == 0x000008, "Wrong alignment on FClientConnectionBaseAnalytics");
static_assert(sizeof(FClientConnectionBaseAnalytics) == 0x000168, "Wrong size on FClientConnectionBaseAnalytics");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientRole) == 0x0000B8, "Member 'FClientConnectionBaseAnalytics::ClientRole' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientSurvivorIndex) == 0x0000C8, "Member 'FClientConnectionBaseAnalytics::ClientSurvivorIndex' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientKillerIndex) == 0x0000D8, "Member 'FClientConnectionBaseAnalytics::ClientKillerIndex' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientPlatformAccountId) == 0x0000E8, "Member 'FClientConnectionBaseAnalytics::ClientPlatformAccountId' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientMirrorsId) == 0x0000F8, "Member 'FClientConnectionBaseAnalytics::ClientMirrorsId' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientPlatform) == 0x000108, "Member 'FClientConnectionBaseAnalytics::ClientPlatform' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientProvider) == 0x000118, "Member 'FClientConnectionBaseAnalytics::ClientProvider' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientName) == 0x000128, "Member 'FClientConnectionBaseAnalytics::ClientName' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, ClientContentVersion) == 0x000138, "Member 'FClientConnectionBaseAnalytics::ClientContentVersion' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, MatchID) == 0x000148, "Member 'FClientConnectionBaseAnalytics::MatchID' has a wrong offset!");
static_assert(offsetof(FClientConnectionBaseAnalytics, GameType) == 0x000158, "Member 'FClientConnectionBaseAnalytics::GameType' has a wrong offset!");

// ScriptStruct DBDAnalytics.ClientLoginAnalytics
// 0x0040 (0x01A8 - 0x0168)
struct FClientLoginAnalytics final : public FClientConnectionBaseAnalytics
{
public:
	class FString                                 ClientOptions;                                     // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientMatchId;                                     // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientGameType;                                    // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LoginResult;                                       // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClientLoginAnalytics) == 0x000008, "Wrong alignment on FClientLoginAnalytics");
static_assert(sizeof(FClientLoginAnalytics) == 0x0001A8, "Wrong size on FClientLoginAnalytics");
static_assert(offsetof(FClientLoginAnalytics, ClientOptions) == 0x000168, "Member 'FClientLoginAnalytics::ClientOptions' has a wrong offset!");
static_assert(offsetof(FClientLoginAnalytics, ClientMatchId) == 0x000178, "Member 'FClientLoginAnalytics::ClientMatchId' has a wrong offset!");
static_assert(offsetof(FClientLoginAnalytics, ClientGameType) == 0x000188, "Member 'FClientLoginAnalytics::ClientGameType' has a wrong offset!");
static_assert(offsetof(FClientLoginAnalytics, LoginResult) == 0x000198, "Member 'FClientLoginAnalytics::LoginResult' has a wrong offset!");

// ScriptStruct DBDAnalytics.ClientLogoutAnalytics
// 0x0020 (0x0188 - 0x0168)
struct FClientLogoutAnalytics final : public FClientConnectionBaseAnalytics
{
public:
	class FString                                 GameState;                                         // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameFlowStep;                                      // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClientLogoutAnalytics) == 0x000008, "Wrong alignment on FClientLogoutAnalytics");
static_assert(sizeof(FClientLogoutAnalytics) == 0x000188, "Wrong size on FClientLogoutAnalytics");
static_assert(offsetof(FClientLogoutAnalytics, GameState) == 0x000168, "Member 'FClientLogoutAnalytics::GameState' has a wrong offset!");
static_assert(offsetof(FClientLogoutAnalytics, GameFlowStep) == 0x000178, "Member 'FClientLogoutAnalytics::GameFlowStep' has a wrong offset!");

// ScriptStruct DBDAnalytics.CrossfriendsAnalytics
// 0x0020 (0x00D8 - 0x00B8)
struct FCrossfriendsAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 Action;                                            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetKrakenUserId;                                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCrossfriendsAnalytics) == 0x000008, "Wrong alignment on FCrossfriendsAnalytics");
static_assert(sizeof(FCrossfriendsAnalytics) == 0x0000D8, "Wrong size on FCrossfriendsAnalytics");
static_assert(offsetof(FCrossfriendsAnalytics, Action) == 0x0000B8, "Member 'FCrossfriendsAnalytics::Action' has a wrong offset!");
static_assert(offsetof(FCrossfriendsAnalytics, TargetKrakenUserId) == 0x0000C8, "Member 'FCrossfriendsAnalytics::TargetKrakenUserId' has a wrong offset!");

// ScriptStruct DBDAnalytics.CurrencyBalanceAnalytics
// 0x0018 (0x00D0 - 0x00B8)
struct FCurrencyBalanceAnalytics final : public FUniquelyIdentifiedAnalytic
{
public:
	class FString                                 CurrencyName;                                      // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrencyBalance;                                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCurrencyBalanceAnalytics) == 0x000008, "Wrong alignment on FCurrencyBalanceAnalytics");
static_assert(sizeof(FCurrencyBalanceAnalytics) == 0x0000D0, "Wrong size on FCurrencyBalanceAnalytics");
