#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDAnimationBudgetAllocator

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct DBDAnimationBudgetAllocator.RootPrerequisiteRegisteredHandle
// 0x0010 (0x0010 - 0x0000)
struct FRootPrerequisiteRegisteredHandle final
{
public:
	class USkeletalMeshComponentBudgeted*         RootPrerequisite;                                  // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRootPrerequisiteRegisteredHandle) == 0x000008, "Wrong alignment on FRootPrerequisiteRegisteredHandle");
static_assert(sizeof(FRootPrerequisiteRegisteredHandle) == 0x000010, "Wrong size on FRootPrerequisiteRegisteredHandle");
static_assert(offsetof(FRootPrerequisiteRegisteredHandle, RootPrerequisite) == 0x000000, "Member 'FRootPrerequisiteRegisteredHandle::RootPrerequisite' has a wrong offset!");

// ScriptStruct DBDAnimationBudgetAllocator.SkeletalMeshComponentData
// 0x0020 (0x0020 - 0x0000)
struct FSkeletalMeshComponentData final
{
public:
	class UDBDSkeletalMeshComponentBudgeted*      SkeletalMeshComponent;                             // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSkeletalMeshComponentData) == 0x000008, "Wrong alignment on FSkeletalMeshComponentData");
static_assert(sizeof(FSkeletalMeshComponentData) == 0x000020, "Wrong size on FSkeletalMeshComponentData");
static_assert(offsetof(FSkeletalMeshComponentData, SkeletalMeshComponent) == 0x000000, "Member 'FSkeletalMeshComponentData::SkeletalMeshComponent' has a wrong offset!");

// ScriptStruct DBDAnimationBudgetAllocator.DBDAnimBudgetAllocatorComponentData
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FDBDAnimBudgetAllocatorComponentData final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDBDAnimBudgetAllocatorComponentData) == 0x000008, "Wrong alignment on FDBDAnimBudgetAllocatorComponentData");
static_assert(sizeof(FDBDAnimBudgetAllocatorComponentData) == 0x000038, "Wrong size on FDBDAnimBudgetAllocatorComponentData");

}

