#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDAnalytics

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "BHVRAnalytics_classes.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class DBDAnalytics.PerkAnalyticsLibrary
// 0x0000 (0x0030 - 0x0030)
class UPerkAnalyticsLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SendFranklinsConsumeItemAnalytics(class ADBDPlayer* PreviousOwner);
	static void SendFranklinsHitSurvivorNearDroppedItemAnalytics(class ADBDPlayer* HitSurvivor, class ADBDPlayer* Slasher);
	static void SendKnockoutSurvivorFoundAnalytics(class ADBDPlayer* FindingSurvivor, class ADBDPlayer* FoundSurvivor);
	static void SendLightbornAuraRevealedAnalytics(class ADBDPlayer* RevealedPlayer, class ADBDPlayer* Slasher);
	static void SendTinkererUndetectableHitNearGeneratorAnalytics(class ADBDPlayer* HitPlayer, class ADBDPlayer* Slasher);
	static void SendTinkererUndetectableInterruptAnalytics(class ADBDPlayer* InterruptedPlayer, class ADBDPlayer* Slasher);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerkAnalyticsLibrary">();
	}
	static class UPerkAnalyticsLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkAnalyticsLibrary>();
	}
};
static_assert(alignof(UPerkAnalyticsLibrary) == 0x000008, "Wrong alignment on UPerkAnalyticsLibrary");
static_assert(sizeof(UPerkAnalyticsLibrary) == 0x000030, "Wrong size on UPerkAnalyticsLibrary");

// Class DBDAnalytics.AnalyticsDelegates
// 0x0000 (0x0038 - 0x0038)
class UAnalyticsDelegates final : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalyticsDelegates">();
	}
	static class UAnalyticsDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsDelegates>();
	}
};
static_assert(alignof(UAnalyticsDelegates) == 0x000008, "Wrong alignment on UAnalyticsDelegates");
static_assert(sizeof(UAnalyticsDelegates) == 0x000038, "Wrong size on UAnalyticsDelegates");

// Class DBDAnalytics.AnalyticsFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UAnalyticsFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void IncrementHookSpawned();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalyticsFunctionLibrary">();
	}
	static class UAnalyticsFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsFunctionLibrary>();
	}
};
static_assert(alignof(UAnalyticsFunctionLibrary) == 0x000008, "Wrong alignment on UAnalyticsFunctionLibrary");
static_assert(sizeof(UAnalyticsFunctionLibrary) == 0x000030, "Wrong size on UAnalyticsFunctionLibrary");

// Class DBDAnalytics.AnalyticsManager
// 0x3A68 (0x3AA0 - 0x0038)
class UAnalyticsManager final : public UAbstractAnalyticsManager
{
public:
	uint8                                         Pad_38[0x3A68];                                    // 0x0038(0x3A68)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalyticsManager">();
	}
	static class UAnalyticsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsManager>();
	}
};
static_assert(alignof(UAnalyticsManager) == 0x000008, "Wrong alignment on UAnalyticsManager");
static_assert(sizeof(UAnalyticsManager) == 0x003AA0, "Wrong size on UAnalyticsManager");

// Class DBDAnalytics.AnalyticsUtilities
// 0x0000 (0x0030 - 0x0030)
class UAnalyticsUtilities final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalyticsUtilities">();
	}
	static class UAnalyticsUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsUtilities>();
	}
};
static_assert(alignof(UAnalyticsUtilities) == 0x000008, "Wrong alignment on UAnalyticsUtilities");
static_assert(sizeof(UAnalyticsUtilities) == 0x000030, "Wrong size on UAnalyticsUtilities");

// Class DBDAnalytics.DBDAnalytics
// 0x0000 (0x0030 - 0x0030)
class UDBDAnalytics final : public UBHVRAnalytics
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DBDAnalytics">();
	}
	static class UDBDAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBDAnalytics>();
	}
};
static_assert(alignof(UDBDAnalytics) == 0x000008, "Wrong alignment on UDBDAnalytics");
static_assert(sizeof(UDBDAnalytics) == 0x000030, "Wrong size on UDBDAnalytics");

// Class DBDAnalytics.EmblemAnalyticsComponent
// 0x0108 (0x01B0 - 0x00A8)
class UEmblemAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x108];                                     // 0x00A8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmblemAnalyticsComponent">();
	}
	static class UEmblemAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmblemAnalyticsComponent>();
	}
};
static_assert(alignof(UEmblemAnalyticsComponent) == 0x000008, "Wrong alignment on UEmblemAnalyticsComponent");
static_assert(sizeof(UEmblemAnalyticsComponent) == 0x0001B0, "Wrong size on UEmblemAnalyticsComponent");

// Class DBDAnalytics.InteractionAnalyticsComponent
// 0x00D8 (0x0180 - 0x00A8)
class UInteractionAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0xD8];                                      // 0x00A8(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionAnalyticsComponent">();
	}
	static class UInteractionAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionAnalyticsComponent>();
	}
};
static_assert(alignof(UInteractionAnalyticsComponent) == 0x000008, "Wrong alignment on UInteractionAnalyticsComponent");
static_assert(sizeof(UInteractionAnalyticsComponent) == 0x000180, "Wrong size on UInteractionAnalyticsComponent");

// Class DBDAnalytics.PigAnalytics
// 0x0000 (0x0030 - 0x0030)
class UPigAnalytics final : public UBlueprintFunctionLibrary
{
public:
	static void IncrementRBTKilledCount(class ACamperPlayer* PlayerKilled, bool KilledByExecutionZone);
	static void IncrementRBTTimerActived(class ACamperPlayer* AttachedPlayer);
	static void OnRBTAttached_Analytics(class ASlasherPlayer* Attacher, class ACamperPlayer* Attachee);
	static void RecordRBTSearch(class ACamperPlayer* SearchingPlayer, bool Success);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PigAnalytics">();
	}
	static class UPigAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPigAnalytics>();
	}
};
static_assert(alignof(UPigAnalytics) == 0x000008, "Wrong alignment on UPigAnalytics");
static_assert(sizeof(UPigAnalytics) == 0x000030, "Wrong size on UPigAnalytics");

// Class DBDAnalytics.PlayerHookAnalyticsComponent
// 0x0368 (0x0410 - 0x00A8)
class UPlayerHookAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x368];                                     // 0x00A8(0x0368)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerHookAnalyticsComponent">();
	}
	static class UPlayerHookAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerHookAnalyticsComponent>();
	}
};
static_assert(alignof(UPlayerHookAnalyticsComponent) == 0x000008, "Wrong alignment on UPlayerHookAnalyticsComponent");
static_assert(sizeof(UPlayerHookAnalyticsComponent) == 0x000410, "Wrong size on UPlayerHookAnalyticsComponent");

// Class DBDAnalytics.PlayerMovementAnalyticsComponent
// 0x0170 (0x0218 - 0x00A8)
class UPlayerMovementAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x170];                                     // 0x00A8(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnControllerPossessionChanged(class APawn* OldPawn, class APawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerMovementAnalyticsComponent">();
	}
	static class UPlayerMovementAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMovementAnalyticsComponent>();
	}
};
static_assert(alignof(UPlayerMovementAnalyticsComponent) == 0x000008, "Wrong alignment on UPlayerMovementAnalyticsComponent");
static_assert(sizeof(UPlayerMovementAnalyticsComponent) == 0x000218, "Wrong size on UPlayerMovementAnalyticsComponent");

// Class DBDAnalytics.PulldownAnalytics
// 0x0000 (0x0030 - 0x0030)
class UPulldownAnalytics final : public UBlueprintFunctionLibrary
{
public:
	static void IncrementPalletDestroy(class ASlasherPlayer* Killer);
	static void IncrementPalletDrop(class ACamperPlayer* Survivor);
	static void IncrementPalletSpawned(class AActor* Actor);
	static void IncrementPalletStun(class ACamperPlayer* Survivor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PulldownAnalytics">();
	}
	static class UPulldownAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPulldownAnalytics>();
	}
};
static_assert(alignof(UPulldownAnalytics) == 0x000008, "Wrong alignment on UPulldownAnalytics");
static_assert(sizeof(UPulldownAnalytics) == 0x000030, "Wrong size on UPulldownAnalytics");

// Class DBDAnalytics.SurvivorAnalyticsComponent
// 0x00C0 (0x0168 - 0x00A8)
class USurvivorAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0xC0];                                      // 0x00A8(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorAnalyticsComponent">();
	}
	static class USurvivorAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorAnalyticsComponent>();
	}
};
static_assert(alignof(USurvivorAnalyticsComponent) == 0x000008, "Wrong alignment on USurvivorAnalyticsComponent");
static_assert(sizeof(USurvivorAnalyticsComponent) == 0x000168, "Wrong size on USurvivorAnalyticsComponent");

// Class DBDAnalytics.SurvivorInteractionAnalytics
// 0x0000 (0x0030 - 0x0030)
class USurvivorInteractionAnalytics final : public UBlueprintFunctionLibrary
{
public:
	static void IncrementHealCount(class ACamperPlayer* Survivor);
	static void RecordHatchEscape(class ACamperPlayer* Survivor);
	static void RecordHealSuccess(class ACamperPlayer* Survivor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorInteractionAnalytics">();
	}
	static class USurvivorInteractionAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorInteractionAnalytics>();
	}
};
static_assert(alignof(USurvivorInteractionAnalytics) == 0x000008, "Wrong alignment on USurvivorInteractionAnalytics");
static_assert(sizeof(USurvivorInteractionAnalytics) == 0x000030, "Wrong size on USurvivorInteractionAnalytics");

}

