#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "AnimationUtilities_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Activation_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDAnimation_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"


namespace SDK
{

// Class DBDAnimation.CrowAnimInstance
// 0x0010 (0x0360 - 0x0350)
class UCrowAnimInstance : public UAnimInstance
{
public:
	bool                                          _shouldTakeOff;                                    // 0x0350(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorldRunawayMeshComponent*             _crow;                                             // 0x0358(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrowAnimInstance">();
	}
	static class UCrowAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrowAnimInstance>();
	}
};
static_assert(alignof(UCrowAnimInstance) == 0x000010, "Wrong alignment on UCrowAnimInstance");
static_assert(sizeof(UCrowAnimInstance) == 0x000360, "Wrong size on UCrowAnimInstance");
static_assert(offsetof(UCrowAnimInstance, _shouldTakeOff) == 0x000350, "Member 'UCrowAnimInstance::_shouldTakeOff' has a wrong offset!");
static_assert(offsetof(UCrowAnimInstance, _crow) == 0x000358, "Member 'UCrowAnimInstance::_crow' has a wrong offset!");

// Class DBDAnimation.DBDBaseAnimInstance
// 0x0030 (0x0380 - 0x0350)
class UDBDBaseAnimInstance : public UAnimInstance
{
public:
	class UAnimEffectBlackBoard*                  _animEffectBlackBoard;                             // 0x0350(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimEffectHandler*                     _animEffectHandlerForSFX;                          // 0x0358(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimEffectHandler*                     _animEffectHandlerForVFX;                          // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimEffectHandler>         _animEffectHandlerClassForSFX;                     // 0x0368(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimEffectHandler>         _animEffectHandlerClassForVFX;                     // 0x0370(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasBeenNotified(const class FName AnimNotify) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DBDBaseAnimInstance">();
	}
	static class UDBDBaseAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBDBaseAnimInstance>();
	}
};
static_assert(alignof(UDBDBaseAnimInstance) == 0x000010, "Wrong alignment on UDBDBaseAnimInstance");
static_assert(sizeof(UDBDBaseAnimInstance) == 0x000380, "Wrong size on UDBDBaseAnimInstance");
static_assert(offsetof(UDBDBaseAnimInstance, _animEffectBlackBoard) == 0x000350, "Member 'UDBDBaseAnimInstance::_animEffectBlackBoard' has a wrong offset!");
static_assert(offsetof(UDBDBaseAnimInstance, _animEffectHandlerForSFX) == 0x000358, "Member 'UDBDBaseAnimInstance::_animEffectHandlerForSFX' has a wrong offset!");
static_assert(offsetof(UDBDBaseAnimInstance, _animEffectHandlerForVFX) == 0x000360, "Member 'UDBDBaseAnimInstance::_animEffectHandlerForVFX' has a wrong offset!");
static_assert(offsetof(UDBDBaseAnimInstance, _animEffectHandlerClassForSFX) == 0x000368, "Member 'UDBDBaseAnimInstance::_animEffectHandlerClassForSFX' has a wrong offset!");
static_assert(offsetof(UDBDBaseAnimInstance, _animEffectHandlerClassForVFX) == 0x000370, "Member 'UDBDBaseAnimInstance::_animEffectHandlerClassForVFX' has a wrong offset!");

// Class DBDAnimation.PlayerAnimInstance
// 0x0260 (0x05E0 - 0x0380)
#pragma pack(push, 0x1)
class alignas(0x10) UPlayerAnimInstance : public UDBDBaseAnimInstance
{
public:
	uint8                                         Pad_380[0x20];                                     // 0x0380(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             _owningPlayer;                                     // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTaggedAnimCollection>          _taggedAnimCollections;                            // 0x03A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UAnimSequence*> _animations;                                       // 0x03B8(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UBlendSpace*> _blendspaces;                                      // 0x0408(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UAimOffsetBlendSpace*> _aimoffsets;                                       // 0x0458(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UBlendSpace1D*> _blendspaces1d;                                    // 0x04A8(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UAimOffsetBlendSpace1D*> _aimoffsets1d;                                     // 0x04F8(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FAnimSequenceSelector> _selectors;                                        // 0x0548(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          _isInParadise;                                     // 0x0598(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIntroCompleted;                                 // 0x0599(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isLevelReadyToPlay;                               // 0x059A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59B[0x5];                                      // 0x059B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActivationDefinition                  _activationDefinition;                             // 0x05A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C8[0x10];                                     // 0x05C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIntroCompleted();
	void OnLevelReadyToPlay();
	void UnlinkAnimationLayerByGroup(const struct FGameplayTag& LayerGroup);

	const class ADBDPlayer* GetOwningPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerAnimInstance">();
	}
	static class UPlayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UPlayerAnimInstance) == 0x000010, "Wrong alignment on UPlayerAnimInstance");
static_assert(sizeof(UPlayerAnimInstance) == 0x0005E0, "Wrong size on UPlayerAnimInstance");
static_assert(offsetof(UPlayerAnimInstance, _owningPlayer) == 0x0003A0, "Member 'UPlayerAnimInstance::_owningPlayer' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _taggedAnimCollections) == 0x0003A8, "Member 'UPlayerAnimInstance::_taggedAnimCollections' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _animations) == 0x0003B8, "Member 'UPlayerAnimInstance::_animations' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _blendspaces) == 0x000408, "Member 'UPlayerAnimInstance::_blendspaces' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _aimoffsets) == 0x000458, "Member 'UPlayerAnimInstance::_aimoffsets' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _blendspaces1d) == 0x0004A8, "Member 'UPlayerAnimInstance::_blendspaces1d' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _aimoffsets1d) == 0x0004F8, "Member 'UPlayerAnimInstance::_aimoffsets1d' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _selectors) == 0x000548, "Member 'UPlayerAnimInstance::_selectors' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _isInParadise) == 0x000598, "Member 'UPlayerAnimInstance::_isInParadise' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _isIntroCompleted) == 0x000599, "Member 'UPlayerAnimInstance::_isIntroCompleted' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _isLevelReadyToPlay) == 0x00059A, "Member 'UPlayerAnimInstance::_isLevelReadyToPlay' has a wrong offset!");
static_assert(offsetof(UPlayerAnimInstance, _activationDefinition) == 0x0005A0, "Member 'UPlayerAnimInstance::_activationDefinition' has a wrong offset!");

// Class DBDAnimation.BasePlayerAttackSubAnimInstance
// 0x00D0 (0x06B0 - 0x05E0)
#pragma pack(push, 0x1)
class alignas(0x10) UBasePlayerAttackSubAnimInstance : public UPlayerAnimInstance
{
public:
	EAttackSubstate                               _attackState;                                      // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _direction;                                        // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _strafeAngle;                                      // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isStrafe;                                         // 0x05E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _attackInPlayRate;                                 // 0x05E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequenceSelector                  _attackIn;                                         // 0x05F0(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         _attackSwingPlayRate;                              // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequenceSelector                  _attackSwing;                                      // 0x0610(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         _attackMissPlayRate;                               // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequenceSelector                  _attackMiss;                                       // 0x0630(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         _attackHitPlayRate;                                // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequenceSelector                  _attackHit;                                        // 0x0650(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         _attackBounceOfWallPlayRate;                       // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequenceSelector                  _attackBounceOfWall;                               // 0x0670(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_688[0x18];                                     // 0x0688(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _firstPersonView;                                  // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePlayerAttackSubAnimInstance">();
	}
	static class UBasePlayerAttackSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePlayerAttackSubAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UBasePlayerAttackSubAnimInstance) == 0x000010, "Wrong alignment on UBasePlayerAttackSubAnimInstance");
static_assert(sizeof(UBasePlayerAttackSubAnimInstance) == 0x0006B0, "Wrong size on UBasePlayerAttackSubAnimInstance");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackState) == 0x0005D8, "Member 'UBasePlayerAttackSubAnimInstance::_attackState' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _direction) == 0x0005DC, "Member 'UBasePlayerAttackSubAnimInstance::_direction' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _strafeAngle) == 0x0005E0, "Member 'UBasePlayerAttackSubAnimInstance::_strafeAngle' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _isStrafe) == 0x0005E4, "Member 'UBasePlayerAttackSubAnimInstance::_isStrafe' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackInPlayRate) == 0x0005E8, "Member 'UBasePlayerAttackSubAnimInstance::_attackInPlayRate' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackIn) == 0x0005F0, "Member 'UBasePlayerAttackSubAnimInstance::_attackIn' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackSwingPlayRate) == 0x000608, "Member 'UBasePlayerAttackSubAnimInstance::_attackSwingPlayRate' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackSwing) == 0x000610, "Member 'UBasePlayerAttackSubAnimInstance::_attackSwing' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackMissPlayRate) == 0x000628, "Member 'UBasePlayerAttackSubAnimInstance::_attackMissPlayRate' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackMiss) == 0x000630, "Member 'UBasePlayerAttackSubAnimInstance::_attackMiss' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackHitPlayRate) == 0x000648, "Member 'UBasePlayerAttackSubAnimInstance::_attackHitPlayRate' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackHit) == 0x000650, "Member 'UBasePlayerAttackSubAnimInstance::_attackHit' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackBounceOfWallPlayRate) == 0x000668, "Member 'UBasePlayerAttackSubAnimInstance::_attackBounceOfWallPlayRate' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _attackBounceOfWall) == 0x000670, "Member 'UBasePlayerAttackSubAnimInstance::_attackBounceOfWall' has a wrong offset!");
static_assert(offsetof(UBasePlayerAttackSubAnimInstance, _firstPersonView) == 0x0006A0, "Member 'UBasePlayerAttackSubAnimInstance::_firstPersonView' has a wrong offset!");

// Class DBDAnimation.BaseKillerAnimInstance
// 0x0010 (0x05F0 - 0x05E0)
class UBaseKillerAnimInstance : public UPlayerAnimInstance
{
public:
	class ASlasherPlayer*                         _owningKiller;                                     // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _firstPersonView;                                  // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0xF];                                      // 0x05E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DBD_ForceAnimPOV(const int32 AnimPOV);

	const class ASlasherPlayer* GetOwningKiller() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseKillerAnimInstance">();
	}
	static class UBaseKillerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseKillerAnimInstance>();
	}
};
static_assert(alignof(UBaseKillerAnimInstance) == 0x000010, "Wrong alignment on UBaseKillerAnimInstance");
static_assert(sizeof(UBaseKillerAnimInstance) == 0x0005F0, "Wrong size on UBaseKillerAnimInstance");
static_assert(offsetof(UBaseKillerAnimInstance, _owningKiller) == 0x0005D8, "Member 'UBaseKillerAnimInstance::_owningKiller' has a wrong offset!");
static_assert(offsetof(UBaseKillerAnimInstance, _firstPersonView) == 0x0005E0, "Member 'UBaseKillerAnimInstance::_firstPersonView' has a wrong offset!");

// Class DBDAnimation.SurvivorAimableArmSensor
// 0x0040 (0x0168 - 0x0128)
class USurvivorAimableArmSensor final : public UArmIKSensorComponent
{
public:
	uint8                                         Pad_128[0x18];                                     // 0x0128(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class ACollectable*                           _aimableCollectable;                               // 0x0140(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimableComponent*                      _aimable;                                          // 0x0148(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x18];                                     // 0x0150(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorAimableArmSensor">();
	}
	static class USurvivorAimableArmSensor* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorAimableArmSensor>();
	}
};
static_assert(alignof(USurvivorAimableArmSensor) == 0x000008, "Wrong alignment on USurvivorAimableArmSensor");
static_assert(sizeof(USurvivorAimableArmSensor) == 0x000168, "Wrong size on USurvivorAimableArmSensor");
static_assert(offsetof(USurvivorAimableArmSensor, _aimableCollectable) == 0x000140, "Member 'USurvivorAimableArmSensor::_aimableCollectable' has a wrong offset!");
static_assert(offsetof(USurvivorAimableArmSensor, _aimable) == 0x000148, "Member 'USurvivorAimableArmSensor::_aimable' has a wrong offset!");

// Class DBDAnimation.BaseSurvivorAnimInstance
// 0x0000 (0x05E0 - 0x05E0)
class UBaseSurvivorAnimInstance : public UPlayerAnimInstance
{
public:
	class ACamperPlayer*                          _owningSurvivor;                                   // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	const class ACamperPlayer* GetOwningSurvivor() const;
	bool IsPlayingMontageByName(class FName MontageID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseSurvivorAnimInstance">();
	}
	static class UBaseSurvivorAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSurvivorAnimInstance>();
	}
};
static_assert(alignof(UBaseSurvivorAnimInstance) == 0x000010, "Wrong alignment on UBaseSurvivorAnimInstance");
static_assert(sizeof(UBaseSurvivorAnimInstance) == 0x0005E0, "Wrong size on UBaseSurvivorAnimInstance");
static_assert(offsetof(UBaseSurvivorAnimInstance, _owningSurvivor) == 0x0005D8, "Member 'UBaseSurvivorAnimInstance::_owningSurvivor' has a wrong offset!");

// Class DBDAnimation.BaseMenuAnimInstance
// 0x0010 (0x0390 - 0x0380)
#pragma pack(push, 0x1)
class alignas(0x10) UBaseMenuAnimInstance : public UDBDBaseAnimInstance
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCustomizationChanged(const TArray<class FName>& CustomizationArray);

	EGameFlowStep GetCurrentMenu() const;
	class ADBDMenuPlayer* GetOwningMenuPlayer() const;
	bool IsInArchiveRift() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseMenuAnimInstance">();
	}
	static class UBaseMenuAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMenuAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UBaseMenuAnimInstance) == 0x000010, "Wrong alignment on UBaseMenuAnimInstance");
static_assert(sizeof(UBaseMenuAnimInstance) == 0x000390, "Wrong size on UBaseMenuAnimInstance");

// Class DBDAnimation.DynamicAccessoryAnimInstance
// 0x0010 (0x0360 - 0x0350)
class UDynamicAccessoryAnimInstance : public UAnimInstance
{
public:
	bool                                          _isInMenu;                                         // 0x0350(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInGame;                                         // 0x0351(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInSnapshotTool;                                 // 0x0352(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPoseableHusk;                                   // 0x0353(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USkeletalMeshComponent>  _masterMesh;                                       // 0x0354(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicAccessoryAnimInstance">();
	}
	static class UDynamicAccessoryAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAccessoryAnimInstance>();
	}
};
static_assert(alignof(UDynamicAccessoryAnimInstance) == 0x000010, "Wrong alignment on UDynamicAccessoryAnimInstance");
static_assert(sizeof(UDynamicAccessoryAnimInstance) == 0x000360, "Wrong size on UDynamicAccessoryAnimInstance");
static_assert(offsetof(UDynamicAccessoryAnimInstance, _isInMenu) == 0x000350, "Member 'UDynamicAccessoryAnimInstance::_isInMenu' has a wrong offset!");
static_assert(offsetof(UDynamicAccessoryAnimInstance, _isInGame) == 0x000351, "Member 'UDynamicAccessoryAnimInstance::_isInGame' has a wrong offset!");
static_assert(offsetof(UDynamicAccessoryAnimInstance, _isInSnapshotTool) == 0x000352, "Member 'UDynamicAccessoryAnimInstance::_isInSnapshotTool' has a wrong offset!");
static_assert(offsetof(UDynamicAccessoryAnimInstance, _isPoseableHusk) == 0x000353, "Member 'UDynamicAccessoryAnimInstance::_isPoseableHusk' has a wrong offset!");
static_assert(offsetof(UDynamicAccessoryAnimInstance, _masterMesh) == 0x000354, "Member 'UDynamicAccessoryAnimInstance::_masterMesh' has a wrong offset!");

// Class DBDAnimation.SabotageSurvivorSubAnimInstance
// 0x00C0 (0x06A0 - 0x05E0)
class USabotageSurvivorSubAnimInstance : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_5E0[0x38];                                     // 0x05E0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isSabotaging;                                     // 0x0618(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasSkillCheckFailed;                              // 0x0619(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61A[0x2];                                      // 0x061A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _sabotageTag;                                      // 0x061C(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _minRelevantAnimTimeRemaining;                     // 0x0628(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _asSabotageInTag;                                  // 0x062C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _asSabotageLoopTag;                                // 0x0638(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _asSabotageFailTag;                                // 0x0644(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _asSabotageIn;                                     // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _asSabotageLoop;                                   // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _asSabotageFail;                                   // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _notSabotagingAndNotHasSkillCheckFailed;           // 0x0668(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _sabotageInToSabotageRule;                         // 0x0669(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _sabotageFailToBaseRule;                           // 0x066A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _sabotageFailToSabotageInRule;                     // 0x066B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_66C[0x34];                                     // 0x066C(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SabotageSurvivorSubAnimInstance">();
	}
	static class USabotageSurvivorSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USabotageSurvivorSubAnimInstance>();
	}
};
static_assert(alignof(USabotageSurvivorSubAnimInstance) == 0x000010, "Wrong alignment on USabotageSurvivorSubAnimInstance");
static_assert(sizeof(USabotageSurvivorSubAnimInstance) == 0x0006A0, "Wrong size on USabotageSurvivorSubAnimInstance");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _isSabotaging) == 0x000618, "Member 'USabotageSurvivorSubAnimInstance::_isSabotaging' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _hasSkillCheckFailed) == 0x000619, "Member 'USabotageSurvivorSubAnimInstance::_hasSkillCheckFailed' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _sabotageTag) == 0x00061C, "Member 'USabotageSurvivorSubAnimInstance::_sabotageTag' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _minRelevantAnimTimeRemaining) == 0x000628, "Member 'USabotageSurvivorSubAnimInstance::_minRelevantAnimTimeRemaining' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _asSabotageInTag) == 0x00062C, "Member 'USabotageSurvivorSubAnimInstance::_asSabotageInTag' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _asSabotageLoopTag) == 0x000638, "Member 'USabotageSurvivorSubAnimInstance::_asSabotageLoopTag' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _asSabotageFailTag) == 0x000644, "Member 'USabotageSurvivorSubAnimInstance::_asSabotageFailTag' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _asSabotageIn) == 0x000650, "Member 'USabotageSurvivorSubAnimInstance::_asSabotageIn' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _asSabotageLoop) == 0x000658, "Member 'USabotageSurvivorSubAnimInstance::_asSabotageLoop' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _asSabotageFail) == 0x000660, "Member 'USabotageSurvivorSubAnimInstance::_asSabotageFail' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _notSabotagingAndNotHasSkillCheckFailed) == 0x000668, "Member 'USabotageSurvivorSubAnimInstance::_notSabotagingAndNotHasSkillCheckFailed' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _sabotageInToSabotageRule) == 0x000669, "Member 'USabotageSurvivorSubAnimInstance::_sabotageInToSabotageRule' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _sabotageFailToBaseRule) == 0x00066A, "Member 'USabotageSurvivorSubAnimInstance::_sabotageFailToBaseRule' has a wrong offset!");
static_assert(offsetof(USabotageSurvivorSubAnimInstance, _sabotageFailToSabotageInRule) == 0x00066B, "Member 'USabotageSurvivorSubAnimInstance::_sabotageFailToSabotageInRule' has a wrong offset!");

// Class DBDAnimation.BaseKillerAttackSubAnimInstance
// 0x0000 (0x06B0 - 0x06B0)
class UBaseKillerAttackSubAnimInstance : public UBasePlayerAttackSubAnimInstance
{
public:
	class ASlasherPlayer*                         _owningKiller;                                     // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	const class ASlasherPlayer* GetOwningKiller() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseKillerAttackSubAnimInstance">();
	}
	static class UBaseKillerAttackSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseKillerAttackSubAnimInstance>();
	}
};
static_assert(alignof(UBaseKillerAttackSubAnimInstance) == 0x000010, "Wrong alignment on UBaseKillerAttackSubAnimInstance");
static_assert(sizeof(UBaseKillerAttackSubAnimInstance) == 0x0006B0, "Wrong size on UBaseKillerAttackSubAnimInstance");
static_assert(offsetof(UBaseKillerAttackSubAnimInstance, _owningKiller) == 0x0006A8, "Member 'UBaseKillerAttackSubAnimInstance::_owningKiller' has a wrong offset!");

// Class DBDAnimation.KillerSpecificSurvivorAnimationPicker
// 0x0018 (0x00C0 - 0x00A8)
class UKillerSpecificSurvivorAnimationPicker final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              _killerSpecificAnimInstanceClass;                  // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             _killerSpecificSurvivorAnimationDB;                // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerSpecificSurvivorAnimationPicker">();
	}
	static class UKillerSpecificSurvivorAnimationPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerSpecificSurvivorAnimationPicker>();
	}
};
static_assert(alignof(UKillerSpecificSurvivorAnimationPicker) == 0x000008, "Wrong alignment on UKillerSpecificSurvivorAnimationPicker");
static_assert(sizeof(UKillerSpecificSurvivorAnimationPicker) == 0x0000C0, "Wrong size on UKillerSpecificSurvivorAnimationPicker");
static_assert(offsetof(UKillerSpecificSurvivorAnimationPicker, _killerSpecificAnimInstanceClass) == 0x0000B0, "Member 'UKillerSpecificSurvivorAnimationPicker::_killerSpecificAnimInstanceClass' has a wrong offset!");
static_assert(offsetof(UKillerSpecificSurvivorAnimationPicker, _killerSpecificSurvivorAnimationDB) == 0x0000B8, "Member 'UKillerSpecificSurvivorAnimationPicker::_killerSpecificSurvivorAnimationDB' has a wrong offset!");

// Class DBDAnimation.KillerAnimInstance
// 0x0130 (0x0720 - 0x05F0)
class UKillerAnimInstance : public UBaseKillerAnimInstance
{
public:
	struct FVector                                _leftHandIKLocationFPV;                            // 0x05F0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _rightHandIKLocationFPV;                           // 0x0608(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAnyMontagePlaying;                              // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCarrying;                                       // 0x0621(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_622[0x6];                                      // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _firstPersonCarryOffset;                           // 0x0628(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _firstPersonCarryOffsetLookingDown;                // 0x0640(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInAir;                                          // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSpectator;                                      // 0x0659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x065A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65B[0x1];                                      // 0x065B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _animDirection;                                    // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animSpeed;                                        // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animPitch;                                        // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animYaw;                                          // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _pelvisHeight;                                     // 0x066C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _idleTime;                                         // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _directionSwitch;                                  // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttacking;                                      // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPlayingAnyMontage;                              // 0x0679(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isKilling;                                        // 0x067A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_67B[0x1];                                      // 0x067B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _minAnimPitchAngle;                                // 0x067C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _maxAnimPitchAngle;                                // 0x0680(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _leftClearFrontSpaceVector;                        // 0x0688(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _rightClearFrontSpaceVector;                       // 0x06A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _velocity;                                         // 0x06B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _rightFootEffectorLocation;                        // 0x06D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                _leftFootEffectorLocation;                         // 0x06E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionAnimation                         _interactionType;                                  // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArmIKSensorComponent*                  _armIKSensorComponent;                             // 0x0708(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttackSubstate                               _attackState;                                      // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_711[0x3];                                      // 0x0711(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _forwardVelocity;                                  // 0x0714(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _lateralVelocity;                                  // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetWeaponCustomizationId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerAnimInstance">();
	}
	static class UKillerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerAnimInstance>();
	}
};
static_assert(alignof(UKillerAnimInstance) == 0x000010, "Wrong alignment on UKillerAnimInstance");
static_assert(sizeof(UKillerAnimInstance) == 0x000720, "Wrong size on UKillerAnimInstance");
static_assert(offsetof(UKillerAnimInstance, _leftHandIKLocationFPV) == 0x0005F0, "Member 'UKillerAnimInstance::_leftHandIKLocationFPV' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _rightHandIKLocationFPV) == 0x000608, "Member 'UKillerAnimInstance::_rightHandIKLocationFPV' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isAnyMontagePlaying) == 0x000620, "Member 'UKillerAnimInstance::_isAnyMontagePlaying' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isCarrying) == 0x000621, "Member 'UKillerAnimInstance::_isCarrying' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _firstPersonCarryOffset) == 0x000628, "Member 'UKillerAnimInstance::_firstPersonCarryOffset' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _firstPersonCarryOffsetLookingDown) == 0x000640, "Member 'UKillerAnimInstance::_firstPersonCarryOffsetLookingDown' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isInAir) == 0x000658, "Member 'UKillerAnimInstance::_isInAir' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isSpectator) == 0x000659, "Member 'UKillerAnimInstance::_isSpectator' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isIdle) == 0x00065A, "Member 'UKillerAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _animDirection) == 0x00065C, "Member 'UKillerAnimInstance::_animDirection' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _animSpeed) == 0x000660, "Member 'UKillerAnimInstance::_animSpeed' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _animPitch) == 0x000664, "Member 'UKillerAnimInstance::_animPitch' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _animYaw) == 0x000668, "Member 'UKillerAnimInstance::_animYaw' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _pelvisHeight) == 0x00066C, "Member 'UKillerAnimInstance::_pelvisHeight' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _idleTime) == 0x000670, "Member 'UKillerAnimInstance::_idleTime' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _directionSwitch) == 0x000674, "Member 'UKillerAnimInstance::_directionSwitch' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isAttacking) == 0x000678, "Member 'UKillerAnimInstance::_isAttacking' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isPlayingAnyMontage) == 0x000679, "Member 'UKillerAnimInstance::_isPlayingAnyMontage' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _isKilling) == 0x00067A, "Member 'UKillerAnimInstance::_isKilling' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _minAnimPitchAngle) == 0x00067C, "Member 'UKillerAnimInstance::_minAnimPitchAngle' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _maxAnimPitchAngle) == 0x000680, "Member 'UKillerAnimInstance::_maxAnimPitchAngle' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _leftClearFrontSpaceVector) == 0x000688, "Member 'UKillerAnimInstance::_leftClearFrontSpaceVector' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _rightClearFrontSpaceVector) == 0x0006A0, "Member 'UKillerAnimInstance::_rightClearFrontSpaceVector' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _velocity) == 0x0006B8, "Member 'UKillerAnimInstance::_velocity' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _rightFootEffectorLocation) == 0x0006D0, "Member 'UKillerAnimInstance::_rightFootEffectorLocation' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _leftFootEffectorLocation) == 0x0006E8, "Member 'UKillerAnimInstance::_leftFootEffectorLocation' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _interactionType) == 0x000700, "Member 'UKillerAnimInstance::_interactionType' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _armIKSensorComponent) == 0x000708, "Member 'UKillerAnimInstance::_armIKSensorComponent' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _attackState) == 0x000710, "Member 'UKillerAnimInstance::_attackState' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _forwardVelocity) == 0x000714, "Member 'UKillerAnimInstance::_forwardVelocity' has a wrong offset!");
static_assert(offsetof(UKillerAnimInstance, _lateralVelocity) == 0x000718, "Member 'UKillerAnimInstance::_lateralVelocity' has a wrong offset!");

// Class DBDAnimation.ClosetIdleSurvivorSubAnimInstance
// 0x0020 (0x0600 - 0x05E0)
class UClosetIdleSurvivorSubAnimInstance : public UBaseSurvivorAnimInstance
{
public:
	EInteractionAnimation                         _interactionType;                                  // 0x05E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInsideCloset;                                   // 0x05E1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E2[0x2];                                      // 0x05E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _asClosetIdleTag;                                  // 0x05E4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _asClosetIdle;                                     // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _closetIdleToBaseRule;                             // 0x05F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClosetIdleSurvivorSubAnimInstance">();
	}
	static class UClosetIdleSurvivorSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClosetIdleSurvivorSubAnimInstance>();
	}
};
static_assert(alignof(UClosetIdleSurvivorSubAnimInstance) == 0x000010, "Wrong alignment on UClosetIdleSurvivorSubAnimInstance");
static_assert(sizeof(UClosetIdleSurvivorSubAnimInstance) == 0x000600, "Wrong size on UClosetIdleSurvivorSubAnimInstance");
static_assert(offsetof(UClosetIdleSurvivorSubAnimInstance, _interactionType) == 0x0005E0, "Member 'UClosetIdleSurvivorSubAnimInstance::_interactionType' has a wrong offset!");
static_assert(offsetof(UClosetIdleSurvivorSubAnimInstance, _isInsideCloset) == 0x0005E1, "Member 'UClosetIdleSurvivorSubAnimInstance::_isInsideCloset' has a wrong offset!");
static_assert(offsetof(UClosetIdleSurvivorSubAnimInstance, _asClosetIdleTag) == 0x0005E4, "Member 'UClosetIdleSurvivorSubAnimInstance::_asClosetIdleTag' has a wrong offset!");
static_assert(offsetof(UClosetIdleSurvivorSubAnimInstance, _asClosetIdle) == 0x0005F0, "Member 'UClosetIdleSurvivorSubAnimInstance::_asClosetIdle' has a wrong offset!");
static_assert(offsetof(UClosetIdleSurvivorSubAnimInstance, _closetIdleToBaseRule) == 0x0005F8, "Member 'UClosetIdleSurvivorSubAnimInstance::_closetIdleToBaseRule' has a wrong offset!");

// Class DBDAnimation.KillerAttackSubAnimInstance
// 0x0010 (0x06C0 - 0x06B0)
#pragma pack(push, 0x1)
class alignas(0x10) UKillerAttackSubAnimInstance : public UBaseKillerAttackSubAnimInstance
{
public:
	bool                                          _isCarrying;                                       // 0x06B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActive;                                         // 0x06B1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B2[0x6];                                      // 0x06B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerAttackSubAnimInstance">();
	}
	static class UKillerAttackSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerAttackSubAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UKillerAttackSubAnimInstance) == 0x000010, "Wrong alignment on UKillerAttackSubAnimInstance");
static_assert(sizeof(UKillerAttackSubAnimInstance) == 0x0006C0, "Wrong size on UKillerAttackSubAnimInstance");
static_assert(offsetof(UKillerAttackSubAnimInstance, _isCarrying) == 0x0006B0, "Member 'UKillerAttackSubAnimInstance::_isCarrying' has a wrong offset!");
static_assert(offsetof(UKillerAttackSubAnimInstance, _isActive) == 0x0006B1, "Member 'UKillerAttackSubAnimInstance::_isActive' has a wrong offset!");

// Class DBDAnimation.ArmIKSurvivorSubAnimInstance
// 0x00A0 (0x0680 - 0x05E0)
class UArmIKSurvivorSubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	struct FRotator                               _rightWristUpRotation;                             // 0x05E0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               _leftWristUpRotation;                              // 0x05F8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFloatRange                            _localWristYawRange;                               // 0x0610(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFloatRange                            _localWristPitchRange;                             // 0x0620(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _armInterpolationSpeed;                            // 0x0630(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _handInterpolationSpeed;                           // 0x0634(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _alphaLerpTime;                                    // 0x0638(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reachPadding;                                     // 0x063C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _rightArmIKAlpha;                                  // 0x0640(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _leftArmIKAlpha;                                   // 0x0644(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EArmIkMode                                    _armIkMode;                                        // 0x0648(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArmDetectionFanComponent*              _rightDetectionFan;                                // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArmDetectionFanComponent*              _leftDetectionFan;                                 // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
