#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function DBDAttack.PounceAttackOpenSubstateCosmetic.OnLocallyObservedChanged
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_OnLocallyObservedChanged::Killer' has a wrong offset!");

// Function DBDAttack.PounceAttackOpenSubstateCosmetic.OnLocallyObservedChangedCosmetic
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_OnLocallyObservedChangedCosmetic::Killer' has a wrong offset!");

// Function DBDAttack.PounceAttackOpenSubstateCosmetic.OnLungeAttackEndCosmetic
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_OnLungeAttackEndCosmetic::Killer' has a wrong offset!");

// Function DBDAttack.PounceAttackOpenSubstateCosmetic.OnLungeAttackStartCosmetic
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_OnLungeAttackStartCosmetic::Killer' has a wrong offset!");

// Function DBDAttack.PounceAttackOpenSubstateCosmetic.IsLungeAttackAugmented
// 0x0010 (0x0010 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented) == 0x000010, "Wrong size on PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented::Killer' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented, ReturnValue) == 0x000008, "Member 'PounceAttackOpenSubstateCosmetic_IsLungeAttackAugmented::ReturnValue' has a wrong offset!");

}

