#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDBots

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DBDBots_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDBots.AIPathValidatorInterface
// 0x0000 (0x0030 - 0x0030)
class IAIPathValidatorInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIPathValidatorInterface">();
	}
	static class IAIPathValidatorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAIPathValidatorInterface>();
	}
};
static_assert(alignof(IAIPathValidatorInterface) == 0x000008, "Wrong alignment on IAIPathValidatorInterface");
static_assert(sizeof(IAIPathValidatorInterface) == 0x000030, "Wrong size on IAIPathValidatorInterface");

// Class DBDBots.AISkill
// 0x00E8 (0x0118 - 0x0030)
class UAISkill : public UObject
{
public:
	struct FGameplayTagContainer                  RunContexts;                                       // 0x0030(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          StopIfPausedByNavLinkProxy;                        // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RunTimeLimit;                                      // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunCooldownTime;                                   // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunCooldownTimeDeviation;                          // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>     SkillNavigationFilterClass;                        // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAISenseConfig*>                 SkillSenseConfigs;                                 // 0x0068(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FKillerFilterItem>              KillerFilter;                                      // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBehaviorTree>           DynamicSubtree;                                    // 0x0088(0x0038)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAdditionalDynamicSubtree>      AdditionalDynamicSubtrees;                         // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FAISkillContextWeights>         ContextWeights;                                    // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        _pausedByObjects;                                  // 0x00E0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDAIBTController*                     _aiControllerOwner;                                // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill">();
	}
	static class UAISkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill>();
	}
};
static_assert(alignof(UAISkill) == 0x000008, "Wrong alignment on UAISkill");
static_assert(sizeof(UAISkill) == 0x000118, "Wrong size on UAISkill");
static_assert(offsetof(UAISkill, RunContexts) == 0x000030, "Member 'UAISkill::RunContexts' has a wrong offset!");
static_assert(offsetof(UAISkill, StopIfPausedByNavLinkProxy) == 0x000050, "Member 'UAISkill::StopIfPausedByNavLinkProxy' has a wrong offset!");
static_assert(offsetof(UAISkill, RunTimeLimit) == 0x000054, "Member 'UAISkill::RunTimeLimit' has a wrong offset!");
static_assert(offsetof(UAISkill, RunCooldownTime) == 0x000058, "Member 'UAISkill::RunCooldownTime' has a wrong offset!");
static_assert(offsetof(UAISkill, RunCooldownTimeDeviation) == 0x00005C, "Member 'UAISkill::RunCooldownTimeDeviation' has a wrong offset!");
static_assert(offsetof(UAISkill, SkillNavigationFilterClass) == 0x000060, "Member 'UAISkill::SkillNavigationFilterClass' has a wrong offset!");
static_assert(offsetof(UAISkill, SkillSenseConfigs) == 0x000068, "Member 'UAISkill::SkillSenseConfigs' has a wrong offset!");
static_assert(offsetof(UAISkill, KillerFilter) == 0x000078, "Member 'UAISkill::KillerFilter' has a wrong offset!");
static_assert(offsetof(UAISkill, DynamicSubtree) == 0x000088, "Member 'UAISkill::DynamicSubtree' has a wrong offset!");
static_assert(offsetof(UAISkill, AdditionalDynamicSubtrees) == 0x0000C0, "Member 'UAISkill::AdditionalDynamicSubtrees' has a wrong offset!");
static_assert(offsetof(UAISkill, ContextWeights) == 0x0000D0, "Member 'UAISkill::ContextWeights' has a wrong offset!");
static_assert(offsetof(UAISkill, _pausedByObjects) == 0x0000E0, "Member 'UAISkill::_pausedByObjects' has a wrong offset!");
static_assert(offsetof(UAISkill, _aiControllerOwner) == 0x000110, "Member 'UAISkill::_aiControllerOwner' has a wrong offset!");

// Class DBDBots.AISkill_Interaction
// 0x0168 (0x0280 - 0x0118)
class UAISkill_Interaction : public UAISkill
{
public:
	EPawnInputPressTypes                          InputType;                                         // 0x0118(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionSkillInputModes                   InputMode;                                         // 0x0119(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPawnInputPressTypes                          CancelInputType;                                   // 0x011A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionCancelInputModes                  CancelInputMode;                                   // 0x011B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoLockInput;                                     // 0x011C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIRoll                                StartRoll;                                         // 0x0120(0x00C8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 StartInteractionID;                                // 0x01E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalStartInteractionIDs;                     // 0x01F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 StopInteractionID;                                 // 0x0208(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinHoldInputTime;                                  // 0x0218(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoReleaseHoldInputWhenCharged;                   // 0x021C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21D[0x63];                                     // 0x021D(0x0063)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction">();
	}
	static class UAISkill_Interaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction>();
	}
};
static_assert(alignof(UAISkill_Interaction) == 0x000008, "Wrong alignment on UAISkill_Interaction");
static_assert(sizeof(UAISkill_Interaction) == 0x000280, "Wrong size on UAISkill_Interaction");
static_assert(offsetof(UAISkill_Interaction, InputType) == 0x000118, "Member 'UAISkill_Interaction::InputType' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, InputMode) == 0x000119, "Member 'UAISkill_Interaction::InputMode' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, CancelInputType) == 0x00011A, "Member 'UAISkill_Interaction::CancelInputType' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, CancelInputMode) == 0x00011B, "Member 'UAISkill_Interaction::CancelInputMode' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, AutoLockInput) == 0x00011C, "Member 'UAISkill_Interaction::AutoLockInput' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, StartRoll) == 0x000120, "Member 'UAISkill_Interaction::StartRoll' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, StartInteractionID) == 0x0001E8, "Member 'UAISkill_Interaction::StartInteractionID' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, AdditionalStartInteractionIDs) == 0x0001F8, "Member 'UAISkill_Interaction::AdditionalStartInteractionIDs' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, StopInteractionID) == 0x000208, "Member 'UAISkill_Interaction::StopInteractionID' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, MinHoldInputTime) == 0x000218, "Member 'UAISkill_Interaction::MinHoldInputTime' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction, AutoReleaseHoldInputWhenCharged) == 0x00021C, "Member 'UAISkill_Interaction::AutoReleaseHoldInputWhenCharged' has a wrong offset!");

// Class DBDBots.AISkill_InteractionUseItem
// 0x0010 (0x0290 - 0x0280)
class UAISkill_InteractionUseItem : public UAISkill_Interaction
{
public:
	ELoadoutItemType                              ItemType;                                          // 0x0280(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ACollectable>               ItemClass;                                         // 0x0288(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem">();
	}
	static class UAISkill_InteractionUseItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem");
static_assert(sizeof(UAISkill_InteractionUseItem) == 0x000290, "Wrong size on UAISkill_InteractionUseItem");
static_assert(offsetof(UAISkill_InteractionUseItem, ItemType) == 0x000280, "Member 'UAISkill_InteractionUseItem::ItemType' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionUseItem, ItemClass) == 0x000288, "Member 'UAISkill_InteractionUseItem::ItemClass' has a wrong offset!");

// Class DBDBots.AISkill_Find
// 0x01D8 (0x02F0 - 0x0118)
class UAISkill_Find : public UAISkill
{
public:
	TSoftClassPtr<class UClass>                   FindClass;                                         // 0x0118(0x0038)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BlackboardWishListTag;                             // 0x0150(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SearchInterval;                                    // 0x015C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MustBeSeen;                                        // 0x0160(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RejectIfWasInCooldownAndFocusedOnAnotherObject;    // 0x0161(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreMindFocusCooldown;                           // 0x0162(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AbandonIfInChase;                                  // 0x0163(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RejectIfInPressureZone;                            // 0x0164(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RejectIfNotFocusedBySelf;                          // 0x0165(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RejectIfInteractableFocusedByOther;                // 0x0166(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsesActorLocation;                                 // 0x0167(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ActorLocationOffset;                               // 0x0168(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    GoalBasicWeight;                                   // 0x0180(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    GoalWeightMaxDistance;                             // 0x01E0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    GoalWeightAtMinDistance;                           // 0x0240(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         SearchHeightAmplifier;                             // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SearchHeightAmplifierActivationHeight;             // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUnsafeAction;                                    // 0x02A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UnsafeInteractionID;                               // 0x02B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UnsafeActionUsesItemAddons;                        // 0x02C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UnsafeActionIsSelfInteraction;                     // 0x02C1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UnsafeActionRange;                                 // 0x02C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        _currentWishedObjects;                             // 0x02C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x18];                                     // 0x02D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Find">();
	}
	static class UAISkill_Find* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Find>();
	}
};
static_assert(alignof(UAISkill_Find) == 0x000008, "Wrong alignment on UAISkill_Find");
static_assert(sizeof(UAISkill_Find) == 0x0002F0, "Wrong size on UAISkill_Find");
static_assert(offsetof(UAISkill_Find, FindClass) == 0x000118, "Member 'UAISkill_Find::FindClass' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, BlackboardWishListTag) == 0x000150, "Member 'UAISkill_Find::BlackboardWishListTag' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, SearchInterval) == 0x00015C, "Member 'UAISkill_Find::SearchInterval' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, MustBeSeen) == 0x000160, "Member 'UAISkill_Find::MustBeSeen' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, RejectIfWasInCooldownAndFocusedOnAnotherObject) == 0x000161, "Member 'UAISkill_Find::RejectIfWasInCooldownAndFocusedOnAnotherObject' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, IgnoreMindFocusCooldown) == 0x000162, "Member 'UAISkill_Find::IgnoreMindFocusCooldown' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, AbandonIfInChase) == 0x000163, "Member 'UAISkill_Find::AbandonIfInChase' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, RejectIfInPressureZone) == 0x000164, "Member 'UAISkill_Find::RejectIfInPressureZone' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, RejectIfNotFocusedBySelf) == 0x000165, "Member 'UAISkill_Find::RejectIfNotFocusedBySelf' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, RejectIfInteractableFocusedByOther) == 0x000166, "Member 'UAISkill_Find::RejectIfInteractableFocusedByOther' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, UsesActorLocation) == 0x000167, "Member 'UAISkill_Find::UsesActorLocation' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, ActorLocationOffset) == 0x000168, "Member 'UAISkill_Find::ActorLocationOffset' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, GoalBasicWeight) == 0x000180, "Member 'UAISkill_Find::GoalBasicWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, GoalWeightMaxDistance) == 0x0001E0, "Member 'UAISkill_Find::GoalWeightMaxDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, GoalWeightAtMinDistance) == 0x000240, "Member 'UAISkill_Find::GoalWeightAtMinDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, SearchHeightAmplifier) == 0x0002A0, "Member 'UAISkill_Find::SearchHeightAmplifier' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, SearchHeightAmplifierActivationHeight) == 0x0002A4, "Member 'UAISkill_Find::SearchHeightAmplifierActivationHeight' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, IsUnsafeAction) == 0x0002A8, "Member 'UAISkill_Find::IsUnsafeAction' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, UnsafeInteractionID) == 0x0002B0, "Member 'UAISkill_Find::UnsafeInteractionID' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, UnsafeActionUsesItemAddons) == 0x0002C0, "Member 'UAISkill_Find::UnsafeActionUsesItemAddons' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, UnsafeActionIsSelfInteraction) == 0x0002C1, "Member 'UAISkill_Find::UnsafeActionIsSelfInteraction' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, UnsafeActionRange) == 0x0002C4, "Member 'UAISkill_Find::UnsafeActionRange' has a wrong offset!");
static_assert(offsetof(UAISkill_Find, _currentWishedObjects) == 0x0002C8, "Member 'UAISkill_Find::_currentWishedObjects' has a wrong offset!");

// Class DBDBots.AISkill_FindInteractable
// 0x0018 (0x0308 - 0x02F0)
class UAISkill_FindInteractable : public UAISkill_Find
{
public:
	class FString                                 RequiredInteractionId;                             // 0x02F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputInteractionType                         RequiredInteractionInputType;                      // 0x0300(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable">();
	}
	static class UAISkill_FindInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable>();
	}
};
static_assert(alignof(UAISkill_FindInteractable) == 0x000008, "Wrong alignment on UAISkill_FindInteractable");
static_assert(sizeof(UAISkill_FindInteractable) == 0x000308, "Wrong size on UAISkill_FindInteractable");
static_assert(offsetof(UAISkill_FindInteractable, RequiredInteractionId) == 0x0002F0, "Member 'UAISkill_FindInteractable::RequiredInteractionId' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable, RequiredInteractionInputType) == 0x000300, "Member 'UAISkill_FindInteractable::RequiredInteractionInputType' has a wrong offset!");

// Class DBDBots.AISkill_FindCollectable
// 0x0070 (0x0378 - 0x0308)
class UAISkill_FindCollectable : public UAISkill_FindInteractable
{
public:
	float                                         CollectUnderItemRatio;                             // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollectOverItemChargeRatio;                        // 0x030C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    GoalItemCountBonusWeight;                          // 0x0310(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          ItemMustHaveNormalPickupFlow;                      // 0x0370(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable">();
	}
	static class UAISkill_FindCollectable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable>();
	}
};
static_assert(alignof(UAISkill_FindCollectable) == 0x000008, "Wrong alignment on UAISkill_FindCollectable");
static_assert(sizeof(UAISkill_FindCollectable) == 0x000378, "Wrong size on UAISkill_FindCollectable");
static_assert(offsetof(UAISkill_FindCollectable, CollectUnderItemRatio) == 0x000308, "Member 'UAISkill_FindCollectable::CollectUnderItemRatio' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable, CollectOverItemChargeRatio) == 0x00030C, "Member 'UAISkill_FindCollectable::CollectOverItemChargeRatio' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable, GoalItemCountBonusWeight) == 0x000310, "Member 'UAISkill_FindCollectable::GoalItemCountBonusWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable, ItemMustHaveNormalPickupFlow) == 0x000370, "Member 'UAISkill_FindCollectable::ItemMustHaveNormalPickupFlow' has a wrong offset!");

// Class DBDBots.AISkill_FindCollectable_Hatchet
// 0x0000 (0x0378 - 0x0378)
class UAISkill_FindCollectable_Hatchet final : public UAISkill_FindCollectable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_Hatchet">();
	}
	static class UAISkill_FindCollectable_Hatchet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_Hatchet>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_Hatchet) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_Hatchet");
static_assert(sizeof(UAISkill_FindCollectable_Hatchet) == 0x000378, "Wrong size on UAISkill_FindCollectable_Hatchet");

// Class DBDBots.AISkill_Interaction_QuietMode
// 0x0000 (0x0280 - 0x0280)
class UAISkill_Interaction_QuietMode final : public UAISkill_Interaction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_QuietMode">();
	}
	static class UAISkill_Interaction_QuietMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_QuietMode>();
	}
};
static_assert(alignof(UAISkill_Interaction_QuietMode) == 0x000008, "Wrong alignment on UAISkill_Interaction_QuietMode");
static_assert(sizeof(UAISkill_Interaction_QuietMode) == 0x000280, "Wrong size on UAISkill_Interaction_QuietMode");

// Class DBDBots.AISkill_CharacterClass
// 0x0000 (0x0118 - 0x0118)
class UAISkill_CharacterClass final : public UAISkill
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_CharacterClass">();
	}
	static class UAISkill_CharacterClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_CharacterClass>();
	}
};
static_assert(alignof(UAISkill_CharacterClass) == 0x000008, "Wrong alignment on UAISkill_CharacterClass");
static_assert(sizeof(UAISkill_CharacterClass) == 0x000118, "Wrong size on UAISkill_CharacterClass");

// Class DBDBots.AISkill_BuiltToLast
// 0x0030 (0x0148 - 0x0118)
class UAISkill_BuiltToLast final : public UAISkill
{
public:
	struct FDataTableDropdown                     PerkId;                                            // 0x0118(0x0030)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_BuiltToLast">();
	}
	static class UAISkill_BuiltToLast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_BuiltToLast>();
	}
};
static_assert(alignof(UAISkill_BuiltToLast) == 0x000008, "Wrong alignment on UAISkill_BuiltToLast");
static_assert(sizeof(UAISkill_BuiltToLast) == 0x000148, "Wrong size on UAISkill_BuiltToLast");
static_assert(offsetof(UAISkill_BuiltToLast, PerkId) == 0x000118, "Member 'UAISkill_BuiltToLast::PerkId' has a wrong offset!");

// Class DBDBots.BTDecorator_TickableBase
// 0x0000 (0x0070 - 0x0070)
class UBTDecorator_TickableBase : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_TickableBase">();
	}
	static class UBTDecorator_TickableBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_TickableBase>();
	}
};
static_assert(alignof(UBTDecorator_TickableBase) == 0x000008, "Wrong alignment on UBTDecorator_TickableBase");
static_assert(sizeof(UBTDecorator_TickableBase) == 0x000070, "Wrong size on UBTDecorator_TickableBase");

// Class DBDBots.BTDecorator_RandomByDistance
// 0x0220 (0x0290 - 0x0070)
class UBTDecorator_RandomByDistance final : public UBTDecorator_TickableBase
{
public:
	struct FBlackboardKeySelector                 BBAroundLoc;                                       // 0x0070(0x0030)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 BBRelativeFromTime;                                // 0x00A0(0x0030)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 BBRelativeToTime;                                  // 0x00D0(0x0030)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    StartDistance;                                     // 0x0100(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    EndDistance;                                       // 0x0160(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    PercentageAtStartDistance;                         // 0x01C0(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    PercentageAtEndDistance;                           // 0x0220(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	TArray<struct FAIRandomByDistancePercentagesAtTime> PercentagesAtTimes;                                // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_RandomByDistance">();
	}
	static class UBTDecorator_RandomByDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_RandomByDistance>();
	}
};
static_assert(alignof(UBTDecorator_RandomByDistance) == 0x000008, "Wrong alignment on UBTDecorator_RandomByDistance");
static_assert(sizeof(UBTDecorator_RandomByDistance) == 0x000290, "Wrong size on UBTDecorator_RandomByDistance");
static_assert(offsetof(UBTDecorator_RandomByDistance, BBAroundLoc) == 0x000070, "Member 'UBTDecorator_RandomByDistance::BBAroundLoc' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, BBRelativeFromTime) == 0x0000A0, "Member 'UBTDecorator_RandomByDistance::BBRelativeFromTime' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, BBRelativeToTime) == 0x0000D0, "Member 'UBTDecorator_RandomByDistance::BBRelativeToTime' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, StartDistance) == 0x000100, "Member 'UBTDecorator_RandomByDistance::StartDistance' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, EndDistance) == 0x000160, "Member 'UBTDecorator_RandomByDistance::EndDistance' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, PercentageAtStartDistance) == 0x0001C0, "Member 'UBTDecorator_RandomByDistance::PercentageAtStartDistance' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, PercentageAtEndDistance) == 0x000220, "Member 'UBTDecorator_RandomByDistance::PercentageAtEndDistance' has a wrong offset!");
static_assert(offsetof(UBTDecorator_RandomByDistance, PercentagesAtTimes) == 0x000280, "Member 'UBTDecorator_RandomByDistance::PercentagesAtTimes' has a wrong offset!");

// Class DBDBots.AISkill_FindInteractable_K32ItemBox
// 0x0058 (0x0360 - 0x0308)
class UAISkill_FindInteractable_K32ItemBox final : public UAISkill_FindInteractable
{
public:
	class FName                                   BBK32EmpTargetActor;                               // 0x0308(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BBOriginalFocusedActor;                            // 0x0314(0x000C)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             GoalClassesToGiveAdditionalWeight;                 // 0x0320(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         EmpTargetNearGoalWeight;                           // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearEmpBoxGoalWeight;                              // 0x0334(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearEmpBoxDistance;                                // 0x0338(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         K32EmpMaxCount;                                    // 0x033C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K32ItemBoxChargeWeightRatio;                       // 0x0340(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_344[0x1C];                                     // 0x0344(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_K32ItemBox">();
	}
	static class UAISkill_FindInteractable_K32ItemBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_K32ItemBox>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_K32ItemBox) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_K32ItemBox");
static_assert(sizeof(UAISkill_FindInteractable_K32ItemBox) == 0x000360, "Wrong size on UAISkill_FindInteractable_K32ItemBox");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, BBK32EmpTargetActor) == 0x000308, "Member 'UAISkill_FindInteractable_K32ItemBox::BBK32EmpTargetActor' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, BBOriginalFocusedActor) == 0x000314, "Member 'UAISkill_FindInteractable_K32ItemBox::BBOriginalFocusedActor' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, GoalClassesToGiveAdditionalWeight) == 0x000320, "Member 'UAISkill_FindInteractable_K32ItemBox::GoalClassesToGiveAdditionalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, EmpTargetNearGoalWeight) == 0x000330, "Member 'UAISkill_FindInteractable_K32ItemBox::EmpTargetNearGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, NearEmpBoxGoalWeight) == 0x000334, "Member 'UAISkill_FindInteractable_K32ItemBox::NearEmpBoxGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, NearEmpBoxDistance) == 0x000338, "Member 'UAISkill_FindInteractable_K32ItemBox::NearEmpBoxDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, K32EmpMaxCount) == 0x00033C, "Member 'UAISkill_FindInteractable_K32ItemBox::K32EmpMaxCount' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K32ItemBox, K32ItemBoxChargeWeightRatio) == 0x000340, "Member 'UAISkill_FindInteractable_K32ItemBox::K32ItemBoxChargeWeightRatio' has a wrong offset!");

// Class DBDBots.AISkill_FindInteractable_Invitation
// 0x0000 (0x0308 - 0x0308)
class UAISkill_FindInteractable_Invitation final : public UAISkill_FindInteractable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_Invitation">();
	}
	static class UAISkill_FindInteractable_Invitation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_Invitation>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_Invitation) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_Invitation");
static_assert(sizeof(UAISkill_FindInteractable_Invitation) == 0x000308, "Wrong size on UAISkill_FindInteractable_Invitation");

// Class DBDBots.AISkill_FindCollectable_Camper
// 0x0190 (0x0508 - 0x0378)
class UAISkill_FindCollectable_Camper : public UAISkill_FindCollectable
{
public:
	float                                         CollectUnderItemWeight;                            // 0x0378(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollectOverWeightRatioDifference;                  // 0x037C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    WantToKeepEmptyItemPenalty;                        // 0x0380(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    CloseItemDistThreshold;                            // 0x03E0(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    CloseItemWeightMultiplier;                         // 0x0440(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    ItemGoalWeightMultiplier;                          // 0x04A0(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	float                                         EmptyItemChargeThreshold;                          // 0x0500(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_Camper">();
	}
	static class UAISkill_FindCollectable_Camper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_Camper>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_Camper) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_Camper");
static_assert(sizeof(UAISkill_FindCollectable_Camper) == 0x000508, "Wrong size on UAISkill_FindCollectable_Camper");
static_assert(offsetof(UAISkill_FindCollectable_Camper, CollectUnderItemWeight) == 0x000378, "Member 'UAISkill_FindCollectable_Camper::CollectUnderItemWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_Camper, CollectOverWeightRatioDifference) == 0x00037C, "Member 'UAISkill_FindCollectable_Camper::CollectOverWeightRatioDifference' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_Camper, WantToKeepEmptyItemPenalty) == 0x000380, "Member 'UAISkill_FindCollectable_Camper::WantToKeepEmptyItemPenalty' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_Camper, CloseItemDistThreshold) == 0x0003E0, "Member 'UAISkill_FindCollectable_Camper::CloseItemDistThreshold' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_Camper, CloseItemWeightMultiplier) == 0x000440, "Member 'UAISkill_FindCollectable_Camper::CloseItemWeightMultiplier' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_Camper, ItemGoalWeightMultiplier) == 0x0004A0, "Member 'UAISkill_FindCollectable_Camper::ItemGoalWeightMultiplier' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_Camper, EmptyItemChargeThreshold) == 0x000500, "Member 'UAISkill_FindCollectable_Camper::EmptyItemChargeThreshold' has a wrong offset!");

// Class DBDBots.BTDecorator_ExtIsAtLocation
// 0x00A0 (0x0110 - 0x0070)
class UBTDecorator_ExtIsAtLocation final : public UBTDecorator_TickableBase
{
public:
	struct FBlackboardKeySelector                 BBLoc;                                             // 0x0070(0x0030)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                          UseAlternativeLoc;                                 // 0x00A0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITunableParameter                    AcceptableRadius;                                  // 0x00A8(0x0060)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                          IncludeAgentRadius;                                // 0x0108(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_ExtIsAtLocation">();
	}
	static class UBTDecorator_ExtIsAtLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_ExtIsAtLocation>();
	}
};
static_assert(alignof(UBTDecorator_ExtIsAtLocation) == 0x000008, "Wrong alignment on UBTDecorator_ExtIsAtLocation");
static_assert(sizeof(UBTDecorator_ExtIsAtLocation) == 0x000110, "Wrong size on UBTDecorator_ExtIsAtLocation");
static_assert(offsetof(UBTDecorator_ExtIsAtLocation, BBLoc) == 0x000070, "Member 'UBTDecorator_ExtIsAtLocation::BBLoc' has a wrong offset!");
static_assert(offsetof(UBTDecorator_ExtIsAtLocation, UseAlternativeLoc) == 0x0000A0, "Member 'UBTDecorator_ExtIsAtLocation::UseAlternativeLoc' has a wrong offset!");
static_assert(offsetof(UBTDecorator_ExtIsAtLocation, AcceptableRadius) == 0x0000A8, "Member 'UBTDecorator_ExtIsAtLocation::AcceptableRadius' has a wrong offset!");
static_assert(offsetof(UBTDecorator_ExtIsAtLocation, IncludeAgentRadius) == 0x000108, "Member 'UBTDecorator_ExtIsAtLocation::IncludeAgentRadius' has a wrong offset!");

// Class DBDBots.AISkill_BardicInspiration
// 0x0018 (0x0130 - 0x0118)
class UAISkill_BardicInspiration final : public UAISkill
{
public:
	class FName                                   BBGeneratorLocationKey;                            // 0x0118(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceFromGenerator;                          // 0x0124(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceFromSurvivorDuringSkill;                // 0x0128(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_BardicInspiration">();
	}
	static class UAISkill_BardicInspiration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_BardicInspiration>();
	}
};
static_assert(alignof(UAISkill_BardicInspiration) == 0x000008, "Wrong alignment on UAISkill_BardicInspiration");
static_assert(sizeof(UAISkill_BardicInspiration) == 0x000130, "Wrong size on UAISkill_BardicInspiration");
static_assert(offsetof(UAISkill_BardicInspiration, BBGeneratorLocationKey) == 0x000118, "Member 'UAISkill_BardicInspiration::BBGeneratorLocationKey' has a wrong offset!");
static_assert(offsetof(UAISkill_BardicInspiration, MaxDistanceFromGenerator) == 0x000124, "Member 'UAISkill_BardicInspiration::MaxDistanceFromGenerator' has a wrong offset!");
static_assert(offsetof(UAISkill_BardicInspiration, MaxDistanceFromSurvivorDuringSkill) == 0x000128, "Member 'UAISkill_BardicInspiration::MaxDistanceFromSurvivorDuringSkill' has a wrong offset!");

// Class DBDBots.BTDecorator_IsExitOpened
// 0x0030 (0x00A0 - 0x0070)
class UBTDecorator_IsExitOpened final : public UBTDecorator_TickableBase
{
public:
	struct FBlackboardKeySelector                 BBExitObj;                                         // 0x0070(0x0030)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_IsExitOpened">();
	}
	static class UBTDecorator_IsExitOpened* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_IsExitOpened>();
	}
};
static_assert(alignof(UBTDecorator_IsExitOpened) == 0x000008, "Wrong alignment on UBTDecorator_IsExitOpened");
static_assert(sizeof(UBTDecorator_IsExitOpened) == 0x0000A0, "Wrong size on UBTDecorator_IsExitOpened");
static_assert(offsetof(UBTDecorator_IsExitOpened, BBExitObj) == 0x000070, "Member 'UBTDecorator_IsExitOpened::BBExitObj' has a wrong offset!");

// Class DBDBots.AISkill_InteractionTarget
// 0x00C8 (0x0348 - 0x0280)
class UAISkill_InteractionTarget : public UAISkill_Interaction
{
public:
	EInteractionTargetRequirements                TargetRequirement;                                 // 0x0280(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BBOnlyFromActor;                                   // 0x0284(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoSwapBestStimulusWithBestTarget;                // 0x0290(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartMinRange;                                     // 0x0294(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartMaxRange;                                     // 0x0298(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopMinRange;                                      // 0x029C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopMaxRange;                                      // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartMaxHalfAngle;                                 // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopMaxHalfAngle;                                  // 0x02A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMaxHalfAngle2D;                                  // 0x02AC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TestMaxHalfAngleOnPath;                            // 0x02AD(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     MaxAngleFilterClass;                               // 0x02B0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionTargetInSightModes                InSightMode;                                       // 0x02B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutOfSightModeDelay;                               // 0x02BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetMoveAwayTooFastStopDelay;                    // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetMoveAwayTooFastCooldown;                     // 0x02C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearEvadeInteractableDistThreshold;                // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRangeModifierWhenObstacleIsPredicted;           // 0x02CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckTargetIsNotOnOtherSideOfEvadeInteractable;    // 0x02D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlwaysStrafeAroundTarget;                          // 0x02D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAIDetectedStimulus>            _unfilteredTargets;                                // 0x02D8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAIDetectedStimulus>            _filteredTargets;                                  // 0x02E8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class AActor*, struct FTargetMoveAwayToFastInfo> _targetsMoveAwayTooFastInfo;                       // 0x02F8(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionTarget">();
	}
	static class UAISkill_InteractionTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionTarget>();
	}
};
static_assert(alignof(UAISkill_InteractionTarget) == 0x000008, "Wrong alignment on UAISkill_InteractionTarget");
static_assert(sizeof(UAISkill_InteractionTarget) == 0x000348, "Wrong size on UAISkill_InteractionTarget");
static_assert(offsetof(UAISkill_InteractionTarget, TargetRequirement) == 0x000280, "Member 'UAISkill_InteractionTarget::TargetRequirement' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, BBOnlyFromActor) == 0x000284, "Member 'UAISkill_InteractionTarget::BBOnlyFromActor' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, AutoSwapBestStimulusWithBestTarget) == 0x000290, "Member 'UAISkill_InteractionTarget::AutoSwapBestStimulusWithBestTarget' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, StartMinRange) == 0x000294, "Member 'UAISkill_InteractionTarget::StartMinRange' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, StartMaxRange) == 0x000298, "Member 'UAISkill_InteractionTarget::StartMaxRange' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, StopMinRange) == 0x00029C, "Member 'UAISkill_InteractionTarget::StopMinRange' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, StopMaxRange) == 0x0002A0, "Member 'UAISkill_InteractionTarget::StopMaxRange' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, StartMaxHalfAngle) == 0x0002A4, "Member 'UAISkill_InteractionTarget::StartMaxHalfAngle' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, StopMaxHalfAngle) == 0x0002A8, "Member 'UAISkill_InteractionTarget::StopMaxHalfAngle' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, IsMaxHalfAngle2D) == 0x0002AC, "Member 'UAISkill_InteractionTarget::IsMaxHalfAngle2D' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, TestMaxHalfAngleOnPath) == 0x0002AD, "Member 'UAISkill_InteractionTarget::TestMaxHalfAngleOnPath' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, MaxAngleFilterClass) == 0x0002B0, "Member 'UAISkill_InteractionTarget::MaxAngleFilterClass' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, InSightMode) == 0x0002B8, "Member 'UAISkill_InteractionTarget::InSightMode' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, OutOfSightModeDelay) == 0x0002BC, "Member 'UAISkill_InteractionTarget::OutOfSightModeDelay' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, TargetMoveAwayTooFastStopDelay) == 0x0002C0, "Member 'UAISkill_InteractionTarget::TargetMoveAwayTooFastStopDelay' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, TargetMoveAwayTooFastCooldown) == 0x0002C4, "Member 'UAISkill_InteractionTarget::TargetMoveAwayTooFastCooldown' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, NearEvadeInteractableDistThreshold) == 0x0002C8, "Member 'UAISkill_InteractionTarget::NearEvadeInteractableDistThreshold' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, MinRangeModifierWhenObstacleIsPredicted) == 0x0002CC, "Member 'UAISkill_InteractionTarget::MinRangeModifierWhenObstacleIsPredicted' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, CheckTargetIsNotOnOtherSideOfEvadeInteractable) == 0x0002D0, "Member 'UAISkill_InteractionTarget::CheckTargetIsNotOnOtherSideOfEvadeInteractable' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, AlwaysStrafeAroundTarget) == 0x0002D1, "Member 'UAISkill_InteractionTarget::AlwaysStrafeAroundTarget' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, _unfilteredTargets) == 0x0002D8, "Member 'UAISkill_InteractionTarget::_unfilteredTargets' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, _filteredTargets) == 0x0002E8, "Member 'UAISkill_InteractionTarget::_filteredTargets' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget, _targetsMoveAwayTooFastInfo) == 0x0002F8, "Member 'UAISkill_InteractionTarget::_targetsMoveAwayTooFastInfo' has a wrong offset!");

// Class DBDBots.AISkill_InteractionTarget_Stalk
// 0x0000 (0x0348 - 0x0348)
class UAISkill_InteractionTarget_Stalk : public UAISkill_InteractionTarget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionTarget_Stalk">();
	}
	static class UAISkill_InteractionTarget_Stalk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionTarget_Stalk>();
	}
};
static_assert(alignof(UAISkill_InteractionTarget_Stalk) == 0x000008, "Wrong alignment on UAISkill_InteractionTarget_Stalk");
static_assert(sizeof(UAISkill_InteractionTarget_Stalk) == 0x000348, "Wrong size on UAISkill_InteractionTarget_Stalk");

// Class DBDBots.AISkill_InteractionTarget_StalkShape
// 0x0008 (0x0350 - 0x0348)
class UAISkill_InteractionTarget_StalkShape final : public UAISkill_InteractionTarget_Stalk
{
public:
	int32                                         StalkRangeLimitedAtEvilTier;                       // 0x0348(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxStalkRangeWhenLimitedByEvilTier;                // 0x034C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionTarget_StalkShape">();
	}
	static class UAISkill_InteractionTarget_StalkShape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionTarget_StalkShape>();
	}
};
static_assert(alignof(UAISkill_InteractionTarget_StalkShape) == 0x000008, "Wrong alignment on UAISkill_InteractionTarget_StalkShape");
static_assert(sizeof(UAISkill_InteractionTarget_StalkShape) == 0x000350, "Wrong size on UAISkill_InteractionTarget_StalkShape");
static_assert(offsetof(UAISkill_InteractionTarget_StalkShape, StalkRangeLimitedAtEvilTier) == 0x000348, "Member 'UAISkill_InteractionTarget_StalkShape::StalkRangeLimitedAtEvilTier' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionTarget_StalkShape, MaxStalkRangeWhenLimitedByEvilTier) == 0x00034C, "Member 'UAISkill_InteractionTarget_StalkShape::MaxStalkRangeWhenLimitedByEvilTier' has a wrong offset!");

// Class DBDBots.DBDAIBTController
// 0x01D0 (0x0A20 - 0x0850)
class ADBDAIBTController : public ADBDAIController
{
public:
