#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDCompetence

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "StatSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDCompetence_structs.hpp"
#include "Competence_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDGameplay_structs.hpp"
#include "Engine_classes.hpp"
#include "SystemUtilities_structs.hpp"
#include "GameplayUtilities_structs.hpp"
#include "NetworkUtilities_structs.hpp"


namespace SDK
{

// Class DBDCompetence.HighestLevelAndClosestEffectCondition
// 0x0048 (0x0108 - 0x00C0)
class UHighestLevelAndClosestEffectCondition final : public UGameplayModifierCondition
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStatusEffect*>                  _effectsLevel1;                                    // 0x00C8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UStatusEffect*>                  _effectsLevel2;                                    // 0x00D8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UStatusEffect*>                  _effectsLevel3;                                    // 0x00E8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitEffectArrays(class FName EffectIDLevel1, class FName EffectIDLevel2, class FName EffectIDLevel3);
	void SetCurrentEffectLevel(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HighestLevelAndClosestEffectCondition">();
	}
	static class UHighestLevelAndClosestEffectCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighestLevelAndClosestEffectCondition>();
	}
};
static_assert(alignof(UHighestLevelAndClosestEffectCondition) == 0x000008, "Wrong alignment on UHighestLevelAndClosestEffectCondition");
static_assert(sizeof(UHighestLevelAndClosestEffectCondition) == 0x000108, "Wrong size on UHighestLevelAndClosestEffectCondition");
static_assert(offsetof(UHighestLevelAndClosestEffectCondition, _effectsLevel1) == 0x0000C8, "Member 'UHighestLevelAndClosestEffectCondition::_effectsLevel1' has a wrong offset!");
static_assert(offsetof(UHighestLevelAndClosestEffectCondition, _effectsLevel2) == 0x0000D8, "Member 'UHighestLevelAndClosestEffectCondition::_effectsLevel2' has a wrong offset!");
static_assert(offsetof(UHighestLevelAndClosestEffectCondition, _effectsLevel3) == 0x0000E8, "Member 'UHighestLevelAndClosestEffectCondition::_effectsLevel3' has a wrong offset!");

// Class DBDCompetence.ActivateOnEventBaseActivationStrategy
// 0x0000 (0x0030 - 0x0030)
class UActivateOnEventBaseActivationStrategy : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateOnEventBaseActivationStrategy">();
	}
	static class UActivateOnEventBaseActivationStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateOnEventBaseActivationStrategy>();
	}
};
static_assert(alignof(UActivateOnEventBaseActivationStrategy) == 0x000008, "Wrong alignment on UActivateOnEventBaseActivationStrategy");
static_assert(sizeof(UActivateOnEventBaseActivationStrategy) == 0x000030, "Wrong size on UActivateOnEventBaseActivationStrategy");

// Class DBDCompetence.ActivateOnEventTargetActivationStrategy
// 0x0000 (0x0030 - 0x0030)
class UActivateOnEventTargetActivationStrategy final : public UActivateOnEventBaseActivationStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateOnEventTargetActivationStrategy">();
	}
	static class UActivateOnEventTargetActivationStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateOnEventTargetActivationStrategy>();
	}
};
static_assert(alignof(UActivateOnEventTargetActivationStrategy) == 0x000008, "Wrong alignment on UActivateOnEventTargetActivationStrategy");
static_assert(sizeof(UActivateOnEventTargetActivationStrategy) == 0x000030, "Wrong size on UActivateOnEventTargetActivationStrategy");

// Class DBDCompetence.SpawnEffectsOnAllSurvivorsBaseAddon
// 0x0010 (0x02F8 - 0x02E8)
class USpawnEffectsOnAllSurvivorsBaseAddon : public UItemAddon
{
public:
	bool                                          _canCreateMultipleInstances;                       // 0x02E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E9[0xF];                                      // 0x02E9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpawnEffectsOnAllSurvivorsBaseAddon">();
	}
	static class USpawnEffectsOnAllSurvivorsBaseAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEffectsOnAllSurvivorsBaseAddon>();
	}
};
static_assert(alignof(USpawnEffectsOnAllSurvivorsBaseAddon) == 0x000008, "Wrong alignment on USpawnEffectsOnAllSurvivorsBaseAddon");
static_assert(sizeof(USpawnEffectsOnAllSurvivorsBaseAddon) == 0x0002F8, "Wrong size on USpawnEffectsOnAllSurvivorsBaseAddon");
static_assert(offsetof(USpawnEffectsOnAllSurvivorsBaseAddon, _canCreateMultipleInstances) == 0x0002E8, "Member 'USpawnEffectsOnAllSurvivorsBaseAddon::_canCreateMultipleInstances' has a wrong offset!");

// Class DBDCompetence.SimpleSpawnEffectsOnAllSurvivorsAddon
// 0x0010 (0x0308 - 0x02F8)
class USimpleSpawnEffectsOnAllSurvivorsAddon : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	TArray<struct FSimpleSpawnEffectsOnAllSurvivorsAddonParams> _statusEffectsSpawnParams;                         // 0x02F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleSpawnEffectsOnAllSurvivorsAddon">();
	}
	static class USimpleSpawnEffectsOnAllSurvivorsAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleSpawnEffectsOnAllSurvivorsAddon>();
	}
};
static_assert(alignof(USimpleSpawnEffectsOnAllSurvivorsAddon) == 0x000008, "Wrong alignment on USimpleSpawnEffectsOnAllSurvivorsAddon");
static_assert(sizeof(USimpleSpawnEffectsOnAllSurvivorsAddon) == 0x000308, "Wrong size on USimpleSpawnEffectsOnAllSurvivorsAddon");
static_assert(offsetof(USimpleSpawnEffectsOnAllSurvivorsAddon, _statusEffectsSpawnParams) == 0x0002F8, "Member 'USimpleSpawnEffectsOnAllSurvivorsAddon::_statusEffectsSpawnParams' has a wrong offset!");

// Class DBDCompetence.IsHighestLevelAndClosestOriginatingEffect
// 0x0028 (0x00E8 - 0x00C0)
class UIsHighestLevelAndClosestOriginatingEffect final : public UGameplayModifierCondition
{
public:
	TArray<class UStatusEffect*>                  _applicableEffects;                                // 0x00C0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnStatusEffectAddedOrRemoved(class UStatusEffect* Effect, bool Valid);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsHighestLevelAndClosestOriginatingEffect">();
	}
	static class UIsHighestLevelAndClosestOriginatingEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsHighestLevelAndClosestOriginatingEffect>();
	}
};
static_assert(alignof(UIsHighestLevelAndClosestOriginatingEffect) == 0x000008, "Wrong alignment on UIsHighestLevelAndClosestOriginatingEffect");
static_assert(sizeof(UIsHighestLevelAndClosestOriginatingEffect) == 0x0000E8, "Wrong size on UIsHighestLevelAndClosestOriginatingEffect");
static_assert(offsetof(UIsHighestLevelAndClosestOriginatingEffect, _applicableEffects) == 0x0000C0, "Member 'UIsHighestLevelAndClosestOriginatingEffect::_applicableEffects' has a wrong offset!");

// Class DBDCompetence.ActivateStatusEffectOnEventBaseStrategy
// 0x0000 (0x0030 - 0x0030)
class UActivateStatusEffectOnEventBaseStrategy : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateStatusEffectOnEventBaseStrategy">();
	}
	static class UActivateStatusEffectOnEventBaseStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateStatusEffectOnEventBaseStrategy>();
	}
};
static_assert(alignof(UActivateStatusEffectOnEventBaseStrategy) == 0x000008, "Wrong alignment on UActivateStatusEffectOnEventBaseStrategy");
static_assert(sizeof(UActivateStatusEffectOnEventBaseStrategy) == 0x000030, "Wrong size on UActivateStatusEffectOnEventBaseStrategy");

// Class DBDCompetence.ActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy
// 0x0000 (0x0030 - 0x0030)
class UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy final : public UActivateStatusEffectOnEventBaseStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy">();
	}
	static class UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy>();
	}
};
static_assert(alignof(UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy) == 0x000008, "Wrong alignment on UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy");
static_assert(sizeof(UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy) == 0x000030, "Wrong size on UActivateStatusEffectOnEventOriginatingPlayerInstigatorStrategy");

// Class DBDCompetence.UndetectableEffect
// 0x0000 (0x0380 - 0x0380)
class UUndetectableEffect : public UStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UndetectableEffect">();
	}
	static class UUndetectableEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUndetectableEffect>();
	}
};
static_assert(alignof(UUndetectableEffect) == 0x000008, "Wrong alignment on UUndetectableEffect");
static_assert(sizeof(UUndetectableEffect) == 0x000380, "Wrong size on UUndetectableEffect");

// Class DBDCompetence.GameplayModifierContainerWrapperSkill
// 0x0018 (0x0360 - 0x0348)
class UGameplayModifierContainerWrapperSkill : public USkill
{
public:
	class FName                                   _gameplayModifierContainerId;                      // 0x0348(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayModifierContainer*             _spawnedGameplayModifierContainer;                 // 0x0358(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_SpawnedGameplayModifierContainer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayModifierContainerWrapperSkill">();
	}
	static class UGameplayModifierContainerWrapperSkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayModifierContainerWrapperSkill>();
	}
};
static_assert(alignof(UGameplayModifierContainerWrapperSkill) == 0x000008, "Wrong alignment on UGameplayModifierContainerWrapperSkill");
static_assert(sizeof(UGameplayModifierContainerWrapperSkill) == 0x000360, "Wrong size on UGameplayModifierContainerWrapperSkill");
static_assert(offsetof(UGameplayModifierContainerWrapperSkill, _gameplayModifierContainerId) == 0x000348, "Member 'UGameplayModifierContainerWrapperSkill::_gameplayModifierContainerId' has a wrong offset!");
static_assert(offsetof(UGameplayModifierContainerWrapperSkill, _spawnedGameplayModifierContainer) == 0x000358, "Member 'UGameplayModifierContainerWrapperSkill::_spawnedGameplayModifierContainer' has a wrong offset!");

// Class DBDCompetence.AddonWrapperSkill
// 0x0000 (0x0360 - 0x0360)
class UAddonWrapperSkill final : public UGameplayModifierContainerWrapperSkill
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddonWrapperSkill">();
	}
	static class UAddonWrapperSkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddonWrapperSkill>();
	}
};
static_assert(alignof(UAddonWrapperSkill) == 0x000008, "Wrong alignment on UAddonWrapperSkill");
static_assert(sizeof(UAddonWrapperSkill) == 0x000360, "Wrong size on UAddonWrapperSkill");

// Class DBDCompetence.HexPerk
// 0x0028 (0x04A0 - 0x0478)
class UHexPerk : public UTotemBoundPerk
{
public:
	TArray<class ADBDPlayer*>                     _playersWhoKnowCurse;                              // 0x0478(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TArray<class ADBDPlayer*>                     _oldPlayersWhoKnowCurse;                           // 0x0488(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_RevealCurseToAllSurvivors(bool Revealed);
	void Authority_SetCurseRevealedToPlayer(class ADBDPlayer* Player, const bool Revealed);
	void OnRep_PlayersWhoKnowCurse();
	void UpdateCursedStatusViewOnLocalPlayer();

	bool IsCurseRevealedToPlayer(const class ADBDPlayer* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HexPerk">();
	}
	static class UHexPerk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHexPerk>();
	}
};
static_assert(alignof(UHexPerk) == 0x000008, "Wrong alignment on UHexPerk");
static_assert(sizeof(UHexPerk) == 0x0004A0, "Wrong size on UHexPerk");
static_assert(offsetof(UHexPerk, _playersWhoKnowCurse) == 0x000478, "Member 'UHexPerk::_playersWhoKnowCurse' has a wrong offset!");
static_assert(offsetof(UHexPerk, _oldPlayersWhoKnowCurse) == 0x000488, "Member 'UHexPerk::_oldPlayersWhoKnowCurse' has a wrong offset!");

// Class DBDCompetence.ActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy
// 0x0088 (0x00B8 - 0x0030)
class UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy : public UActivateStatusEffectOnEventBaseStrategy
{
public:
	float                                         _range;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _tunableStat;                                      // 0x0038(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy">();
	}
	static class UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy>();
	}
};
static_assert(alignof(UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy) == 0x000008, "Wrong alignment on UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy");
static_assert(sizeof(UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy) == 0x0000B8, "Wrong size on UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy");
static_assert(offsetof(UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy, _range) == 0x000030, "Member 'UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy::_range' has a wrong offset!");
static_assert(offsetof(UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy, _tunableStat) == 0x000038, "Member 'UActivateStatusEffectOnEventInRangeOfOriginatingPlayerStrategy::_tunableStat' has a wrong offset!");

// Class DBDCompetence.DyingLight
// 0x0038 (0x0458 - 0x0420)
class UDyingLight final : public UPerk
{
public:
	TArray<float>                                 _actionSpeedPenaltyPerToken;                       // 0x0420(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         _obsessionActionSpeedBonus;                        // 0x0430(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _obsessionStatusEffect;                            // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _nonObsessionStatusEffect;                         // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UStatusEffect*>                  _survivorDebuffs;                                  // 0x0448(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnObsessionChanged(class ACamperPlayer* NewObsession, class ACamperPlayer* PreviousObsession);

	float GetActionSpeedPenaltyPerTokenAtLevel() const;
	float GetObsessionActionSpeedBonus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DyingLight">();
	}
	static class UDyingLight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDyingLight>();
	}
};
static_assert(alignof(UDyingLight) == 0x000008, "Wrong alignment on UDyingLight");
static_assert(sizeof(UDyingLight) == 0x000458, "Wrong size on UDyingLight");
static_assert(offsetof(UDyingLight, _actionSpeedPenaltyPerToken) == 0x000420, "Member 'UDyingLight::_actionSpeedPenaltyPerToken' has a wrong offset!");
static_assert(offsetof(UDyingLight, _obsessionActionSpeedBonus) == 0x000430, "Member 'UDyingLight::_obsessionActionSpeedBonus' has a wrong offset!");
static_assert(offsetof(UDyingLight, _obsessionStatusEffect) == 0x000438, "Member 'UDyingLight::_obsessionStatusEffect' has a wrong offset!");
static_assert(offsetof(UDyingLight, _nonObsessionStatusEffect) == 0x000440, "Member 'UDyingLight::_nonObsessionStatusEffect' has a wrong offset!");
static_assert(offsetof(UDyingLight, _survivorDebuffs) == 0x000448, "Member 'UDyingLight::_survivorDebuffs' has a wrong offset!");

// Class DBDCompetence.OnEventBaseAddon
// 0x0010 (0x02F8 - 0x02E8)
class UOnEventBaseAddon : public UItemAddon
{
public:
	struct FGameplayTag                           _eventToListenTo;                                  // 0x02E8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEventFired(const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnEventBaseAddon">();
	}
	static class UOnEventBaseAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnEventBaseAddon>();
	}
};
static_assert(alignof(UOnEventBaseAddon) == 0x000008, "Wrong alignment on UOnEventBaseAddon");
static_assert(sizeof(UOnEventBaseAddon) == 0x0002F8, "Wrong size on UOnEventBaseAddon");
static_assert(offsetof(UOnEventBaseAddon, _eventToListenTo) == 0x0002E8, "Member 'UOnEventBaseAddon::_eventToListenTo' has a wrong offset!");

// Class DBDCompetence.BaseLingeringStatusEffect
// 0x0068 (0x03E8 - 0x0380)
class UBaseLingeringStatusEffect : public UStatusEffect
{
public:
	float                                         _lingerDuration;                                   // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNonTunableStat                        _lingerDurationModifier;                           // 0x0388(0x0060)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void Authority_ActivateEffect();
	void Authority_DeactivateEffect();
	void SetLingerDuration(float LingerDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseLingeringStatusEffect">();
	}
	static class UBaseLingeringStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseLingeringStatusEffect>();
	}
};
static_assert(alignof(UBaseLingeringStatusEffect) == 0x000008, "Wrong alignment on UBaseLingeringStatusEffect");
static_assert(sizeof(UBaseLingeringStatusEffect) == 0x0003E8, "Wrong size on UBaseLingeringStatusEffect");
static_assert(offsetof(UBaseLingeringStatusEffect, _lingerDuration) == 0x000380, "Member 'UBaseLingeringStatusEffect::_lingerDuration' has a wrong offset!");
static_assert(offsetof(UBaseLingeringStatusEffect, _lingerDurationModifier) == 0x000388, "Member 'UBaseLingeringStatusEffect::_lingerDurationModifier' has a wrong offset!");

// Class DBDCompetence.KindredPerk
// 0x0030 (0x0450 - 0x0420)
class UKindredPerk final : public UPerk
{
public:
	TArray<float>                                 _killerAuraRevealRange;                            // 0x0420(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _kindredRevealKillerOther;                         // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _kindredRevealKillerOwner;                         // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _kindredRevealSurvivors;                           // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetKillerAuraRevealRangeAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KindredPerk">();
	}
	static class UKindredPerk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKindredPerk>();
	}
};
static_assert(alignof(UKindredPerk) == 0x000008, "Wrong alignment on UKindredPerk");
static_assert(sizeof(UKindredPerk) == 0x000450, "Wrong size on UKindredPerk");
static_assert(offsetof(UKindredPerk, _killerAuraRevealRange) == 0x000420, "Member 'UKindredPerk::_killerAuraRevealRange' has a wrong offset!");
static_assert(offsetof(UKindredPerk, _kindredRevealKillerOther) == 0x000430, "Member 'UKindredPerk::_kindredRevealKillerOther' has a wrong offset!");
static_assert(offsetof(UKindredPerk, _kindredRevealKillerOwner) == 0x000438, "Member 'UKindredPerk::_kindredRevealKillerOwner' has a wrong offset!");
static_assert(offsetof(UKindredPerk, _kindredRevealSurvivors) == 0x000440, "Member 'UKindredPerk::_kindredRevealSurvivors' has a wrong offset!");

// Class DBDCompetence.Adrenaline
// 0x0028 (0x0448 - 0x0420)
class UAdrenaline final : public UPerk
{
public:
	float                                         _exhaustionDuration[0x3];                          // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _speedEffect;                                      // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _exhaustionEffect;                                 // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _movementSpeedDuration;                            // 0x0440(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _movementSpeedPercentage;                          // 0x0444(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Multicast_DispatchAdrenalineEvents(const bool IsHealthy, const float HealAmount);

	float GetExhaustionDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Adrenaline">();
	}
	static class UAdrenaline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdrenaline>();
	}
};
static_assert(alignof(UAdrenaline) == 0x000008, "Wrong alignment on UAdrenaline");
static_assert(sizeof(UAdrenaline) == 0x000448, "Wrong size on UAdrenaline");
static_assert(offsetof(UAdrenaline, _exhaustionDuration) == 0x000420, "Member 'UAdrenaline::_exhaustionDuration' has a wrong offset!");
static_assert(offsetof(UAdrenaline, _speedEffect) == 0x000430, "Member 'UAdrenaline::_speedEffect' has a wrong offset!");
static_assert(offsetof(UAdrenaline, _exhaustionEffect) == 0x000438, "Member 'UAdrenaline::_exhaustionEffect' has a wrong offset!");
static_assert(offsetof(UAdrenaline, _movementSpeedDuration) == 0x000440, "Member 'UAdrenaline::_movementSpeedDuration' has a wrong offset!");
static_assert(offsetof(UAdrenaline, _movementSpeedPercentage) == 0x000444, "Member 'UAdrenaline::_movementSpeedPercentage' has a wrong offset!");

// Class DBDCompetence.SpawningEffectPerk
// 0x0080 (0x04A0 - 0x0420)
class USpawningEffectPerk : public UPerk
{
public:
	struct FPerkLevelEffectArray                  _perkLevelEffects[0x3];                            // 0x0420(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FPlayerStatusEffectSpawnerHelper       _effectSpawnerHelper;                              // 0x0450(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpawningEffectPerk">();
	}
	static class USpawningEffectPerk* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawningEffectPerk>();
	}
};
static_assert(alignof(USpawningEffectPerk) == 0x000008, "Wrong alignment on USpawningEffectPerk");
static_assert(sizeof(USpawningEffectPerk) == 0x0004A0, "Wrong size on USpawningEffectPerk");
static_assert(offsetof(USpawningEffectPerk, _perkLevelEffects) == 0x000420, "Member 'USpawningEffectPerk::_perkLevelEffects' has a wrong offset!");
static_assert(offsetof(USpawningEffectPerk, _effectSpawnerHelper) == 0x000450, "Member 'USpawningEffectPerk::_effectSpawnerHelper' has a wrong offset!");

// Class DBDCompetence.ActivateOnEventTimedStatusEffect
// 0x0030 (0x03B0 - 0x0380)
class UActivateOnEventTimedStatusEffect : public UStatusEffect
{
public:
	TSubclassOf<class UActivateOnEventBaseActivationStrategy> _activationStrategyClass;                          // 0x0380(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActivateOnEventBaseActivationStrategy* _activationStrategy;                               // 0x0388(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  _eventsToActivateOn;                               // 0x0390(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateOnEventTimedStatusEffect">();
	}
	static class UActivateOnEventTimedStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateOnEventTimedStatusEffect>();
	}
};
static_assert(alignof(UActivateOnEventTimedStatusEffect) == 0x000008, "Wrong alignment on UActivateOnEventTimedStatusEffect");
static_assert(sizeof(UActivateOnEventTimedStatusEffect) == 0x0003B0, "Wrong size on UActivateOnEventTimedStatusEffect");
static_assert(offsetof(UActivateOnEventTimedStatusEffect, _activationStrategyClass) == 0x000380, "Member 'UActivateOnEventTimedStatusEffect::_activationStrategyClass' has a wrong offset!");
static_assert(offsetof(UActivateOnEventTimedStatusEffect, _activationStrategy) == 0x000388, "Member 'UActivateOnEventTimedStatusEffect::_activationStrategy' has a wrong offset!");
static_assert(offsetof(UActivateOnEventTimedStatusEffect, _eventsToActivateOn) == 0x000390, "Member 'UActivateOnEventTimedStatusEffect::_eventsToActivateOn' has a wrong offset!");

// Class DBDCompetence.AlertKillerRevealEffect
// 0x0000 (0x0380 - 0x0380)
class UAlertKillerRevealEffect final : public UStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlertKillerRevealEffect">();
	}
	static class UAlertKillerRevealEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlertKillerRevealEffect>();
	}
};
static_assert(alignof(UAlertKillerRevealEffect) == 0x000008, "Wrong alignment on UAlertKillerRevealEffect");
static_assert(sizeof(UAlertKillerRevealEffect) == 0x000380, "Wrong size on UAlertKillerRevealEffect");

// Class DBDCompetence.HideSurvivorVFXForKillerEffect
// 0x0000 (0x0380 - 0x0380)
class UHideSurvivorVFXForKillerEffect final : public UStatusEffect
{
public:
	void HideVFX(bool Hide);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HideSurvivorVFXForKillerEffect">();
	}
	static class UHideSurvivorVFXForKillerEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHideSurvivorVFXForKillerEffect>();
	}
};
static_assert(alignof(UHideSurvivorVFXForKillerEffect) == 0x000008, "Wrong alignment on UHideSurvivorVFXForKillerEffect");
static_assert(sizeof(UHideSurvivorVFXForKillerEffect) == 0x000380, "Wrong size on UHideSurvivorVFXForKillerEffect");

// Class DBDCompetence.AdjustableCooldownStatusEffect
// 0x0010 (0x0390 - 0x0380)
class UAdjustableCooldownStatusEffect : public UStatusEffect
{
public:
	struct FGameplayTag                           CooldownModifierType;                              // 0x0380(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdjustableCooldownStatusEffect">();
	}
	static class UAdjustableCooldownStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdjustableCooldownStatusEffect>();
	}
};
static_assert(alignof(UAdjustableCooldownStatusEffect) == 0x000008, "Wrong alignment on UAdjustableCooldownStatusEffect");
static_assert(sizeof(UAdjustableCooldownStatusEffect) == 0x000390, "Wrong size on UAdjustableCooldownStatusEffect");
static_assert(offsetof(UAdjustableCooldownStatusEffect, CooldownModifierType) == 0x000380, "Member 'UAdjustableCooldownStatusEffect::CooldownModifierType' has a wrong offset!");

// Class DBDCompetence.ActivateStatusEffectOnEventInstigatorStrategy
// 0x0000 (0x0030 - 0x0030)
class UActivateStatusEffectOnEventInstigatorStrategy final : public UActivateStatusEffectOnEventBaseStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateStatusEffectOnEventInstigatorStrategy">();
	}
	static class UActivateStatusEffectOnEventInstigatorStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateStatusEffectOnEventInstigatorStrategy>();
	}
};
static_assert(alignof(UActivateStatusEffectOnEventInstigatorStrategy) == 0x000008, "Wrong alignment on UActivateStatusEffectOnEventInstigatorStrategy");
static_assert(sizeof(UActivateStatusEffectOnEventInstigatorStrategy) == 0x000030, "Wrong size on UActivateStatusEffectOnEventInstigatorStrategy");

// Class DBDCompetence.AnyActorPairQueryRangeIsTrue
// 0x0010 (0x00F8 - 0x00E8)
class UAnyActorPairQueryRangeIsTrue : public URangeBasedCondition
{
public:
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInRangeChanged(const bool InRange);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnyActorPairQueryRangeIsTrue">();
	}
	static class UAnyActorPairQueryRangeIsTrue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnyActorPairQueryRangeIsTrue>();
	}
};
static_assert(alignof(UAnyActorPairQueryRangeIsTrue) == 0x000008, "Wrong alignment on UAnyActorPairQueryRangeIsTrue");
static_assert(sizeof(UAnyActorPairQueryRangeIsTrue) == 0x0000F8, "Wrong size on UAnyActorPairQueryRangeIsTrue");

// Class DBDCompetence.BlessedStatusEffect
// 0x0010 (0x0390 - 0x0380)
class UBlessedStatusEffect : public UStatusEffect
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBlessedVignetteController> _vignetteControllerBlueprint;                      // 0x0388(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnSurvivorRemovedFromGame(class ACamperPlayer* Survivor);
	void OnEnterBoonRange();
	void OnExitBoonRange();

	float GetBoonTotemBlessingRange() const;
	class ATotem* GetBoundTotem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlessedStatusEffect">();
	}
	static class UBlessedStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlessedStatusEffect>();
	}
};
static_assert(alignof(UBlessedStatusEffect) == 0x000008, "Wrong alignment on UBlessedStatusEffect");
static_assert(sizeof(UBlessedStatusEffect) == 0x000390, "Wrong size on UBlessedStatusEffect");
static_assert(offsetof(UBlessedStatusEffect, _vignetteControllerBlueprint) == 0x000388, "Member 'UBlessedStatusEffect::_vignetteControllerBlueprint' has a wrong offset!");

// Class DBDCompetence.LingeringStateTagStatusEffect
// 0x0038 (0x0420 - 0x03E8)
class ULingeringStateTagStatusEffect : public UBaseLingeringStatusEffect
{
public:
	struct FGameplayTag                           _ownerStateTag;                                    // 0x03E8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F4[0x2C];                                     // 0x03F4(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LingeringStateTagStatusEffect">();
	}
	static class ULingeringStateTagStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULingeringStateTagStatusEffect>();
	}
};
static_assert(alignof(ULingeringStateTagStatusEffect) == 0x000008, "Wrong alignment on ULingeringStateTagStatusEffect");
static_assert(sizeof(ULingeringStateTagStatusEffect) == 0x000420, "Wrong size on ULingeringStateTagStatusEffect");
static_assert(offsetof(ULingeringStateTagStatusEffect, _ownerStateTag) == 0x0003E8, "Member 'ULingeringStateTagStatusEffect::_ownerStateTag' has a wrong offset!");

// Class DBDCompetence.ThrillingTremors
// 0x0060 (0x0480 - 0x0420)
class UThrillingTremors final : public UPerk
{
public:
	int32                                         _cooldownByLevel[0x3];                             // 0x0420(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _durationByLevel[0x3];                             // 0x042C(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _disableWhenSurvivorPutDownOrUnhooked;             // 0x0438(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           _generatorAuraColorForKiller;                      // 0x043C(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGenerator*>                     _blockedGenerators;                                // 0x0450(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TArray<class AGenerator*>                     _revealedGenerators;                               // 0x0460(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_BlockedGenerators();

	int32 GetCooldownAtLevel() const;
	float GetDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ThrillingTremors">();
	}
	static class UThrillingTremors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThrillingTremors>();
	}
};
static_assert(alignof(UThrillingTremors) == 0x000008, "Wrong alignment on UThrillingTremors");
static_assert(sizeof(UThrillingTremors) == 0x000480, "Wrong size on UThrillingTremors");
static_assert(offsetof(UThrillingTremors, _cooldownByLevel) == 0x000420, "Member 'UThrillingTremors::_cooldownByLevel' has a wrong offset!");
static_assert(offsetof(UThrillingTremors, _durationByLevel) == 0x00042C, "Member 'UThrillingTremors::_durationByLevel' has a wrong offset!");
static_assert(offsetof(UThrillingTremors, _disableWhenSurvivorPutDownOrUnhooked) == 0x000438, "Member 'UThrillingTremors::_disableWhenSurvivorPutDownOrUnhooked' has a wrong offset!");
static_assert(offsetof(UThrillingTremors, _generatorAuraColorForKiller) == 0x00043C, "Member 'UThrillingTremors::_generatorAuraColorForKiller' has a wrong offset!");
static_assert(offsetof(UThrillingTremors, _blockedGenerators) == 0x000450, "Member 'UThrillingTremors::_blockedGenerators' has a wrong offset!");
static_assert(offsetof(UThrillingTremors, _revealedGenerators) == 0x000460, "Member 'UThrillingTremors::_revealedGenerators' has a wrong offset!");

// Class DBDCompetence.ImposeStatusEffectOnEventAddon
// 0x0018 (0x0310 - 0x02F8)
class UImposeStatusEffectOnEventAddon : public UOnEventBaseAddon
{
public:
	bool                                          _requireEventInstigatorToMatchAddonOwnerToImposeStatusEffects; // 0x02F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _requireEventTargetToMatchAddonOwnerToImposeStatusEffects; // 0x02F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataDrivenStatusEffectInfo>    _statusEffectsToImposeOnEvent;                     // 0x0300(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImposeStatusEffectOnEventAddon">();
	}
	static class UImposeStatusEffectOnEventAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImposeStatusEffectOnEventAddon>();
	}
};
static_assert(alignof(UImposeStatusEffectOnEventAddon) == 0x000008, "Wrong alignment on UImposeStatusEffectOnEventAddon");
static_assert(sizeof(UImposeStatusEffectOnEventAddon) == 0x000310, "Wrong size on UImposeStatusEffectOnEventAddon");
static_assert(offsetof(UImposeStatusEffectOnEventAddon, _requireEventInstigatorToMatchAddonOwnerToImposeStatusEffects) == 0x0002F8, "Member 'UImposeStatusEffectOnEventAddon::_requireEventInstigatorToMatchAddonOwnerToImposeStatusEffects' has a wrong offset!");
static_assert(offsetof(UImposeStatusEffectOnEventAddon, _requireEventTargetToMatchAddonOwnerToImposeStatusEffects) == 0x0002F9, "Member 'UImposeStatusEffectOnEventAddon::_requireEventTargetToMatchAddonOwnerToImposeStatusEffects' has a wrong offset!");
static_assert(offsetof(UImposeStatusEffectOnEventAddon, _statusEffectsToImposeOnEvent) == 0x000300, "Member 'UImposeStatusEffectOnEventAddon::_statusEffectsToImposeOnEvent' has a wrong offset!");

// Class DBDCompetence.ActivateStatusEffectOnOwningSurvivorNoHookStage
// 0x0008 (0x0038 - 0x0030)
class UActivateStatusEffectOnOwningSurvivorNoHookStage final : public UActivateStatusEffectOnEventBaseStrategy
{
public:
	EHookDrainStage                               _hookStage;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateStatusEffectOnOwningSurvivorNoHookStage">();
	}
	static class UActivateStatusEffectOnOwningSurvivorNoHookStage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateStatusEffectOnOwningSurvivorNoHookStage>();
	}
};
static_assert(alignof(UActivateStatusEffectOnOwningSurvivorNoHookStage) == 0x000008, "Wrong alignment on UActivateStatusEffectOnOwningSurvivorNoHookStage");
static_assert(sizeof(UActivateStatusEffectOnOwningSurvivorNoHookStage) == 0x000038, "Wrong size on UActivateStatusEffectOnOwningSurvivorNoHookStage");
static_assert(offsetof(UActivateStatusEffectOnOwningSurvivorNoHookStage, _hookStage) == 0x000030, "Member 'UActivateStatusEffectOnOwningSurvivorNoHookStage::_hookStage' has a wrong offset!");

// Class DBDCompetence.SetStackingModifierValueAction
// 0x0020 (0x0060 - 0x0040)
class USetStackingModifierValueAction final : public UCompetenceAction
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _gameplayModifierType;                             // 0x0048(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _gameplayModifierValue;                            // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _maxStacks;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SetStackingModifierValueAction">();
	}
	static class USetStackingModifierValueAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetStackingModifierValueAction>();
	}
};
static_assert(alignof(USetStackingModifierValueAction) == 0x000008, "Wrong alignment on USetStackingModifierValueAction");
static_assert(sizeof(USetStackingModifierValueAction) == 0x000060, "Wrong size on USetStackingModifierValueAction");
static_assert(offsetof(USetStackingModifierValueAction, _gameplayModifierType) == 0x000048, "Member 'USetStackingModifierValueAction::_gameplayModifierType' has a wrong offset!");
static_assert(offsetof(USetStackingModifierValueAction, _gameplayModifierValue) == 0x000054, "Member 'USetStackingModifierValueAction::_gameplayModifierValue' has a wrong offset!");
static_assert(offsetof(USetStackingModifierValueAction, _maxStacks) == 0x000058, "Member 'USetStackingModifierValueAction::_maxStacks' has a wrong offset!");

// Class DBDCompetence.IsPlayerPerformingInteraction
// 0x0040 (0x0120 - 0x00E0)
class UIsPlayerPerformingInteraction : public UEventDrivenModifierCondition
{
public:
	struct FGameplayTagContainer                  _interactionSemantics;                             // 0x00E0(0x0020)(Edit, BlueprintVisible, Net, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInteractionSemantics(const struct FGameplayTagContainer& InteractionSemantics);
	void UpdateIsTrue(class UInteractionDefinition* InteractionDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsPlayerPerformingInteraction">();
	}
	static class UIsPlayerPerformingInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsPlayerPerformingInteraction>();
	}
};
static_assert(alignof(UIsPlayerPerformingInteraction) == 0x000008, "Wrong alignment on UIsPlayerPerformingInteraction");
static_assert(sizeof(UIsPlayerPerformingInteraction) == 0x000120, "Wrong size on UIsPlayerPerformingInteraction");
static_assert(offsetof(UIsPlayerPerformingInteraction, _interactionSemantics) == 0x0000E0, "Member 'UIsPlayerPerformingInteraction::_interactionSemantics' has a wrong offset!");

// Class DBDCompetence.Tinkerer
// 0x0078 (0x0498 - 0x0420)
class UTinkerer final : public UPerk
{
public:
	TSubclassOf<class UStatusEffect>              _undetectableEffectClass;                          // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _triggerThreshold;                                 // 0x0428(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceThreshold;                                // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _activationTime[0x3];                              // 0x0430(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, float>                    _generatorActivationTimes;                         // 0x0440(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0x8];                                      // 0x0490(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnGeneratorChargePercentChanged(class UChargeableComponent* ChargeableComponent, float PercentCompletionChange, float TotalPercentComplete);
	void Authority_OnGeneratorReachedThreshold(class AGenerator* Generator);
	void Authority_OnLevelReadyToPlay();
	void Authority_OnUndetectableAttackSuccessNearActiveGenerator(class ADBDPlayer* Instigator, class ADBDPlayer* Target);
	void Authority_OnUndetectableGeneratorInterrupt(class ADBDPlayer* Instigator, class ADBDPlayer* Target);

	float GetActivationTimeAtLevel() const;
	float GetTriggerThreshold() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Tinkerer">();
	}
	static class UTinkerer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTinkerer>();
	}
};
static_assert(alignof(UTinkerer) == 0x000008, "Wrong alignment on UTinkerer");
static_assert(sizeof(UTinkerer) == 0x000498, "Wrong size on UTinkerer");
static_assert(offsetof(UTinkerer, _undetectableEffectClass) == 0x000420, "Member 'UTinkerer::_undetectableEffectClass' has a wrong offset!");
static_assert(offsetof(UTinkerer, _triggerThreshold) == 0x000428, "Member 'UTinkerer::_triggerThreshold' has a wrong offset!");
static_assert(offsetof(UTinkerer, _distanceThreshold) == 0x00042C, "Member 'UTinkerer::_distanceThreshold' has a wrong offset!");
static_assert(offsetof(UTinkerer, _activationTime) == 0x000430, "Member 'UTinkerer::_activationTime' has a wrong offset!");
static_assert(offsetof(UTinkerer, _generatorActivationTimes) == 0x000440, "Member 'UTinkerer::_generatorActivationTimes' has a wrong offset!");

// Class DBDCompetence.ObliviousEffect
// 0x0000 (0x0390 - 0x0390)
class UObliviousEffect : public UAdjustableCooldownStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObliviousEffect">();
	}
	static class UObliviousEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObliviousEffect>();
	}
};
static_assert(alignof(UObliviousEffect) == 0x000008, "Wrong alignment on UObliviousEffect");
static_assert(sizeof(UObliviousEffect) == 0x000390, "Wrong size on UObliviousEffect");

// Class DBDCompetence.KillerInstinctStatusEffect
// 0x0000 (0x0380 - 0x0380)
class UKillerInstinctStatusEffect : public UStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerInstinctStatusEffect">();
	}
	static class UKillerInstinctStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerInstinctStatusEffect>();
	}
};
static_assert(alignof(UKillerInstinctStatusEffect) == 0x000008, "Wrong alignment on UKillerInstinctStatusEffect");
static_assert(sizeof(UKillerInstinctStatusEffect) == 0x000380, "Wrong size on UKillerInstinctStatusEffect");

// Class DBDCompetence.TimedObliviousEffect
// 0x0000 (0x0390 - 0x0390)
class UTimedObliviousEffect : public UObliviousEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TimedObliviousEffect">();
	}
	static class UTimedObliviousEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimedObliviousEffect>();
	}
};
static_assert(alignof(UTimedObliviousEffect) == 0x000008, "Wrong alignment on UTimedObliviousEffect");
static_assert(sizeof(UTimedObliviousEffect) == 0x000390, "Wrong size on UTimedObliviousEffect");

// Class DBDCompetence.IsCooldownTimerDone
// 0x0018 (0x00F8 - 0x00E0)
class UIsCooldownTimerDone final : public UEventDrivenModifierCondition
{
public:
	uint8                                         Pad_E0[0x18];                                      // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsCooldownTimerDone">();
	}
	static class UIsCooldownTimerDone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsCooldownTimerDone>();
	}
};
static_assert(alignof(UIsCooldownTimerDone) == 0x000008, "Wrong alignment on UIsCooldownTimerDone");
static_assert(sizeof(UIsCooldownTimerDone) == 0x0000F8, "Wrong size on UIsCooldownTimerDone");

// Class DBDCompetence.AddInteractionOnPlayerAction
// 0x0018 (0x0058 - 0x0040)
class UAddInteractionOnPlayerAction final : public UCompetenceAction
{
public:
	TSubclassOf<class UInteractionDefinition>     _interactionClass;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EInteractionOwnerType                         _interactionOwnerType;                             // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractionAttacherComponent*          _interactionAttacherComponent;                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddInteractionOnPlayerAction">();
	}
	static class UAddInteractionOnPlayerAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddInteractionOnPlayerAction>();
	}
};
static_assert(alignof(UAddInteractionOnPlayerAction) == 0x000008, "Wrong alignment on UAddInteractionOnPlayerAction");
static_assert(sizeof(UAddInteractionOnPlayerAction) == 0x000058, "Wrong size on UAddInteractionOnPlayerAction");
static_assert(offsetof(UAddInteractionOnPlayerAction, _interactionClass) == 0x000040, "Member 'UAddInteractionOnPlayerAction::_interactionClass' has a wrong offset!");
static_assert(offsetof(UAddInteractionOnPlayerAction, _interactionOwnerType) == 0x000048, "Member 'UAddInteractionOnPlayerAction::_interactionOwnerType' has a wrong offset!");
static_assert(offsetof(UAddInteractionOnPlayerAction, _interactionAttacherComponent) == 0x000050, "Member 'UAddInteractionOnPlayerAction::_interactionAttacherComponent' has a wrong offset!");

// Class DBDCompetence.DejaVu
// 0x0048 (0x0468 - 0x0420)
class UDejaVu final : public UPerk
{
public:
	int32                                         _generatorsToRevealCount;                          // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _actionSpeeds[0x3];                                // 0x0424(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _generatorAuraColor;                               // 0x0430(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AGenerator*>                     _revealedGenerators;                               // 0x0440(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x18];                                     // 0x0450(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_SetNewGeneratorsToReveal();
	void OnRep_RevealedGenerators();

	float GetActionSpeedsAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DejaVu">();
	}
	static class UDejaVu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDejaVu>();
	}
};
static_assert(alignof(UDejaVu) == 0x000008, "Wrong alignment on UDejaVu");
static_assert(sizeof(UDejaVu) == 0x000468, "Wrong size on UDejaVu");
static_assert(offsetof(UDejaVu, _generatorsToRevealCount) == 0x000420, "Member 'UDejaVu::_generatorsToRevealCount' has a wrong offset!");
static_assert(offsetof(UDejaVu, _actionSpeeds) == 0x000424, "Member 'UDejaVu::_actionSpeeds' has a wrong offset!");
static_assert(offsetof(UDejaVu, _generatorAuraColor) == 0x000430, "Member 'UDejaVu::_generatorAuraColor' has a wrong offset!");
static_assert(offsetof(UDejaVu, _revealedGenerators) == 0x000440, "Member 'UDejaVu::_revealedGenerators' has a wrong offset!");

// Class DBDCompetence.GateBlockerEffect
// 0x0038 (0x03B8 - 0x0380)
class UGateBlockerEffect : public UStatusEffect
{
public:
	float                                         _blockGateLingeringTime;                           // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x34];                                     // 0x0384(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RemoveCantEscapeFlag();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GateBlockerEffect">();
	}
	static class UGateBlockerEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGateBlockerEffect>();
	}
};
static_assert(alignof(UGateBlockerEffect) == 0x000008, "Wrong alignment on UGateBlockerEffect");
static_assert(sizeof(UGateBlockerEffect) == 0x0003B8, "Wrong size on UGateBlockerEffect");
static_assert(offsetof(UGateBlockerEffect, _blockGateLingeringTime) == 0x000380, "Member 'UGateBlockerEffect::_blockGateLingeringTime' has a wrong offset!");

// Class DBDCompetence.TheMettleOfMan
// 0x0058 (0x0478 - 0x0420)
class UTheMettleOfMan final : public UPerk
{
public:
	int32                                         _tokenNeededToActivate[0x3];                       // 0x0420(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _revealOutsideRange[0x3];                          // 0x042C(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _mustBeInjured;                                    // 0x0438(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _enduranceHighlightEffectClass;                    // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _revealToKillerEffectClass;                        // 0x0448(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _numTokenSoFar;                                    // 0x0450(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
