#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDCompetence

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StatSystem_structs.hpp"


namespace SDK::Params
{

// Function DBDCompetence.HighestLevelAndClosestEffectCondition.InitEffectArrays
// 0x0024 (0x0024 - 0x0000)
struct HighestLevelAndClosestEffectCondition_InitEffectArrays final
{
public:
	class FName                                   EffectIDLevel1;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EffectIDLevel2;                                    // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EffectIDLevel3;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HighestLevelAndClosestEffectCondition_InitEffectArrays) == 0x000004, "Wrong alignment on HighestLevelAndClosestEffectCondition_InitEffectArrays");
static_assert(sizeof(HighestLevelAndClosestEffectCondition_InitEffectArrays) == 0x000024, "Wrong size on HighestLevelAndClosestEffectCondition_InitEffectArrays");
static_assert(offsetof(HighestLevelAndClosestEffectCondition_InitEffectArrays, EffectIDLevel1) == 0x000000, "Member 'HighestLevelAndClosestEffectCondition_InitEffectArrays::EffectIDLevel1' has a wrong offset!");
static_assert(offsetof(HighestLevelAndClosestEffectCondition_InitEffectArrays, EffectIDLevel2) == 0x00000C, "Member 'HighestLevelAndClosestEffectCondition_InitEffectArrays::EffectIDLevel2' has a wrong offset!");
static_assert(offsetof(HighestLevelAndClosestEffectCondition_InitEffectArrays, EffectIDLevel3) == 0x000018, "Member 'HighestLevelAndClosestEffectCondition_InitEffectArrays::EffectIDLevel3' has a wrong offset!");

// Function DBDCompetence.HighestLevelAndClosestEffectCondition.SetCurrentEffectLevel
// 0x0004 (0x0004 - 0x0000)
struct HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel) == 0x000004, "Wrong alignment on HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel");
static_assert(sizeof(HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel) == 0x000004, "Wrong size on HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel");
static_assert(offsetof(HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel, Level) == 0x000000, "Member 'HighestLevelAndClosestEffectCondition_SetCurrentEffectLevel::Level' has a wrong offset!");

// Function DBDCompetence.IsHighestLevelAndClosestOriginatingEffect.OnStatusEffectAddedOrRemoved
// 0x0010 (0x0010 - 0x0000)
struct IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved final
{
public:
	class UStatusEffect*                          Effect;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved) == 0x000008, "Wrong alignment on IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved");
static_assert(sizeof(IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved) == 0x000010, "Wrong size on IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved");
static_assert(offsetof(IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved, Effect) == 0x000000, "Member 'IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved::Effect' has a wrong offset!");
static_assert(offsetof(IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved, Valid) == 0x000008, "Member 'IsHighestLevelAndClosestOriginatingEffect_OnStatusEffectAddedOrRemoved::Valid' has a wrong offset!");

// Function DBDCompetence.HexPerk.Authority_RevealCurseToAllSurvivors
// 0x0001 (0x0001 - 0x0000)
struct HexPerk_Authority_RevealCurseToAllSurvivors final
{
public:
	bool                                          Revealed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HexPerk_Authority_RevealCurseToAllSurvivors) == 0x000001, "Wrong alignment on HexPerk_Authority_RevealCurseToAllSurvivors");
static_assert(sizeof(HexPerk_Authority_RevealCurseToAllSurvivors) == 0x000001, "Wrong size on HexPerk_Authority_RevealCurseToAllSurvivors");
static_assert(offsetof(HexPerk_Authority_RevealCurseToAllSurvivors, Revealed) == 0x000000, "Member 'HexPerk_Authority_RevealCurseToAllSurvivors::Revealed' has a wrong offset!");

// Function DBDCompetence.HexPerk.Authority_SetCurseRevealedToPlayer
// 0x0010 (0x0010 - 0x0000)
struct HexPerk_Authority_SetCurseRevealedToPlayer final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Revealed;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HexPerk_Authority_SetCurseRevealedToPlayer) == 0x000008, "Wrong alignment on HexPerk_Authority_SetCurseRevealedToPlayer");
static_assert(sizeof(HexPerk_Authority_SetCurseRevealedToPlayer) == 0x000010, "Wrong size on HexPerk_Authority_SetCurseRevealedToPlayer");
static_assert(offsetof(HexPerk_Authority_SetCurseRevealedToPlayer, Player) == 0x000000, "Member 'HexPerk_Authority_SetCurseRevealedToPlayer::Player' has a wrong offset!");
static_assert(offsetof(HexPerk_Authority_SetCurseRevealedToPlayer, Revealed) == 0x000008, "Member 'HexPerk_Authority_SetCurseRevealedToPlayer::Revealed' has a wrong offset!");

// Function DBDCompetence.HexPerk.IsCurseRevealedToPlayer
// 0x0010 (0x0010 - 0x0000)
struct HexPerk_IsCurseRevealedToPlayer final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HexPerk_IsCurseRevealedToPlayer) == 0x000008, "Wrong alignment on HexPerk_IsCurseRevealedToPlayer");
static_assert(sizeof(HexPerk_IsCurseRevealedToPlayer) == 0x000010, "Wrong size on HexPerk_IsCurseRevealedToPlayer");
static_assert(offsetof(HexPerk_IsCurseRevealedToPlayer, Player) == 0x000000, "Member 'HexPerk_IsCurseRevealedToPlayer::Player' has a wrong offset!");
static_assert(offsetof(HexPerk_IsCurseRevealedToPlayer, ReturnValue) == 0x000008, "Member 'HexPerk_IsCurseRevealedToPlayer::ReturnValue' has a wrong offset!");

// Function DBDCompetence.DyingLight.OnObsessionChanged
// 0x0010 (0x0010 - 0x0000)
struct DyingLight_OnObsessionChanged final
{
public:
	class ACamperPlayer*                          NewObsession;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACamperPlayer*                          PreviousObsession;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DyingLight_OnObsessionChanged) == 0x000008, "Wrong alignment on DyingLight_OnObsessionChanged");
static_assert(sizeof(DyingLight_OnObsessionChanged) == 0x000010, "Wrong size on DyingLight_OnObsessionChanged");
static_assert(offsetof(DyingLight_OnObsessionChanged, NewObsession) == 0x000000, "Member 'DyingLight_OnObsessionChanged::NewObsession' has a wrong offset!");
static_assert(offsetof(DyingLight_OnObsessionChanged, PreviousObsession) == 0x000008, "Member 'DyingLight_OnObsessionChanged::PreviousObsession' has a wrong offset!");

// Function DBDCompetence.DyingLight.GetActionSpeedPenaltyPerTokenAtLevel
// 0x0004 (0x0004 - 0x0000)
struct DyingLight_GetActionSpeedPenaltyPerTokenAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DyingLight_GetActionSpeedPenaltyPerTokenAtLevel) == 0x000004, "Wrong alignment on DyingLight_GetActionSpeedPenaltyPerTokenAtLevel");
static_assert(sizeof(DyingLight_GetActionSpeedPenaltyPerTokenAtLevel) == 0x000004, "Wrong size on DyingLight_GetActionSpeedPenaltyPerTokenAtLevel");
static_assert(offsetof(DyingLight_GetActionSpeedPenaltyPerTokenAtLevel, ReturnValue) == 0x000000, "Member 'DyingLight_GetActionSpeedPenaltyPerTokenAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.DyingLight.GetObsessionActionSpeedBonus
// 0x0004 (0x0004 - 0x0000)
struct DyingLight_GetObsessionActionSpeedBonus final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DyingLight_GetObsessionActionSpeedBonus) == 0x000004, "Wrong alignment on DyingLight_GetObsessionActionSpeedBonus");
static_assert(sizeof(DyingLight_GetObsessionActionSpeedBonus) == 0x000004, "Wrong size on DyingLight_GetObsessionActionSpeedBonus");
static_assert(offsetof(DyingLight_GetObsessionActionSpeedBonus, ReturnValue) == 0x000000, "Member 'DyingLight_GetObsessionActionSpeedBonus::ReturnValue' has a wrong offset!");

// Function DBDCompetence.OnEventBaseAddon.OnEventFired
// 0x0030 (0x0030 - 0x0000)
struct OnEventBaseAddon_OnEventFired final
{
public:
	struct FGameEventData                         GameEventData;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnEventBaseAddon_OnEventFired) == 0x000008, "Wrong alignment on OnEventBaseAddon_OnEventFired");
static_assert(sizeof(OnEventBaseAddon_OnEventFired) == 0x000030, "Wrong size on OnEventBaseAddon_OnEventFired");
static_assert(offsetof(OnEventBaseAddon_OnEventFired, GameEventData) == 0x000000, "Member 'OnEventBaseAddon_OnEventFired::GameEventData' has a wrong offset!");

// Function DBDCompetence.BaseLingeringStatusEffect.SetLingerDuration
// 0x0004 (0x0004 - 0x0000)
struct BaseLingeringStatusEffect_SetLingerDuration final
{
public:
	float                                         LingerDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseLingeringStatusEffect_SetLingerDuration) == 0x000004, "Wrong alignment on BaseLingeringStatusEffect_SetLingerDuration");
static_assert(sizeof(BaseLingeringStatusEffect_SetLingerDuration) == 0x000004, "Wrong size on BaseLingeringStatusEffect_SetLingerDuration");
static_assert(offsetof(BaseLingeringStatusEffect_SetLingerDuration, LingerDuration) == 0x000000, "Member 'BaseLingeringStatusEffect_SetLingerDuration::LingerDuration' has a wrong offset!");

// Function DBDCompetence.KindredPerk.GetKillerAuraRevealRangeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct KindredPerk_GetKillerAuraRevealRangeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KindredPerk_GetKillerAuraRevealRangeAtLevel) == 0x000004, "Wrong alignment on KindredPerk_GetKillerAuraRevealRangeAtLevel");
static_assert(sizeof(KindredPerk_GetKillerAuraRevealRangeAtLevel) == 0x000004, "Wrong size on KindredPerk_GetKillerAuraRevealRangeAtLevel");
static_assert(offsetof(KindredPerk_GetKillerAuraRevealRangeAtLevel, ReturnValue) == 0x000000, "Member 'KindredPerk_GetKillerAuraRevealRangeAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.Adrenaline.Multicast_DispatchAdrenalineEvents
// 0x0008 (0x0008 - 0x0000)
struct Adrenaline_Multicast_DispatchAdrenalineEvents final
{
public:
	bool                                          IsHealthy;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HealAmount;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Adrenaline_Multicast_DispatchAdrenalineEvents) == 0x000004, "Wrong alignment on Adrenaline_Multicast_DispatchAdrenalineEvents");
static_assert(sizeof(Adrenaline_Multicast_DispatchAdrenalineEvents) == 0x000008, "Wrong size on Adrenaline_Multicast_DispatchAdrenalineEvents");
static_assert(offsetof(Adrenaline_Multicast_DispatchAdrenalineEvents, IsHealthy) == 0x000000, "Member 'Adrenaline_Multicast_DispatchAdrenalineEvents::IsHealthy' has a wrong offset!");
static_assert(offsetof(Adrenaline_Multicast_DispatchAdrenalineEvents, HealAmount) == 0x000004, "Member 'Adrenaline_Multicast_DispatchAdrenalineEvents::HealAmount' has a wrong offset!");

// Function DBDCompetence.Adrenaline.GetExhaustionDuration
// 0x0004 (0x0004 - 0x0000)
struct Adrenaline_GetExhaustionDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Adrenaline_GetExhaustionDuration) == 0x000004, "Wrong alignment on Adrenaline_GetExhaustionDuration");
static_assert(sizeof(Adrenaline_GetExhaustionDuration) == 0x000004, "Wrong size on Adrenaline_GetExhaustionDuration");
static_assert(offsetof(Adrenaline_GetExhaustionDuration, ReturnValue) == 0x000000, "Member 'Adrenaline_GetExhaustionDuration::ReturnValue' has a wrong offset!");

// Function DBDCompetence.HideSurvivorVFXForKillerEffect.HideVFX
// 0x0001 (0x0001 - 0x0000)
struct HideSurvivorVFXForKillerEffect_HideVFX final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HideSurvivorVFXForKillerEffect_HideVFX) == 0x000001, "Wrong alignment on HideSurvivorVFXForKillerEffect_HideVFX");
static_assert(sizeof(HideSurvivorVFXForKillerEffect_HideVFX) == 0x000001, "Wrong size on HideSurvivorVFXForKillerEffect_HideVFX");
static_assert(offsetof(HideSurvivorVFXForKillerEffect_HideVFX, Hide) == 0x000000, "Member 'HideSurvivorVFXForKillerEffect_HideVFX::Hide' has a wrong offset!");

// Function DBDCompetence.AnyActorPairQueryRangeIsTrue.OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct AnyActorPairQueryRangeIsTrue_OnInRangeChanged final
{
public:
	bool                                          InRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnyActorPairQueryRangeIsTrue_OnInRangeChanged) == 0x000001, "Wrong alignment on AnyActorPairQueryRangeIsTrue_OnInRangeChanged");
static_assert(sizeof(AnyActorPairQueryRangeIsTrue_OnInRangeChanged) == 0x000001, "Wrong size on AnyActorPairQueryRangeIsTrue_OnInRangeChanged");
static_assert(offsetof(AnyActorPairQueryRangeIsTrue_OnInRangeChanged, InRange) == 0x000000, "Member 'AnyActorPairQueryRangeIsTrue_OnInRangeChanged::InRange' has a wrong offset!");

// Function DBDCompetence.BlessedStatusEffect.Authority_OnSurvivorRemovedFromGame
// 0x0008 (0x0008 - 0x0000)
struct BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame) == 0x000008, "Wrong alignment on BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame");
static_assert(sizeof(BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame) == 0x000008, "Wrong size on BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame");
static_assert(offsetof(BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame, Survivor) == 0x000000, "Member 'BlessedStatusEffect_Authority_OnSurvivorRemovedFromGame::Survivor' has a wrong offset!");

// Function DBDCompetence.BlessedStatusEffect.GetBoonTotemBlessingRange
// 0x0004 (0x0004 - 0x0000)
struct BlessedStatusEffect_GetBoonTotemBlessingRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlessedStatusEffect_GetBoonTotemBlessingRange) == 0x000004, "Wrong alignment on BlessedStatusEffect_GetBoonTotemBlessingRange");
static_assert(sizeof(BlessedStatusEffect_GetBoonTotemBlessingRange) == 0x000004, "Wrong size on BlessedStatusEffect_GetBoonTotemBlessingRange");
static_assert(offsetof(BlessedStatusEffect_GetBoonTotemBlessingRange, ReturnValue) == 0x000000, "Member 'BlessedStatusEffect_GetBoonTotemBlessingRange::ReturnValue' has a wrong offset!");

// Function DBDCompetence.BlessedStatusEffect.GetBoundTotem
// 0x0008 (0x0008 - 0x0000)
struct BlessedStatusEffect_GetBoundTotem final
{
public:
	class ATotem*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlessedStatusEffect_GetBoundTotem) == 0x000008, "Wrong alignment on BlessedStatusEffect_GetBoundTotem");
static_assert(sizeof(BlessedStatusEffect_GetBoundTotem) == 0x000008, "Wrong size on BlessedStatusEffect_GetBoundTotem");
static_assert(offsetof(BlessedStatusEffect_GetBoundTotem, ReturnValue) == 0x000000, "Member 'BlessedStatusEffect_GetBoundTotem::ReturnValue' has a wrong offset!");

// Function DBDCompetence.ThrillingTremors.GetCooldownAtLevel
// 0x0004 (0x0004 - 0x0000)
struct ThrillingTremors_GetCooldownAtLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThrillingTremors_GetCooldownAtLevel) == 0x000004, "Wrong alignment on ThrillingTremors_GetCooldownAtLevel");
static_assert(sizeof(ThrillingTremors_GetCooldownAtLevel) == 0x000004, "Wrong size on ThrillingTremors_GetCooldownAtLevel");
static_assert(offsetof(ThrillingTremors_GetCooldownAtLevel, ReturnValue) == 0x000000, "Member 'ThrillingTremors_GetCooldownAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.ThrillingTremors.GetDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct ThrillingTremors_GetDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThrillingTremors_GetDurationAtLevel) == 0x000004, "Wrong alignment on ThrillingTremors_GetDurationAtLevel");
static_assert(sizeof(ThrillingTremors_GetDurationAtLevel) == 0x000004, "Wrong size on ThrillingTremors_GetDurationAtLevel");
static_assert(offsetof(ThrillingTremors_GetDurationAtLevel, ReturnValue) == 0x000000, "Member 'ThrillingTremors_GetDurationAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.IsPlayerPerformingInteraction.SetInteractionSemantics
// 0x0020 (0x0020 - 0x0000)
struct IsPlayerPerformingInteraction_SetInteractionSemantics final
{
public:
	struct FGameplayTagContainer                  InteractionSemantics;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerPerformingInteraction_SetInteractionSemantics) == 0x000008, "Wrong alignment on IsPlayerPerformingInteraction_SetInteractionSemantics");
static_assert(sizeof(IsPlayerPerformingInteraction_SetInteractionSemantics) == 0x000020, "Wrong size on IsPlayerPerformingInteraction_SetInteractionSemantics");
static_assert(offsetof(IsPlayerPerformingInteraction_SetInteractionSemantics, InteractionSemantics) == 0x000000, "Member 'IsPlayerPerformingInteraction_SetInteractionSemantics::InteractionSemantics' has a wrong offset!");

// Function DBDCompetence.IsPlayerPerformingInteraction.UpdateIsTrue
// 0x0008 (0x0008 - 0x0000)
struct IsPlayerPerformingInteraction_UpdateIsTrue final
{
public:
	class UInteractionDefinition*                 InteractionDefinition;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerPerformingInteraction_UpdateIsTrue) == 0x000008, "Wrong alignment on IsPlayerPerformingInteraction_UpdateIsTrue");
static_assert(sizeof(IsPlayerPerformingInteraction_UpdateIsTrue) == 0x000008, "Wrong size on IsPlayerPerformingInteraction_UpdateIsTrue");
static_assert(offsetof(IsPlayerPerformingInteraction_UpdateIsTrue, InteractionDefinition) == 0x000000, "Member 'IsPlayerPerformingInteraction_UpdateIsTrue::InteractionDefinition' has a wrong offset!");

// Function DBDCompetence.Tinkerer.Authority_OnGeneratorChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct Tinkerer_Authority_OnGeneratorChargePercentChanged final
{
public:
	class UChargeableComponent*                   ChargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Tinkerer_Authority_OnGeneratorChargePercentChanged) == 0x000008, "Wrong alignment on Tinkerer_Authority_OnGeneratorChargePercentChanged");
static_assert(sizeof(Tinkerer_Authority_OnGeneratorChargePercentChanged) == 0x000010, "Wrong size on Tinkerer_Authority_OnGeneratorChargePercentChanged");
static_assert(offsetof(Tinkerer_Authority_OnGeneratorChargePercentChanged, ChargeableComponent) == 0x000000, "Member 'Tinkerer_Authority_OnGeneratorChargePercentChanged::ChargeableComponent' has a wrong offset!");
static_assert(offsetof(Tinkerer_Authority_OnGeneratorChargePercentChanged, PercentCompletionChange) == 0x000008, "Member 'Tinkerer_Authority_OnGeneratorChargePercentChanged::PercentCompletionChange' has a wrong offset!");
static_assert(offsetof(Tinkerer_Authority_OnGeneratorChargePercentChanged, TotalPercentComplete) == 0x00000C, "Member 'Tinkerer_Authority_OnGeneratorChargePercentChanged::TotalPercentComplete' has a wrong offset!");

// Function DBDCompetence.Tinkerer.Authority_OnGeneratorReachedThreshold
// 0x0008 (0x0008 - 0x0000)
struct Tinkerer_Authority_OnGeneratorReachedThreshold final
{
public:
	class AGenerator*                             Generator;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Tinkerer_Authority_OnGeneratorReachedThreshold) == 0x000008, "Wrong alignment on Tinkerer_Authority_OnGeneratorReachedThreshold");
static_assert(sizeof(Tinkerer_Authority_OnGeneratorReachedThreshold) == 0x000008, "Wrong size on Tinkerer_Authority_OnGeneratorReachedThreshold");
static_assert(offsetof(Tinkerer_Authority_OnGeneratorReachedThreshold, Generator) == 0x000000, "Member 'Tinkerer_Authority_OnGeneratorReachedThreshold::Generator' has a wrong offset!");

// Function DBDCompetence.Tinkerer.Authority_OnUndetectableAttackSuccessNearActiveGenerator
// 0x0010 (0x0010 - 0x0000)
struct Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator final
{
public:
	class ADBDPlayer*                             Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator) == 0x000008, "Wrong alignment on Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator");
static_assert(sizeof(Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator) == 0x000010, "Wrong size on Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator");
static_assert(offsetof(Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator, Instigator) == 0x000000, "Member 'Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator::Instigator' has a wrong offset!");
static_assert(offsetof(Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator, Target) == 0x000008, "Member 'Tinkerer_Authority_OnUndetectableAttackSuccessNearActiveGenerator::Target' has a wrong offset!");

// Function DBDCompetence.Tinkerer.Authority_OnUndetectableGeneratorInterrupt
// 0x0010 (0x0010 - 0x0000)
struct Tinkerer_Authority_OnUndetectableGeneratorInterrupt final
{
public:
	class ADBDPlayer*                             Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Tinkerer_Authority_OnUndetectableGeneratorInterrupt) == 0x000008, "Wrong alignment on Tinkerer_Authority_OnUndetectableGeneratorInterrupt");
static_assert(sizeof(Tinkerer_Authority_OnUndetectableGeneratorInterrupt) == 0x000010, "Wrong size on Tinkerer_Authority_OnUndetectableGeneratorInterrupt");
static_assert(offsetof(Tinkerer_Authority_OnUndetectableGeneratorInterrupt, Instigator) == 0x000000, "Member 'Tinkerer_Authority_OnUndetectableGeneratorInterrupt::Instigator' has a wrong offset!");
static_assert(offsetof(Tinkerer_Authority_OnUndetectableGeneratorInterrupt, Target) == 0x000008, "Member 'Tinkerer_Authority_OnUndetectableGeneratorInterrupt::Target' has a wrong offset!");

// Function DBDCompetence.Tinkerer.GetActivationTimeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct Tinkerer_GetActivationTimeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Tinkerer_GetActivationTimeAtLevel) == 0x000004, "Wrong alignment on Tinkerer_GetActivationTimeAtLevel");
static_assert(sizeof(Tinkerer_GetActivationTimeAtLevel) == 0x000004, "Wrong size on Tinkerer_GetActivationTimeAtLevel");
static_assert(offsetof(Tinkerer_GetActivationTimeAtLevel, ReturnValue) == 0x000000, "Member 'Tinkerer_GetActivationTimeAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.Tinkerer.GetTriggerThreshold
// 0x0004 (0x0004 - 0x0000)
struct Tinkerer_GetTriggerThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Tinkerer_GetTriggerThreshold) == 0x000004, "Wrong alignment on Tinkerer_GetTriggerThreshold");
static_assert(sizeof(Tinkerer_GetTriggerThreshold) == 0x000004, "Wrong size on Tinkerer_GetTriggerThreshold");
static_assert(offsetof(Tinkerer_GetTriggerThreshold, ReturnValue) == 0x000000, "Member 'Tinkerer_GetTriggerThreshold::ReturnValue' has a wrong offset!");

// Function DBDCompetence.DejaVu.GetActionSpeedsAtLevel
// 0x0004 (0x0004 - 0x0000)
struct DejaVu_GetActionSpeedsAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DejaVu_GetActionSpeedsAtLevel) == 0x000004, "Wrong alignment on DejaVu_GetActionSpeedsAtLevel");
static_assert(sizeof(DejaVu_GetActionSpeedsAtLevel) == 0x000004, "Wrong size on DejaVu_GetActionSpeedsAtLevel");
static_assert(offsetof(DejaVu_GetActionSpeedsAtLevel, ReturnValue) == 0x000000, "Member 'DejaVu_GetActionSpeedsAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.TheMettleOfMan.GetRevealOutsideRangeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct TheMettleOfMan_GetRevealOutsideRangeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TheMettleOfMan_GetRevealOutsideRangeAtLevel) == 0x000004, "Wrong alignment on TheMettleOfMan_GetRevealOutsideRangeAtLevel");
static_assert(sizeof(TheMettleOfMan_GetRevealOutsideRangeAtLevel) == 0x000004, "Wrong size on TheMettleOfMan_GetRevealOutsideRangeAtLevel");
static_assert(offsetof(TheMettleOfMan_GetRevealOutsideRangeAtLevel, ReturnValue) == 0x000000, "Member 'TheMettleOfMan_GetRevealOutsideRangeAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.DecisiveStrike.Multicast_SetTriggerOnNextPickup
// 0x0001 (0x0001 - 0x0000)
struct DecisiveStrike_Multicast_SetTriggerOnNextPickup final
{
public:
	bool                                          TriggerOnNextPickup;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecisiveStrike_Multicast_SetTriggerOnNextPickup) == 0x000001, "Wrong alignment on DecisiveStrike_Multicast_SetTriggerOnNextPickup");
static_assert(sizeof(DecisiveStrike_Multicast_SetTriggerOnNextPickup) == 0x000001, "Wrong size on DecisiveStrike_Multicast_SetTriggerOnNextPickup");
static_assert(offsetof(DecisiveStrike_Multicast_SetTriggerOnNextPickup, TriggerOnNextPickup) == 0x000000, "Member 'DecisiveStrike_Multicast_SetTriggerOnNextPickup::TriggerOnNextPickup' has a wrong offset!");

// Function DBDCompetence.DecisiveStrike.OnOwnerPickedUp
// 0x0008 (0x0008 - 0x0000)
struct DecisiveStrike_OnOwnerPickedUp final
{
public:
	class ADBDPlayer*                             Picker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecisiveStrike_OnOwnerPickedUp) == 0x000008, "Wrong alignment on DecisiveStrike_OnOwnerPickedUp");
static_assert(sizeof(DecisiveStrike_OnOwnerPickedUp) == 0x000008, "Wrong size on DecisiveStrike_OnOwnerPickedUp");
static_assert(offsetof(DecisiveStrike_OnOwnerPickedUp, Picker) == 0x000000, "Member 'DecisiveStrike_OnOwnerPickedUp::Picker' has a wrong offset!");

// Function DBDCompetence.DecisiveStrike.OnPickUpEnded
// 0x0008 (0x0008 - 0x0000)
struct DecisiveStrike_OnPickUpEnded final
{
public:
	class ADBDPlayer*                             Picker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecisiveStrike_OnPickUpEnded) == 0x000008, "Wrong alignment on DecisiveStrike_OnPickUpEnded");
static_assert(sizeof(DecisiveStrike_OnPickUpEnded) == 0x000008, "Wrong size on DecisiveStrike_OnPickUpEnded");
static_assert(offsetof(DecisiveStrike_OnPickUpEnded, Picker) == 0x000000, "Member 'DecisiveStrike_OnPickUpEnded::Picker' has a wrong offset!");

// Function DBDCompetence.DecisiveStrike.OnSkillCheck
// 0x0010 (0x0010 - 0x0000)
struct DecisiveStrike_OnSkillCheck final
{
public:
	bool                                          HadInput;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bonus;                                             // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkillCheckCustomType                         Type;                                              // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecisiveStrike_OnSkillCheck) == 0x000008, "Wrong alignment on DecisiveStrike_OnSkillCheck");
static_assert(sizeof(DecisiveStrike_OnSkillCheck) == 0x000010, "Wrong size on DecisiveStrike_OnSkillCheck");
static_assert(offsetof(DecisiveStrike_OnSkillCheck, HadInput) == 0x000000, "Member 'DecisiveStrike_OnSkillCheck::HadInput' has a wrong offset!");
static_assert(offsetof(DecisiveStrike_OnSkillCheck, Success) == 0x000001, "Member 'DecisiveStrike_OnSkillCheck::Success' has a wrong offset!");
static_assert(offsetof(DecisiveStrike_OnSkillCheck, Bonus) == 0x000002, "Member 'DecisiveStrike_OnSkillCheck::Bonus' has a wrong offset!");
static_assert(offsetof(DecisiveStrike_OnSkillCheck, Type) == 0x000003, "Member 'DecisiveStrike_OnSkillCheck::Type' has a wrong offset!");
static_assert(offsetof(DecisiveStrike_OnSkillCheck, Player) == 0x000008, "Member 'DecisiveStrike_OnSkillCheck::Player' has a wrong offset!");

// Function DBDCompetence.DecisiveStrike.Server_SetTriggerOnNextPickup
// 0x0001 (0x0001 - 0x0000)
struct DecisiveStrike_Server_SetTriggerOnNextPickup final
{
public:
	bool                                          TriggerOnNextPickup;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecisiveStrike_Server_SetTriggerOnNextPickup) == 0x000001, "Wrong alignment on DecisiveStrike_Server_SetTriggerOnNextPickup");
static_assert(sizeof(DecisiveStrike_Server_SetTriggerOnNextPickup) == 0x000001, "Wrong size on DecisiveStrike_Server_SetTriggerOnNextPickup");
static_assert(offsetof(DecisiveStrike_Server_SetTriggerOnNextPickup, TriggerOnNextPickup) == 0x000000, "Member 'DecisiveStrike_Server_SetTriggerOnNextPickup::TriggerOnNextPickup' has a wrong offset!");

// Function DBDCompetence.DecisiveStrike.GetDurationAfterUnhook
// 0x0004 (0x0004 - 0x0000)
struct DecisiveStrike_GetDurationAfterUnhook final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DecisiveStrike_GetDurationAfterUnhook) == 0x000004, "Wrong alignment on DecisiveStrike_GetDurationAfterUnhook");
static_assert(sizeof(DecisiveStrike_GetDurationAfterUnhook) == 0x000004, "Wrong size on DecisiveStrike_GetDurationAfterUnhook");
static_assert(offsetof(DecisiveStrike_GetDurationAfterUnhook, ReturnValue) == 0x000000, "Member 'DecisiveStrike_GetDurationAfterUnhook::ReturnValue' has a wrong offset!");

// Function DBDCompetence.BoonPerk.Authority_OnSurvivorRemoved
// 0x0008 (0x0008 - 0x0000)
struct BoonPerk_Authority_OnSurvivorRemoved final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoonPerk_Authority_OnSurvivorRemoved) == 0x000008, "Wrong alignment on BoonPerk_Authority_OnSurvivorRemoved");
static_assert(sizeof(BoonPerk_Authority_OnSurvivorRemoved) == 0x000008, "Wrong size on BoonPerk_Authority_OnSurvivorRemoved");
static_assert(offsetof(BoonPerk_Authority_OnSurvivorRemoved, Survivor) == 0x000000, "Member 'BoonPerk_Authority_OnSurvivorRemoved::Survivor' has a wrong offset!");

// Function DBDCompetence.DarkSense.Authority_OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct DarkSense_Authority_OnInRangeChanged final
{
public:
	bool                                          InRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkSense_Authority_OnInRangeChanged) == 0x000001, "Wrong alignment on DarkSense_Authority_OnInRangeChanged");
static_assert(sizeof(DarkSense_Authority_OnInRangeChanged) == 0x000001, "Wrong size on DarkSense_Authority_OnInRangeChanged");
static_assert(offsetof(DarkSense_Authority_OnInRangeChanged, InRange) == 0x000000, "Member 'DarkSense_Authority_OnInRangeChanged::InRange' has a wrong offset!");

// Function DBDCompetence.DarkSense.GetDarkSenseRevealRange
// 0x0004 (0x0004 - 0x0000)
struct DarkSense_GetDarkSenseRevealRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkSense_GetDarkSenseRevealRange) == 0x000004, "Wrong alignment on DarkSense_GetDarkSenseRevealRange");
static_assert(sizeof(DarkSense_GetDarkSenseRevealRange) == 0x000004, "Wrong size on DarkSense_GetDarkSenseRevealRange");
static_assert(offsetof(DarkSense_GetDarkSenseRevealRange, ReturnValue) == 0x000000, "Member 'DarkSense_GetDarkSenseRevealRange::ReturnValue' has a wrong offset!");

// Function DBDCompetence.DarkSense.GetKillerRevealDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct DarkSense_GetKillerRevealDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarkSense_GetKillerRevealDurationAtLevel) == 0x000004, "Wrong alignment on DarkSense_GetKillerRevealDurationAtLevel");
static_assert(sizeof(DarkSense_GetKillerRevealDurationAtLevel) == 0x000004, "Wrong size on DarkSense_GetKillerRevealDurationAtLevel");
static_assert(offsetof(DarkSense_GetKillerRevealDurationAtLevel, ReturnValue) == 0x000000, "Member 'DarkSense_GetKillerRevealDurationAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.PlayersInRangePerk.GetPerkRange
// 0x0004 (0x0004 - 0x0000)
struct PlayersInRangePerk_GetPerkRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayersInRangePerk_GetPerkRange) == 0x000004, "Wrong alignment on PlayersInRangePerk_GetPerkRange");
static_assert(sizeof(PlayersInRangePerk_GetPerkRange) == 0x000004, "Wrong size on PlayersInRangePerk_GetPerkRange");
static_assert(offsetof(PlayersInRangePerk_GetPerkRange, ReturnValue) == 0x000000, "Member 'PlayersInRangePerk_GetPerkRange::ReturnValue' has a wrong offset!");

// Function DBDCompetence.HemorrhageStatusEffect.Authority_OnSurvivorHealed
// 0x0018 (0x0018 - 0x0000)
struct HemorrhageStatusEffect_Authority_OnSurvivorHealed final
{
public:
	struct FCamperHealResult                      HealResult;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HemorrhageStatusEffect_Authority_OnSurvivorHealed) == 0x000008, "Wrong alignment on HemorrhageStatusEffect_Authority_OnSurvivorHealed");
static_assert(sizeof(HemorrhageStatusEffect_Authority_OnSurvivorHealed) == 0x000018, "Wrong size on HemorrhageStatusEffect_Authority_OnSurvivorHealed");
static_assert(offsetof(HemorrhageStatusEffect_Authority_OnSurvivorHealed, HealResult) == 0x000000, "Member 'HemorrhageStatusEffect_Authority_OnSurvivorHealed::HealResult' has a wrong offset!");

// Function DBDCompetence.HemorrhageStatusEffect.OnStoppedHealing
// 0x0010 (0x0010 - 0x0000)
struct HemorrhageStatusEffect_OnStoppedHealing final
{
public:
	const class ADBDPlayer*                       Instigator;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ADBDPlayer*                       Target;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HemorrhageStatusEffect_OnStoppedHealing) == 0x000008, "Wrong alignment on HemorrhageStatusEffect_OnStoppedHealing");
static_assert(sizeof(HemorrhageStatusEffect_OnStoppedHealing) == 0x000010, "Wrong size on HemorrhageStatusEffect_OnStoppedHealing");
static_assert(offsetof(HemorrhageStatusEffect_OnStoppedHealing, Instigator) == 0x000000, "Member 'HemorrhageStatusEffect_OnStoppedHealing::Instigator' has a wrong offset!");
static_assert(offsetof(HemorrhageStatusEffect_OnStoppedHealing, Target) == 0x000008, "Member 'HemorrhageStatusEffect_OnStoppedHealing::Target' has a wrong offset!");

// Function DBDCompetence.IsBestProveThyselfEffectInRange.OnInRangeChanged
// 0x0010 (0x0010 - 0x0000)
struct IsBestProveThyselfEffectInRange_OnInRangeChanged final
{
public:
	bool                                          InRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProveThyselfEffect*                    ProveThyselfEffect;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsBestProveThyselfEffectInRange_OnInRangeChanged) == 0x000008, "Wrong alignment on IsBestProveThyselfEffectInRange_OnInRangeChanged");
static_assert(sizeof(IsBestProveThyselfEffectInRange_OnInRangeChanged) == 0x000010, "Wrong size on IsBestProveThyselfEffectInRange_OnInRangeChanged");
static_assert(offsetof(IsBestProveThyselfEffectInRange_OnInRangeChanged, InRange) == 0x000000, "Member 'IsBestProveThyselfEffectInRange_OnInRangeChanged::InRange' has a wrong offset!");
static_assert(offsetof(IsBestProveThyselfEffectInRange_OnInRangeChanged, ProveThyselfEffect) == 0x000008, "Member 'IsBestProveThyselfEffectInRange_OnInRangeChanged::ProveThyselfEffect' has a wrong offset!");

// Function DBDCompetence.InfectiousFright.RevealSurvivorLocation
// 0x0008 (0x0008 - 0x0000)
struct InfectiousFright_RevealSurvivorLocation final
{
public:
	class ACamperPlayer*                          Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InfectiousFright_RevealSurvivorLocation) == 0x000008, "Wrong alignment on InfectiousFright_RevealSurvivorLocation");
static_assert(sizeof(InfectiousFright_RevealSurvivorLocation) == 0x000008, "Wrong size on InfectiousFright_RevealSurvivorLocation");
static_assert(offsetof(InfectiousFright_RevealSurvivorLocation, Target) == 0x000000, "Member 'InfectiousFright_RevealSurvivorLocation::Target' has a wrong offset!");

// Function DBDCompetence.CruelConfinement.GetBlockDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct CruelConfinement_GetBlockDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CruelConfinement_GetBlockDurationAtLevel) == 0x000004, "Wrong alignment on CruelConfinement_GetBlockDurationAtLevel");
static_assert(sizeof(CruelConfinement_GetBlockDurationAtLevel) == 0x000004, "Wrong size on CruelConfinement_GetBlockDurationAtLevel");
static_assert(offsetof(CruelConfinement_GetBlockDurationAtLevel, ReturnValue) == 0x000000, "Member 'CruelConfinement_GetBlockDurationAtLevel::ReturnValue' has a wrong offset!");

// Function DBDCompetence.IsInRangeOfOriginatingPlayer.OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct IsInRangeOfOriginatingPlayer_OnInRangeChanged final
{
public:
	bool                                          InRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsInRangeOfOriginatingPlayer_OnInRangeChanged) == 0x000001, "Wrong alignment on IsInRangeOfOriginatingPlayer_OnInRangeChanged");
static_assert(sizeof(IsInRangeOfOriginatingPlayer_OnInRangeChanged) == 0x000001, "Wrong size on IsInRangeOfOriginatingPlayer_OnInRangeChanged");
static_assert(offsetof(IsInRangeOfOriginatingPlayer_OnInRangeChanged, InRange) == 0x000000, "Member 'IsInRangeOfOriginatingPlayer_OnInRangeChanged::InRange' has a wrong offset!");

// Function DBDCompetence.IsPlayerLookingAtKillerCondition.OnPawnControllerChanged
// 0x0010 (0x0010 - 0x0000)
struct IsPlayerLookingAtKillerCondition_OnPawnControllerChanged final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            Controller;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerLookingAtKillerCondition_OnPawnControllerChanged) == 0x000008, "Wrong alignment on IsPlayerLookingAtKillerCondition_OnPawnControllerChanged");
static_assert(sizeof(IsPlayerLookingAtKillerCondition_OnPawnControllerChanged) == 0x000010, "Wrong size on IsPlayerLookingAtKillerCondition_OnPawnControllerChanged");
static_assert(offsetof(IsPlayerLookingAtKillerCondition_OnPawnControllerChanged, Pawn) == 0x000000, "Member 'IsPlayerLookingAtKillerCondition_OnPawnControllerChanged::Pawn' has a wrong offset!");
static_assert(offsetof(IsPlayerLookingAtKillerCondition_OnPawnControllerChanged, Controller) == 0x000008, "Member 'IsPlayerLookingAtKillerCondition_OnPawnControllerChanged::Controller' has a wrong offset!");

// Function DBDCompetence.IsPlayerLookingAtKillerCondition.OnRep_IsLookingTowards
// 0x0001 (0x0001 - 0x0000)
struct IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards final
{
public:
	bool                                          IsLookingTowards;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards) == 0x000001, "Wrong alignment on IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards");
static_assert(sizeof(IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards) == 0x000001, "Wrong size on IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards");
static_assert(offsetof(IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards, IsLookingTowards) == 0x000000, "Member 'IsPlayerLookingAtKillerCondition_OnRep_IsLookingTowards::IsLookingTowards' has a wrong offset!");

// Function DBDCompetence.AddStatusEffectAction.Multicast_ExecuteSubActions
// 0x0030 (0x0030 - 0x0000)
struct AddStatusEffectAction_Multicast_ExecuteSubActions final
{
public:
	struct FGameEventData                         GameEventData;                                     // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AddStatusEffectAction_Multicast_ExecuteSubActions) == 0x000008, "Wrong alignment on AddStatusEffectAction_Multicast_ExecuteSubActions");
static_assert(sizeof(AddStatusEffectAction_Multicast_ExecuteSubActions) == 0x000030, "Wrong size on AddStatusEffectAction_Multicast_ExecuteSubActions");
static_assert(offsetof(AddStatusEffectAction_Multicast_ExecuteSubActions, GameEventData) == 0x000000, "Member 'AddStatusEffectAction_Multicast_ExecuteSubActions::GameEventData' has a wrong offset!");

// Function DBDCompetence.BaseIsPlayerPerformingInteraction.SetInteractionSemantics
// 0x0020 (0x0020 - 0x0000)
struct BaseIsPlayerPerformingInteraction_SetInteractionSemantics final
{
public:
	struct FGameplayTagContainer                  InteractionSemantics;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseIsPlayerPerformingInteraction_SetInteractionSemantics) == 0x000008, "Wrong alignment on BaseIsPlayerPerformingInteraction_SetInteractionSemantics");
static_assert(sizeof(BaseIsPlayerPerformingInteraction_SetInteractionSemantics) == 0x000020, "Wrong size on BaseIsPlayerPerformingInteraction_SetInteractionSemantics");
static_assert(offsetof(BaseIsPlayerPerformingInteraction_SetInteractionSemantics, InteractionSemantics) == 0x000000, "Member 'BaseIsPlayerPerformingInteraction_SetInteractionSemantics::InteractionSemantics' has a wrong offset!");

// Function DBDCompetence.BaseIsPlayerPerformingInteraction.UpdateIsTrue
// 0x0008 (0x0008 - 0x0000)
struct BaseIsPlayerPerformingInteraction_UpdateIsTrue final
{
public:
	class UInteractionDefinition*                 InteractionDefinition;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseIsPlayerPerformingInteraction_UpdateIsTrue) == 0x000008, "Wrong alignment on BaseIsPlayerPerformingInteraction_UpdateIsTrue");
static_assert(sizeof(BaseIsPlayerPerformingInteraction_UpdateIsTrue) == 0x000008, "Wrong size on BaseIsPlayerPerformingInteraction_UpdateIsTrue");
static_assert(offsetof(BaseIsPlayerPerformingInteraction_UpdateIsTrue, InteractionDefinition) == 0x000000, "Member 'BaseIsPlayerPerformingInteraction_UpdateIsTrue::InteractionDefinition' has a wrong offset!");

// Function DBDCompetence.IsPlayerPerformingItemInteraction.OnCollectableChargeStateChange
// 0x0001 (0x0001 - 0x0000)
struct IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange final
{
public:
	bool                                          Empty;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange) == 0x000001, "Wrong alignment on IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange");
static_assert(sizeof(IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange) == 0x000001, "Wrong size on IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange");
static_assert(offsetof(IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange, Empty) == 0x000000, "Member 'IsPlayerPerformingItemInteraction_OnCollectableChargeStateChange::Empty' has a wrong offset!");

// Function DBDCompetence.IsPlayerPerformingItemInteraction.OnCollectableDropped
// 0x0001 (0x0001 - 0x0000)
struct IsPlayerPerformingItemInteraction_OnCollectableDropped final
{
public:
	EItemDropType                                 DropType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerPerformingItemInteraction_OnCollectableDropped) == 0x000001, "Wrong alignment on IsPlayerPerformingItemInteraction_OnCollectableDropped");
static_assert(sizeof(IsPlayerPerformingItemInteraction_OnCollectableDropped) == 0x000001, "Wrong size on IsPlayerPerformingItemInteraction_OnCollectableDropped");
static_assert(offsetof(IsPlayerPerformingItemInteraction_OnCollectableDropped, DropType) == 0x000000, "Member 'IsPlayerPerformingItemInteraction_OnCollectableDropped::DropType' has a wrong offset!");

// Function DBDCompetence.IsPlayerPerformingItemInteraction.OnCollectablePickedUp
// 0x0008 (0x0008 - 0x0000)
struct IsPlayerPerformingItemInteraction_OnCollectablePickedUp final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IsPlayerPerformingItemInteraction_OnCollectablePickedUp) == 0x000008, "Wrong alignment on IsPlayerPerformingItemInteraction_OnCollectablePickedUp");
static_assert(sizeof(IsPlayerPerformingItemInteraction_OnCollectablePickedUp) == 0x000008, "Wrong size on IsPlayerPerformingItemInteraction_OnCollectablePickedUp");
static_assert(offsetof(IsPlayerPerformingItemInteraction_OnCollectablePickedUp, Player) == 0x000000, "Member 'IsPlayerPerformingItemInteraction_OnCollectablePickedUp::Player' has a wrong offset!");

// Function DBDCompetence.AllowSelfRecoverAction.Authority_OnHealProgress
// 0x0018 (0x0018 - 0x0000)
struct AllowSelfRecoverAction_Authority_OnHealProgress final
{
public:
	float                                         IndividualChargeAmount;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalChargeAmount;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ChargeInstigator;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasCoop;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTime;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AllowSelfRecoverAction_Authority_OnHealProgress) == 0x000008, "Wrong alignment on AllowSelfRecoverAction_Authority_OnHealProgress");
static_assert(sizeof(AllowSelfRecoverAction_Authority_OnHealProgress) == 0x000018, "Wrong size on AllowSelfRecoverAction_Authority_OnHealProgress");
static_assert(offsetof(AllowSelfRecoverAction_Authority_OnHealProgress, IndividualChargeAmount) == 0x000000, "Member 'AllowSelfRecoverAction_Authority_OnHealProgress::IndividualChargeAmount' has a wrong offset!");
static_assert(offsetof(AllowSelfRecoverAction_Authority_OnHealProgress, TotalChargeAmount) == 0x000004, "Member 'AllowSelfRecoverAction_Authority_OnHealProgress::TotalChargeAmount' has a wrong offset!");
static_assert(offsetof(AllowSelfRecoverAction_Authority_OnHealProgress, ChargeInstigator) == 0x000008, "Member 'AllowSelfRecoverAction_Authority_OnHealProgress::ChargeInstigator' has a wrong offset!");
static_assert(offsetof(AllowSelfRecoverAction_Authority_OnHealProgress, WasCoop) == 0x000010, "Member 'AllowSelfRecoverAction_Authority_OnHealProgress::WasCoop' has a wrong offset!");
static_assert(offsetof(AllowSelfRecoverAction_Authority_OnHealProgress, DeltaTime) == 0x000014, "Member 'AllowSelfRecoverAction_Authority_OnHealProgress::DeltaTime' has a wrong offset!");

// Function DBDCompetence.AnyMeansNecessary.Authority_OnPalletPulledUp
// 0x0040 (0x0040 - 0x0000)
struct AnyMeansNecessary_Authority_OnPalletPulledUp final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
