#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDDialog

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function DBDDialog.DialogHandlerCondition.IsTrue
// 0x0050 (0x0050 - 0x0000)
struct DialogHandlerCondition_IsTrue final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ADBDGameState*                          GameState;                                         // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DialogHandlerCondition_IsTrue) == 0x000008, "Wrong alignment on DialogHandlerCondition_IsTrue");
static_assert(sizeof(DialogHandlerCondition_IsTrue) == 0x000050, "Wrong size on DialogHandlerCondition_IsTrue");
static_assert(offsetof(DialogHandlerCondition_IsTrue, GameEventType) == 0x000000, "Member 'DialogHandlerCondition_IsTrue::GameEventType' has a wrong offset!");
static_assert(offsetof(DialogHandlerCondition_IsTrue, GameEventData) == 0x000010, "Member 'DialogHandlerCondition_IsTrue::GameEventData' has a wrong offset!");
static_assert(offsetof(DialogHandlerCondition_IsTrue, GameState) == 0x000040, "Member 'DialogHandlerCondition_IsTrue::GameState' has a wrong offset!");
static_assert(offsetof(DialogHandlerCondition_IsTrue, ReturnValue) == 0x000048, "Member 'DialogHandlerCondition_IsTrue::ReturnValue' has a wrong offset!");

}

