#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDGameplay

#include "Basic.hpp"

#include "VFXUtilities_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDInteraction_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDGameplay_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "QueryService_structs.hpp"
#include "GameplayUtilities_classes.hpp"
#include "StatSystem_structs.hpp"
#include "NetworkUtilities_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// Class DBDGameplay.DebugIndicator
// 0x0020 (0x02C0 - 0x02A0)
class ADebugIndicator final : public AActor
{
public:
	class UStaticMeshComponent*                   _staticMeshComponent;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B0[0x10];                                     // 0x02B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetColor(const struct FLinearColor& Color);
	void SetVisible(const bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebugIndicator">();
	}
	static class ADebugIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADebugIndicator>();
	}
};
static_assert(alignof(ADebugIndicator) == 0x000008, "Wrong alignment on ADebugIndicator");
static_assert(sizeof(ADebugIndicator) == 0x0002C0, "Wrong size on ADebugIndicator");
static_assert(offsetof(ADebugIndicator, _staticMeshComponent) == 0x0002A0, "Member 'ADebugIndicator::_staticMeshComponent' has a wrong offset!");
static_assert(offsetof(ADebugIndicator, _outlineComponent) == 0x0002A8, "Member 'ADebugIndicator::_outlineComponent' has a wrong offset!");

// Class DBDGameplay.BaseCamperCollectable
// 0x0048 (0x0598 - 0x0550)
class ABaseCamperCollectable : public ACollectable
{
public:
	class USpherePlayerOverlapComponent*          _interactable;                                     // 0x0550(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractor*                            _collectableInteractor;                            // 0x0558(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDropItemInteraction*                   _dropInteraction;                                  // 0x0560(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCollectItemInteraction*                _collectInteraction;                               // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                       _infectablePrimitive;                              // 0x0570(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0578(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialHelper*                        _materialHelper;                                   // 0x0580(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USurvivorCollectableOutlineUpdateStrategy* _survivorCollectableOutlineUpdateStrategy;         // 0x0588(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCamperCollectable">();
	}
	static class ABaseCamperCollectable* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseCamperCollectable>();
	}
};
static_assert(alignof(ABaseCamperCollectable) == 0x000008, "Wrong alignment on ABaseCamperCollectable");
static_assert(sizeof(ABaseCamperCollectable) == 0x000598, "Wrong size on ABaseCamperCollectable");
static_assert(offsetof(ABaseCamperCollectable, _interactable) == 0x000550, "Member 'ABaseCamperCollectable::_interactable' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _collectableInteractor) == 0x000558, "Member 'ABaseCamperCollectable::_collectableInteractor' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _dropInteraction) == 0x000560, "Member 'ABaseCamperCollectable::_dropInteraction' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _collectInteraction) == 0x000568, "Member 'ABaseCamperCollectable::_collectInteraction' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _infectablePrimitive) == 0x000570, "Member 'ABaseCamperCollectable::_infectablePrimitive' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _outlineComponent) == 0x000578, "Member 'ABaseCamperCollectable::_outlineComponent' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _materialHelper) == 0x000580, "Member 'ABaseCamperCollectable::_materialHelper' has a wrong offset!");
static_assert(offsetof(ABaseCamperCollectable, _survivorCollectableOutlineUpdateStrategy) == 0x000588, "Member 'ABaseCamperCollectable::_survivorCollectableOutlineUpdateStrategy' has a wrong offset!");

// Class DBDGameplay.ZoneUtilities
// 0x0000 (0x0030 - 0x0030)
class UZoneUtilities final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneUtilities">();
	}
	static class UZoneUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneUtilities>();
	}
};
static_assert(alignof(UZoneUtilities) == 0x000008, "Wrong alignment on UZoneUtilities");
static_assert(sizeof(UZoneUtilities) == 0x000030, "Wrong size on UZoneUtilities");

// Class DBDGameplay.CharacterOptimizer
// 0x0010 (0x00B8 - 0x00A8)
class UCharacterOptimizer final : public UActorComponent
{
public:
	float                                         _characterMovementTickRateWhenInsignificant;       // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0xC];                                       // 0x00AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterOptimizer">();
	}
	static class UCharacterOptimizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterOptimizer>();
	}
};
static_assert(alignof(UCharacterOptimizer) == 0x000008, "Wrong alignment on UCharacterOptimizer");
static_assert(sizeof(UCharacterOptimizer) == 0x0000B8, "Wrong size on UCharacterOptimizer");
static_assert(offsetof(UCharacterOptimizer, _characterMovementTickRateWhenInsignificant) == 0x0000A8, "Member 'UCharacterOptimizer::_characterMovementTickRateWhenInsignificant' has a wrong offset!");

// Class DBDGameplay.BaseHusk
// 0x0040 (0x02E8 - 0x02A8)
class ABaseHusk : public ABaseVFX
{
public:
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        _rootComponent;                                    // 0x02C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDSkeletalMeshComponentBudgeted*      _huskMesh;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomizedSkeletalMesh*                _huskCustomizedSkeletalMesh;                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _shouldDeactivateVFX;                              // 0x02D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D9[0xB];                                      // 0x02D9(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _updateWeaponAccessories;                          // 0x02E4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _shouldWeaponBeVisible;                            // 0x02E5(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_InitializeSkeletalMesh(class USkeletalMeshComponent* Mesh);
	void InitializeHusk(class UCustomizedSkeletalMesh* CustomizedSkeletalMeshToCopy, class USkeletalMeshComponent* SkeletalMeshToCopy, int32 CharacterIdOverride);
	void SetHuskVisibility(bool Visible);
	void SetScalarParameterOnAllChildrenMeshes(class FName ParameterName, float Value, class USkeletalMeshComponent* Mesh);

	const class UCustomizedSkeletalMesh* GetCopiedCustomizedSkeletalMesh() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseHusk">();
	}
	static class ABaseHusk* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseHusk>();
	}
};
static_assert(alignof(ABaseHusk) == 0x000008, "Wrong alignment on ABaseHusk");
static_assert(sizeof(ABaseHusk) == 0x0002E8, "Wrong size on ABaseHusk");
static_assert(offsetof(ABaseHusk, _rootComponent) == 0x0002C0, "Member 'ABaseHusk::_rootComponent' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _huskMesh) == 0x0002C8, "Member 'ABaseHusk::_huskMesh' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _huskCustomizedSkeletalMesh) == 0x0002D0, "Member 'ABaseHusk::_huskCustomizedSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _shouldDeactivateVFX) == 0x0002D8, "Member 'ABaseHusk::_shouldDeactivateVFX' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _updateWeaponAccessories) == 0x0002E4, "Member 'ABaseHusk::_updateWeaponAccessories' has a wrong offset!");
static_assert(offsetof(ABaseHusk, _shouldWeaponBeVisible) == 0x0002E5, "Member 'ABaseHusk::_shouldWeaponBeVisible' has a wrong offset!");

// Class DBDGameplay.FlashlightUtilities
// 0x0000 (0x0030 - 0x0030)
class UFlashlightUtilities final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightUtilities">();
	}
	static class UFlashlightUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightUtilities>();
	}
};
static_assert(alignof(UFlashlightUtilities) == 0x000008, "Wrong alignment on UFlashlightUtilities");
static_assert(sizeof(UFlashlightUtilities) == 0x000030, "Wrong size on UFlashlightUtilities");

// Class DBDGameplay.BaseRangedExplosiveActorEffect
// 0x0000 (0x0030 - 0x0030)
class UBaseRangedExplosiveActorEffect : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseRangedExplosiveActorEffect">();
	}
	static class UBaseRangedExplosiveActorEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseRangedExplosiveActorEffect>();
	}
};
static_assert(alignof(UBaseRangedExplosiveActorEffect) == 0x000008, "Wrong alignment on UBaseRangedExplosiveActorEffect");
static_assert(sizeof(UBaseRangedExplosiveActorEffect) == 0x000030, "Wrong size on UBaseRangedExplosiveActorEffect");

// Class DBDGameplay.BlindAndDeafenRangedExplosiveActorEffect
// 0x0000 (0x0030 - 0x0030)
class UBlindAndDeafenRangedExplosiveActorEffect final : public UBaseRangedExplosiveActorEffect
{
public:
	bool Authority_TryToBlind(class UBlindableBaseComponent* BlindableComponent, class AActor* EffectorActor) const;
	bool Authority_TryToDeafen(const class ADBDPlayer* Player, class UAudioFXComponent* AudioFXComponent) const;
	float GetBlindnessEffectDuration(const class AActor* Player) const;
	float GetDeafnessEffectDuration(const class AActor* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindAndDeafenRangedExplosiveActorEffect">();
	}
	static class UBlindAndDeafenRangedExplosiveActorEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindAndDeafenRangedExplosiveActorEffect>();
	}
};
static_assert(alignof(UBlindAndDeafenRangedExplosiveActorEffect) == 0x000008, "Wrong alignment on UBlindAndDeafenRangedExplosiveActorEffect");
static_assert(sizeof(UBlindAndDeafenRangedExplosiveActorEffect) == 0x000030, "Wrong size on UBlindAndDeafenRangedExplosiveActorEffect");

// Class DBDGameplay.SurvivorBoundOptimizer
// 0x0020 (0x00C8 - 0x00A8)
class USurvivorBoundOptimizer final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorBoundOptimizer">();
	}
	static class USurvivorBoundOptimizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorBoundOptimizer>();
	}
};
static_assert(alignof(USurvivorBoundOptimizer) == 0x000008, "Wrong alignment on USurvivorBoundOptimizer");
static_assert(sizeof(USurvivorBoundOptimizer) == 0x0000C8, "Wrong size on USurvivorBoundOptimizer");

// Class DBDGameplay.CageHook
// 0x02E0 (0x0688 - 0x03A8)
class ACageHook : public AInteractable
{
public:
	uint8                                         Pad_3A8[0x80];                                     // 0x03A8(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _timeToBlockLocationOnRescue;                      // 0x0428(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _sacrificeScoreEvent;                              // 0x0450(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _inMontageID;                                      // 0x045C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _idleMontageID;                                    // 0x0468(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _idleToStruggleMontageID;                          // 0x0474(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _struggleMontageID;                                // 0x0480(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _struggleHitMontageID;                             // 0x048C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _deadMontageID;                                    // 0x0498(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _relocateMontageID;                                // 0x04A4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _goingUnderMontageID;                              // 0x04B0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _survivorSocketID;                                 // 0x04BC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _rescuerSocketID;                                  // 0x04C8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _cameraSocketID;                                   // 0x04D4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _rescueSocketID;                                   // 0x04E0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _sacrificeAfterMontageSecond;                      // 0x04EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _goingUnderMontageSecond;                          // 0x04F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _furthestLocationSelectionCount;                   // 0x04F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        _root;                                             // 0x04F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ACamperPlayer*                          _cagedSurvivor;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASlasherPlayer*                         _killerInstigator;                                 // 0x0508(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _rescueChargeableComponent;                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDSkeletalMeshComponentBudgeted*      _cageSkeletalMesh;                                 // 0x0518(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                          _interactionZone;                                  // 0x0520(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                          _playerOverlapZone;                                // 0x0528(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMontagePlayer*                         _montagePlayer;                                    // 0x0530(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_538[0x10];                                     // 0x0538(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          _cageCollision;                                    // 0x0548(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_550[0x50];                                     // 0x0550(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationMontageSlave*                 _animationMontageSlave;                            // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           _montageToPlay;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B0[0x8];                                      // 0x05B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _rescuerSnapPosition;                              // 0x05B8(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCageHookAntiCampComponent*             _anticampComponent;                                // 0x05D0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x70];                                     // 0x05D8(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _anticampDrainCooldownTime;                        // 0x0648(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_670[0x10];                                     // 0x0670(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIPerceptionStimuliSourceComponent*    _perceptionStimuliComponent;                       // 0x0680(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CheckRescuerSocketPosition();
	void Cosmetic_DisplayCage(const bool Display);
	void Cosmetic_OnPlayerAbsorbedByGround();
	void Cosmetic_OnRelocateStart();
	void FX_SurvivorSavedFromCage();
	void Multicast_Relocate(const struct FVector& Location, const struct FRotator& Rotation, const bool IsAnticampRelocation);
	void Multicast_SendSurvivorToCage(class ACamperPlayer* Survivor, class ASlasherPlayer* KillerInstigator);
	void Multicast_SendSurvivorToCageImmediately(class ACamperPlayer* Survivor, class ASlasherPlayer* KillerInstigator, const struct FVector& Location, const struct FRotator& Rotation);
	void OnCageDisappear();
	void OnRescueCancelled();
	void OnSkillCheckFailed();
	void OnSkillCheckFailed_Cosmetic();
	void PlayerOverlapZoneBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PlayerOverlapZoneEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

	class ACamperPlayer* GetCagedSurvivor() const;
	class UMontagePlayer* GetMontagePlayer() const;
	struct FVector GetRescuerSnapPosition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CageHook">();
	}
	static class ACageHook* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACageHook>();
	}
};
static_assert(alignof(ACageHook) == 0x000008, "Wrong alignment on ACageHook");
static_assert(sizeof(ACageHook) == 0x000688, "Wrong size on ACageHook");
static_assert(offsetof(ACageHook, _timeToBlockLocationOnRescue) == 0x000428, "Member 'ACageHook::_timeToBlockLocationOnRescue' has a wrong offset!");
static_assert(offsetof(ACageHook, _sacrificeScoreEvent) == 0x000450, "Member 'ACageHook::_sacrificeScoreEvent' has a wrong offset!");
static_assert(offsetof(ACageHook, _inMontageID) == 0x00045C, "Member 'ACageHook::_inMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _idleMontageID) == 0x000468, "Member 'ACageHook::_idleMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _idleToStruggleMontageID) == 0x000474, "Member 'ACageHook::_idleToStruggleMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _struggleMontageID) == 0x000480, "Member 'ACageHook::_struggleMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _struggleHitMontageID) == 0x00048C, "Member 'ACageHook::_struggleHitMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _deadMontageID) == 0x000498, "Member 'ACageHook::_deadMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _relocateMontageID) == 0x0004A4, "Member 'ACageHook::_relocateMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _goingUnderMontageID) == 0x0004B0, "Member 'ACageHook::_goingUnderMontageID' has a wrong offset!");
static_assert(offsetof(ACageHook, _survivorSocketID) == 0x0004BC, "Member 'ACageHook::_survivorSocketID' has a wrong offset!");
static_assert(offsetof(ACageHook, _rescuerSocketID) == 0x0004C8, "Member 'ACageHook::_rescuerSocketID' has a wrong offset!");
static_assert(offsetof(ACageHook, _cameraSocketID) == 0x0004D4, "Member 'ACageHook::_cameraSocketID' has a wrong offset!");
static_assert(offsetof(ACageHook, _rescueSocketID) == 0x0004E0, "Member 'ACageHook::_rescueSocketID' has a wrong offset!");
static_assert(offsetof(ACageHook, _sacrificeAfterMontageSecond) == 0x0004EC, "Member 'ACageHook::_sacrificeAfterMontageSecond' has a wrong offset!");
static_assert(offsetof(ACageHook, _goingUnderMontageSecond) == 0x0004F0, "Member 'ACageHook::_goingUnderMontageSecond' has a wrong offset!");
static_assert(offsetof(ACageHook, _furthestLocationSelectionCount) == 0x0004F4, "Member 'ACageHook::_furthestLocationSelectionCount' has a wrong offset!");
static_assert(offsetof(ACageHook, _root) == 0x0004F8, "Member 'ACageHook::_root' has a wrong offset!");
static_assert(offsetof(ACageHook, _cagedSurvivor) == 0x000500, "Member 'ACageHook::_cagedSurvivor' has a wrong offset!");
static_assert(offsetof(ACageHook, _killerInstigator) == 0x000508, "Member 'ACageHook::_killerInstigator' has a wrong offset!");
static_assert(offsetof(ACageHook, _rescueChargeableComponent) == 0x000510, "Member 'ACageHook::_rescueChargeableComponent' has a wrong offset!");
static_assert(offsetof(ACageHook, _cageSkeletalMesh) == 0x000518, "Member 'ACageHook::_cageSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ACageHook, _interactionZone) == 0x000520, "Member 'ACageHook::_interactionZone' has a wrong offset!");
static_assert(offsetof(ACageHook, _playerOverlapZone) == 0x000528, "Member 'ACageHook::_playerOverlapZone' has a wrong offset!");
static_assert(offsetof(ACageHook, _montagePlayer) == 0x000530, "Member 'ACageHook::_montagePlayer' has a wrong offset!");
static_assert(offsetof(ACageHook, _cageCollision) == 0x000548, "Member 'ACageHook::_cageCollision' has a wrong offset!");
static_assert(offsetof(ACageHook, _animationMontageSlave) == 0x0005A0, "Member 'ACageHook::_animationMontageSlave' has a wrong offset!");
static_assert(offsetof(ACageHook, _montageToPlay) == 0x0005A8, "Member 'ACageHook::_montageToPlay' has a wrong offset!");
static_assert(offsetof(ACageHook, _rescuerSnapPosition) == 0x0005B8, "Member 'ACageHook::_rescuerSnapPosition' has a wrong offset!");
static_assert(offsetof(ACageHook, _anticampComponent) == 0x0005D0, "Member 'ACageHook::_anticampComponent' has a wrong offset!");
static_assert(offsetof(ACageHook, _anticampDrainCooldownTime) == 0x000648, "Member 'ACageHook::_anticampDrainCooldownTime' has a wrong offset!");
static_assert(offsetof(ACageHook, _perceptionStimuliComponent) == 0x000680, "Member 'ACageHook::_perceptionStimuliComponent' has a wrong offset!");

// Class DBDGameplay.UnhookedSurvivorTrackerComponent
// 0x0028 (0x00D0 - 0x00A8)
class UUnhookedSurvivorTrackerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnhookedSurvivorTrackerComponent">();
	}
	static class UUnhookedSurvivorTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnhookedSurvivorTrackerComponent>();
	}
};
static_assert(alignof(UUnhookedSurvivorTrackerComponent) == 0x000008, "Wrong alignment on UUnhookedSurvivorTrackerComponent");
static_assert(sizeof(UUnhookedSurvivorTrackerComponent) == 0x0000D0, "Wrong size on UUnhookedSurvivorTrackerComponent");

// Class DBDGameplay.BaseActorAttackableComponent
// 0x0038 (0x00E0 - 0x00A8)
class UBaseActorAttackableComponent : public UAttackableComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _killerProjectilesThatCanDamageActor;              // 0x00C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void HitWithProjectile(class ABaseProjectile* Projectile);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseActorAttackableComponent">();
	}
	static class UBaseActorAttackableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseActorAttackableComponent>();
	}
};
static_assert(alignof(UBaseActorAttackableComponent) == 0x000008, "Wrong alignment on UBaseActorAttackableComponent");
static_assert(sizeof(UBaseActorAttackableComponent) == 0x0000E0, "Wrong size on UBaseActorAttackableComponent");
static_assert(offsetof(UBaseActorAttackableComponent, _killerProjectilesThatCanDamageActor) == 0x0000C0, "Member 'UBaseActorAttackableComponent::_killerProjectilesThatCanDamageActor' has a wrong offset!");

// Class DBDGameplay.CageRescueInteraction
// 0x0040 (0x0900 - 0x08C0)
#pragma pack(push, 0x1)
class alignas(0x10) UCageRescueInteraction : public UChargeableInteractionDefinition
{
public:
	struct FGameplayTag                           _cageRescueScoreEvent;                             // 0x08C0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _loudNoiseRange;                                   // 0x08D0(0x0028)(Edit, NativeAccessSpecifierPrivate)

public:
	struct FVector GetRescuerSnapPosition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CageRescueInteraction">();
	}
	static class UCageRescueInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCageRescueInteraction>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCageRescueInteraction) == 0x000010, "Wrong alignment on UCageRescueInteraction");
static_assert(sizeof(UCageRescueInteraction) == 0x000900, "Wrong size on UCageRescueInteraction");
static_assert(offsetof(UCageRescueInteraction, _cageRescueScoreEvent) == 0x0008C0, "Member 'UCageRescueInteraction::_cageRescueScoreEvent' has a wrong offset!");
static_assert(offsetof(UCageRescueInteraction, _loudNoiseRange) == 0x0008D0, "Member 'UCageRescueInteraction::_loudNoiseRange' has a wrong offset!");

// Class DBDGameplay.SendToCageInteraction
// 0x0010 (0x0930 - 0x0920)
class USendToCageInteraction : public UBasicChargeableInteraction
{
public:
	struct FGameplayTag                           _sendToCageScoreEvent;                             // 0x0920(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_92C[0x4];                                      // 0x092C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FX_InteractionCancel();
	void FX_InteractionChargeCompleted(class ADBDPlayer* Player);
	void FX_InteractionStart();

	const class ACamperPlayer* GetOwningSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SendToCageInteraction">();
	}
	static class USendToCageInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USendToCageInteraction>();
	}
};
static_assert(alignof(USendToCageInteraction) == 0x000010, "Wrong alignment on USendToCageInteraction");
static_assert(sizeof(USendToCageInteraction) == 0x000930, "Wrong size on USendToCageInteraction");
static_assert(offsetof(USendToCageInteraction, _sendToCageScoreEvent) == 0x000920, "Member 'USendToCageInteraction::_sendToCageScoreEvent' has a wrong offset!");

// Class DBDGameplay.AuraOverriderComponent
// 0x0050 (0x00F8 - 0x00A8)
class UAuraOverriderComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceShowAura(const class AActor* Actor, const struct FLinearColor& Color, bool IsAlwaysVisible, const float MinimumOutlineDistanceVisible, const float MinimumOutlineDistance);
	void ResetAura(const class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuraOverriderComponent">();
	}
	static class UAuraOverriderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuraOverriderComponent>();
	}
};
static_assert(alignof(UAuraOverriderComponent) == 0x000008, "Wrong alignment on UAuraOverriderComponent");
static_assert(sizeof(UAuraOverriderComponent) == 0x0000F8, "Wrong size on UAuraOverriderComponent");

// Class DBDGameplay.BaseSightManagerComponent
// 0x00B0 (0x0158 - 0x00A8)
class UBaseSightManagerComponent : public UActorComponent
{
public:
	struct FDBDTunableRowHandle                   _maximumSightDistance;                             // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _sightingDelay;                                    // 0x00D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _discerningDelay;                                  // 0x00F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _undiscerningDelay;                                // 0x0120(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSurvivorLookStatus>            _survivorLookStatus;                               // 0x0148(0x0010)(Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void Authority_OnCharacterSightChanged(class ACharacter* SightedCharacter, class UCharacterSightComponent* SightComponent);
	void OnIntroCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseSightManagerComponent">();
	}
	static class UBaseSightManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSightManagerComponent>();
	}
};
static_assert(alignof(UBaseSightManagerComponent) == 0x000008, "Wrong alignment on UBaseSightManagerComponent");
static_assert(sizeof(UBaseSightManagerComponent) == 0x000158, "Wrong size on UBaseSightManagerComponent");
static_assert(offsetof(UBaseSightManagerComponent, _maximumSightDistance) == 0x0000A8, "Member 'UBaseSightManagerComponent::_maximumSightDistance' has a wrong offset!");
static_assert(offsetof(UBaseSightManagerComponent, _sightingDelay) == 0x0000D0, "Member 'UBaseSightManagerComponent::_sightingDelay' has a wrong offset!");
static_assert(offsetof(UBaseSightManagerComponent, _discerningDelay) == 0x0000F8, "Member 'UBaseSightManagerComponent::_discerningDelay' has a wrong offset!");
static_assert(offsetof(UBaseSightManagerComponent, _undiscerningDelay) == 0x000120, "Member 'UBaseSightManagerComponent::_undiscerningDelay' has a wrong offset!");
static_assert(offsetof(UBaseSightManagerComponent, _survivorLookStatus) == 0x000148, "Member 'UBaseSightManagerComponent::_survivorLookStatus' has a wrong offset!");

// Class DBDGameplay.IgnoreCollisionsHandlerComponent
// 0x0020 (0x05F0 - 0x05D0)
class UIgnoreCollisionsHandlerComponent : public UBoxComponent
{
public:
	uint8                                         Pad_5D0[0x20];                                     // 0x05D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IgnoreCollisionsHandlerComponent">();
	}
	static class UIgnoreCollisionsHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIgnoreCollisionsHandlerComponent>();
	}
};
static_assert(alignof(UIgnoreCollisionsHandlerComponent) == 0x000010, "Wrong alignment on UIgnoreCollisionsHandlerComponent");
static_assert(sizeof(UIgnoreCollisionsHandlerComponent) == 0x0005F0, "Wrong size on UIgnoreCollisionsHandlerComponent");

// Class DBDGameplay.IgnoreCollisionsPalletHandlerComponent
// 0x0000 (0x05F0 - 0x05F0)
class UIgnoreCollisionsPalletHandlerComponent : public UIgnoreCollisionsHandlerComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IgnoreCollisionsPalletHandlerComponent">();
	}
	static class UIgnoreCollisionsPalletHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIgnoreCollisionsPalletHandlerComponent>();
	}
};
static_assert(alignof(UIgnoreCollisionsPalletHandlerComponent) == 0x000010, "Wrong alignment on UIgnoreCollisionsPalletHandlerComponent");
static_assert(sizeof(UIgnoreCollisionsPalletHandlerComponent) == 0x0005F0, "Wrong size on UIgnoreCollisionsPalletHandlerComponent");

// Class DBDGameplay.FlashlightableLightingStrategy
// 0x0000 (0x0030 - 0x0030)
class UFlashlightableLightingStrategy : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightableLightingStrategy">();
	}
	static class UFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UFlashlightableLightingStrategy");
static_assert(sizeof(UFlashlightableLightingStrategy) == 0x000030, "Wrong size on UFlashlightableLightingStrategy");

// Class DBDGameplay.DebugTimerLogComponent
// 0x0080 (0x0128 - 0x00A8)
class UDebugTimerLogComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x30];                                      // 0x00A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _timerDisplayName;                                 // 0x00D8(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSpeedBasedNetSyncedValue              _timerCountdown;                                   // 0x00E8(0x0038)(Net, RepNotify, NativeAccessSpecifierPrivate)
	float                                         _timerRemainingPercent;                            // 0x0120(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_TimerCountdown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebugTimerLogComponent">();
	}
	static class UDebugTimerLogComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugTimerLogComponent>();
	}
};
static_assert(alignof(UDebugTimerLogComponent) == 0x000008, "Wrong alignment on UDebugTimerLogComponent");
static_assert(sizeof(UDebugTimerLogComponent) == 0x000128, "Wrong size on UDebugTimerLogComponent");
static_assert(offsetof(UDebugTimerLogComponent, _timerDisplayName) == 0x0000D8, "Member 'UDebugTimerLogComponent::_timerDisplayName' has a wrong offset!");
static_assert(offsetof(UDebugTimerLogComponent, _timerCountdown) == 0x0000E8, "Member 'UDebugTimerLogComponent::_timerCountdown' has a wrong offset!");
static_assert(offsetof(UDebugTimerLogComponent, _timerRemainingPercent) == 0x000120, "Member 'UDebugTimerLogComponent::_timerRemainingPercent' has a wrong offset!");

// Class DBDGameplay.FadeComponent
// 0x0020 (0x00C8 - 0x00A8)
class UFadeComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnFadePercentChanged;                              // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         _fadeDuration;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0xC];                                       // 0x00BC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetFadePercent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FadeComponent">();
	}
	static class UFadeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFadeComponent>();
	}
};
static_assert(alignof(UFadeComponent) == 0x000008, "Wrong alignment on UFadeComponent");
static_assert(sizeof(UFadeComponent) == 0x0000C8, "Wrong size on UFadeComponent");
static_assert(offsetof(UFadeComponent, OnFadePercentChanged) == 0x0000A8, "Member 'UFadeComponent::OnFadePercentChanged' has a wrong offset!");
static_assert(offsetof(UFadeComponent, _fadeDuration) == 0x0000B8, "Member 'UFadeComponent::_fadeDuration' has a wrong offset!");

// Class DBDGameplay.FlashlightTargetFXComponent
// 0x0048 (0x00F0 - 0x00A8)
class UFlashlightTargetFXComponent : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x30];                                      // 0x00A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _modifiesBeamAngle;                                // 0x00D8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFlashlightableComponent*               _flashlightable;                                   // 0x00E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIsLitChanged(bool IsLit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightTargetFXComponent">();
	}
	static class UFlashlightTargetFXComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightTargetFXComponent>();
	}
};
static_assert(alignof(UFlashlightTargetFXComponent) == 0x000008, "Wrong alignment on UFlashlightTargetFXComponent");
static_assert(sizeof(UFlashlightTargetFXComponent) == 0x0000F0, "Wrong size on UFlashlightTargetFXComponent");
static_assert(offsetof(UFlashlightTargetFXComponent, _modifiesBeamAngle) == 0x0000D8, "Member 'UFlashlightTargetFXComponent::_modifiesBeamAngle' has a wrong offset!");
static_assert(offsetof(UFlashlightTargetFXComponent, _flashlightable) == 0x0000E0, "Member 'UFlashlightTargetFXComponent::_flashlightable' has a wrong offset!");

// Class DBDGameplay.TargetableComponent
// 0x00A0 (0x0360 - 0x02C0)
class UTargetableComponent : public USceneComponent
{
public:
	class UTargetableStrategy*                    _targetableStrategy;                               // 0x02C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             _relativeTransformToTargetActor;                   // 0x02D0(0x0060)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0x4];                                      // 0x0330(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           _outlineColorWhenAnAvailableTarget;                // 0x0334(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           _outlineColorWhenBeingTargeted;                    // 0x0344(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_354[0xC];                                      // 0x0354(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetableComponent">();
	}
	static class UTargetableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetableComponent>();
	}
};
static_assert(alignof(UTargetableComponent) == 0x000010, "Wrong alignment on UTargetableComponent");
static_assert(sizeof(UTargetableComponent) == 0x000360, "Wrong size on UTargetableComponent");
static_assert(offsetof(UTargetableComponent, _targetableStrategy) == 0x0002C0, "Member 'UTargetableComponent::_targetableStrategy' has a wrong offset!");
static_assert(offsetof(UTargetableComponent, _relativeTransformToTargetActor) == 0x0002D0, "Member 'UTargetableComponent::_relativeTransformToTargetActor' has a wrong offset!");
static_assert(offsetof(UTargetableComponent, _outlineColorWhenAnAvailableTarget) == 0x000334, "Member 'UTargetableComponent::_outlineColorWhenAnAvailableTarget' has a wrong offset!");
static_assert(offsetof(UTargetableComponent, _outlineColorWhenBeingTargeted) == 0x000344, "Member 'UTargetableComponent::_outlineColorWhenBeingTargeted' has a wrong offset!");

// Class DBDGameplay.TerrorRadiusScreenIndicatorComponent
// 0x00C0 (0x03A0 - 0x02E0)
class UTerrorRadiusScreenIndicatorComponent final : public UScreenIndicatorWorldMarkerComponent
{
public:
	TArray<struct FHideHeartIndicatorWithDelay>   _hideHeartIndicatorWithDelay;                      // 0x02D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8[0xB8];                                     // 0x02E8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHeartStateChanged(const struct FGameplayTag& HeartState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TerrorRadiusScreenIndicatorComponent">();
	}
	static class UTerrorRadiusScreenIndicatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTerrorRadiusScreenIndicatorComponent>();
	}
};
static_assert(alignof(UTerrorRadiusScreenIndicatorComponent) == 0x000010, "Wrong alignment on UTerrorRadiusScreenIndicatorComponent");
static_assert(sizeof(UTerrorRadiusScreenIndicatorComponent) == 0x0003A0, "Wrong size on UTerrorRadiusScreenIndicatorComponent");
static_assert(offsetof(UTerrorRadiusScreenIndicatorComponent, _hideHeartIndicatorWithDelay) == 0x0002D8, "Member 'UTerrorRadiusScreenIndicatorComponent::_hideHeartIndicatorWithDelay' has a wrong offset!");

// Class DBDGameplay.BlindFlashlightTargetFXComponent
// 0x0030 (0x0120 - 0x00F0)
class UBlindFlashlightTargetFXComponent final : public UFlashlightTargetFXComponent
{
public:
	uint8                                         Pad_F0[0x30];                                      // 0x00F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindFlashlightTargetFXComponent">();
	}
	static class UBlindFlashlightTargetFXComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindFlashlightTargetFXComponent>();
	}
};
static_assert(alignof(UBlindFlashlightTargetFXComponent) == 0x000008, "Wrong alignment on UBlindFlashlightTargetFXComponent");
static_assert(sizeof(UBlindFlashlightTargetFXComponent) == 0x000120, "Wrong size on UBlindFlashlightTargetFXComponent");

// Class DBDGameplay.FlashlightablePointsLightingStrategy
// 0x0010 (0x0040 - 0x0030)
class UFlashlightablePointsLightingStrategy : public UFlashlightableLightingStrategy
{
public:
	class UPointsProvider*                        _pointsProvider;                                   // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _impactPointDistanceError;                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlashlightablePointsLightingStrategy">();
	}
	static class UFlashlightablePointsLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashlightablePointsLightingStrategy>();
	}
};
static_assert(alignof(UFlashlightablePointsLightingStrategy) == 0x000008, "Wrong alignment on UFlashlightablePointsLightingStrategy");
static_assert(sizeof(UFlashlightablePointsLightingStrategy) == 0x000040, "Wrong size on UFlashlightablePointsLightingStrategy");
static_assert(offsetof(UFlashlightablePointsLightingStrategy, _pointsProvider) == 0x000030, "Member 'UFlashlightablePointsLightingStrategy::_pointsProvider' has a wrong offset!");
static_assert(offsetof(UFlashlightablePointsLightingStrategy, _impactPointDistanceError) == 0x000038, "Member 'UFlashlightablePointsLightingStrategy::_impactPointDistanceError' has a wrong offset!");

// Class DBDGameplay.BlindFlashlightableLightingStrategy
// 0x0010 (0x0050 - 0x0040)
class UBlindFlashlightableLightingStrategy : public UFlashlightablePointsLightingStrategy
{
public:
	TArray<struct FGameplayTag>                   _flashlightableIgnoreTags;                         // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindFlashlightableLightingStrategy">();
	}
	static class UBlindFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UBlindFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UBlindFlashlightableLightingStrategy");
static_assert(sizeof(UBlindFlashlightableLightingStrategy) == 0x000050, "Wrong size on UBlindFlashlightableLightingStrategy");
static_assert(offsetof(UBlindFlashlightableLightingStrategy, _flashlightableIgnoreTags) == 0x000040, "Member 'UBlindFlashlightableLightingStrategy::_flashlightableIgnoreTags' has a wrong offset!");

// Class DBDGameplay.DLCCheatComponent
// 0x0000 (0x00A8 - 0x00A8)
class UDLCCheatComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DLCCheatComponent">();
	}
	static class UDLCCheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDLCCheatComponent>();
	}
};
static_assert(alignof(UDLCCheatComponent) == 0x000008, "Wrong alignment on UDLCCheatComponent");
static_assert(sizeof(UDLCCheatComponent) == 0x0000A8, "Wrong size on UDLCCheatComponent");

// Class DBDGameplay.KillerAbilityComponent
// 0x0100 (0x01A8 - 0x00A8)
class UKillerAbilityComponent : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillerAbilityData*                     _abilityData;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UPowerWidgetPresentationComponent*> _powerWidgetPresentationComponents;                // 0x00B8(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0xC0];                                      // 0x00C8(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimerObject*                           _cooldownTimer;                                    // 0x0188(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTimerObject*                           _durationTimer;                                    // 0x0190(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTimerObject*                           _tokenRechargeTimer;                               // 0x0198(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _tokenCount;                                       // 0x01A0(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CooldownTimer();
	void OnRep_DurationTimer();
	void OnRep_TokenCount(const int32 OldCount);
	void OnRep_TokenRechargeTimer();

	float GetCooldown() const;
	float GetDuration() const;
	class ASlasherPlayer* GetOwningKiller() const;
	class AKillerPower* GetOwningPower() const;
	float GetRemainingCooldown() const;
	float GetRemainingCooldownPercent() const;
	bool IsApplicable() const;
	bool IsAvailable() const;
	bool IsOnCooldown() const;
	void PlayAudioOnOwningKiller(class UAkAudioEvent* AudioEvent, bool OnlyPlayIfLocallyObserved) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerAbilityComponent">();
	}
	static class UKillerAbilityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerAbilityComponent>();
	}
};
static_assert(alignof(UKillerAbilityComponent) == 0x000008, "Wrong alignment on UKillerAbilityComponent");
static_assert(sizeof(UKillerAbilityComponent) == 0x0001A8, "Wrong size on UKillerAbilityComponent");
static_assert(offsetof(UKillerAbilityComponent, _abilityData) == 0x0000B0, "Member 'UKillerAbilityComponent::_abilityData' has a wrong offset!");
static_assert(offsetof(UKillerAbilityComponent, _powerWidgetPresentationComponents) == 0x0000B8, "Member 'UKillerAbilityComponent::_powerWidgetPresentationComponents' has a wrong offset!");
static_assert(offsetof(UKillerAbilityComponent, _cooldownTimer) == 0x000188, "Member 'UKillerAbilityComponent::_cooldownTimer' has a wrong offset!");
static_assert(offsetof(UKillerAbilityComponent, _durationTimer) == 0x000190, "Member 'UKillerAbilityComponent::_durationTimer' has a wrong offset!");
static_assert(offsetof(UKillerAbilityComponent, _tokenRechargeTimer) == 0x000198, "Member 'UKillerAbilityComponent::_tokenRechargeTimer' has a wrong offset!");
static_assert(offsetof(UKillerAbilityComponent, _tokenCount) == 0x0001A0, "Member 'UKillerAbilityComponent::_tokenCount' has a wrong offset!");

// Class DBDGameplay.PoseableHusk
// 0x0008 (0x02F0 - 0x02E8)
class APoseableHusk : public ABaseHusk
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CapturePose();
	void Cosmetic_OnAnimationPoseCaptured();
	void OnActiveStateChanged(bool IsActive);
	void SetIsActive(bool IsActive);

	bool GetIsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseableHusk">();
	}
	static class APoseableHusk* GetDefaultObj()
	{
		return GetDefaultObjImpl<APoseableHusk>();
	}
};
static_assert(alignof(APoseableHusk) == 0x000008, "Wrong alignment on APoseableHusk");
static_assert(sizeof(APoseableHusk) == 0x0002F0, "Wrong size on APoseableHusk");

// Class DBDGameplay.KillerPower
// 0x00A8 (0x05F8 - 0x0550)
class AKillerPower : public ACollectable
{
public:
	uint8                                         Pad_550[0x18];                                     // 0x0550(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractor*                            _interactor;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
