#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDGameplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDGameplay_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function DBDGameplay.DebugIndicator.SetColor
// 0x0010 (0x0010 - 0x0000)
struct DebugIndicator_SetColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugIndicator_SetColor) == 0x000004, "Wrong alignment on DebugIndicator_SetColor");
static_assert(sizeof(DebugIndicator_SetColor) == 0x000010, "Wrong size on DebugIndicator_SetColor");
static_assert(offsetof(DebugIndicator_SetColor, Color) == 0x000000, "Member 'DebugIndicator_SetColor::Color' has a wrong offset!");

// Function DBDGameplay.DebugIndicator.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct DebugIndicator_SetVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugIndicator_SetVisible) == 0x000001, "Wrong alignment on DebugIndicator_SetVisible");
static_assert(sizeof(DebugIndicator_SetVisible) == 0x000001, "Wrong size on DebugIndicator_SetVisible");
static_assert(offsetof(DebugIndicator_SetVisible, Visible) == 0x000000, "Member 'DebugIndicator_SetVisible::Visible' has a wrong offset!");

// Function DBDGameplay.BaseHusk.Cosmetic_InitializeSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BaseHusk_Cosmetic_InitializeSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_Cosmetic_InitializeSkeletalMesh) == 0x000008, "Wrong alignment on BaseHusk_Cosmetic_InitializeSkeletalMesh");
static_assert(sizeof(BaseHusk_Cosmetic_InitializeSkeletalMesh) == 0x000008, "Wrong size on BaseHusk_Cosmetic_InitializeSkeletalMesh");
static_assert(offsetof(BaseHusk_Cosmetic_InitializeSkeletalMesh, Mesh) == 0x000000, "Member 'BaseHusk_Cosmetic_InitializeSkeletalMesh::Mesh' has a wrong offset!");

// Function DBDGameplay.BaseHusk.InitializeHusk
// 0x0018 (0x0018 - 0x0000)
struct BaseHusk_InitializeHusk final
{
public:
	class UCustomizedSkeletalMesh*                CustomizedSkeletalMeshToCopy;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshToCopy;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterIdOverride;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseHusk_InitializeHusk) == 0x000008, "Wrong alignment on BaseHusk_InitializeHusk");
static_assert(sizeof(BaseHusk_InitializeHusk) == 0x000018, "Wrong size on BaseHusk_InitializeHusk");
static_assert(offsetof(BaseHusk_InitializeHusk, CustomizedSkeletalMeshToCopy) == 0x000000, "Member 'BaseHusk_InitializeHusk::CustomizedSkeletalMeshToCopy' has a wrong offset!");
static_assert(offsetof(BaseHusk_InitializeHusk, SkeletalMeshToCopy) == 0x000008, "Member 'BaseHusk_InitializeHusk::SkeletalMeshToCopy' has a wrong offset!");
static_assert(offsetof(BaseHusk_InitializeHusk, CharacterIdOverride) == 0x000010, "Member 'BaseHusk_InitializeHusk::CharacterIdOverride' has a wrong offset!");

// Function DBDGameplay.BaseHusk.SetHuskVisibility
// 0x0001 (0x0001 - 0x0000)
struct BaseHusk_SetHuskVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_SetHuskVisibility) == 0x000001, "Wrong alignment on BaseHusk_SetHuskVisibility");
static_assert(sizeof(BaseHusk_SetHuskVisibility) == 0x000001, "Wrong size on BaseHusk_SetHuskVisibility");
static_assert(offsetof(BaseHusk_SetHuskVisibility, Visible) == 0x000000, "Member 'BaseHusk_SetHuskVisibility::Visible' has a wrong offset!");

// Function DBDGameplay.BaseHusk.SetScalarParameterOnAllChildrenMeshes
// 0x0018 (0x0018 - 0x0000)
struct BaseHusk_SetScalarParameterOnAllChildrenMeshes final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_SetScalarParameterOnAllChildrenMeshes) == 0x000008, "Wrong alignment on BaseHusk_SetScalarParameterOnAllChildrenMeshes");
static_assert(sizeof(BaseHusk_SetScalarParameterOnAllChildrenMeshes) == 0x000018, "Wrong size on BaseHusk_SetScalarParameterOnAllChildrenMeshes");
static_assert(offsetof(BaseHusk_SetScalarParameterOnAllChildrenMeshes, ParameterName) == 0x000000, "Member 'BaseHusk_SetScalarParameterOnAllChildrenMeshes::ParameterName' has a wrong offset!");
static_assert(offsetof(BaseHusk_SetScalarParameterOnAllChildrenMeshes, Value) == 0x00000C, "Member 'BaseHusk_SetScalarParameterOnAllChildrenMeshes::Value' has a wrong offset!");
static_assert(offsetof(BaseHusk_SetScalarParameterOnAllChildrenMeshes, Mesh) == 0x000010, "Member 'BaseHusk_SetScalarParameterOnAllChildrenMeshes::Mesh' has a wrong offset!");

// Function DBDGameplay.BaseHusk.GetCopiedCustomizedSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BaseHusk_GetCopiedCustomizedSkeletalMesh final
{
public:
	const class UCustomizedSkeletalMesh*          ReturnValue;                                       // 0x0000(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseHusk_GetCopiedCustomizedSkeletalMesh) == 0x000008, "Wrong alignment on BaseHusk_GetCopiedCustomizedSkeletalMesh");
static_assert(sizeof(BaseHusk_GetCopiedCustomizedSkeletalMesh) == 0x000008, "Wrong size on BaseHusk_GetCopiedCustomizedSkeletalMesh");
static_assert(offsetof(BaseHusk_GetCopiedCustomizedSkeletalMesh, ReturnValue) == 0x000000, "Member 'BaseHusk_GetCopiedCustomizedSkeletalMesh::ReturnValue' has a wrong offset!");

// Function DBDGameplay.BlindAndDeafenRangedExplosiveActorEffect.Authority_TryToBlind
// 0x0018 (0x0018 - 0x0000)
struct BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind final
{
public:
	class UBlindableBaseComponent*                BlindableComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EffectorActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind) == 0x000008, "Wrong alignment on BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind");
static_assert(sizeof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind) == 0x000018, "Wrong size on BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind, BlindableComponent) == 0x000000, "Member 'BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind::BlindableComponent' has a wrong offset!");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind, EffectorActor) == 0x000008, "Member 'BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind::EffectorActor' has a wrong offset!");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind, ReturnValue) == 0x000010, "Member 'BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToBlind::ReturnValue' has a wrong offset!");

// Function DBDGameplay.BlindAndDeafenRangedExplosiveActorEffect.Authority_TryToDeafen
// 0x0018 (0x0018 - 0x0000)
struct BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioFXComponent*                      AudioFXComponent;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen) == 0x000008, "Wrong alignment on BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen");
static_assert(sizeof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen) == 0x000018, "Wrong size on BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen, Player) == 0x000000, "Member 'BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen::Player' has a wrong offset!");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen, AudioFXComponent) == 0x000008, "Member 'BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen::AudioFXComponent' has a wrong offset!");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen, ReturnValue) == 0x000010, "Member 'BlindAndDeafenRangedExplosiveActorEffect_Authority_TryToDeafen::ReturnValue' has a wrong offset!");

// Function DBDGameplay.BlindAndDeafenRangedExplosiveActorEffect.GetBlindnessEffectDuration
// 0x0010 (0x0010 - 0x0000)
struct BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration final
{
public:
	const class AActor*                           Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration) == 0x000008, "Wrong alignment on BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration");
static_assert(sizeof(BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration) == 0x000010, "Wrong size on BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration, Player) == 0x000000, "Member 'BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration::Player' has a wrong offset!");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration, ReturnValue) == 0x000008, "Member 'BlindAndDeafenRangedExplosiveActorEffect_GetBlindnessEffectDuration::ReturnValue' has a wrong offset!");

// Function DBDGameplay.BlindAndDeafenRangedExplosiveActorEffect.GetDeafnessEffectDuration
// 0x0010 (0x0010 - 0x0000)
struct BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration final
{
public:
	const class AActor*                           Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration) == 0x000008, "Wrong alignment on BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration");
static_assert(sizeof(BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration) == 0x000010, "Wrong size on BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration, Player) == 0x000000, "Member 'BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration::Player' has a wrong offset!");
static_assert(offsetof(BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration, ReturnValue) == 0x000008, "Member 'BlindAndDeafenRangedExplosiveActorEffect_GetDeafnessEffectDuration::ReturnValue' has a wrong offset!");

// Function DBDGameplay.CageHook.Cosmetic_DisplayCage
// 0x0001 (0x0001 - 0x0000)
struct CageHook_Cosmetic_DisplayCage final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_Cosmetic_DisplayCage) == 0x000001, "Wrong alignment on CageHook_Cosmetic_DisplayCage");
static_assert(sizeof(CageHook_Cosmetic_DisplayCage) == 0x000001, "Wrong size on CageHook_Cosmetic_DisplayCage");
static_assert(offsetof(CageHook_Cosmetic_DisplayCage, Display) == 0x000000, "Member 'CageHook_Cosmetic_DisplayCage::Display' has a wrong offset!");

// Function DBDGameplay.CageHook.Multicast_Relocate
// 0x0038 (0x0038 - 0x0000)
struct CageHook_Multicast_Relocate final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsAnticampRelocation;                              // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CageHook_Multicast_Relocate) == 0x000008, "Wrong alignment on CageHook_Multicast_Relocate");
static_assert(sizeof(CageHook_Multicast_Relocate) == 0x000038, "Wrong size on CageHook_Multicast_Relocate");
static_assert(offsetof(CageHook_Multicast_Relocate, Location) == 0x000000, "Member 'CageHook_Multicast_Relocate::Location' has a wrong offset!");
static_assert(offsetof(CageHook_Multicast_Relocate, Rotation) == 0x000018, "Member 'CageHook_Multicast_Relocate::Rotation' has a wrong offset!");
static_assert(offsetof(CageHook_Multicast_Relocate, IsAnticampRelocation) == 0x000030, "Member 'CageHook_Multicast_Relocate::IsAnticampRelocation' has a wrong offset!");

// Function DBDGameplay.CageHook.Multicast_SendSurvivorToCage
// 0x0010 (0x0010 - 0x0000)
struct CageHook_Multicast_SendSurvivorToCage final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASlasherPlayer*                         KillerInstigator;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_Multicast_SendSurvivorToCage) == 0x000008, "Wrong alignment on CageHook_Multicast_SendSurvivorToCage");
static_assert(sizeof(CageHook_Multicast_SendSurvivorToCage) == 0x000010, "Wrong size on CageHook_Multicast_SendSurvivorToCage");
static_assert(offsetof(CageHook_Multicast_SendSurvivorToCage, Survivor) == 0x000000, "Member 'CageHook_Multicast_SendSurvivorToCage::Survivor' has a wrong offset!");
static_assert(offsetof(CageHook_Multicast_SendSurvivorToCage, KillerInstigator) == 0x000008, "Member 'CageHook_Multicast_SendSurvivorToCage::KillerInstigator' has a wrong offset!");

// Function DBDGameplay.CageHook.Multicast_SendSurvivorToCageImmediately
// 0x0040 (0x0040 - 0x0000)
struct CageHook_Multicast_SendSurvivorToCageImmediately final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASlasherPlayer*                         KillerInstigator;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_Multicast_SendSurvivorToCageImmediately) == 0x000008, "Wrong alignment on CageHook_Multicast_SendSurvivorToCageImmediately");
static_assert(sizeof(CageHook_Multicast_SendSurvivorToCageImmediately) == 0x000040, "Wrong size on CageHook_Multicast_SendSurvivorToCageImmediately");
static_assert(offsetof(CageHook_Multicast_SendSurvivorToCageImmediately, Survivor) == 0x000000, "Member 'CageHook_Multicast_SendSurvivorToCageImmediately::Survivor' has a wrong offset!");
static_assert(offsetof(CageHook_Multicast_SendSurvivorToCageImmediately, KillerInstigator) == 0x000008, "Member 'CageHook_Multicast_SendSurvivorToCageImmediately::KillerInstigator' has a wrong offset!");
static_assert(offsetof(CageHook_Multicast_SendSurvivorToCageImmediately, Location) == 0x000010, "Member 'CageHook_Multicast_SendSurvivorToCageImmediately::Location' has a wrong offset!");
static_assert(offsetof(CageHook_Multicast_SendSurvivorToCageImmediately, Rotation) == 0x000028, "Member 'CageHook_Multicast_SendSurvivorToCageImmediately::Rotation' has a wrong offset!");

// Function DBDGameplay.CageHook.PlayerOverlapZoneBeginOverlap
// 0x0110 (0x0110 - 0x0000)
struct CageHook_PlayerOverlapZoneBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_PlayerOverlapZoneBeginOverlap) == 0x000008, "Wrong alignment on CageHook_PlayerOverlapZoneBeginOverlap");
static_assert(sizeof(CageHook_PlayerOverlapZoneBeginOverlap) == 0x000110, "Wrong size on CageHook_PlayerOverlapZoneBeginOverlap");
static_assert(offsetof(CageHook_PlayerOverlapZoneBeginOverlap, OverlappedComponent) == 0x000000, "Member 'CageHook_PlayerOverlapZoneBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneBeginOverlap, OtherActor) == 0x000008, "Member 'CageHook_PlayerOverlapZoneBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneBeginOverlap, OtherComp) == 0x000010, "Member 'CageHook_PlayerOverlapZoneBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'CageHook_PlayerOverlapZoneBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneBeginOverlap, bFromSweep) == 0x00001C, "Member 'CageHook_PlayerOverlapZoneBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneBeginOverlap, SweepResult) == 0x000020, "Member 'CageHook_PlayerOverlapZoneBeginOverlap::SweepResult' has a wrong offset!");

// Function DBDGameplay.CageHook.PlayerOverlapZoneEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct CageHook_PlayerOverlapZoneEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CageHook_PlayerOverlapZoneEndOverlap) == 0x000008, "Wrong alignment on CageHook_PlayerOverlapZoneEndOverlap");
static_assert(sizeof(CageHook_PlayerOverlapZoneEndOverlap) == 0x000020, "Wrong size on CageHook_PlayerOverlapZoneEndOverlap");
static_assert(offsetof(CageHook_PlayerOverlapZoneEndOverlap, OverlappedComponent) == 0x000000, "Member 'CageHook_PlayerOverlapZoneEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneEndOverlap, OtherActor) == 0x000008, "Member 'CageHook_PlayerOverlapZoneEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneEndOverlap, OtherComp) == 0x000010, "Member 'CageHook_PlayerOverlapZoneEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(CageHook_PlayerOverlapZoneEndOverlap, OtherBodyIndex) == 0x000018, "Member 'CageHook_PlayerOverlapZoneEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function DBDGameplay.CageHook.GetCagedSurvivor
// 0x0008 (0x0008 - 0x0000)
struct CageHook_GetCagedSurvivor final
{
public:
	class ACamperPlayer*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_GetCagedSurvivor) == 0x000008, "Wrong alignment on CageHook_GetCagedSurvivor");
static_assert(sizeof(CageHook_GetCagedSurvivor) == 0x000008, "Wrong size on CageHook_GetCagedSurvivor");
static_assert(offsetof(CageHook_GetCagedSurvivor, ReturnValue) == 0x000000, "Member 'CageHook_GetCagedSurvivor::ReturnValue' has a wrong offset!");

// Function DBDGameplay.CageHook.GetMontagePlayer
// 0x0008 (0x0008 - 0x0000)
struct CageHook_GetMontagePlayer final
{
public:
	class UMontagePlayer*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_GetMontagePlayer) == 0x000008, "Wrong alignment on CageHook_GetMontagePlayer");
static_assert(sizeof(CageHook_GetMontagePlayer) == 0x000008, "Wrong size on CageHook_GetMontagePlayer");
static_assert(offsetof(CageHook_GetMontagePlayer, ReturnValue) == 0x000000, "Member 'CageHook_GetMontagePlayer::ReturnValue' has a wrong offset!");

// Function DBDGameplay.CageHook.GetRescuerSnapPosition
// 0x0018 (0x0018 - 0x0000)
struct CageHook_GetRescuerSnapPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageHook_GetRescuerSnapPosition) == 0x000008, "Wrong alignment on CageHook_GetRescuerSnapPosition");
static_assert(sizeof(CageHook_GetRescuerSnapPosition) == 0x000018, "Wrong size on CageHook_GetRescuerSnapPosition");
static_assert(offsetof(CageHook_GetRescuerSnapPosition, ReturnValue) == 0x000000, "Member 'CageHook_GetRescuerSnapPosition::ReturnValue' has a wrong offset!");

// Function DBDGameplay.BaseActorAttackableComponent.HitWithProjectile
// 0x0008 (0x0008 - 0x0000)
struct BaseActorAttackableComponent_HitWithProjectile final
{
public:
	class ABaseProjectile*                        Projectile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseActorAttackableComponent_HitWithProjectile) == 0x000008, "Wrong alignment on BaseActorAttackableComponent_HitWithProjectile");
static_assert(sizeof(BaseActorAttackableComponent_HitWithProjectile) == 0x000008, "Wrong size on BaseActorAttackableComponent_HitWithProjectile");
static_assert(offsetof(BaseActorAttackableComponent_HitWithProjectile, Projectile) == 0x000000, "Member 'BaseActorAttackableComponent_HitWithProjectile::Projectile' has a wrong offset!");

// Function DBDGameplay.CageRescueInteraction.GetRescuerSnapPosition
// 0x0018 (0x0018 - 0x0000)
struct CageRescueInteraction_GetRescuerSnapPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CageRescueInteraction_GetRescuerSnapPosition) == 0x000008, "Wrong alignment on CageRescueInteraction_GetRescuerSnapPosition");
static_assert(sizeof(CageRescueInteraction_GetRescuerSnapPosition) == 0x000018, "Wrong size on CageRescueInteraction_GetRescuerSnapPosition");
static_assert(offsetof(CageRescueInteraction_GetRescuerSnapPosition, ReturnValue) == 0x000000, "Member 'CageRescueInteraction_GetRescuerSnapPosition::ReturnValue' has a wrong offset!");

// Function DBDGameplay.SendToCageInteraction.FX_InteractionChargeCompleted
// 0x0008 (0x0008 - 0x0000)
struct SendToCageInteraction_FX_InteractionChargeCompleted final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SendToCageInteraction_FX_InteractionChargeCompleted) == 0x000008, "Wrong alignment on SendToCageInteraction_FX_InteractionChargeCompleted");
static_assert(sizeof(SendToCageInteraction_FX_InteractionChargeCompleted) == 0x000008, "Wrong size on SendToCageInteraction_FX_InteractionChargeCompleted");
static_assert(offsetof(SendToCageInteraction_FX_InteractionChargeCompleted, Player) == 0x000000, "Member 'SendToCageInteraction_FX_InteractionChargeCompleted::Player' has a wrong offset!");

// Function DBDGameplay.SendToCageInteraction.GetOwningSurvivor
// 0x0008 (0x0008 - 0x0000)
struct SendToCageInteraction_GetOwningSurvivor final
{
public:
	const class ACamperPlayer*                    ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SendToCageInteraction_GetOwningSurvivor) == 0x000008, "Wrong alignment on SendToCageInteraction_GetOwningSurvivor");
static_assert(sizeof(SendToCageInteraction_GetOwningSurvivor) == 0x000008, "Wrong size on SendToCageInteraction_GetOwningSurvivor");
static_assert(offsetof(SendToCageInteraction_GetOwningSurvivor, ReturnValue) == 0x000000, "Member 'SendToCageInteraction_GetOwningSurvivor::ReturnValue' has a wrong offset!");

// Function DBDGameplay.AuraOverriderComponent.ForceShowAura
// 0x0028 (0x0028 - 0x0000)
struct AuraOverriderComponent_ForceShowAura final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAlwaysVisible;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumOutlineDistanceVisible;                     // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumOutlineDistance;                            // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AuraOverriderComponent_ForceShowAura) == 0x000008, "Wrong alignment on AuraOverriderComponent_ForceShowAura");
static_assert(sizeof(AuraOverriderComponent_ForceShowAura) == 0x000028, "Wrong size on AuraOverriderComponent_ForceShowAura");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, Actor) == 0x000000, "Member 'AuraOverriderComponent_ForceShowAura::Actor' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, Color) == 0x000008, "Member 'AuraOverriderComponent_ForceShowAura::Color' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, IsAlwaysVisible) == 0x000018, "Member 'AuraOverriderComponent_ForceShowAura::IsAlwaysVisible' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, MinimumOutlineDistanceVisible) == 0x00001C, "Member 'AuraOverriderComponent_ForceShowAura::MinimumOutlineDistanceVisible' has a wrong offset!");
static_assert(offsetof(AuraOverriderComponent_ForceShowAura, MinimumOutlineDistance) == 0x000020, "Member 'AuraOverriderComponent_ForceShowAura::MinimumOutlineDistance' has a wrong offset!");

// Function DBDGameplay.AuraOverriderComponent.ResetAura
// 0x0008 (0x0008 - 0x0000)
struct AuraOverriderComponent_ResetAura final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuraOverriderComponent_ResetAura) == 0x000008, "Wrong alignment on AuraOverriderComponent_ResetAura");
static_assert(sizeof(AuraOverriderComponent_ResetAura) == 0x000008, "Wrong size on AuraOverriderComponent_ResetAura");
static_assert(offsetof(AuraOverriderComponent_ResetAura, Actor) == 0x000000, "Member 'AuraOverriderComponent_ResetAura::Actor' has a wrong offset!");

// Function DBDGameplay.BaseSightManagerComponent.Authority_OnCharacterSightChanged
// 0x0010 (0x0010 - 0x0000)
struct BaseSightManagerComponent_Authority_OnCharacterSightChanged final
{
public:
	class ACharacter*                             SightedCharacter;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCharacterSightComponent*               SightComponent;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSightManagerComponent_Authority_OnCharacterSightChanged) == 0x000008, "Wrong alignment on BaseSightManagerComponent_Authority_OnCharacterSightChanged");
static_assert(sizeof(BaseSightManagerComponent_Authority_OnCharacterSightChanged) == 0x000010, "Wrong size on BaseSightManagerComponent_Authority_OnCharacterSightChanged");
static_assert(offsetof(BaseSightManagerComponent_Authority_OnCharacterSightChanged, SightedCharacter) == 0x000000, "Member 'BaseSightManagerComponent_Authority_OnCharacterSightChanged::SightedCharacter' has a wrong offset!");
static_assert(offsetof(BaseSightManagerComponent_Authority_OnCharacterSightChanged, SightComponent) == 0x000008, "Member 'BaseSightManagerComponent_Authority_OnCharacterSightChanged::SightComponent' has a wrong offset!");

// Function DBDGameplay.FadeComponent.GetFadePercent
// 0x0004 (0x0004 - 0x0000)
struct FadeComponent_GetFadePercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FadeComponent_GetFadePercent) == 0x000004, "Wrong alignment on FadeComponent_GetFadePercent");
static_assert(sizeof(FadeComponent_GetFadePercent) == 0x000004, "Wrong size on FadeComponent_GetFadePercent");
static_assert(offsetof(FadeComponent_GetFadePercent, ReturnValue) == 0x000000, "Member 'FadeComponent_GetFadePercent::ReturnValue' has a wrong offset!");

// Function DBDGameplay.FlashlightTargetFXComponent.OnIsLitChanged
// 0x0001 (0x0001 - 0x0000)
struct FlashlightTargetFXComponent_OnIsLitChanged final
{
public:
	bool                                          IsLit;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlashlightTargetFXComponent_OnIsLitChanged) == 0x000001, "Wrong alignment on FlashlightTargetFXComponent_OnIsLitChanged");
static_assert(sizeof(FlashlightTargetFXComponent_OnIsLitChanged) == 0x000001, "Wrong size on FlashlightTargetFXComponent_OnIsLitChanged");
static_assert(offsetof(FlashlightTargetFXComponent_OnIsLitChanged, IsLit) == 0x000000, "Member 'FlashlightTargetFXComponent_OnIsLitChanged::IsLit' has a wrong offset!");

// Function DBDGameplay.TerrorRadiusScreenIndicatorComponent.OnHeartStateChanged
// 0x000C (0x000C - 0x0000)
struct TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged final
{
public:
	struct FGameplayTag                           HeartState;                                        // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged) == 0x000004, "Wrong alignment on TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged");
static_assert(sizeof(TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged) == 0x00000C, "Wrong size on TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged");
static_assert(offsetof(TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged, HeartState) == 0x000000, "Member 'TerrorRadiusScreenIndicatorComponent_OnHeartStateChanged::HeartState' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.OnRep_TokenCount
// 0x0004 (0x0004 - 0x0000)
struct KillerAbilityComponent_OnRep_TokenCount final
{
public:
	int32                                         OldCount;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_OnRep_TokenCount) == 0x000004, "Wrong alignment on KillerAbilityComponent_OnRep_TokenCount");
static_assert(sizeof(KillerAbilityComponent_OnRep_TokenCount) == 0x000004, "Wrong size on KillerAbilityComponent_OnRep_TokenCount");
static_assert(offsetof(KillerAbilityComponent_OnRep_TokenCount, OldCount) == 0x000000, "Member 'KillerAbilityComponent_OnRep_TokenCount::OldCount' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.GetCooldown
// 0x0004 (0x0004 - 0x0000)
struct KillerAbilityComponent_GetCooldown final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_GetCooldown) == 0x000004, "Wrong alignment on KillerAbilityComponent_GetCooldown");
static_assert(sizeof(KillerAbilityComponent_GetCooldown) == 0x000004, "Wrong size on KillerAbilityComponent_GetCooldown");
static_assert(offsetof(KillerAbilityComponent_GetCooldown, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_GetCooldown::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.GetDuration
// 0x0004 (0x0004 - 0x0000)
struct KillerAbilityComponent_GetDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_GetDuration) == 0x000004, "Wrong alignment on KillerAbilityComponent_GetDuration");
static_assert(sizeof(KillerAbilityComponent_GetDuration) == 0x000004, "Wrong size on KillerAbilityComponent_GetDuration");
static_assert(offsetof(KillerAbilityComponent_GetDuration, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_GetDuration::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.GetOwningKiller
// 0x0008 (0x0008 - 0x0000)
struct KillerAbilityComponent_GetOwningKiller final
{
public:
	class ASlasherPlayer*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_GetOwningKiller) == 0x000008, "Wrong alignment on KillerAbilityComponent_GetOwningKiller");
static_assert(sizeof(KillerAbilityComponent_GetOwningKiller) == 0x000008, "Wrong size on KillerAbilityComponent_GetOwningKiller");
static_assert(offsetof(KillerAbilityComponent_GetOwningKiller, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_GetOwningKiller::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.GetOwningPower
// 0x0008 (0x0008 - 0x0000)
struct KillerAbilityComponent_GetOwningPower final
{
public:
	class AKillerPower*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_GetOwningPower) == 0x000008, "Wrong alignment on KillerAbilityComponent_GetOwningPower");
static_assert(sizeof(KillerAbilityComponent_GetOwningPower) == 0x000008, "Wrong size on KillerAbilityComponent_GetOwningPower");
static_assert(offsetof(KillerAbilityComponent_GetOwningPower, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_GetOwningPower::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.GetRemainingCooldown
// 0x0004 (0x0004 - 0x0000)
struct KillerAbilityComponent_GetRemainingCooldown final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_GetRemainingCooldown) == 0x000004, "Wrong alignment on KillerAbilityComponent_GetRemainingCooldown");
static_assert(sizeof(KillerAbilityComponent_GetRemainingCooldown) == 0x000004, "Wrong size on KillerAbilityComponent_GetRemainingCooldown");
static_assert(offsetof(KillerAbilityComponent_GetRemainingCooldown, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_GetRemainingCooldown::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.GetRemainingCooldownPercent
// 0x0004 (0x0004 - 0x0000)
struct KillerAbilityComponent_GetRemainingCooldownPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_GetRemainingCooldownPercent) == 0x000004, "Wrong alignment on KillerAbilityComponent_GetRemainingCooldownPercent");
static_assert(sizeof(KillerAbilityComponent_GetRemainingCooldownPercent) == 0x000004, "Wrong size on KillerAbilityComponent_GetRemainingCooldownPercent");
static_assert(offsetof(KillerAbilityComponent_GetRemainingCooldownPercent, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_GetRemainingCooldownPercent::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.IsApplicable
// 0x0001 (0x0001 - 0x0000)
struct KillerAbilityComponent_IsApplicable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_IsApplicable) == 0x000001, "Wrong alignment on KillerAbilityComponent_IsApplicable");
static_assert(sizeof(KillerAbilityComponent_IsApplicable) == 0x000001, "Wrong size on KillerAbilityComponent_IsApplicable");
static_assert(offsetof(KillerAbilityComponent_IsApplicable, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_IsApplicable::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.IsAvailable
// 0x0001 (0x0001 - 0x0000)
struct KillerAbilityComponent_IsAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_IsAvailable) == 0x000001, "Wrong alignment on KillerAbilityComponent_IsAvailable");
static_assert(sizeof(KillerAbilityComponent_IsAvailable) == 0x000001, "Wrong size on KillerAbilityComponent_IsAvailable");
static_assert(offsetof(KillerAbilityComponent_IsAvailable, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_IsAvailable::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.IsOnCooldown
// 0x0001 (0x0001 - 0x0000)
struct KillerAbilityComponent_IsOnCooldown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KillerAbilityComponent_IsOnCooldown) == 0x000001, "Wrong alignment on KillerAbilityComponent_IsOnCooldown");
static_assert(sizeof(KillerAbilityComponent_IsOnCooldown) == 0x000001, "Wrong size on KillerAbilityComponent_IsOnCooldown");
static_assert(offsetof(KillerAbilityComponent_IsOnCooldown, ReturnValue) == 0x000000, "Member 'KillerAbilityComponent_IsOnCooldown::ReturnValue' has a wrong offset!");

// Function DBDGameplay.KillerAbilityComponent.PlayAudioOnOwningKiller
// 0x0010 (0x0010 - 0x0000)
struct KillerAbilityComponent_PlayAudioOnOwningKiller final
{
public:
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyPlayIfLocallyObserved;                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KillerAbilityComponent_PlayAudioOnOwningKiller) == 0x000008, "Wrong alignment on KillerAbilityComponent_PlayAudioOnOwningKiller");
static_assert(sizeof(KillerAbilityComponent_PlayAudioOnOwningKiller) == 0x000010, "Wrong size on KillerAbilityComponent_PlayAudioOnOwningKiller");
static_assert(offsetof(KillerAbilityComponent_PlayAudioOnOwningKiller, AudioEvent) == 0x000000, "Member 'KillerAbilityComponent_PlayAudioOnOwningKiller::AudioEvent' has a wrong offset!");
static_assert(offsetof(KillerAbilityComponent_PlayAudioOnOwningKiller, OnlyPlayIfLocallyObserved) == 0x000008, "Member 'KillerAbilityComponent_PlayAudioOnOwningKiller::OnlyPlayIfLocallyObserved' has a wrong offset!");

// Function DBDGameplay.PoseableHusk.OnActiveStateChanged
// 0x0001 (0x0001 - 0x0000)
struct PoseableHusk_OnActiveStateChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseableHusk_OnActiveStateChanged) == 0x000001, "Wrong alignment on PoseableHusk_OnActiveStateChanged");
static_assert(sizeof(PoseableHusk_OnActiveStateChanged) == 0x000001, "Wrong size on PoseableHusk_OnActiveStateChanged");
static_assert(offsetof(PoseableHusk_OnActiveStateChanged, IsActive) == 0x000000, "Member 'PoseableHusk_OnActiveStateChanged::IsActive' has a wrong offset!");

// Function DBDGameplay.PoseableHusk.SetIsActive
// 0x0001 (0x0001 - 0x0000)
struct PoseableHusk_SetIsActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseableHusk_SetIsActive) == 0x000001, "Wrong alignment on PoseableHusk_SetIsActive");
static_assert(sizeof(PoseableHusk_SetIsActive) == 0x000001, "Wrong size on PoseableHusk_SetIsActive");
static_assert(offsetof(PoseableHusk_SetIsActive, IsActive) == 0x000000, "Member 'PoseableHusk_SetIsActive::IsActive' has a wrong offset!");

// Function DBDGameplay.PoseableHusk.GetIsActive
// 0x0001 (0x0001 - 0x0000)
struct PoseableHusk_GetIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseableHusk_GetIsActive) == 0x000001, "Wrong alignment on PoseableHusk_GetIsActive");
static_assert(sizeof(PoseableHusk_GetIsActive) == 0x000001, "Wrong size on PoseableHusk_GetIsActive");
static_assert(offsetof(PoseableHusk_GetIsActive, ReturnValue) == 0x000000, "Member 'PoseableHusk_GetIsActive::ReturnValue' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.FireSoundEventFromInteractor
// 0x0010 (0x0010 - 0x0000)
struct ClosetHideInteraction_FireSoundEventFromInteractor final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADBDPlayer*                             InstigatingPlayer;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_FireSoundEventFromInteractor) == 0x000008, "Wrong alignment on ClosetHideInteraction_FireSoundEventFromInteractor");
static_assert(sizeof(ClosetHideInteraction_FireSoundEventFromInteractor) == 0x000010, "Wrong size on ClosetHideInteraction_FireSoundEventFromInteractor");
static_assert(offsetof(ClosetHideInteraction_FireSoundEventFromInteractor, Instigator) == 0x000000, "Member 'ClosetHideInteraction_FireSoundEventFromInteractor::Instigator' has a wrong offset!");
static_assert(offsetof(ClosetHideInteraction_FireSoundEventFromInteractor, InstigatingPlayer) == 0x000008, "Member 'ClosetHideInteraction_FireSoundEventFromInteractor::InstigatingPlayer' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.SetOtherInteractorsUsable
// 0x0001 (0x0001 - 0x0000)
struct ClosetHideInteraction_SetOtherInteractorsUsable final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_SetOtherInteractorsUsable) == 0x000001, "Wrong alignment on ClosetHideInteraction_SetOtherInteractorsUsable");
static_assert(sizeof(ClosetHideInteraction_SetOtherInteractorsUsable) == 0x000001, "Wrong size on ClosetHideInteraction_SetOtherInteractorsUsable");
static_assert(offsetof(ClosetHideInteraction_SetOtherInteractorsUsable, IsEnabled) == 0x000000, "Member 'ClosetHideInteraction_SetOtherInteractorsUsable::IsEnabled' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.GetInsideInteractor
// 0x0008 (0x0008 - 0x0000)
struct ClosetHideInteraction_GetInsideInteractor final
{
public:
	class UInteractor*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_GetInsideInteractor) == 0x000008, "Wrong alignment on ClosetHideInteraction_GetInsideInteractor");
static_assert(sizeof(ClosetHideInteraction_GetInsideInteractor) == 0x000008, "Wrong size on ClosetHideInteraction_GetInsideInteractor");
static_assert(offsetof(ClosetHideInteraction_GetInsideInteractor, ReturnValue) == 0x000000, "Member 'ClosetHideInteraction_GetInsideInteractor::ReturnValue' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.GetPlayerInCloset
// 0x0008 (0x0008 - 0x0000)
struct ClosetHideInteraction_GetPlayerInCloset final
{
public:
	class ADBDPlayer*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_GetPlayerInCloset) == 0x000008, "Wrong alignment on ClosetHideInteraction_GetPlayerInCloset");
static_assert(sizeof(ClosetHideInteraction_GetPlayerInCloset) == 0x000008, "Wrong size on ClosetHideInteraction_GetPlayerInCloset");
static_assert(offsetof(ClosetHideInteraction_GetPlayerInCloset, ReturnValue) == 0x000000, "Member 'ClosetHideInteraction_GetPlayerInCloset::ReturnValue' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.IsInteractingPlayerInsideCloset
// 0x0010 (0x0010 - 0x0000)
struct ClosetHideInteraction_IsInteractingPlayerInsideCloset final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ClosetHideInteraction_IsInteractingPlayerInsideCloset) == 0x000008, "Wrong alignment on ClosetHideInteraction_IsInteractingPlayerInsideCloset");
static_assert(sizeof(ClosetHideInteraction_IsInteractingPlayerInsideCloset) == 0x000010, "Wrong size on ClosetHideInteraction_IsInteractingPlayerInsideCloset");
static_assert(offsetof(ClosetHideInteraction_IsInteractingPlayerInsideCloset, Player) == 0x000000, "Member 'ClosetHideInteraction_IsInteractingPlayerInsideCloset::Player' has a wrong offset!");
static_assert(offsetof(ClosetHideInteraction_IsInteractingPlayerInsideCloset, ReturnValue) == 0x000008, "Member 'ClosetHideInteraction_IsInteractingPlayerInsideCloset::ReturnValue' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.IsOccupied
// 0x0001 (0x0001 - 0x0000)
struct ClosetHideInteraction_IsOccupied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_IsOccupied) == 0x000001, "Wrong alignment on ClosetHideInteraction_IsOccupied");
static_assert(sizeof(ClosetHideInteraction_IsOccupied) == 0x000001, "Wrong size on ClosetHideInteraction_IsOccupied");
static_assert(offsetof(ClosetHideInteraction_IsOccupied, ReturnValue) == 0x000000, "Member 'ClosetHideInteraction_IsOccupied::ReturnValue' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.IsRushed
// 0x0001 (0x0001 - 0x0000)
struct ClosetHideInteraction_IsRushed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_IsRushed) == 0x000001, "Wrong alignment on ClosetHideInteraction_IsRushed");
static_assert(sizeof(ClosetHideInteraction_IsRushed) == 0x000001, "Wrong size on ClosetHideInteraction_IsRushed");
static_assert(offsetof(ClosetHideInteraction_IsRushed, ReturnValue) == 0x000000, "Member 'ClosetHideInteraction_IsRushed::ReturnValue' has a wrong offset!");

// Function DBDGameplay.ClosetHideInteraction.SetCollisionWithCloset
// 0x0010 (0x0010 - 0x0000)
struct ClosetHideInteraction_SetCollisionWithCloset final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClosetHideInteraction_SetCollisionWithCloset) == 0x000008, "Wrong alignment on ClosetHideInteraction_SetCollisionWithCloset");
static_assert(sizeof(ClosetHideInteraction_SetCollisionWithCloset) == 0x000010, "Wrong size on ClosetHideInteraction_SetCollisionWithCloset");
static_assert(offsetof(ClosetHideInteraction_SetCollisionWithCloset, IsEnabled) == 0x000000, "Member 'ClosetHideInteraction_SetCollisionWithCloset::IsEnabled' has a wrong offset!");
static_assert(offsetof(ClosetHideInteraction_SetCollisionWithCloset, Player) == 0x000008, "Member 'ClosetHideInteraction_SetCollisionWithCloset::Player' has a wrong offset!");

// Function DBDGameplay.ClosetHideEnterInteraction.EjectSurvivorFromLocker
// 0x0010 (0x0010 - 0x0000)
struct ClosetHideEnterInteraction_EjectSurvivorFromLocker final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
