#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDInteraction

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDInteraction.GeneratorRepairInteraction
// 0x0080 (0x0940 - 0x08C0)
class UGeneratorRepairInteraction : public UChargeableInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _penaltyPerRepairPlayerCount[0x3];                 // 0x08C0(0x0028)(Edit, EditFixedSize, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_938[0x8];                                      // 0x0938(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnSkillCheckResponseAuthority(bool Success, bool Bonus, class ADBDPlayer* Player, bool TriggerLoudNoise, ESkillCheckCustomType Type);
	void SetIsObstructed(bool Obstructed);

	float GetInteractionChargeSpeedMultiplier_Implementation(const class ADBDPlayer* Character) const;
	class AGenerator* GetOwningGenerator() const;
	bool IsBeingRepaired() const;
	bool IsInteractionPossibleInternal(const class ADBDPlayer* Player) const;
	bool IsObstructed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneratorRepairInteraction">();
	}
	static class UGeneratorRepairInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneratorRepairInteraction>();
	}
};
static_assert(alignof(UGeneratorRepairInteraction) == 0x000010, "Wrong alignment on UGeneratorRepairInteraction");
static_assert(sizeof(UGeneratorRepairInteraction) == 0x000940, "Wrong size on UGeneratorRepairInteraction");
static_assert(offsetof(UGeneratorRepairInteraction, _penaltyPerRepairPlayerCount) == 0x0008C0, "Member 'UGeneratorRepairInteraction::_penaltyPerRepairPlayerCount' has a wrong offset!");

// Class DBDInteraction.ThrowInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UThrowInteraction : public UChargeableInteractionDefinition
{
public:
	class UCurveFloat*                            _throwCancelledSpeedCurve;                         // 0x08C0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _throwCancellationExitTime;                        // 0x08C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitThrowCancellationExitTime(float Value);

	bool HasCancelledThrow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ThrowInteraction">();
	}
	static class UThrowInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThrowInteraction>();
	}
};
static_assert(alignof(UThrowInteraction) == 0x000010, "Wrong alignment on UThrowInteraction");
static_assert(sizeof(UThrowInteraction) == 0x0008D0, "Wrong size on UThrowInteraction");
static_assert(offsetof(UThrowInteraction, _throwCancelledSpeedCurve) == 0x0008C0, "Member 'UThrowInteraction::_throwCancelledSpeedCurve' has a wrong offset!");
static_assert(offsetof(UThrowInteraction, _throwCancellationExitTime) == 0x0008C8, "Member 'UThrowInteraction::_throwCancellationExitTime' has a wrong offset!");

// Class DBDInteraction.BaseStalkModeInteraction
// 0x0000 (0x0780 - 0x0780)
class UBaseStalkModeInteraction : public UInteractionDefinition
{
public:
	bool CanStalk() const;
	class UStalkerComponent* GetStalkerComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseStalkModeInteraction">();
	}
	static class UBaseStalkModeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseStalkModeInteraction>();
	}
};
static_assert(alignof(UBaseStalkModeInteraction) == 0x000010, "Wrong alignment on UBaseStalkModeInteraction");
static_assert(sizeof(UBaseStalkModeInteraction) == 0x000780, "Wrong size on UBaseStalkModeInteraction");

// Class DBDInteraction.BaseTotemInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UBaseTotemInteraction : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x10];                                     // 0x08C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ATotem* GetTotem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseTotemInteraction">();
	}
	static class UBaseTotemInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseTotemInteraction>();
	}
};
static_assert(alignof(UBaseTotemInteraction) == 0x000010, "Wrong alignment on UBaseTotemInteraction");
static_assert(sizeof(UBaseTotemInteraction) == 0x0008D0, "Wrong size on UBaseTotemInteraction");

// Class DBDInteraction.CleanseTotem
// 0x0000 (0x08D0 - 0x08D0)
class UCleanseTotem : public UBaseTotemInteraction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CleanseTotem">();
	}
	static class UCleanseTotem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCleanseTotem>();
	}
};
static_assert(alignof(UCleanseTotem) == 0x000010, "Wrong alignment on UCleanseTotem");
static_assert(sizeof(UCleanseTotem) == 0x0008D0, "Wrong size on UCleanseTotem");

// Class DBDInteraction.CollectItemInteraction
// 0x0030 (0x07B0 - 0x0780)
#pragma pack(push, 0x1)
class alignas(0x10) UCollectItemInteraction : public UInteractionDefinition
{
public:
	uint8                                         Pad_778[0x8];                                      // 0x0778(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCollectUpdateStart;                              // 0x0780(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCollectUpdateEnd;                                // 0x0790(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A0[0x8];                                      // 0x07A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ACollectable* GetItem() const;
	class ACollectable* GetItemToReplace(const class ADBDPlayer* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectItemInteraction">();
	}
	static class UCollectItemInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectItemInteraction>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCollectItemInteraction) == 0x000010, "Wrong alignment on UCollectItemInteraction");
static_assert(sizeof(UCollectItemInteraction) == 0x0007B0, "Wrong size on UCollectItemInteraction");
static_assert(offsetof(UCollectItemInteraction, OnCollectUpdateStart) == 0x000780, "Member 'UCollectItemInteraction::OnCollectUpdateStart' has a wrong offset!");
static_assert(offsetof(UCollectItemInteraction, OnCollectUpdateEnd) == 0x000790, "Member 'UCollectItemInteraction::OnCollectUpdateEnd' has a wrong offset!");

// Class DBDInteraction.EscapeMapInteraction
// 0x0000 (0x0780 - 0x0780)
class UEscapeMapInteraction : public UInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EscapeMapInteraction">();
	}
	static class UEscapeMapInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEscapeMapInteraction>();
	}
};
static_assert(alignof(UEscapeMapInteraction) == 0x000010, "Wrong alignment on UEscapeMapInteraction");
static_assert(sizeof(UEscapeMapInteraction) == 0x000780, "Wrong size on UEscapeMapInteraction");

// Class DBDInteraction.SetTrapInteraction
// 0x0080 (0x0940 - 0x08C0)
class USetTrapInteraction : public UChargeableInteractionDefinition
{
public:
	struct FSocketOrBoneCache                     _dropSocket;                                       // 0x08C0(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SetTrapInteraction">();
	}
	static class USetTrapInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetTrapInteraction>();
	}
};
static_assert(alignof(USetTrapInteraction) == 0x000010, "Wrong alignment on USetTrapInteraction");
static_assert(sizeof(USetTrapInteraction) == 0x000940, "Wrong size on USetTrapInteraction");
static_assert(offsetof(USetTrapInteraction, _dropSocket) == 0x0008C0, "Member 'USetTrapInteraction::_dropSocket' has a wrong offset!");

// Class DBDInteraction.BasicChargeableInteraction
// 0x0060 (0x0920 - 0x08C0)
class UBasicChargeableInteraction : public UChargeableInteractionDefinition
{
public:
	bool                                          AutoSpawnChargeableComponent;                      // 0x08C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ResetProgressWhenStoppingInteraction;              // 0x08C1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AutoAddCharge;                                     // 0x08C2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C3[0x5];                                      // 0x08C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UChargeableComponent*                   _spawnedChargeable;                                // 0x08C8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _chargeTime;                                       // 0x08D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _dechargeTime;                                     // 0x08F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void OnRep_SpawnedChargeable();

	float GetChargeTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicChargeableInteraction">();
	}
	static class UBasicChargeableInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicChargeableInteraction>();
	}
};
static_assert(alignof(UBasicChargeableInteraction) == 0x000010, "Wrong alignment on UBasicChargeableInteraction");
static_assert(sizeof(UBasicChargeableInteraction) == 0x000920, "Wrong size on UBasicChargeableInteraction");
static_assert(offsetof(UBasicChargeableInteraction, AutoSpawnChargeableComponent) == 0x0008C0, "Member 'UBasicChargeableInteraction::AutoSpawnChargeableComponent' has a wrong offset!");
static_assert(offsetof(UBasicChargeableInteraction, ResetProgressWhenStoppingInteraction) == 0x0008C1, "Member 'UBasicChargeableInteraction::ResetProgressWhenStoppingInteraction' has a wrong offset!");
static_assert(offsetof(UBasicChargeableInteraction, AutoAddCharge) == 0x0008C2, "Member 'UBasicChargeableInteraction::AutoAddCharge' has a wrong offset!");
static_assert(offsetof(UBasicChargeableInteraction, _spawnedChargeable) == 0x0008C8, "Member 'UBasicChargeableInteraction::_spawnedChargeable' has a wrong offset!");
static_assert(offsetof(UBasicChargeableInteraction, _chargeTime) == 0x0008D0, "Member 'UBasicChargeableInteraction::_chargeTime' has a wrong offset!");
static_assert(offsetof(UBasicChargeableInteraction, _dechargeTime) == 0x0008F8, "Member 'UBasicChargeableInteraction::_dechargeTime' has a wrong offset!");

// Class DBDInteraction.SnuffTotem
// 0x0000 (0x0780 - 0x0780)
class USnuffTotem : public UInteractionDefinition
{
public:
	float                                         _slasherFacingTolerance;                           // 0x0778(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SnuffTotem">();
	}
	static class USnuffTotem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnuffTotem>();
	}
};
static_assert(alignof(USnuffTotem) == 0x000010, "Wrong alignment on USnuffTotem");
static_assert(sizeof(USnuffTotem) == 0x000780, "Wrong size on USnuffTotem");
static_assert(offsetof(USnuffTotem, _slasherFacingTolerance) == 0x000778, "Member 'USnuffTotem::_slasherFacingTolerance' has a wrong offset!");

// Class DBDInteraction.BaseLockerInteraction
// 0x0030 (0x07B0 - 0x0780)
#pragma pack(push, 0x1)
class alignas(0x10) UBaseLockerInteraction : public UInteractionDefinition
{
public:
	class ALocker*                                _owningLocker;                                     // 0x0778(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  _lockerPreventingTags;                             // 0x0780(0x0020)(Edit, NativeAccessSpecifierPrivate)
	bool                                          _lockerIsMontageFollower;                          // 0x07A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ALocker* GetLocker() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseLockerInteraction">();
	}
	static class UBaseLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseLockerInteraction>();
	}
};
#pragma pack(pop)
static_assert(alignof(UBaseLockerInteraction) == 0x000010, "Wrong alignment on UBaseLockerInteraction");
static_assert(sizeof(UBaseLockerInteraction) == 0x0007B0, "Wrong size on UBaseLockerInteraction");
static_assert(offsetof(UBaseLockerInteraction, _owningLocker) == 0x000778, "Member 'UBaseLockerInteraction::_owningLocker' has a wrong offset!");
static_assert(offsetof(UBaseLockerInteraction, _lockerPreventingTags) == 0x000780, "Member 'UBaseLockerInteraction::_lockerPreventingTags' has a wrong offset!");
static_assert(offsetof(UBaseLockerInteraction, _lockerIsMontageFollower) == 0x0007A0, "Member 'UBaseLockerInteraction::_lockerIsMontageFollower' has a wrong offset!");

// Class DBDInteraction.SelfUnhook
// 0x00C0 (0x0980 - 0x08C0)
class USelfUnhook : public UChargeableInteractionDefinition
{
public:
	struct FAnimationMontageDescriptor            _selfUnhookMontage;                                // 0x08C0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FString                                 _guaranteedUnhookAttemptText;                      // 0x08E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _enduranceEffectDuration;                          // 0x08F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _movementSpeedBonusDuration;                       // 0x0918(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _enduranceEffectClass;                             // 0x0940(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _movementSpeedBonusEffectClass;                    // 0x0948(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_950[0x30];                                     // 0x0950(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelfUnhook">();
	}
	static class USelfUnhook* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfUnhook>();
	}
};
static_assert(alignof(USelfUnhook) == 0x000010, "Wrong alignment on USelfUnhook");
static_assert(sizeof(USelfUnhook) == 0x000980, "Wrong size on USelfUnhook");
static_assert(offsetof(USelfUnhook, _selfUnhookMontage) == 0x0008C0, "Member 'USelfUnhook::_selfUnhookMontage' has a wrong offset!");
static_assert(offsetof(USelfUnhook, _guaranteedUnhookAttemptText) == 0x0008E0, "Member 'USelfUnhook::_guaranteedUnhookAttemptText' has a wrong offset!");
static_assert(offsetof(USelfUnhook, _enduranceEffectDuration) == 0x0008F0, "Member 'USelfUnhook::_enduranceEffectDuration' has a wrong offset!");
static_assert(offsetof(USelfUnhook, _movementSpeedBonusDuration) == 0x000918, "Member 'USelfUnhook::_movementSpeedBonusDuration' has a wrong offset!");
static_assert(offsetof(USelfUnhook, _enduranceEffectClass) == 0x000940, "Member 'USelfUnhook::_enduranceEffectClass' has a wrong offset!");
static_assert(offsetof(USelfUnhook, _movementSpeedBonusEffectClass) == 0x000948, "Member 'USelfUnhook::_movementSpeedBonusEffectClass' has a wrong offset!");

// Class DBDInteraction.ItemCraftInteraction
// 0x0020 (0x07A0 - 0x0780)
class UItemCraftInteraction : public UInteractionDefinition
{
public:
	class FName                                   _attachToSocketName;                               // 0x0778(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ACollectable>               _collectableClass;                                 // 0x0788(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_790[0x10];                                     // 0x0790(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemCraftInteraction">();
	}
	static class UItemCraftInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemCraftInteraction>();
	}
};
static_assert(alignof(UItemCraftInteraction) == 0x000010, "Wrong alignment on UItemCraftInteraction");
static_assert(sizeof(UItemCraftInteraction) == 0x0007A0, "Wrong size on UItemCraftInteraction");
static_assert(offsetof(UItemCraftInteraction, _attachToSocketName) == 0x000778, "Member 'UItemCraftInteraction::_attachToSocketName' has a wrong offset!");
static_assert(offsetof(UItemCraftInteraction, _collectableClass) == 0x000788, "Member 'UItemCraftInteraction::_collectableClass' has a wrong offset!");

// Class DBDInteraction.WakeUpOtherInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UWakeUpOtherInteraction final : public UChargeableInteractionDefinition
{
public:
	class UCurveFloat*                            _wakeUpTimeCurve;                                  // 0x08C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WakeUpOtherInteraction">();
	}
	static class UWakeUpOtherInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWakeUpOtherInteraction>();
	}
};
static_assert(alignof(UWakeUpOtherInteraction) == 0x000010, "Wrong alignment on UWakeUpOtherInteraction");
static_assert(sizeof(UWakeUpOtherInteraction) == 0x0008D0, "Wrong size on UWakeUpOtherInteraction");
static_assert(offsetof(UWakeUpOtherInteraction, _wakeUpTimeCurve) == 0x0008C0, "Member 'UWakeUpOtherInteraction::_wakeUpTimeCurve' has a wrong offset!");

// Class DBDInteraction.TrapInteractableInteraction
// 0x0000 (0x0780 - 0x0780)
class UTrapInteractableInteraction : public UInteractionDefinition
{
public:
	class AInteractable*                          _owningInteractable;                               // 0x0778(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrapInteractableInteraction">();
	}
	static class UTrapInteractableInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrapInteractableInteraction>();
	}
};
static_assert(alignof(UTrapInteractableInteraction) == 0x000010, "Wrong alignment on UTrapInteractableInteraction");
static_assert(sizeof(UTrapInteractableInteraction) == 0x000780, "Wrong size on UTrapInteractableInteraction");
static_assert(offsetof(UTrapInteractableInteraction, _owningInteractable) == 0x000778, "Member 'UTrapInteractableInteraction::_owningInteractable' has a wrong offset!");

// Class DBDInteraction.DestroyBreakableWallWithPowerInteraction
// 0x0000 (0x0780 - 0x0780)
class UDestroyBreakableWallWithPowerInteraction : public UInteractionDefinition
{
public:
	void CustomizePropertiesForBlight(class ADBDPlayer* Killer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DestroyBreakableWallWithPowerInteraction">();
	}
	static class UDestroyBreakableWallWithPowerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroyBreakableWallWithPowerInteraction>();
	}
};
static_assert(alignof(UDestroyBreakableWallWithPowerInteraction) == 0x000010, "Wrong alignment on UDestroyBreakableWallWithPowerInteraction");
static_assert(sizeof(UDestroyBreakableWallWithPowerInteraction) == 0x000780, "Wrong size on UDestroyBreakableWallWithPowerInteraction");

// Class DBDInteraction.SearchChestInteractionBase
// 0x0020 (0x08E0 - 0x08C0)
class USearchChestInteractionBase : public UChargeableInteractionDefinition
{
public:
	bool                                          _handleCompletionScoreEvents;                      // 0x08C0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C1[0x3];                                      // 0x08C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _searchableCompleteContributionPercentTag;         // 0x08C4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _scoreEventFired;                                  // 0x08D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASearchable*                            _owningChest;                                      // 0x08D8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void FireChestScoreEvent(const class ADBDPlayer* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SearchChestInteractionBase">();
	}
	static class USearchChestInteractionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USearchChestInteractionBase>();
	}
};
static_assert(alignof(USearchChestInteractionBase) == 0x000010, "Wrong alignment on USearchChestInteractionBase");
static_assert(sizeof(USearchChestInteractionBase) == 0x0008E0, "Wrong size on USearchChestInteractionBase");
static_assert(offsetof(USearchChestInteractionBase, _handleCompletionScoreEvents) == 0x0008C0, "Member 'USearchChestInteractionBase::_handleCompletionScoreEvents' has a wrong offset!");
static_assert(offsetof(USearchChestInteractionBase, _searchableCompleteContributionPercentTag) == 0x0008C4, "Member 'USearchChestInteractionBase::_searchableCompleteContributionPercentTag' has a wrong offset!");
static_assert(offsetof(USearchChestInteractionBase, _scoreEventFired) == 0x0008D0, "Member 'USearchChestInteractionBase::_scoreEventFired' has a wrong offset!");
static_assert(offsetof(USearchChestInteractionBase, _owningChest) == 0x0008D8, "Member 'USearchChestInteractionBase::_owningChest' has a wrong offset!");

// Class DBDInteraction.LockerFakeEnterInteraction
// 0x0030 (0x07E0 - 0x07B0)
class ULockerFakeEnterInteraction : public UBaseLockerInteraction
{
public:
	float                                         _lockerInteractionBlockTime;                       // 0x07A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _fakeEnterLoudNoiseRange;                          // 0x07B0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LockerFakeEnterInteraction">();
	}
	static class ULockerFakeEnterInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULockerFakeEnterInteraction>();
	}
};
static_assert(alignof(ULockerFakeEnterInteraction) == 0x000010, "Wrong alignment on ULockerFakeEnterInteraction");
static_assert(sizeof(ULockerFakeEnterInteraction) == 0x0007E0, "Wrong size on ULockerFakeEnterInteraction");
static_assert(offsetof(ULockerFakeEnterInteraction, _lockerInteractionBlockTime) == 0x0007A8, "Member 'ULockerFakeEnterInteraction::_lockerInteractionBlockTime' has a wrong offset!");
static_assert(offsetof(ULockerFakeEnterInteraction, _fakeEnterLoudNoiseRange) == 0x0007B0, "Member 'ULockerFakeEnterInteraction::_fakeEnterLoudNoiseRange' has a wrong offset!");

// Class DBDInteraction.OpenChestInteraction
// 0x0020 (0x0900 - 0x08E0)
class UOpenChestInteraction : public USearchChestInteractionBase
{
public:
	struct FGameplayTag                           _camperSearchablePercentTag;                       // 0x08E0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8EC[0x4];                                      // 0x08EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          _successExitTimeAnimSequenceReference;             // 0x08F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _startTime;                                        // 0x08F8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpenChestInteraction">();
	}
	static class UOpenChestInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenChestInteraction>();
	}
};
static_assert(alignof(UOpenChestInteraction) == 0x000010, "Wrong alignment on UOpenChestInteraction");
static_assert(sizeof(UOpenChestInteraction) == 0x000900, "Wrong size on UOpenChestInteraction");
static_assert(offsetof(UOpenChestInteraction, _camperSearchablePercentTag) == 0x0008E0, "Member 'UOpenChestInteraction::_camperSearchablePercentTag' has a wrong offset!");
static_assert(offsetof(UOpenChestInteraction, _successExitTimeAnimSequenceReference) == 0x0008F0, "Member 'UOpenChestInteraction::_successExitTimeAnimSequenceReference' has a wrong offset!");
static_assert(offsetof(UOpenChestInteraction, _startTime) == 0x0008F8, "Member 'UOpenChestInteraction::_startTime' has a wrong offset!");

// Class DBDInteraction.SearchLockerInteraction
// 0x0000 (0x07B0 - 0x07B0)
class USearchLockerInteraction : public UBaseLockerInteraction
{
public:
	bool                                          _possibleWhenOccupied;                             // 0x07A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _killerFacingLockerToleranceAngle;                 // 0x07AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SearchLockerInteraction">();
	}
	static class USearchLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USearchLockerInteraction>();
	}
};
static_assert(alignof(USearchLockerInteraction) == 0x000010, "Wrong alignment on USearchLockerInteraction");
static_assert(sizeof(USearchLockerInteraction) == 0x0007B0, "Wrong size on USearchLockerInteraction");
static_assert(offsetof(USearchLockerInteraction, _possibleWhenOccupied) == 0x0007A8, "Member 'USearchLockerInteraction::_possibleWhenOccupied' has a wrong offset!");
static_assert(offsetof(USearchLockerInteraction, _killerFacingLockerToleranceAngle) == 0x0007AC, "Member 'USearchLockerInteraction::_killerFacingLockerToleranceAngle' has a wrong offset!");

// Class DBDInteraction.AntiCampSelfUnhook
// 0x00B0 (0x0970 - 0x08C0)
class UAntiCampSelfUnhook : public UChargeableInteractionDefinition
{
public:
	struct FAnimationMontageDescriptor            _selfUnhookMontage;                                // 0x08C0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _enduranceEffectDuration;                          // 0x08E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _movementSpeedBonusDuration;                       // 0x0908(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _enduranceEffectClass;                             // 0x0930(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _movementSpeedBonusEffectClass;                    // 0x0938(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_940[0x30];                                     // 0x0940(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetAntiCampTrapImmunityDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AntiCampSelfUnhook">();
	}
	static class UAntiCampSelfUnhook* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAntiCampSelfUnhook>();
	}
};
static_assert(alignof(UAntiCampSelfUnhook) == 0x000010, "Wrong alignment on UAntiCampSelfUnhook");
static_assert(sizeof(UAntiCampSelfUnhook) == 0x000970, "Wrong size on UAntiCampSelfUnhook");
static_assert(offsetof(UAntiCampSelfUnhook, _selfUnhookMontage) == 0x0008C0, "Member 'UAntiCampSelfUnhook::_selfUnhookMontage' has a wrong offset!");
static_assert(offsetof(UAntiCampSelfUnhook, _enduranceEffectDuration) == 0x0008E0, "Member 'UAntiCampSelfUnhook::_enduranceEffectDuration' has a wrong offset!");
static_assert(offsetof(UAntiCampSelfUnhook, _movementSpeedBonusDuration) == 0x000908, "Member 'UAntiCampSelfUnhook::_movementSpeedBonusDuration' has a wrong offset!");
static_assert(offsetof(UAntiCampSelfUnhook, _enduranceEffectClass) == 0x000930, "Member 'UAntiCampSelfUnhook::_enduranceEffectClass' has a wrong offset!");
static_assert(offsetof(UAntiCampSelfUnhook, _movementSpeedBonusEffectClass) == 0x000938, "Member 'UAntiCampSelfUnhook::_movementSpeedBonusEffectClass' has a wrong offset!");

// Class DBDInteraction.BlessTotem
// 0x0030 (0x0900 - 0x08D0)
class UBlessTotem : public UBaseTotemInteraction
{
public:
	struct FDBDTunableRowHandle                   _blessHexTotemSpeedPenalty;                        // 0x08D0(0x0028)(Edit, EditFixedSize, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnInteractionFinished();
	void Cosmetic_OnInteractionStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlessTotem">();
	}
	static class UBlessTotem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlessTotem>();
	}
};
static_assert(alignof(UBlessTotem) == 0x000010, "Wrong alignment on UBlessTotem");
static_assert(sizeof(UBlessTotem) == 0x000900, "Wrong size on UBlessTotem");
static_assert(offsetof(UBlessTotem, _blessHexTotemSpeedPenalty) == 0x0008D0, "Member 'UBlessTotem::_blessHexTotemSpeedPenalty' has a wrong offset!");

// Class DBDInteraction.CollectItemFromSearchableInteraction
// 0x0010 (0x07C0 - 0x07B0)
class UCollectItemFromSearchableInteraction : public UCollectItemInteraction
{
public:
	uint8                                         Pad_7A8[0x18];                                     // 0x07A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectItemFromSearchableInteraction">();
	}
	static class UCollectItemFromSearchableInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectItemFromSearchableInteraction>();
	}
};
static_assert(alignof(UCollectItemFromSearchableInteraction) == 0x000010, "Wrong alignment on UCollectItemFromSearchableInteraction");
static_assert(sizeof(UCollectItemFromSearchableInteraction) == 0x0007C0, "Wrong size on UCollectItemFromSearchableInteraction");

// Class DBDInteraction.CollectItemInCrateInteraction
// 0x0010 (0x07C0 - 0x07B0)
class UCollectItemInCrateInteraction final : public UCollectItemInteraction
{
public:
	class ASupplyCrateInteractable*               _owningSupplyCrate;                                // 0x07A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7B0[0x10];                                     // 0x07B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectItemInCrateInteraction">();
	}
	static class UCollectItemInCrateInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectItemInCrateInteraction>();
	}
};
static_assert(alignof(UCollectItemInCrateInteraction) == 0x000010, "Wrong alignment on UCollectItemInCrateInteraction");
static_assert(sizeof(UCollectItemInCrateInteraction) == 0x0007C0, "Wrong size on UCollectItemInCrateInteraction");
static_assert(offsetof(UCollectItemInCrateInteraction, _owningSupplyCrate) == 0x0007A8, "Member 'UCollectItemInCrateInteraction::_owningSupplyCrate' has a wrong offset!");

// Class DBDInteraction.DestroyPalletDefinition
// 0x0040 (0x07C0 - 0x0780)
class UDestroyPalletDefinition : public UInteractionDefinition
{
public:
	float                                         _interactionTimePercentForDestroyEvent;            // 0x0778(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_77C[0x44];                                     // 0x077C(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DestroyPalletDefinition">();
	}
	static class UDestroyPalletDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroyPalletDefinition>();
	}
};
static_assert(alignof(UDestroyPalletDefinition) == 0x000010, "Wrong alignment on UDestroyPalletDefinition");
static_assert(sizeof(UDestroyPalletDefinition) == 0x0007C0, "Wrong size on UDestroyPalletDefinition");
static_assert(offsetof(UDestroyPalletDefinition, _interactionTimePercentForDestroyEvent) == 0x000778, "Member 'UDestroyPalletDefinition::_interactionTimePercentForDestroyEvent' has a wrong offset!");

// Class DBDInteraction.DropItemInteraction
// 0x0000 (0x0780 - 0x0780)
class UDropItemInteraction final : public UInteractionDefinition
{
public:
	class ACollectable* GetItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DropItemInteraction">();
	}
	static class UDropItemInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDropItemInteraction>();
	}
};
static_assert(alignof(UDropItemInteraction) == 0x000010, "Wrong alignment on UDropItemInteraction");
static_assert(sizeof(UDropItemInteraction) == 0x000780, "Wrong size on UDropItemInteraction");

// Class DBDInteraction.GeneratorDamageInteraction
// 0x0080 (0x0940 - 0x08C0)
class UGeneratorDamageInteraction : public UChargeableInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _fastInteractionAnimThreshold;                     // 0x08C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UAkAudioEvent*> _canceledSfxBasedOnKiller;                         // 0x08E8(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_938[0x8];                                      // 0x0938(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneratorDamageInteraction">();
	}
	static class UGeneratorDamageInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneratorDamageInteraction>();
	}
};
static_assert(alignof(UGeneratorDamageInteraction) == 0x000010, "Wrong alignment on UGeneratorDamageInteraction");
static_assert(sizeof(UGeneratorDamageInteraction) == 0x000940, "Wrong size on UGeneratorDamageInteraction");
static_assert(offsetof(UGeneratorDamageInteraction, _fastInteractionAnimThreshold) == 0x0008C0, "Member 'UGeneratorDamageInteraction::_fastInteractionAnimThreshold' has a wrong offset!");
static_assert(offsetof(UGeneratorDamageInteraction, _canceledSfxBasedOnKiller) == 0x0008E8, "Member 'UGeneratorDamageInteraction::_canceledSfxBasedOnKiller' has a wrong offset!");

// Class DBDInteraction.GeneratorToolboxRepairInteraction
// 0x0080 (0x09C0 - 0x0940)
class UGeneratorToolboxRepairInteraction : public UGeneratorRepairInteraction
{
public:
	class FText                                   _interactionTextWhenEmpty;                         // 0x0940(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _repairSkillCheckDurationWhenEmpty;                // 0x0958(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _repairSkillCheckChanceWhenEmpty;                  // 0x0980(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9A8[0x18];                                     // 0x09A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetInteractionTextWhenEmpty() const;
	bool HasChargedToolBox(const class ADBDPlayer* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneratorToolboxRepairInteraction">();
	}
	static class UGeneratorToolboxRepairInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneratorToolboxRepairInteraction>();
	}
};
static_assert(alignof(UGeneratorToolboxRepairInteraction) == 0x000010, "Wrong alignment on UGeneratorToolboxRepairInteraction");
static_assert(sizeof(UGeneratorToolboxRepairInteraction) == 0x0009C0, "Wrong size on UGeneratorToolboxRepairInteraction");
static_assert(offsetof(UGeneratorToolboxRepairInteraction, _interactionTextWhenEmpty) == 0x000940, "Member 'UGeneratorToolboxRepairInteraction::_interactionTextWhenEmpty' has a wrong offset!");
static_assert(offsetof(UGeneratorToolboxRepairInteraction, _repairSkillCheckDurationWhenEmpty) == 0x000958, "Member 'UGeneratorToolboxRepairInteraction::_repairSkillCheckDurationWhenEmpty' has a wrong offset!");
static_assert(offsetof(UGeneratorToolboxRepairInteraction, _repairSkillCheckChanceWhenEmpty) == 0x000980, "Member 'UGeneratorToolboxRepairInteraction::_repairSkillCheckChanceWhenEmpty' has a wrong offset!");

// Class DBDInteraction.GenericStunInteractionDefinition
// 0x0000 (0x0780 - 0x0780)
#pragma pack(push, 0x1)
class alignas(0x10) UGenericStunInteractionDefinition : public UInteractionDefinition
{
public:
	void DispatchStunEvent(class ADBDPlayer* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericStunInteractionDefinition">();
	}
	static class UGenericStunInteractionDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericStunInteractionDefinition>();
	}
};
#pragma pack(pop)
static_assert(alignof(UGenericStunInteractionDefinition) == 0x000010, "Wrong alignment on UGenericStunInteractionDefinition");
static_assert(sizeof(UGenericStunInteractionDefinition) == 0x000780, "Wrong size on UGenericStunInteractionDefinition");

// Class DBDInteraction.HealInteraction
// 0x0010 (0x08D0 - 0x08C0)
#pragma pack(push, 0x1)
class alignas(0x10) UHealInteraction : public UChargeableInteractionDefinition
{
public:
	class ADBDPlayer*                             _healingPlayer;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnHealChargeApplied(float IndividualChargeAmount, float TotalChargeAmount, class AActor* ChargeInstigator, bool WasCoop, float DeltaTime);
	void Authority_OnPlayerHealed(class ADBDPlayer* HealingPlayer, class ADBDPlayer* HealedPlayer);
	void Authority_OnSurvivorHealed(const struct FCamperHealResult& HealResult);

	float GetHealScorePercent(float Delta) const;
	class ACamperPlayer* GetTargetSurvivor() const;
	bool HasChargedMedkit(const class ADBDPlayer* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HealInteraction">();
	}
	static class UHealInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealInteraction>();
	}
};
#pragma pack(pop)
static_assert(alignof(UHealInteraction) == 0x000010, "Wrong alignment on UHealInteraction");
static_assert(sizeof(UHealInteraction) == 0x0008D0, "Wrong size on UHealInteraction");
static_assert(offsetof(UHealInteraction, _healingPlayer) == 0x0008C0, "Member 'UHealInteraction::_healingPlayer' has a wrong offset!");

// Class DBDInteraction.HealOtherInteraction
// 0x0030 (0x0900 - 0x08D0)
class UHealOtherInteraction : public UHealInteraction
{
public:
	struct FVector                                SlashableRelativeLocationInjured;                  // 0x08C8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                SlashableRelativeLocationKO;                       // 0x08E0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HealOtherInteraction">();
	}
	static class UHealOtherInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealOtherInteraction>();
	}
};
static_assert(alignof(UHealOtherInteraction) == 0x000010, "Wrong alignment on UHealOtherInteraction");
static_assert(sizeof(UHealOtherInteraction) == 0x000900, "Wrong size on UHealOtherInteraction");
static_assert(offsetof(UHealOtherInteraction, SlashableRelativeLocationInjured) == 0x0008C8, "Member 'UHealOtherInteraction::SlashableRelativeLocationInjured' has a wrong offset!");
static_assert(offsetof(UHealOtherInteraction, SlashableRelativeLocationKO) == 0x0008E0, "Member 'UHealOtherInteraction::SlashableRelativeLocationKO' has a wrong offset!");

// Class DBDInteraction.HealOtherMedkitInteraction
// 0x0030 (0x0930 - 0x0900)
class UHealOtherMedkitInteraction : public UHealOtherInteraction
{
public:
	uint8                                         Pad_900[0x8];                                      // 0x0900(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   _interactionTextWhenEmpty;                         // 0x0908(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_920[0x10];                                     // 0x0920(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HealOtherMedkitInteraction">();
	}
	static class UHealOtherMedkitInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealOtherMedkitInteraction>();
	}
};
static_assert(alignof(UHealOtherMedkitInteraction) == 0x000010, "Wrong alignment on UHealOtherMedkitInteraction");
static_assert(sizeof(UHealOtherMedkitInteraction) == 0x000930, "Wrong size on UHealOtherMedkitInteraction");
static_assert(offsetof(UHealOtherMedkitInteraction, _interactionTextWhenEmpty) == 0x000908, "Member 'UHealOtherMedkitInteraction::_interactionTextWhenEmpty' has a wrong offset!");

// Class DBDInteraction.HealSelfInteraction
// 0x0000 (0x08D0 - 0x08D0)
class UHealSelfInteraction : public UHealInteraction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HealSelfInteraction">();
	}
	static class UHealSelfInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealSelfInteraction>();
	}
};
static_assert(alignof(UHealSelfInteraction) == 0x000010, "Wrong alignment on UHealSelfInteraction");
static_assert(sizeof(UHealSelfInteraction) == 0x0008D0, "Wrong size on UHealSelfInteraction");

// Class DBDInteraction.HealSelfMedkitInteraction
// 0x0010 (0x08E0 - 0x08D0)
class UHealSelfMedkitInteraction : public UHealSelfInteraction
{
public:
	uint8                                         Pad_8D0[0x10];                                     // 0x08D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HealSelfMedkitInteraction">();
	}
	static class UHealSelfMedkitInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealSelfMedkitInteraction>();
	}
};
static_assert(alignof(UHealSelfMedkitInteraction) == 0x000010, "Wrong alignment on UHealSelfMedkitInteraction");
static_assert(sizeof(UHealSelfMedkitInteraction) == 0x0008E0, "Wrong size on UHealSelfMedkitInteraction");

// Class DBDInteraction.HookSurvivorDefinition
// 0x0040 (0x0900 - 0x08C0)
class UHookSurvivorDefinition : public UChargeableInteractionDefinition
{
public:
	class ACamperPlayer*                          _survivorBeingHooked;                              // 0x08C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _smallestScreamTime;                               // 0x08C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8CC[0x34];                                     // 0x08CC(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AMeatHook* GetMeatHook() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HookSurvivorDefinition">();
	}
	static class UHookSurvivorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHookSurvivorDefinition>();
	}
};
static_assert(alignof(UHookSurvivorDefinition) == 0x000010, "Wrong alignment on UHookSurvivorDefinition");
static_assert(sizeof(UHookSurvivorDefinition) == 0x000900, "Wrong size on UHookSurvivorDefinition");
static_assert(offsetof(UHookSurvivorDefinition, _survivorBeingHooked) == 0x0008C0, "Member 'UHookSurvivorDefinition::_survivorBeingHooked' has a wrong offset!");
static_assert(offsetof(UHookSurvivorDefinition, _smallestScreamTime) == 0x0008C8, "Member 'UHookSurvivorDefinition::_smallestScreamTime' has a wrong offset!");

// Class DBDInteraction.InstallBrandNewPartInteraction
// 0x0060 (0x0A20 - 0x09C0)
class UInstallBrandNewPartInteraction : public UGeneratorToolboxRepairInteraction
{
public:
	class ACollectable*                           _toolbox;                                          // 0x09C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _permanentProgressPercent;                         // 0x09C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _existingSkillCheckDelay;                          // 0x09CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   _repairToolboxText;                                // 0x09D0(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_9E8[0x38];                                     // 0x09E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_OnTriggerSkillCheck(class ADBDPlayer* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstallBrandNewPartInteraction">();
	}
	static class UInstallBrandNewPartInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstallBrandNewPartInteraction>();
	}
};
static_assert(alignof(UInstallBrandNewPartInteraction) == 0x000010, "Wrong alignment on UInstallBrandNewPartInteraction");
static_assert(sizeof(UInstallBrandNewPartInteraction) == 0x000A20, "Wrong size on UInstallBrandNewPartInteraction");
static_assert(offsetof(UInstallBrandNewPartInteraction, _toolbox) == 0x0009C0, "Member 'UInstallBrandNewPartInteraction::_toolbox' has a wrong offset!");
static_assert(offsetof(UInstallBrandNewPartInteraction, _permanentProgressPercent) == 0x0009C8, "Member 'UInstallBrandNewPartInteraction::_permanentProgressPercent' has a wrong offset!");
static_assert(offsetof(UInstallBrandNewPartInteraction, _existingSkillCheckDelay) == 0x0009CC, "Member 'UInstallBrandNewPartInteraction::_existingSkillCheckDelay' has a wrong offset!");
static_assert(offsetof(UInstallBrandNewPartInteraction, _repairToolboxText) == 0x0009D0, "Member 'UInstallBrandNewPartInteraction::_repairToolboxText' has a wrong offset!");

// Class DBDInteraction.ItemPickupPopupInteractionInterface
// 0x0000 (0x0030 - 0x0030)
class IItemPickupPopupInteractionInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemPickupPopupInteractionInterface">();
	}
	static class IItemPickupPopupInteractionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IItemPickupPopupInteractionInterface>();
	}
};
static_assert(alignof(IItemPickupPopupInteractionInterface) == 0x000008, "Wrong alignment on IItemPickupPopupInteractionInterface");
static_assert(sizeof(IItemPickupPopupInteractionInterface) == 0x000030, "Wrong size on IItemPickupPopupInteractionInterface");

// Class DBDInteraction.LinkedVomitInteraction
// 0x0030 (0x08F0 - 0x08C0)
class ULinkedVomitInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x30];                                     // 0x08C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UVomitStateComponent* GetVomitStateComponent() const;
	bool IsVomiting() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LinkedVomitInteraction">();
	}
	static class ULinkedVomitInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinkedVomitInteraction>();
	}
};
static_assert(alignof(ULinkedVomitInteraction) == 0x000010, "Wrong alignment on ULinkedVomitInteraction");
static_assert(sizeof(ULinkedVomitInteraction) == 0x0008F0, "Wrong size on ULinkedVomitInteraction");

// Class DBDInteraction.OpenEscapeInteraction
// 0x0020 (0x08E0 - 0x08C0)
class UOpenEscapeInteraction : public UChargeableInteractionDefinition
{
public:
	class AEscapeDoor*                            _escapeDoor;                                       // 0x08C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _jointCrankTargetName;                             // 0x08C8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D4[0xC];                                      // 0x08D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpenEscapeInteraction">();
	}
	static class UOpenEscapeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenEscapeInteraction>();
	}
};
static_assert(alignof(UOpenEscapeInteraction) == 0x000010, "Wrong alignment on UOpenEscapeInteraction");
static_assert(sizeof(UOpenEscapeInteraction) == 0x0008E0, "Wrong size on UOpenEscapeInteraction");
static_assert(offsetof(UOpenEscapeInteraction, _escapeDoor) == 0x0008C0, "Member 'UOpenEscapeInteraction::_escapeDoor' has a wrong offset!");
static_assert(offsetof(UOpenEscapeInteraction, _jointCrankTargetName) == 0x0008C8, "Member 'UOpenEscapeInteraction::_jointCrankTargetName' has a wrong offset!");

// Class DBDInteraction.OpenHatchInteraction
// 0x0050 (0x0910 - 0x08C0)
class UOpenHatchInteraction : public UChargeableInteractionDefinition
{
public:
	float                                         SnapToEscapeLocationDuration;                      // 0x08C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C4[0x4];                                      // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            InteractionStoppedMontage;                         // 0x08C8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            InteractionSucceedMontage;                         // 0x08E8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_908[0x8];                                      // 0x0908(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpenHatchInteraction">();
	}
	static class UOpenHatchInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenHatchInteraction>();
	}
};
static_assert(alignof(UOpenHatchInteraction) == 0x000010, "Wrong alignment on UOpenHatchInteraction");
static_assert(sizeof(UOpenHatchInteraction) == 0x000910, "Wrong size on UOpenHatchInteraction");
static_assert(offsetof(UOpenHatchInteraction, SnapToEscapeLocationDuration) == 0x0008C0, "Member 'UOpenHatchInteraction::SnapToEscapeLocationDuration' has a wrong offset!");
static_assert(offsetof(UOpenHatchInteraction, InteractionStoppedMontage) == 0x0008C8, "Member 'UOpenHatchInteraction::InteractionStoppedMontage' has a wrong offset!");
static_assert(offsetof(UOpenHatchInteraction, InteractionSucceedMontage) == 0x0008E8, "Member 'UOpenHatchInteraction::InteractionSucceedMontage' has a wrong offset!");

// Class DBDInteraction.PalletPullUpInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UPalletPullUpInteraction : public UChargeableInteractionDefinition
{
public:
	EPalletSide                                   _side;                                             // 0x08C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APallet*                                _owningPallet;                                     // 0x08C8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PalletPullUpInteraction">();
	}
	static class UPalletPullUpInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPalletPullUpInteraction>();
	}
};
static_assert(alignof(UPalletPullUpInteraction) == 0x000010, "Wrong alignment on UPalletPullUpInteraction");
static_assert(sizeof(UPalletPullUpInteraction) == 0x0008D0, "Wrong size on UPalletPullUpInteraction");
static_assert(offsetof(UPalletPullUpInteraction, _side) == 0x0008C0, "Member 'UPalletPullUpInteraction::_side' has a wrong offset!");
static_assert(offsetof(UPalletPullUpInteraction, _owningPallet) == 0x0008C8, "Member 'UPalletPullUpInteraction::_owningPallet' has a wrong offset!");

// Class DBDInteraction.PickupInteraction
// 0x0020 (0x07A0 - 0x0780)
class UPickupInteraction : public UInteractionDefinition
{
public:
	TArray<class FString>                         _nonOverrideableInteractionsOnTargetPlayer;        // 0x0778(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class FString>                         _overrideableInteractions;                         // 0x0788(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PickupInteraction">();
	}
	static class UPickupInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickupInteraction>();
	}
};
static_assert(alignof(UPickupInteraction) == 0x000010, "Wrong alignment on UPickupInteraction");
