#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewInterfaces

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "NewsAndMessagesCommon_structs.hpp"
#include "RemoteContentCache_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDUIViewInterfaces.AddonViewInterface
// 0x0000 (0x0030 - 0x0030)
class IAddonViewInterface final : public IInterface
{
public:
	void ClearData();
	void SetData(const struct FAddonViewData& BaseLoadoutPartViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddonViewInterface">();
	}
	static class IAddonViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAddonViewInterface>();
	}
};
static_assert(alignof(IAddonViewInterface) == 0x000008, "Wrong alignment on IAddonViewInterface");
static_assert(sizeof(IAddonViewInterface) == 0x000030, "Wrong size on IAddonViewInterface");

// Class DBDUIViewInterfaces.StoreCharactersSelectionViewInterface
// 0x0000 (0x0030 - 0x0030)
class IStoreCharactersSelectionViewInterface final : public IInterface
{
public:
	void SetData(const struct FStoreCharactersSelectionViewData& Data);
	void SetKillerPower(class UMenuPowerViewData* KillerPowerViewData);
	void SetPerksData(EPlayerRole Role, const TArray<class UMenuPerkViewData*>& Perks);
	void UpdateSelectedCharacter(const int32 SelectedCharacterIndex, const bool ScrollToSelection);

	TScriptInterface<class ISearchBarViewInterface> GetSearchBarViewInterface() const;
	TScriptInterface<class IStoreCharactersFilterViewInterface> GetStoreCharactersFilterInterface() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StoreCharactersSelectionViewInterface">();
	}
	static class IStoreCharactersSelectionViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IStoreCharactersSelectionViewInterface>();
	}
};
static_assert(alignof(IStoreCharactersSelectionViewInterface) == 0x000008, "Wrong alignment on IStoreCharactersSelectionViewInterface");
static_assert(sizeof(IStoreCharactersSelectionViewInterface) == 0x000030, "Wrong size on IStoreCharactersSelectionViewInterface");

// Class DBDUIViewInterfaces.AlertsViewInterface
// 0x0000 (0x0030 - 0x0030)
class IAlertsViewInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlertsViewInterface">();
	}
	static class IAlertsViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAlertsViewInterface>();
	}
};
static_assert(alignof(IAlertsViewInterface) == 0x000008, "Wrong alignment on IAlertsViewInterface");
static_assert(sizeof(IAlertsViewInterface) == 0x000030, "Wrong size on IAlertsViewInterface");

// Class DBDUIViewInterfaces.AnimationPreviewViewInterface
// 0x0000 (0x0030 - 0x0030)
class IAnimationPreviewViewInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimationPreviewViewInterface">();
	}
	static class IAnimationPreviewViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAnimationPreviewViewInterface>();
	}
};
static_assert(alignof(IAnimationPreviewViewInterface) == 0x000008, "Wrong alignment on IAnimationPreviewViewInterface");
static_assert(sizeof(IAnimationPreviewViewInterface) == 0x000030, "Wrong size on IAnimationPreviewViewInterface");

// Class DBDUIViewInterfaces.GlobalProcessingIconViewInterface
// 0x0000 (0x0030 - 0x0030)
class IGlobalProcessingIconViewInterface final : public IInterface
{
public:
	void SetGlobalLoadingIconVisibility(bool IsVisible);
	void SetGlobalSavingIconVisibility(bool IsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GlobalProcessingIconViewInterface">();
	}
	static class IGlobalProcessingIconViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGlobalProcessingIconViewInterface>();
	}
};
static_assert(alignof(IGlobalProcessingIconViewInterface) == 0x000008, "Wrong alignment on IGlobalProcessingIconViewInterface");
static_assert(sizeof(IGlobalProcessingIconViewInterface) == 0x000030, "Wrong size on IGlobalProcessingIconViewInterface");

// Class DBDUIViewInterfaces.KillerStatusData
// 0x0000 (0x0030 - 0x0030)
class UKillerStatusData : public UObject
{
public:
	bool IsEqual(const class UKillerStatusData* Other) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KillerStatusData">();
	}
	static class UKillerStatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillerStatusData>();
	}
};
static_assert(alignof(UKillerStatusData) == 0x000008, "Wrong alignment on UKillerStatusData");
static_assert(sizeof(UKillerStatusData) == 0x000030, "Wrong size on UKillerStatusData");

// Class DBDUIViewInterfaces.NightmareStatusData
// 0x0010 (0x0040 - 0x0030)
class UNightmareStatusData final : public UKillerStatusData
{
public:
	ESleepingUIState                              SleepingState;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SleepingProgress;                                  // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SleepProtectionRemainingDuration;                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NightmareStatusData">();
	}
	static class UNightmareStatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNightmareStatusData>();
	}
};
static_assert(alignof(UNightmareStatusData) == 0x000008, "Wrong alignment on UNightmareStatusData");
static_assert(sizeof(UNightmareStatusData) == 0x000040, "Wrong size on UNightmareStatusData");
static_assert(offsetof(UNightmareStatusData, SleepingState) == 0x000030, "Member 'UNightmareStatusData::SleepingState' has a wrong offset!");
static_assert(offsetof(UNightmareStatusData, SleepingProgress) == 0x000034, "Member 'UNightmareStatusData::SleepingProgress' has a wrong offset!");
static_assert(offsetof(UNightmareStatusData, SleepProtectionRemainingDuration) == 0x000038, "Member 'UNightmareStatusData::SleepProtectionRemainingDuration' has a wrong offset!");

// Class DBDUIViewInterfaces.AntiCampSelfUnhookMeterViewInterface
// 0x0000 (0x0030 - 0x0030)
class IAntiCampSelfUnhookMeterViewInterface final : public IInterface
{
public:
	void SetProgress(const float Progress);
	void SetState(const EAntiCampSelfUnhookMeterState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AntiCampSelfUnhookMeterViewInterface">();
	}
	static class IAntiCampSelfUnhookMeterViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAntiCampSelfUnhookMeterViewInterface>();
	}
};
static_assert(alignof(IAntiCampSelfUnhookMeterViewInterface) == 0x000008, "Wrong alignment on IAntiCampSelfUnhookMeterViewInterface");
static_assert(sizeof(IAntiCampSelfUnhookMeterViewInterface) == 0x000030, "Wrong size on IAntiCampSelfUnhookMeterViewInterface");

// Class DBDUIViewInterfaces.ArchiveCompendiumViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveCompendiumViewInterface final : public IInterface
{
public:
	void SetPastTomesViewData(const TArray<struct FCompendiumButtonData>& PastStoryButtonData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveCompendiumViewInterface">();
	}
	static class IArchiveCompendiumViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveCompendiumViewInterface>();
	}
};
static_assert(alignof(IArchiveCompendiumViewInterface) == 0x000008, "Wrong alignment on IArchiveCompendiumViewInterface");
static_assert(sizeof(IArchiveCompendiumViewInterface) == 0x000030, "Wrong size on IArchiveCompendiumViewInterface");

// Class DBDUIViewInterfaces.K30StatusData
// 0x0008 (0x0038 - 0x0030)
class UK30StatusData final : public UKillerStatusData
{
public:
	float                                         HuntRemainingPercentage;                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHuntingSurvivor;                                 // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30StatusData">();
	}
	static class UK30StatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK30StatusData>();
	}
};
static_assert(alignof(UK30StatusData) == 0x000008, "Wrong alignment on UK30StatusData");
static_assert(sizeof(UK30StatusData) == 0x000038, "Wrong size on UK30StatusData");
static_assert(offsetof(UK30StatusData, HuntRemainingPercentage) == 0x000030, "Member 'UK30StatusData::HuntRemainingPercentage' has a wrong offset!");
static_assert(offsetof(UK30StatusData, IsHuntingSurvivor) == 0x000034, "Member 'UK30StatusData::IsHuntingSurvivor' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveEditorViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveEditorViewInterface final : public IInterface
{
public:
	void DisplayEditorSaving(const class FString& Path);
	void InitEditor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveEditorViewInterface">();
	}
	static class IArchiveEditorViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveEditorViewInterface>();
	}
};
static_assert(alignof(IArchiveEditorViewInterface) == 0x000008, "Wrong alignment on IArchiveEditorViewInterface");
static_assert(sizeof(IArchiveEditorViewInterface) == 0x000030, "Wrong size on IArchiveEditorViewInterface");

// Class DBDUIViewInterfaces.ArchiveImageViewerViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveImageViewerViewInterface final : public IInterface
{
public:
	void SetTextVisibility(bool Visible);
	void SetVoiceOverAutoplay(bool VoiceOverAutoplay);
	void SetVoiceOverPlaying(bool VoiceOverPlaying);
	void UpdateContent(const struct FArchivesVignetteEntryViewData& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveImageViewerViewInterface">();
	}
	static class IArchiveImageViewerViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveImageViewerViewInterface>();
	}
};
static_assert(alignof(IArchiveImageViewerViewInterface) == 0x000008, "Wrong alignment on IArchiveImageViewerViewInterface");
static_assert(sizeof(IArchiveImageViewerViewInterface) == 0x000030, "Wrong size on IArchiveImageViewerViewInterface");

// Class DBDUIViewInterfaces.K24StatusData
// 0x0008 (0x0038 - 0x0030)
class UK24StatusData final : public UKillerStatusData
{
public:
	bool                                          IsContaminated;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K24StatusData">();
	}
	static class UK24StatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK24StatusData>();
	}
};
static_assert(alignof(UK24StatusData) == 0x000008, "Wrong alignment on UK24StatusData");
static_assert(sizeof(UK24StatusData) == 0x000038, "Wrong size on UK24StatusData");
static_assert(offsetof(UK24StatusData, IsContaminated) == 0x000030, "Member 'UK24StatusData::IsContaminated' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveJournalViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveJournalViewInterface final : public IInterface
{
public:
	void OnImageViewerVoiceOverAutoplay(bool Autoplay);
	void OnImageViewerVoiceOverPlayed();
	void SetArrowButtonEnabled(const bool IsEnabled);
	void SetCinematicButtonsEnabled(bool Enabled);
	void SetEntryData(const struct FArchivesVignetteEntryViewData& EntryViewData);
	void SetVignetteData(const struct FArchivesVignetteViewData& VignetteViewData);
	void SetVignetteInputsEnabled(bool Enabled);
	void SetVignetteList(const TArray<struct FArchivesVignetteViewData>& VignetteDataList);
	void SetVoiceOverAutoplay(bool VoiceOverAutoplay);
	void SetVoiceOverPlaying(bool VoiceOverPlaying);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveJournalViewInterface">();
	}
	static class IArchiveJournalViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveJournalViewInterface>();
	}
};
static_assert(alignof(IArchiveJournalViewInterface) == 0x000008, "Wrong alignment on IArchiveJournalViewInterface");
static_assert(sizeof(IArchiveJournalViewInterface) == 0x000030, "Wrong size on IArchiveJournalViewInterface");

// Class DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveLevelProgressionViewInterface final : public IInterface
{
public:
	void GoToNextLevel(int32 LevelIndex);
	void PlayRewardsAnimation();
	void SetActiveLevel(int32 LevelIndex, bool PerformAction);
	void SetLevelSelectorEnabled(const bool Enabled);
	void SetLevelSelectorVisibility(bool IsVisible);
	void SetRewardsContainerVisibility(bool IsVisible);
	void SetTomeLevelsData(const TArray<class UArchiveStoryLevelViewData*>& LevelsData, int32 SelectedLevel);
	void SetTomeRewardsData(const TArray<struct FRewardWrapperViewData>& RewardsData, bool AreLocked);
	void UpdateLevelStatus(int32 Level, EArchivesStoryLevelStatus Status);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveLevelProgressionViewInterface">();
	}
	static class IArchiveLevelProgressionViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveLevelProgressionViewInterface>();
	}
};
static_assert(alignof(IArchiveLevelProgressionViewInterface) == 0x000008, "Wrong alignment on IArchiveLevelProgressionViewInterface");
static_assert(sizeof(IArchiveLevelProgressionViewInterface) == 0x000030, "Wrong size on IArchiveLevelProgressionViewInterface");

// Class DBDUIViewInterfaces.BasePopupViewData
// 0x0040 (0x0070 - 0x0030)
class UBasePopupViewData : public UObject
{
public:
	EPopupPriority                                Priority;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0038(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0050(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          DisplayBackgroundOverlay;                          // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePopupViewData">();
	}
	static class UBasePopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePopupViewData>();
	}
};
static_assert(alignof(UBasePopupViewData) == 0x000008, "Wrong alignment on UBasePopupViewData");
static_assert(sizeof(UBasePopupViewData) == 0x000070, "Wrong size on UBasePopupViewData");
static_assert(offsetof(UBasePopupViewData, Priority) == 0x000030, "Member 'UBasePopupViewData::Priority' has a wrong offset!");
static_assert(offsetof(UBasePopupViewData, Title) == 0x000038, "Member 'UBasePopupViewData::Title' has a wrong offset!");
static_assert(offsetof(UBasePopupViewData, Message) == 0x000050, "Member 'UBasePopupViewData::Message' has a wrong offset!");
static_assert(offsetof(UBasePopupViewData, DisplayBackgroundOverlay) == 0x000068, "Member 'UBasePopupViewData::DisplayBackgroundOverlay' has a wrong offset!");

// Class DBDUIViewInterfaces.GenericPopupViewData
// 0x0180 (0x01F0 - 0x0070)
class UGenericPopupViewData : public UBasePopupViewData
{
public:
	struct FPopupButtonViewData                   ProgressionData;                                   // 0x0070(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPopupButtonViewData                   RegressionData;                                    // 0x00F0(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPopupButtonViewData                   AlternativeData;                                   // 0x0170(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericPopupViewData">();
	}
	static class UGenericPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericPopupViewData>();
	}
};
static_assert(alignof(UGenericPopupViewData) == 0x000010, "Wrong alignment on UGenericPopupViewData");
static_assert(sizeof(UGenericPopupViewData) == 0x0001F0, "Wrong size on UGenericPopupViewData");
static_assert(offsetof(UGenericPopupViewData, ProgressionData) == 0x000070, "Member 'UGenericPopupViewData::ProgressionData' has a wrong offset!");
static_assert(offsetof(UGenericPopupViewData, RegressionData) == 0x0000F0, "Member 'UGenericPopupViewData::RegressionData' has a wrong offset!");
static_assert(offsetof(UGenericPopupViewData, AlternativeData) == 0x000170, "Member 'UGenericPopupViewData::AlternativeData' has a wrong offset!");

// Class DBDUIViewInterfaces.GenericTextInputPopupViewData
// 0x00E0 (0x02D0 - 0x01F0)
class UGenericTextInputPopupViewData final : public UGenericPopupViewData
{
public:
	class FString                                 InputDefaultText;                                  // 0x01F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowCopyPaste;                                    // 0x0200(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_201[0xCF];                                     // 0x0201(0x00CF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericTextInputPopupViewData">();
	}
	static class UGenericTextInputPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericTextInputPopupViewData>();
	}
};
static_assert(alignof(UGenericTextInputPopupViewData) == 0x000010, "Wrong alignment on UGenericTextInputPopupViewData");
static_assert(sizeof(UGenericTextInputPopupViewData) == 0x0002D0, "Wrong size on UGenericTextInputPopupViewData");
static_assert(offsetof(UGenericTextInputPopupViewData, InputDefaultText) == 0x0001F0, "Member 'UGenericTextInputPopupViewData::InputDefaultText' has a wrong offset!");
static_assert(offsetof(UGenericTextInputPopupViewData, AllowCopyPaste) == 0x000200, "Member 'UGenericTextInputPopupViewData::AllowCopyPaste' has a wrong offset!");

// Class DBDUIViewInterfaces.TwinsStatusData
// 0x0008 (0x0038 - 0x0030)
class UTwinsStatusData final : public UKillerStatusData
{
public:
	bool                                          TwinsActive;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinsStatusData">();
	}
	static class UTwinsStatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinsStatusData>();
	}
};
static_assert(alignof(UTwinsStatusData) == 0x000008, "Wrong alignment on UTwinsStatusData");
static_assert(sizeof(UTwinsStatusData) == 0x000038, "Wrong size on UTwinsStatusData");
static_assert(offsetof(UTwinsStatusData, TwinsActive) == 0x000030, "Member 'UTwinsStatusData::TwinsActive' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveStoryLevelViewData
// 0x0010 (0x0040 - 0x0030)
class UArchiveStoryLevelViewData final : public UObject
{
public:
	int32                                         Level;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchivesStoryLevelStatus                     Status;                                            // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              StartDate;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveStoryLevelViewData">();
	}
	static class UArchiveStoryLevelViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveStoryLevelViewData>();
	}
};
static_assert(alignof(UArchiveStoryLevelViewData) == 0x000008, "Wrong alignment on UArchiveStoryLevelViewData");
static_assert(sizeof(UArchiveStoryLevelViewData) == 0x000040, "Wrong size on UArchiveStoryLevelViewData");
static_assert(offsetof(UArchiveStoryLevelViewData, Level) == 0x000030, "Member 'UArchiveStoryLevelViewData::Level' has a wrong offset!");
static_assert(offsetof(UArchiveStoryLevelViewData, Status) == 0x000034, "Member 'UArchiveStoryLevelViewData::Status' has a wrong offset!");
static_assert(offsetof(UArchiveStoryLevelViewData, StartDate) == 0x000038, "Member 'UArchiveStoryLevelViewData::StartDate' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveMenuViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveMenuViewInterface final : public IInterface
{
public:
	void ClearChallengeReminderData(EPlayerRole Role);
	void CloseSlotSelector();
	void HideUI();
	void Init();
	void SetChallengeReminderData(const struct FArchiveChallengeReminderViewData& Data, EPlayerRole Role, bool NeedsAnimation, const struct FVector2D& AnimationOriginalPosition);
	void SetChallengeReminderVisibility(bool IsVisible);
	void SetControllerElementsEnabled(bool Enabled);
	void SetDisplayStandAreaEnabled(bool Enabled);
	void SetEventLabel(const class FString& EventLabel);
	void SetInfoButtonEnabled(bool IsEnabled);
	void SetInfoButtonVisible(bool IsVisible);
	void SetMenuState(EArchiveMenuState MenuState);
	void SetQuestNodeHoverEffect(EPlayerRole Role, bool IsHovered);
	void SetRemainingTime(const class FString& RemainingTime, bool IsMoreThanWarningThreshold, EArchiveMenuState MenuState);
	void SetRemainingTimeVisible(bool IsVisible);
	void SetReminderSlotsEnabled(bool Enabled);
	void SetRiftPackButtonEnabled(bool IsEnabled);
	void SetSubtitle(const class FText& Subtitle);
	void SetSubtitleVisible(bool IsVisible);
	void SetTabEnabled(int32 Key, bool Enabled);
	void SetTabsData(const TArray<struct FTabWidgetData>& TabsData, int32 SelectedKey);
	void SetTabSelected(int32 Key);
	void SetTabsInputsEnabled(bool Enabled);
	void SetTitle(const class FText& Title);
	void ShowSlotSelector(const struct FArchiveNodeViewData& Data);
	void ShowUI();
	void UpdateBackgroundSkin(const int32 Key, const struct FArchiveTomeSkinData& Data);

	TScriptInterface<class IArchiveCompendiumViewInterface> GetArchiveCompendiumInterface() const;
	TScriptInterface<class IArchiveRiftViewInterface> GetArchiveRiftInterface() const;
	TScriptInterface<class IArchiveTomeViewInterface> GetArchiveTomeInterface() const;
	TScriptInterface<class IDisplayStandViewInterface> GetDisplayStandViewInterface() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveMenuViewInterface">();
	}
	static class IArchiveMenuViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveMenuViewInterface>();
	}
};
static_assert(alignof(IArchiveMenuViewInterface) == 0x000008, "Wrong alignment on IArchiveMenuViewInterface");
static_assert(sizeof(IArchiveMenuViewInterface) == 0x000030, "Wrong size on IArchiveMenuViewInterface");

// Class DBDUIViewInterfaces.K28StatusData
// 0x0008 (0x0038 - 0x0030)
class UK28StatusData final : public UKillerStatusData
{
public:
	float                                         DayNightCycleProgressPercentage;                   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDaytime;                                         // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTransitioningToNighttime;                        // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNighttime;                                       // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTransitioningToDaytime;                          // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28StatusData">();
	}
	static class UK28StatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28StatusData>();
	}
};
static_assert(alignof(UK28StatusData) == 0x000008, "Wrong alignment on UK28StatusData");
static_assert(sizeof(UK28StatusData) == 0x000038, "Wrong size on UK28StatusData");
static_assert(offsetof(UK28StatusData, DayNightCycleProgressPercentage) == 0x000030, "Member 'UK28StatusData::DayNightCycleProgressPercentage' has a wrong offset!");
static_assert(offsetof(UK28StatusData, IsDaytime) == 0x000034, "Member 'UK28StatusData::IsDaytime' has a wrong offset!");
static_assert(offsetof(UK28StatusData, IsTransitioningToNighttime) == 0x000035, "Member 'UK28StatusData::IsTransitioningToNighttime' has a wrong offset!");
static_assert(offsetof(UK28StatusData, IsNighttime) == 0x000036, "Member 'UK28StatusData::IsNighttime' has a wrong offset!");
static_assert(offsetof(UK28StatusData, IsTransitioningToDaytime) == 0x000037, "Member 'UK28StatusData::IsTransitioningToDaytime' has a wrong offset!");

// Class DBDUIViewInterfaces.ProcessingPopupViewData
// 0x0000 (0x0070 - 0x0070)
class UProcessingPopupViewData final : public UBasePopupViewData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProcessingPopupViewData">();
	}
	static class UProcessingPopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProcessingPopupViewData>();
	}
};
static_assert(alignof(UProcessingPopupViewData) == 0x000008, "Wrong alignment on UProcessingPopupViewData");
static_assert(sizeof(UProcessingPopupViewData) == 0x000070, "Wrong size on UProcessingPopupViewData");

// Class DBDUIViewInterfaces.ArchivePassPurchasePopupViewData
// 0x00B0 (0x02A0 - 0x01F0)
class UArchivePassPurchasePopupViewData final : public UGenericPopupViewData
{
public:
	class FText                                   AvailabilityDates;                                 // 0x01F0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x0210(0x0038)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPriceTagViewData                      PriceTagViewData;                                  // 0x0248(0x0050)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePassPurchasePopupViewData">();
	}
	static class UArchivePassPurchasePopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchivePassPurchasePopupViewData>();
	}
};
static_assert(alignof(UArchivePassPurchasePopupViewData) == 0x000010, "Wrong alignment on UArchivePassPurchasePopupViewData");
static_assert(sizeof(UArchivePassPurchasePopupViewData) == 0x0002A0, "Wrong size on UArchivePassPurchasePopupViewData");
static_assert(offsetof(UArchivePassPurchasePopupViewData, AvailabilityDates) == 0x0001F0, "Member 'UArchivePassPurchasePopupViewData::AvailabilityDates' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, Quantity) == 0x000208, "Member 'UArchivePassPurchasePopupViewData::Quantity' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, ImageTexture) == 0x000210, "Member 'UArchivePassPurchasePopupViewData::ImageTexture' has a wrong offset!");
static_assert(offsetof(UArchivePassPurchasePopupViewData, PriceTagViewData) == 0x000248, "Member 'UArchivePassPurchasePopupViewData::PriceTagViewData' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchivePassPurchasePopupViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchivePassPurchasePopupViewInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePassPurchasePopupViewInterface">();
	}
	static class IArchivePassPurchasePopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchivePassPurchasePopupViewInterface>();
	}
};
static_assert(alignof(IArchivePassPurchasePopupViewInterface) == 0x000008, "Wrong alignment on IArchivePassPurchasePopupViewInterface");
static_assert(sizeof(IArchivePassPurchasePopupViewInterface) == 0x000030, "Wrong size on IArchivePassPurchasePopupViewInterface");

// Class DBDUIViewInterfaces.K32StatusData
// 0x0008 (0x0038 - 0x0030)
class UK32StatusData final : public UKillerStatusData
{
public:
	bool                                          IsAssimilated;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32StatusData">();
	}
	static class UK32StatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32StatusData>();
	}
};
static_assert(alignof(UK32StatusData) == 0x000008, "Wrong alignment on UK32StatusData");
static_assert(sizeof(UK32StatusData) == 0x000038, "Wrong size on UK32StatusData");
static_assert(offsetof(UK32StatusData, IsAssimilated) == 0x000030, "Member 'UK32StatusData::IsAssimilated' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveQuestMapViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveQuestMapViewInterface final : public IInterface
{
public:
	void Reset();
	void SetLoadingSpinner(bool IsLoading);
	void SetQuestMapData(const TArray<struct FArchiveNodeGraphViewData>& NodeDataList, const TArray<struct FArchiveMapPathViewData>& PathDataList, bool NeedsCascadeAppear);
	void UpdateQuestMapData(const TArray<struct FArchiveNodeGraphViewData>& NodeDataList, const TArray<struct FArchiveMapPathViewData>& PathDataList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveQuestMapViewInterface">();
	}
	static class IArchiveQuestMapViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveQuestMapViewInterface>();
	}
};
static_assert(alignof(IArchiveQuestMapViewInterface) == 0x000008, "Wrong alignment on IArchiveQuestMapViewInterface");
static_assert(sizeof(IArchiveQuestMapViewInterface) == 0x000030, "Wrong size on IArchiveQuestMapViewInterface");

// Class DBDUIViewInterfaces.ArchiveRiftViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveRiftViewInterface final : public IInterface
{
public:
	void PlayUnlockingAnimation(const struct FArchivesRiftUnlockSequenceData& Data);
	void SetData(const struct FArchivesRiftGenericViewData& Data);
	void SetImagePreviewAreaData(const struct FCustomizationItemPreviewAreaViewData& ViewData);
	void SetMatchmakingSoftlockState(bool IsInMatchmakingSoftlock);
	void SetOutfitPreviewButtonVisible(const bool IsVisible);
	void SetRewardTiersData(const TArray<struct FArchiveRiftTierRewardsViewData>& RiftTiersData);
	void SetRiftFragmentTooltipViewData(const struct FCurrencyProgressionTooltipViewData& RiftFragmentTooltipViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveRiftViewInterface">();
	}
	static class IArchiveRiftViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveRiftViewInterface>();
	}
};
static_assert(alignof(IArchiveRiftViewInterface) == 0x000008, "Wrong alignment on IArchiveRiftViewInterface");
static_assert(sizeof(IArchiveRiftViewInterface) == 0x000030, "Wrong size on IArchiveRiftViewInterface");

// Class DBDUIViewInterfaces.K26StatusData
// 0x0008 (0x0038 - 0x0030)
class UK26StatusData final : public UKillerStatusData
{
public:
	bool                                          IsCrowAttached;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K26StatusData">();
	}
	static class UK26StatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK26StatusData>();
	}
};
static_assert(alignof(UK26StatusData) == 0x000008, "Wrong alignment on UK26StatusData");
static_assert(sizeof(UK26StatusData) == 0x000038, "Wrong size on UK26StatusData");
static_assert(offsetof(UK26StatusData, IsCrowAttached) == 0x000030, "Member 'UK26StatusData::IsCrowAttached' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveTierPurchasePopupViewData
// 0x00B0 (0x02A0 - 0x01F0)
class UArchiveTierPurchasePopupViewData final : public UGenericPopupViewData
{
public:
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x01F0(0x0038)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTiers;                                          // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentTier;                                       // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UnitPrice;                                         // 0x0234(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentWalletAmount;                               // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FirstBonusTier;                                    // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastBonusTier;                                     // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBonusTier;                                       // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPriceTagViewData                      PriceTagViewData;                                  // 0x0248(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTierPurchasePopupViewData">();
	}
	static class UArchiveTierPurchasePopupViewData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTierPurchasePopupViewData>();
	}
};
static_assert(alignof(UArchiveTierPurchasePopupViewData) == 0x000010, "Wrong alignment on UArchiveTierPurchasePopupViewData");
static_assert(sizeof(UArchiveTierPurchasePopupViewData) == 0x0002A0, "Wrong size on UArchiveTierPurchasePopupViewData");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, ImageTexture) == 0x0001F0, "Member 'UArchiveTierPurchasePopupViewData::ImageTexture' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, MaxTiers) == 0x000228, "Member 'UArchiveTierPurchasePopupViewData::MaxTiers' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, CurrentTier) == 0x00022C, "Member 'UArchiveTierPurchasePopupViewData::CurrentTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, Quantity) == 0x000230, "Member 'UArchiveTierPurchasePopupViewData::Quantity' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, UnitPrice) == 0x000234, "Member 'UArchiveTierPurchasePopupViewData::UnitPrice' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, CurrentWalletAmount) == 0x000238, "Member 'UArchiveTierPurchasePopupViewData::CurrentWalletAmount' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, FirstBonusTier) == 0x00023C, "Member 'UArchiveTierPurchasePopupViewData::FirstBonusTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, LastBonusTier) == 0x000240, "Member 'UArchiveTierPurchasePopupViewData::LastBonusTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, IsBonusTier) == 0x000244, "Member 'UArchiveTierPurchasePopupViewData::IsBonusTier' has a wrong offset!");
static_assert(offsetof(UArchiveTierPurchasePopupViewData, PriceTagViewData) == 0x000248, "Member 'UArchiveTierPurchasePopupViewData::PriceTagViewData' has a wrong offset!");

// Class DBDUIViewInterfaces.ArchiveTierPurchasePopupViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveTierPurchasePopupViewInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTierPurchasePopupViewInterface">();
	}
	static class IArchiveTierPurchasePopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveTierPurchasePopupViewInterface>();
	}
};
static_assert(alignof(IArchiveTierPurchasePopupViewInterface) == 0x000008, "Wrong alignment on IArchiveTierPurchasePopupViewInterface");
static_assert(sizeof(IArchiveTierPurchasePopupViewInterface) == 0x000030, "Wrong size on IArchiveTierPurchasePopupViewInterface");

// Class DBDUIViewInterfaces.PowerBundleViewInterface
// 0x0000 (0x0030 - 0x0030)
class IPowerBundleViewInterface final : public IInterface
{
public:
	void ClearData();
	void SetData(const struct FPowerBundleViewData& PowerBundleViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PowerBundleViewInterface">();
	}
	static class IPowerBundleViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPowerBundleViewInterface>();
	}
};
static_assert(alignof(IPowerBundleViewInterface) == 0x000008, "Wrong alignment on IPowerBundleViewInterface");
static_assert(sizeof(IPowerBundleViewInterface) == 0x000030, "Wrong size on IPowerBundleViewInterface");

// Class DBDUIViewInterfaces.ArchiveTomeViewInterface
// 0x0000 (0x0030 - 0x0030)
class IArchiveTomeViewInterface final : public IInterface
{
public:
	void SetMenuState(EArchiveTomeMenuState MenuState);
	void SetNotificationVisibility(int32 Key, bool HasNotification);
	void SetSideNavTabsData(const TArray<struct FTabWidgetData>& TabsData, int32 SelectedKey);
	void SetSideNavTabsEnabled(int32 Key, bool IsEnabled);
	void SetSideNavTabsVisibility(int32 Key, bool IsVisible);
	void SetUiTakeoverActive(bool IsActive);
	void ToggleEditor(bool IsEnabled);
	void UpdateBackgroundSkin(int32 Key, class UMaterialInterface* SkinMaterail);

	struct FEditorInterfaces GetArchiveEditorInterface() const;
	TScriptInterface<class IArchiveJournalViewInterface> GetArchiveJournalInterface() const;
	TScriptInterface<class IArchiveLevelProgressionViewInterface> GetArchiveLevelProgressionInterface() const;
	TScriptInterface<class IArchiveQuestMapViewInterface> GetArchiveQuestMapInterface() const;
	const EArchiveTomeMenuState GetMenuState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTomeViewInterface">();
	}
	static class IArchiveTomeViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArchiveTomeViewInterface>();
	}
};
static_assert(alignof(IArchiveTomeViewInterface) == 0x000008, "Wrong alignment on IArchiveTomeViewInterface");
static_assert(sizeof(IArchiveTomeViewInterface) == 0x000030, "Wrong size on IArchiveTomeViewInterface");

// Class DBDUIViewInterfaces.AuricCellsViewInterface
// 0x0000 (0x0030 - 0x0030)
class IAuricCellsViewInterface final : public IInterface
{
public:
	void SetData(const struct FAuricCellsViewData& ViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuricCellsViewInterface">();
	}
	static class IAuricCellsViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuricCellsViewInterface>();
	}
};
static_assert(alignof(IAuricCellsViewInterface) == 0x000008, "Wrong alignment on IAuricCellsViewInterface");
static_assert(sizeof(IAuricCellsViewInterface) == 0x000030, "Wrong size on IAuricCellsViewInterface");

// Class DBDUIViewInterfaces.ReportFeedbackPopupViewInterface
// 0x0000 (0x0030 - 0x0030)
class IReportFeedbackPopupViewInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReportFeedbackPopupViewInterface">();
	}
	static class IReportFeedbackPopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IReportFeedbackPopupViewInterface>();
	}
};
static_assert(alignof(IReportFeedbackPopupViewInterface) == 0x000008, "Wrong alignment on IReportFeedbackPopupViewInterface");
static_assert(sizeof(IReportFeedbackPopupViewInterface) == 0x000030, "Wrong size on IReportFeedbackPopupViewInterface");

// Class DBDUIViewInterfaces.BasePopupViewInterface
// 0x0000 (0x0030 - 0x0030)
class IBasePopupViewInterface final : public IInterface
{
public:
	void Enter(class UBasePopupViewData* Data);
	void Leave();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePopupViewInterface">();
	}
	static class IBasePopupViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBasePopupViewInterface>();
	}
};
static_assert(alignof(IBasePopupViewInterface) == 0x000008, "Wrong alignment on IBasePopupViewInterface");
static_assert(sizeof(IBasePopupViewInterface) == 0x000030, "Wrong size on IBasePopupViewInterface");

// Class DBDUIViewInterfaces.ChallengesMenuChallengeSetViewInterface
// 0x0000 (0x0030 - 0x0030)
class IChallengesMenuChallengeSetViewInterface final : public IInterface
{
public:
	void SetEventVisuals(const class FString& EventFrameLabel);
	void SetTabEnabled(const int32 Key, const bool Enabled);
	void SetTabsData(const TArray<struct FTabWidgetData>& TabsData, const int32 SelectedKey);
	void SetTabSelected(const int32 Key);

	TScriptInterface<class IChallengesMenuRewardTrackViewInterface> GetRewardTrackInterface() const;
	TScriptInterface<class IChallengesMenuRitualsViewInterface> GetRitualsInterface() const;
	TScriptInterface<class IChallengesMenuStoreViewInterface> GetStoreInterface() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuChallengeSetViewInterface">();
	}
	static class IChallengesMenuChallengeSetViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChallengesMenuChallengeSetViewInterface>();
	}
};
static_assert(alignof(IChallengesMenuChallengeSetViewInterface) == 0x000008, "Wrong alignment on IChallengesMenuChallengeSetViewInterface");
static_assert(sizeof(IChallengesMenuChallengeSetViewInterface) == 0x000030, "Wrong size on IChallengesMenuChallengeSetViewInterface");

// Class DBDUIViewInterfaces.ProfileMenuCustomizationViewInterface
// 0x0000 (0x0030 - 0x0030)
class IProfileMenuCustomizationViewInterface final : public IInterface
{
public:
	void Deinit();
	void DeselectItem();
	void EnableInputs(const bool Enable);
	void Init(ECustomizationCategory CustomizationCategory, ESortingOption SortingOption);
	void SetEquipButtonText(const bool CanEquip, const bool IsEquipped);
	void SetItemsData(const TArray<class UStoreCustomizationItemViewData*>& CustomizationRewardsData, const int32 SelectedIndex);
	void SetPreviewAreaData(const struct FCustomizationItemPreviewAreaViewData& ViewData, const bool NoCustomizationEquipped);
	void SetSelectedItem(const int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProfileMenuCustomizationViewInterface">();
	}
	static class IProfileMenuCustomizationViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IProfileMenuCustomizationViewInterface>();
	}
};
static_assert(alignof(IProfileMenuCustomizationViewInterface) == 0x000008, "Wrong alignment on IProfileMenuCustomizationViewInterface");
static_assert(sizeof(IProfileMenuCustomizationViewInterface) == 0x000030, "Wrong size on IProfileMenuCustomizationViewInterface");

// Class DBDUIViewInterfaces.ChallengesMenuRewardTrackViewInterface
// 0x0000 (0x0030 - 0x0030)
class IChallengesMenuRewardTrackViewInterface final : public IInterface
{
public:
	void SetEventVisuals(const class FString& EventFrameLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRewardTrackViewInterface">();
	}
	static class IChallengesMenuRewardTrackViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChallengesMenuRewardTrackViewInterface>();
	}
};
static_assert(alignof(IChallengesMenuRewardTrackViewInterface) == 0x000008, "Wrong alignment on IChallengesMenuRewardTrackViewInterface");
static_assert(sizeof(IChallengesMenuRewardTrackViewInterface) == 0x000030, "Wrong size on IChallengesMenuRewardTrackViewInterface");

// Class DBDUIViewInterfaces.ChallengesMenuRitualsViewInterface
// 0x0000 (0x0030 - 0x0030)
class IChallengesMenuRitualsViewInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRitualsViewInterface">();
	}
	static class IChallengesMenuRitualsViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChallengesMenuRitualsViewInterface>();
	}
};
static_assert(alignof(IChallengesMenuRitualsViewInterface) == 0x000008, "Wrong alignment on IChallengesMenuRitualsViewInterface");
static_assert(sizeof(IChallengesMenuRitualsViewInterface) == 0x000030, "Wrong size on IChallengesMenuRitualsViewInterface");

// Class DBDUIViewInterfaces.K36StatusData
// 0x0018 (0x0048 - 0x0030)
class UK36StatusData final : public UKillerStatusData
{
public:
	bool                                          HasBracers;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasBoots;                                          // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasAssimilatedEyeArtifact;                         // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanUseEyeArtifactPower;                            // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasAssimilatedHandArtifact;                        // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanUseHandArtifactPower;                           // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldSeeBootsCounterSpell;                        // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldSeeBracersCounterSpell;                      // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInjured;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AreMagicItemsVFXsHidden;                           // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BootsCounterID;                                    // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BracersCounterID;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisableMagicItemProgressionPercentage;             // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36StatusData">();
	}
	static class UK36StatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36StatusData>();
	}
};
static_assert(alignof(UK36StatusData) == 0x000008, "Wrong alignment on UK36StatusData");
static_assert(sizeof(UK36StatusData) == 0x000048, "Wrong size on UK36StatusData");
static_assert(offsetof(UK36StatusData, HasBracers) == 0x000030, "Member 'UK36StatusData::HasBracers' has a wrong offset!");
static_assert(offsetof(UK36StatusData, HasBoots) == 0x000031, "Member 'UK36StatusData::HasBoots' has a wrong offset!");
static_assert(offsetof(UK36StatusData, HasAssimilatedEyeArtifact) == 0x000032, "Member 'UK36StatusData::HasAssimilatedEyeArtifact' has a wrong offset!");
static_assert(offsetof(UK36StatusData, CanUseEyeArtifactPower) == 0x000033, "Member 'UK36StatusData::CanUseEyeArtifactPower' has a wrong offset!");
static_assert(offsetof(UK36StatusData, HasAssimilatedHandArtifact) == 0x000034, "Member 'UK36StatusData::HasAssimilatedHandArtifact' has a wrong offset!");
static_assert(offsetof(UK36StatusData, CanUseHandArtifactPower) == 0x000035, "Member 'UK36StatusData::CanUseHandArtifactPower' has a wrong offset!");
static_assert(offsetof(UK36StatusData, ShouldSeeBootsCounterSpell) == 0x000036, "Member 'UK36StatusData::ShouldSeeBootsCounterSpell' has a wrong offset!");
static_assert(offsetof(UK36StatusData, ShouldSeeBracersCounterSpell) == 0x000037, "Member 'UK36StatusData::ShouldSeeBracersCounterSpell' has a wrong offset!");
static_assert(offsetof(UK36StatusData, IsInjured) == 0x000038, "Member 'UK36StatusData::IsInjured' has a wrong offset!");
static_assert(offsetof(UK36StatusData, AreMagicItemsVFXsHidden) == 0x000039, "Member 'UK36StatusData::AreMagicItemsVFXsHidden' has a wrong offset!");
static_assert(offsetof(UK36StatusData, BootsCounterID) == 0x00003C, "Member 'UK36StatusData::BootsCounterID' has a wrong offset!");
static_assert(offsetof(UK36StatusData, BracersCounterID) == 0x000040, "Member 'UK36StatusData::BracersCounterID' has a wrong offset!");
static_assert(offsetof(UK36StatusData, DisableMagicItemProgressionPercentage) == 0x000044, "Member 'UK36StatusData::DisableMagicItemProgressionPercentage' has a wrong offset!");

// Class DBDUIViewInterfaces.ChallengesMenuStoreViewInterface
// 0x0000 (0x0030 - 0x0030)
class IChallengesMenuStoreViewInterface final : public IInterface
{
public:
	void Deinit();
	void DeselectReward();
	void EnableStoreButton(const bool Enable);
	void Init();
	void SetItemsData(const TArray<class UStoreCustomizationItemViewData*>& CustomizationRewardsData, const int32 SelectedIndex);
	void SetPreviewAreaData(const struct FCustomizationItemPreviewAreaViewData& ViewData);
	void SetSelectedReward(const int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuStoreViewInterface">();
	}
	static class IChallengesMenuStoreViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChallengesMenuStoreViewInterface>();
	}
};
static_assert(alignof(IChallengesMenuStoreViewInterface) == 0x000008, "Wrong alignment on IChallengesMenuStoreViewInterface");
static_assert(sizeof(IChallengesMenuStoreViewInterface) == 0x000030, "Wrong size on IChallengesMenuStoreViewInterface");

// Class DBDUIViewInterfaces.ChallengesMenuViewInterface
// 0x0000 (0x0030 - 0x0030)
class IChallengesMenuViewInterface final : public IInterface
{
public:
	TScriptInterface<class IChallengesMenuChallengeSetViewInterface> AddChallengeSet(const struct FChallengeSetViewData& ViewData);
	void SetEventVisuals(const class FString& EventFrameLabel);
	void SetIsFocused(const bool IsFocused);
	void SetSubtitle(const class FText& Subtitle);
	void SetTabEnabled(const int32 Key, const bool Enabled);
	void SetTabsData(const TArray<struct FTabWidgetData>& TabsData, const int32 SelectedKey);
	void SetTabSelected(const int32 Key);
	void SetTitle(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuViewInterface">();
	}
	static class IChallengesMenuViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChallengesMenuViewInterface>();
	}
};
static_assert(alignof(IChallengesMenuViewInterface) == 0x000008, "Wrong alignment on IChallengesMenuViewInterface");
static_assert(sizeof(IChallengesMenuViewInterface) == 0x000030, "Wrong size on IChallengesMenuViewInterface");

// Class DBDUIViewInterfaces.LoadoutMenuViewData
// 0x0130 (0x0160 - 0x0030)
class ULoadoutMenuViewData final : public UObject
{
public:
	TSoftObjectPtr<class UTexture2D>              LoadoutIcon;                                       // 0x0030(0x0038)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ItemId;                                            // 0x0068(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0078(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ParentDisplayName;                                 // 0x0090(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ParentTypeDisplayName;                             // 0x00A8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          IsParentAvailable;                                 // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x00C8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EInventoryItemType                            ItemType;                                          // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
