#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIPresenters

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DBDUIPresenters.Presenter.GetIgnoredPresentationRequirementFunctionOptions
// 0x0010 (0x0010 - 0x0000)
struct Presenter_GetIgnoredPresentationRequirementFunctionOptions final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Presenter_GetIgnoredPresentationRequirementFunctionOptions) == 0x000008, "Wrong alignment on Presenter_GetIgnoredPresentationRequirementFunctionOptions");
static_assert(sizeof(Presenter_GetIgnoredPresentationRequirementFunctionOptions) == 0x000010, "Wrong size on Presenter_GetIgnoredPresentationRequirementFunctionOptions");
static_assert(offsetof(Presenter_GetIgnoredPresentationRequirementFunctionOptions, ReturnValue) == 0x000000, "Member 'Presenter_GetIgnoredPresentationRequirementFunctionOptions::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.Presenter.OnContextChanged
// 0x0001 (0x0001 - 0x0000)
struct Presenter_OnContextChanged final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Presenter_OnContextChanged) == 0x000001, "Wrong alignment on Presenter_OnContextChanged");
static_assert(sizeof(Presenter_OnContextChanged) == 0x000001, "Wrong size on Presenter_OnContextChanged");
static_assert(offsetof(Presenter_OnContextChanged, Context) == 0x000000, "Member 'Presenter_OnContextChanged::Context' has a wrong offset!");

// Function DBDUIPresenters.Presenter.OnContextFocus
// 0x0001 (0x0001 - 0x0000)
struct Presenter_OnContextFocus final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Presenter_OnContextFocus) == 0x000001, "Wrong alignment on Presenter_OnContextFocus");
static_assert(sizeof(Presenter_OnContextFocus) == 0x000001, "Wrong size on Presenter_OnContextFocus");
static_assert(offsetof(Presenter_OnContextFocus, Context) == 0x000000, "Member 'Presenter_OnContextFocus::Context' has a wrong offset!");

// Function DBDUIPresenters.Presenter.OnContextUnfocus
// 0x0001 (0x0001 - 0x0000)
struct Presenter_OnContextUnfocus final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Presenter_OnContextUnfocus) == 0x000001, "Wrong alignment on Presenter_OnContextUnfocus");
static_assert(sizeof(Presenter_OnContextUnfocus) == 0x000001, "Wrong size on Presenter_OnContextUnfocus");
static_assert(offsetof(Presenter_OnContextUnfocus, Context) == 0x000000, "Member 'Presenter_OnContextUnfocus::Context' has a wrong offset!");

// Function DBDUIPresenters.Presenter.IsContextReady
// 0x0001 (0x0001 - 0x0000)
struct Presenter_IsContextReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Presenter_IsContextReady) == 0x000001, "Wrong alignment on Presenter_IsContextReady");
static_assert(sizeof(Presenter_IsContextReady) == 0x000001, "Wrong size on Presenter_IsContextReady");
static_assert(offsetof(Presenter_IsContextReady, ReturnValue) == 0x000000, "Member 'Presenter_IsContextReady::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.Presenter.ShouldPresent
// 0x0001 (0x0001 - 0x0000)
struct Presenter_ShouldPresent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Presenter_ShouldPresent) == 0x000001, "Wrong alignment on Presenter_ShouldPresent");
static_assert(sizeof(Presenter_ShouldPresent) == 0x000001, "Wrong size on Presenter_ShouldPresent");
static_assert(offsetof(Presenter_ShouldPresent, ReturnValue) == 0x000000, "Member 'Presenter_ShouldPresent::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.IsHudReady
// 0x0001 (0x0001 - 0x0000)
struct HudPresenter_IsHudReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_IsHudReady) == 0x000001, "Wrong alignment on HudPresenter_IsHudReady");
static_assert(sizeof(HudPresenter_IsHudReady) == 0x000001, "Wrong size on HudPresenter_IsHudReady");
static_assert(offsetof(HudPresenter_IsHudReady, ReturnValue) == 0x000000, "Member 'HudPresenter_IsHudReady::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.OnPawnPossessed
// 0x0008 (0x0008 - 0x0000)
struct HudPresenter_OnPawnPossessed final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_OnPawnPossessed) == 0x000008, "Wrong alignment on HudPresenter_OnPawnPossessed");
static_assert(sizeof(HudPresenter_OnPawnPossessed) == 0x000008, "Wrong size on HudPresenter_OnPawnPossessed");
static_assert(offsetof(HudPresenter_OnPawnPossessed, Pawn) == 0x000000, "Member 'HudPresenter_OnPawnPossessed::Pawn' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.OnPawnUnpossessed
// 0x0008 (0x0008 - 0x0000)
struct HudPresenter_OnPawnUnpossessed final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_OnPawnUnpossessed) == 0x000008, "Wrong alignment on HudPresenter_OnPawnUnpossessed");
static_assert(sizeof(HudPresenter_OnPawnUnpossessed) == 0x000008, "Wrong size on HudPresenter_OnPawnUnpossessed");
static_assert(offsetof(HudPresenter_OnPawnUnpossessed, Pawn) == 0x000000, "Member 'HudPresenter_OnPawnUnpossessed::Pawn' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.IsGameStateReady
// 0x0001 (0x0001 - 0x0000)
struct HudPresenter_IsGameStateReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_IsGameStateReady) == 0x000001, "Wrong alignment on HudPresenter_IsGameStateReady");
static_assert(sizeof(HudPresenter_IsGameStateReady) == 0x000001, "Wrong size on HudPresenter_IsGameStateReady");
static_assert(offsetof(HudPresenter_IsGameStateReady, ReturnValue) == 0x000000, "Member 'HudPresenter_IsGameStateReady::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.IsPendingPawnReady
// 0x0001 (0x0001 - 0x0000)
struct HudPresenter_IsPendingPawnReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_IsPendingPawnReady) == 0x000001, "Wrong alignment on HudPresenter_IsPendingPawnReady");
static_assert(sizeof(HudPresenter_IsPendingPawnReady) == 0x000001, "Wrong size on HudPresenter_IsPendingPawnReady");
static_assert(offsetof(HudPresenter_IsPendingPawnReady, ReturnValue) == 0x000000, "Member 'HudPresenter_IsPendingPawnReady::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.IsPlayerStateReady
// 0x0001 (0x0001 - 0x0000)
struct HudPresenter_IsPlayerStateReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_IsPlayerStateReady) == 0x000001, "Wrong alignment on HudPresenter_IsPlayerStateReady");
static_assert(sizeof(HudPresenter_IsPlayerStateReady) == 0x000001, "Wrong size on HudPresenter_IsPlayerStateReady");
static_assert(offsetof(HudPresenter_IsPlayerStateReady, ReturnValue) == 0x000000, "Member 'HudPresenter_IsPlayerStateReady::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.HudPresenter.IsVisibleForCurrentGameMode
// 0x0001 (0x0001 - 0x0000)
struct HudPresenter_IsVisibleForCurrentGameMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudPresenter_IsVisibleForCurrentGameMode) == 0x000001, "Wrong alignment on HudPresenter_IsVisibleForCurrentGameMode");
static_assert(sizeof(HudPresenter_IsVisibleForCurrentGameMode) == 0x000001, "Wrong size on HudPresenter_IsVisibleForCurrentGameMode");
static_assert(offsetof(HudPresenter_IsVisibleForCurrentGameMode, ReturnValue) == 0x000000, "Member 'HudPresenter_IsVisibleForCurrentGameMode::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.HudMatchResultPresenter.ShowEndSequence
// 0x000C (0x000C - 0x0000)
struct HudMatchResultPresenter_ShowEndSequence final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSlasher;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MatchResult;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudMatchResultPresenter_ShowEndSequence) == 0x000004, "Wrong alignment on HudMatchResultPresenter_ShowEndSequence");
static_assert(sizeof(HudMatchResultPresenter_ShowEndSequence) == 0x00000C, "Wrong size on HudMatchResultPresenter_ShowEndSequence");
static_assert(offsetof(HudMatchResultPresenter_ShowEndSequence, Duration) == 0x000000, "Member 'HudMatchResultPresenter_ShowEndSequence::Duration' has a wrong offset!");
static_assert(offsetof(HudMatchResultPresenter_ShowEndSequence, IsSlasher) == 0x000004, "Member 'HudMatchResultPresenter_ShowEndSequence::IsSlasher' has a wrong offset!");
static_assert(offsetof(HudMatchResultPresenter_ShowEndSequence, MatchResult) == 0x000008, "Member 'HudMatchResultPresenter_ShowEndSequence::MatchResult' has a wrong offset!");

// Function DBDUIPresenters.AlertsPresenter.CanStartRewardSequence
// 0x0001 (0x0001 - 0x0000)
struct AlertsPresenter_CanStartRewardSequence final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlertsPresenter_CanStartRewardSequence) == 0x000001, "Wrong alignment on AlertsPresenter_CanStartRewardSequence");
static_assert(sizeof(AlertsPresenter_CanStartRewardSequence) == 0x000001, "Wrong size on AlertsPresenter_CanStartRewardSequence");
static_assert(offsetof(AlertsPresenter_CanStartRewardSequence, ReturnValue) == 0x000000, "Member 'AlertsPresenter_CanStartRewardSequence::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.AlertsPresenter.HasPendingViewData
// 0x0001 (0x0001 - 0x0000)
struct AlertsPresenter_HasPendingViewData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlertsPresenter_HasPendingViewData) == 0x000001, "Wrong alignment on AlertsPresenter_HasPendingViewData");
static_assert(sizeof(AlertsPresenter_HasPendingViewData) == 0x000001, "Wrong size on AlertsPresenter_HasPendingViewData");
static_assert(offsetof(AlertsPresenter_HasPendingViewData, ReturnValue) == 0x000000, "Member 'AlertsPresenter_HasPendingViewData::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.AnimationPreviewPresenter.OnContextEnter
// 0x0001 (0x0001 - 0x0000)
struct AnimationPreviewPresenter_OnContextEnter final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationPreviewPresenter_OnContextEnter) == 0x000001, "Wrong alignment on AnimationPreviewPresenter_OnContextEnter");
static_assert(sizeof(AnimationPreviewPresenter_OnContextEnter) == 0x000001, "Wrong size on AnimationPreviewPresenter_OnContextEnter");
static_assert(offsetof(AnimationPreviewPresenter_OnContextEnter, Context) == 0x000000, "Member 'AnimationPreviewPresenter_OnContextEnter::Context' has a wrong offset!");

// Function DBDUIPresenters.AnimationPreviewPresenter.OnContextLeave
// 0x0001 (0x0001 - 0x0000)
struct AnimationPreviewPresenter_OnContextLeave final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationPreviewPresenter_OnContextLeave) == 0x000001, "Wrong alignment on AnimationPreviewPresenter_OnContextLeave");
static_assert(sizeof(AnimationPreviewPresenter_OnContextLeave) == 0x000001, "Wrong size on AnimationPreviewPresenter_OnContextLeave");
static_assert(offsetof(AnimationPreviewPresenter_OnContextLeave, Context) == 0x000000, "Member 'AnimationPreviewPresenter_OnContextLeave::Context' has a wrong offset!");

// Function DBDUIPresenters.AnimationPreviewPresenter.IsContextEntered
// 0x0001 (0x0001 - 0x0000)
struct AnimationPreviewPresenter_IsContextEntered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationPreviewPresenter_IsContextEntered) == 0x000001, "Wrong alignment on AnimationPreviewPresenter_IsContextEntered");
static_assert(sizeof(AnimationPreviewPresenter_IsContextEntered) == 0x000001, "Wrong size on AnimationPreviewPresenter_IsContextEntered");
static_assert(offsetof(AnimationPreviewPresenter_IsContextEntered, ReturnValue) == 0x000000, "Member 'AnimationPreviewPresenter_IsContextEntered::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.ArchiveCompendiumSubPresenter.OnTomeSelected
// 0x0010 (0x0010 - 0x0000)
struct ArchiveCompendiumSubPresenter_OnTomeSelected final
{
public:
	class FString                                 TomeId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveCompendiumSubPresenter_OnTomeSelected) == 0x000008, "Wrong alignment on ArchiveCompendiumSubPresenter_OnTomeSelected");
static_assert(sizeof(ArchiveCompendiumSubPresenter_OnTomeSelected) == 0x000010, "Wrong size on ArchiveCompendiumSubPresenter_OnTomeSelected");
static_assert(offsetof(ArchiveCompendiumSubPresenter_OnTomeSelected, TomeId) == 0x000000, "Member 'ArchiveCompendiumSubPresenter_OnTomeSelected::TomeId' has a wrong offset!");

// Function DBDUIPresenters.ArchiveQuestMapSubPresenter.OnLevelSelected
// 0x0004 (0x0004 - 0x0000)
struct ArchiveQuestMapSubPresenter_OnLevelSelected final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapSubPresenter_OnLevelSelected) == 0x000004, "Wrong alignment on ArchiveQuestMapSubPresenter_OnLevelSelected");
static_assert(sizeof(ArchiveQuestMapSubPresenter_OnLevelSelected) == 0x000004, "Wrong size on ArchiveQuestMapSubPresenter_OnLevelSelected");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnLevelSelected, LevelIndex) == 0x000000, "Member 'ArchiveQuestMapSubPresenter_OnLevelSelected::LevelIndex' has a wrong offset!");

// Function DBDUIPresenters.ArchiveQuestMapSubPresenter.OnNodeSelected
// 0x0020 (0x0020 - 0x0000)
struct ArchiveQuestMapSubPresenter_OnNodeSelected final
{
public:
	class FName                                   NodeId;                                            // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerRole                                   Role;                                              // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Position;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapSubPresenter_OnNodeSelected) == 0x000008, "Wrong alignment on ArchiveQuestMapSubPresenter_OnNodeSelected");
static_assert(sizeof(ArchiveQuestMapSubPresenter_OnNodeSelected) == 0x000020, "Wrong size on ArchiveQuestMapSubPresenter_OnNodeSelected");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnNodeSelected, NodeId) == 0x000000, "Member 'ArchiveQuestMapSubPresenter_OnNodeSelected::NodeId' has a wrong offset!");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnNodeSelected, Role) == 0x00000C, "Member 'ArchiveQuestMapSubPresenter_OnNodeSelected::Role' has a wrong offset!");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnNodeSelected, Position) == 0x000010, "Member 'ArchiveQuestMapSubPresenter_OnNodeSelected::Position' has a wrong offset!");

// Function DBDUIPresenters.ArchiveQuestMapSubPresenter.OnPlayerCardUpdated
// 0x0020 (0x0020 - 0x0000)
struct ArchiveQuestMapSubPresenter_OnPlayerCardUpdated final
{
public:
	class FString                                 badgeId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bannerId;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapSubPresenter_OnPlayerCardUpdated) == 0x000008, "Wrong alignment on ArchiveQuestMapSubPresenter_OnPlayerCardUpdated");
static_assert(sizeof(ArchiveQuestMapSubPresenter_OnPlayerCardUpdated) == 0x000020, "Wrong size on ArchiveQuestMapSubPresenter_OnPlayerCardUpdated");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnPlayerCardUpdated, badgeId) == 0x000000, "Member 'ArchiveQuestMapSubPresenter_OnPlayerCardUpdated::badgeId' has a wrong offset!");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnPlayerCardUpdated, bannerId) == 0x000010, "Member 'ArchiveQuestMapSubPresenter_OnPlayerCardUpdated::bannerId' has a wrong offset!");

// Function DBDUIPresenters.ArchiveQuestMapSubPresenter.OnQuestNodeHovered
// 0x0001 (0x0001 - 0x0000)
struct ArchiveQuestMapSubPresenter_OnQuestNodeHovered final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapSubPresenter_OnQuestNodeHovered) == 0x000001, "Wrong alignment on ArchiveQuestMapSubPresenter_OnQuestNodeHovered");
static_assert(sizeof(ArchiveQuestMapSubPresenter_OnQuestNodeHovered) == 0x000001, "Wrong size on ArchiveQuestMapSubPresenter_OnQuestNodeHovered");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnQuestNodeHovered, Role) == 0x000000, "Member 'ArchiveQuestMapSubPresenter_OnQuestNodeHovered::Role' has a wrong offset!");

// Function DBDUIPresenters.ArchiveQuestMapSubPresenter.OnQuestNodeUnhovered
// 0x0001 (0x0001 - 0x0000)
struct ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered) == 0x000001, "Wrong alignment on ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered");
static_assert(sizeof(ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered) == 0x000001, "Wrong size on ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered");
static_assert(offsetof(ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered, Role) == 0x000000, "Member 'ArchiveQuestMapSubPresenter_OnQuestNodeUnhovered::Role' has a wrong offset!");

// Function DBDUIPresenters.ArchiveEditorSubPresenter.OnSaveTomeGraph
// 0x0010 (0x0010 - 0x0000)
struct ArchiveEditorSubPresenter_OnSaveTomeGraph final
{
public:
	TArray<struct FArchiveNodeGraphViewData>      NodeList;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveEditorSubPresenter_OnSaveTomeGraph) == 0x000008, "Wrong alignment on ArchiveEditorSubPresenter_OnSaveTomeGraph");
static_assert(sizeof(ArchiveEditorSubPresenter_OnSaveTomeGraph) == 0x000010, "Wrong size on ArchiveEditorSubPresenter_OnSaveTomeGraph");
static_assert(offsetof(ArchiveEditorSubPresenter_OnSaveTomeGraph, NodeList) == 0x000000, "Member 'ArchiveEditorSubPresenter_OnSaveTomeGraph::NodeList' has a wrong offset!");

// Function DBDUIPresenters.ArchiveImageViewerPresenter.OnArchivesVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay final
{
public:
	bool                                          Autoplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay");
static_assert(sizeof(ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay");
static_assert(offsetof(ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay, Autoplay) == 0x000000, "Member 'ArchiveImageViewerPresenter_OnArchivesVoiceOverAutoplay::Autoplay' has a wrong offset!");

// Function DBDUIPresenters.ArchiveImageViewerPresenter.OnArchivesVoiceOverPlayed
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed final
{
public:
	bool                                          Playing;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed) == 0x000001, "Wrong alignment on ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed");
static_assert(sizeof(ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed) == 0x000001, "Wrong size on ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed");
static_assert(offsetof(ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed, Playing) == 0x000000, "Member 'ArchiveImageViewerPresenter_OnArchivesVoiceOverPlayed::Playing' has a wrong offset!");

// Function DBDUIPresenters.ArchiveImageViewerPresenter.OnImageViewerVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay final
{
public:
	bool                                          Autoplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay");
static_assert(sizeof(ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay");
static_assert(offsetof(ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay, Autoplay) == 0x000000, "Member 'ArchiveImageViewerPresenter_OnImageViewerVoiceOverAutoplay::Autoplay' has a wrong offset!");

// Function DBDUIPresenters.ArchiveImageViewerPresenter.CanShowFullScreenMode
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerPresenter_CanShowFullScreenMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerPresenter_CanShowFullScreenMode) == 0x000001, "Wrong alignment on ArchiveImageViewerPresenter_CanShowFullScreenMode");
static_assert(sizeof(ArchiveImageViewerPresenter_CanShowFullScreenMode) == 0x000001, "Wrong size on ArchiveImageViewerPresenter_CanShowFullScreenMode");
static_assert(offsetof(ArchiveImageViewerPresenter_CanShowFullScreenMode, ReturnValue) == 0x000000, "Member 'ArchiveImageViewerPresenter_CanShowFullScreenMode::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.ArchiveJournalSubPresenter.OnAutoplayChanged
// 0x0008 (0x0008 - 0x0000)
struct ArchiveJournalSubPresenter_OnAutoplayChanged final
{
public:
	bool                                          AutoplayActive;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EntryIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalSubPresenter_OnAutoplayChanged) == 0x000004, "Wrong alignment on ArchiveJournalSubPresenter_OnAutoplayChanged");
static_assert(sizeof(ArchiveJournalSubPresenter_OnAutoplayChanged) == 0x000008, "Wrong size on ArchiveJournalSubPresenter_OnAutoplayChanged");
static_assert(offsetof(ArchiveJournalSubPresenter_OnAutoplayChanged, AutoplayActive) == 0x000000, "Member 'ArchiveJournalSubPresenter_OnAutoplayChanged::AutoplayActive' has a wrong offset!");
static_assert(offsetof(ArchiveJournalSubPresenter_OnAutoplayChanged, EntryIndex) == 0x000004, "Member 'ArchiveJournalSubPresenter_OnAutoplayChanged::EntryIndex' has a wrong offset!");

// Function DBDUIPresenters.ArchiveJournalSubPresenter.OnClickPlayButton
// 0x0004 (0x0004 - 0x0000)
struct ArchiveJournalSubPresenter_OnClickPlayButton final
{
public:
	int32                                         EntryIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalSubPresenter_OnClickPlayButton) == 0x000004, "Wrong alignment on ArchiveJournalSubPresenter_OnClickPlayButton");
static_assert(sizeof(ArchiveJournalSubPresenter_OnClickPlayButton) == 0x000004, "Wrong size on ArchiveJournalSubPresenter_OnClickPlayButton");
static_assert(offsetof(ArchiveJournalSubPresenter_OnClickPlayButton, EntryIndex) == 0x000000, "Member 'ArchiveJournalSubPresenter_OnClickPlayButton::EntryIndex' has a wrong offset!");

// Function DBDUIPresenters.ArchiveJournalSubPresenter.OnEntrySelected
// 0x0004 (0x0004 - 0x0000)
struct ArchiveJournalSubPresenter_OnEntrySelected final
{
public:
	int32                                         EntryIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalSubPresenter_OnEntrySelected) == 0x000004, "Wrong alignment on ArchiveJournalSubPresenter_OnEntrySelected");
static_assert(sizeof(ArchiveJournalSubPresenter_OnEntrySelected) == 0x000004, "Wrong size on ArchiveJournalSubPresenter_OnEntrySelected");
static_assert(offsetof(ArchiveJournalSubPresenter_OnEntrySelected, EntryIndex) == 0x000000, "Member 'ArchiveJournalSubPresenter_OnEntrySelected::EntryIndex' has a wrong offset!");

// Function DBDUIPresenters.ArchiveJournalSubPresenter.OnImageViewerVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay final
{
public:
	bool                                          Autoplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay");
static_assert(sizeof(ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay");
static_assert(offsetof(ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay, Autoplay) == 0x000000, "Member 'ArchiveJournalSubPresenter_OnImageViewerVoiceOverAutoplay::Autoplay' has a wrong offset!");

// Function DBDUIPresenters.ArchiveJournalSubPresenter.OnPlayCinematic
// 0x0004 (0x0004 - 0x0000)
struct ArchiveJournalSubPresenter_OnPlayCinematic final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalSubPresenter_OnPlayCinematic) == 0x000004, "Wrong alignment on ArchiveJournalSubPresenter_OnPlayCinematic");
static_assert(sizeof(ArchiveJournalSubPresenter_OnPlayCinematic) == 0x000004, "Wrong size on ArchiveJournalSubPresenter_OnPlayCinematic");
static_assert(offsetof(ArchiveJournalSubPresenter_OnPlayCinematic, Param_Index) == 0x000000, "Member 'ArchiveJournalSubPresenter_OnPlayCinematic::Param_Index' has a wrong offset!");

// Function DBDUIPresenters.ArchiveJournalSubPresenter.OnVignetteSelected
// 0x0010 (0x0010 - 0x0000)
struct ArchiveJournalSubPresenter_OnVignetteSelected final
{
public:
	class FString                                 VignetteId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalSubPresenter_OnVignetteSelected) == 0x000008, "Wrong alignment on ArchiveJournalSubPresenter_OnVignetteSelected");
static_assert(sizeof(ArchiveJournalSubPresenter_OnVignetteSelected) == 0x000010, "Wrong size on ArchiveJournalSubPresenter_OnVignetteSelected");
static_assert(offsetof(ArchiveJournalSubPresenter_OnVignetteSelected, VignetteId) == 0x000000, "Member 'ArchiveJournalSubPresenter_OnVignetteSelected::VignetteId' has a wrong offset!");

// Function DBDUIPresenters.ArchiveMenuPresenter.OnChallengeReminderClicked
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuPresenter_OnChallengeReminderClicked final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuPresenter_OnChallengeReminderClicked) == 0x000001, "Wrong alignment on ArchiveMenuPresenter_OnChallengeReminderClicked");
static_assert(sizeof(ArchiveMenuPresenter_OnChallengeReminderClicked) == 0x000001, "Wrong size on ArchiveMenuPresenter_OnChallengeReminderClicked");
static_assert(offsetof(ArchiveMenuPresenter_OnChallengeReminderClicked, Role) == 0x000000, "Member 'ArchiveMenuPresenter_OnChallengeReminderClicked::Role' has a wrong offset!");

// Function DBDUIPresenters.ArchiveMenuPresenter.OnChallengeReminderSlotSelected
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuPresenter_OnChallengeReminderSlotSelected final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuPresenter_OnChallengeReminderSlotSelected) == 0x000001, "Wrong alignment on ArchiveMenuPresenter_OnChallengeReminderSlotSelected");
static_assert(sizeof(ArchiveMenuPresenter_OnChallengeReminderSlotSelected) == 0x000001, "Wrong size on ArchiveMenuPresenter_OnChallengeReminderSlotSelected");
static_assert(offsetof(ArchiveMenuPresenter_OnChallengeReminderSlotSelected, Role) == 0x000000, "Member 'ArchiveMenuPresenter_OnChallengeReminderSlotSelected::Role' has a wrong offset!");

// Function DBDUIPresenters.ArchiveMenuPresenter.OnDisplayStandRotationDelegate
// 0x0004 (0x0004 - 0x0000)
struct ArchiveMenuPresenter_OnDisplayStandRotationDelegate final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuPresenter_OnDisplayStandRotationDelegate) == 0x000004, "Wrong alignment on ArchiveMenuPresenter_OnDisplayStandRotationDelegate");
static_assert(sizeof(ArchiveMenuPresenter_OnDisplayStandRotationDelegate) == 0x000004, "Wrong size on ArchiveMenuPresenter_OnDisplayStandRotationDelegate");
static_assert(offsetof(ArchiveMenuPresenter_OnDisplayStandRotationDelegate, Distance) == 0x000000, "Member 'ArchiveMenuPresenter_OnDisplayStandRotationDelegate::Distance' has a wrong offset!");

// Function DBDUIPresenters.ArchiveMenuPresenter.OnMenuTabSelected
// 0x0002 (0x0002 - 0x0000)
struct ArchiveMenuPresenter_OnMenuTabSelected final
{
public:
	EArchiveMenuState                             MenuState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlreadySelected;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuPresenter_OnMenuTabSelected) == 0x000001, "Wrong alignment on ArchiveMenuPresenter_OnMenuTabSelected");
static_assert(sizeof(ArchiveMenuPresenter_OnMenuTabSelected) == 0x000002, "Wrong size on ArchiveMenuPresenter_OnMenuTabSelected");
static_assert(offsetof(ArchiveMenuPresenter_OnMenuTabSelected, MenuState) == 0x000000, "Member 'ArchiveMenuPresenter_OnMenuTabSelected::MenuState' has a wrong offset!");
static_assert(offsetof(ArchiveMenuPresenter_OnMenuTabSelected, AlreadySelected) == 0x000001, "Member 'ArchiveMenuPresenter_OnMenuTabSelected::AlreadySelected' has a wrong offset!");

// Function DBDUIPresenters.ArchiveMenuPresenter.OnShowImageViewer
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuPresenter_OnShowImageViewer final
{
public:
	bool                                          VoiceOverIsPlaying;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuPresenter_OnShowImageViewer) == 0x000001, "Wrong alignment on ArchiveMenuPresenter_OnShowImageViewer");
static_assert(sizeof(ArchiveMenuPresenter_OnShowImageViewer) == 0x000001, "Wrong size on ArchiveMenuPresenter_OnShowImageViewer");
static_assert(offsetof(ArchiveMenuPresenter_OnShowImageViewer, VoiceOverIsPlaying) == 0x000000, "Member 'ArchiveMenuPresenter_OnShowImageViewer::VoiceOverIsPlaying' has a wrong offset!");

// Function DBDUIPresenters.BasePopupPresenter.OnContextEnter
// 0x0001 (0x0001 - 0x0000)
struct BasePopupPresenter_OnContextEnter final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasePopupPresenter_OnContextEnter) == 0x000001, "Wrong alignment on BasePopupPresenter_OnContextEnter");
static_assert(sizeof(BasePopupPresenter_OnContextEnter) == 0x000001, "Wrong size on BasePopupPresenter_OnContextEnter");
static_assert(offsetof(BasePopupPresenter_OnContextEnter, Context) == 0x000000, "Member 'BasePopupPresenter_OnContextEnter::Context' has a wrong offset!");

// Function DBDUIPresenters.BasePopupPresenter.OnContextLeave
// 0x0001 (0x0001 - 0x0000)
struct BasePopupPresenter_OnContextLeave final
{
public:
	EContext                                      Context;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasePopupPresenter_OnContextLeave) == 0x000001, "Wrong alignment on BasePopupPresenter_OnContextLeave");
static_assert(sizeof(BasePopupPresenter_OnContextLeave) == 0x000001, "Wrong size on BasePopupPresenter_OnContextLeave");
static_assert(offsetof(BasePopupPresenter_OnContextLeave, Context) == 0x000000, "Member 'BasePopupPresenter_OnContextLeave::Context' has a wrong offset!");

// Function DBDUIPresenters.BasePopupPresenter.IsContextEntered
// 0x0001 (0x0001 - 0x0000)
struct BasePopupPresenter_IsContextEntered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BasePopupPresenter_IsContextEntered) == 0x000001, "Wrong alignment on BasePopupPresenter_IsContextEntered");
static_assert(sizeof(BasePopupPresenter_IsContextEntered) == 0x000001, "Wrong size on BasePopupPresenter_IsContextEntered");
static_assert(offsetof(BasePopupPresenter_IsContextEntered, ReturnValue) == 0x000000, "Member 'BasePopupPresenter_IsContextEntered::ReturnValue' has a wrong offset!");

// Function DBDUIPresenters.GenericPopupPresenter.OnAction
// 0x0001 (0x0001 - 0x0000)
struct GenericPopupPresenter_OnAction final
{
public:
	EPopupButtonType                              PopupAction;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GenericPopupPresenter_OnAction) == 0x000001, "Wrong alignment on GenericPopupPresenter_OnAction");
static_assert(sizeof(GenericPopupPresenter_OnAction) == 0x000001, "Wrong size on GenericPopupPresenter_OnAction");
static_assert(offsetof(GenericPopupPresenter_OnAction, PopupAction) == 0x000000, "Member 'GenericPopupPresenter_OnAction::PopupAction' has a wrong offset!");

// Function DBDUIPresenters.GenericPopupPresenter.OnAppResumed
// 0x0001 (0x0001 - 0x0000)
struct GenericPopupPresenter_OnAppResumed final
{
public:
	bool                                          IsAppResumed;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GenericPopupPresenter_OnAppResumed) == 0x000001, "Wrong alignment on GenericPopupPresenter_OnAppResumed");
static_assert(sizeof(GenericPopupPresenter_OnAppResumed) == 0x000001, "Wrong size on GenericPopupPresenter_OnAppResumed");
static_assert(offsetof(GenericPopupPresenter_OnAppResumed, IsAppResumed) == 0x000000, "Member 'GenericPopupPresenter_OnAppResumed::IsAppResumed' has a wrong offset!");

// Function DBDUIPresenters.ArchiveRiftSubPresenter.OnRewardCurrencyClicked
// 0x0001 (0x0001 - 0x0000)
struct ArchiveRiftSubPresenter_OnRewardCurrencyClicked final
{
public:
	ECurrencyType                                 CurrencyType;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftSubPresenter_OnRewardCurrencyClicked) == 0x000001, "Wrong alignment on ArchiveRiftSubPresenter_OnRewardCurrencyClicked");
static_assert(sizeof(ArchiveRiftSubPresenter_OnRewardCurrencyClicked) == 0x000001, "Wrong size on ArchiveRiftSubPresenter_OnRewardCurrencyClicked");
static_assert(offsetof(ArchiveRiftSubPresenter_OnRewardCurrencyClicked, CurrencyType) == 0x000000, "Member 'ArchiveRiftSubPresenter_OnRewardCurrencyClicked::CurrencyType' has a wrong offset!");

// Function DBDUIPresenters.ArchiveRiftSubPresenter.OnRewardItemClicked
// 0x000C (0x000C - 0x0000)
struct ArchiveRiftSubPresenter_OnRewardItemClicked final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveRiftSubPresenter_OnRewardItemClicked) == 0x000004, "Wrong alignment on ArchiveRiftSubPresenter_OnRewardItemClicked");
static_assert(sizeof(ArchiveRiftSubPresenter_OnRewardItemClicked) == 0x00000C, "Wrong size on ArchiveRiftSubPresenter_OnRewardItemClicked");
static_assert(offsetof(ArchiveRiftSubPresenter_OnRewardItemClicked, ItemId) == 0x000000, "Member 'ArchiveRiftSubPresenter_OnRewardItemClicked::ItemId' has a wrong offset!");

// Function DBDUIPresenters.ArchiveTierPurchasePopupPresenter.OnConfirmPurchase
// 0x0004 (0x0004 - 0x0000)
struct ArchiveTierPurchasePopupPresenter_OnConfirmPurchase final
{
public:
	int32                                         TiersToPurchaseNumber;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveTierPurchasePopupPresenter_OnConfirmPurchase) == 0x000004, "Wrong alignment on ArchiveTierPurchasePopupPresenter_OnConfirmPurchase");
static_assert(sizeof(ArchiveTierPurchasePopupPresenter_OnConfirmPurchase) == 0x000004, "Wrong size on ArchiveTierPurchasePopupPresenter_OnConfirmPurchase");
static_assert(offsetof(ArchiveTierPurchasePopupPresenter_OnConfirmPurchase, TiersToPurchaseNumber) == 0x000000, "Member 'ArchiveTierPurchasePopupPresenter_OnConfirmPurchase::TiersToPurchaseNumber' has a wrong offset!");

// Function DBDUIPresenters.ArchiveTomeSubPresenter.OnMenuTabSelected
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTomeSubPresenter_OnMenuTabSelected final
{
public:
	EArchiveTomeMenuState                         MenuState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveTomeSubPresenter_OnMenuTabSelected) == 0x000001, "Wrong alignment on ArchiveTomeSubPresenter_OnMenuTabSelected");
static_assert(sizeof(ArchiveTomeSubPresenter_OnMenuTabSelected) == 0x000001, "Wrong size on ArchiveTomeSubPresenter_OnMenuTabSelected");
static_assert(offsetof(ArchiveTomeSubPresenter_OnMenuTabSelected, MenuState) == 0x000000, "Member 'ArchiveTomeSubPresenter_OnMenuTabSelected::MenuState' has a wrong offset!");

// Function DBDUIPresenters.AuricCellsPresenter.OnBuyAction
// 0x000C (0x000C - 0x0000)
struct AuricCellsPresenter_OnBuyAction final
{
public:
	class FName                                   bundleId;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuricCellsPresenter_OnBuyAction) == 0x000004, "Wrong alignment on AuricCellsPresenter_OnBuyAction");
static_assert(sizeof(AuricCellsPresenter_OnBuyAction) == 0x00000C, "Wrong size on AuricCellsPresenter_OnBuyAction");
static_assert(offsetof(AuricCellsPresenter_OnBuyAction, bundleId) == 0x000000, "Member 'AuricCellsPresenter_OnBuyAction::bundleId' has a wrong offset!");

// Function DBDUIPresenters.AuricCellsPresenter.OnPremiumTransactionCompleted
// 0x0020 (0x0020 - 0x0000)
struct AuricCellsPresenter_OnPremiumTransactionCompleted final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemId;                                            // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPremiumPurchaseCompleteData           PurchaseCompleteData;                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuricCellsPresenter_OnPremiumTransactionCompleted) == 0x000008, "Wrong alignment on AuricCellsPresenter_OnPremiumTransactionCompleted");
static_assert(sizeof(AuricCellsPresenter_OnPremiumTransactionCompleted) == 0x000020, "Wrong size on AuricCellsPresenter_OnPremiumTransactionCompleted");
static_assert(offsetof(AuricCellsPresenter_OnPremiumTransactionCompleted, Success) == 0x000000, "Member 'AuricCellsPresenter_OnPremiumTransactionCompleted::Success' has a wrong offset!");
static_assert(offsetof(AuricCellsPresenter_OnPremiumTransactionCompleted, ItemId) == 0x000004, "Member 'AuricCellsPresenter_OnPremiumTransactionCompleted::ItemId' has a wrong offset!");
static_assert(offsetof(AuricCellsPresenter_OnPremiumTransactionCompleted, PurchaseCompleteData) == 0x000010, "Member 'AuricCellsPresenter_OnPremiumTransactionCompleted::PurchaseCompleteData' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuChallengeSetSubPresenter.OnStoreRedirectionRequested
// 0x0210 (0x0210 - 0x0000)
struct ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested final
{
public:
	struct FCustomizationRewardViewData           SelectedItem;                                      // 0x0000(0x0210)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested) == 0x000008, "Wrong alignment on ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested");
static_assert(sizeof(ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested) == 0x000210, "Wrong size on ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested");
static_assert(offsetof(ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested, SelectedItem) == 0x000000, "Member 'ChallengesMenuChallengeSetSubPresenter_OnStoreRedirectionRequested::SelectedItem' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuChallengeSetSubPresenter.SetChallengeSetState
// 0x0001 (0x0001 - 0x0000)
struct ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState final
{
public:
	EChallengesMenuChallengeSetState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState) == 0x000001, "Wrong alignment on ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState");
static_assert(sizeof(ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState) == 0x000001, "Wrong size on ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState");
static_assert(offsetof(ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState, State) == 0x000000, "Member 'ChallengesMenuChallengeSetSubPresenter_SetChallengeSetState::State' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuPresenter.OnStoreRedirectionRequested
// 0x0228 (0x0228 - 0x0000)
struct ChallengesMenuPresenter_OnStoreRedirectionRequested final
{
public:
	class FString                                 ChallengeSetId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengesMenuChallengeSetState              TabState;                                          // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationRewardViewData           SelectedItem;                                      // 0x0018(0x0210)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuPresenter_OnStoreRedirectionRequested) == 0x000008, "Wrong alignment on ChallengesMenuPresenter_OnStoreRedirectionRequested");
static_assert(sizeof(ChallengesMenuPresenter_OnStoreRedirectionRequested) == 0x000228, "Wrong size on ChallengesMenuPresenter_OnStoreRedirectionRequested");
static_assert(offsetof(ChallengesMenuPresenter_OnStoreRedirectionRequested, ChallengeSetId) == 0x000000, "Member 'ChallengesMenuPresenter_OnStoreRedirectionRequested::ChallengeSetId' has a wrong offset!");
static_assert(offsetof(ChallengesMenuPresenter_OnStoreRedirectionRequested, TabState) == 0x000010, "Member 'ChallengesMenuPresenter_OnStoreRedirectionRequested::TabState' has a wrong offset!");
static_assert(offsetof(ChallengesMenuPresenter_OnStoreRedirectionRequested, SelectedItem) == 0x000018, "Member 'ChallengesMenuPresenter_OnStoreRedirectionRequested::SelectedItem' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuPresenter.OnTabSelected
// 0x0004 (0x0004 - 0x0000)
struct ChallengesMenuPresenter_OnTabSelected final
{
public:
	int32                                         SelectedKey;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuPresenter_OnTabSelected) == 0x000004, "Wrong alignment on ChallengesMenuPresenter_OnTabSelected");
static_assert(sizeof(ChallengesMenuPresenter_OnTabSelected) == 0x000004, "Wrong size on ChallengesMenuPresenter_OnTabSelected");
static_assert(offsetof(ChallengesMenuPresenter_OnTabSelected, SelectedKey) == 0x000000, "Member 'ChallengesMenuPresenter_OnTabSelected::SelectedKey' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuRewardTrackSubPresenter.OnRewardCurrencyClicked
// 0x0001 (0x0001 - 0x0000)
struct ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked final
{
public:
	ECurrencyType                                 CurrencyType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked) == 0x000001, "Wrong alignment on ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked");
static_assert(sizeof(ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked) == 0x000001, "Wrong size on ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked");
static_assert(offsetof(ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked, CurrencyType) == 0x000000, "Member 'ChallengesMenuRewardTrackSubPresenter_OnRewardCurrencyClicked::CurrencyType' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuRewardTrackSubPresenter.OnRewardItemClicked
// 0x000C (0x000C - 0x0000)
struct ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked) == 0x000004, "Wrong alignment on ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked");
static_assert(sizeof(ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked) == 0x00000C, "Wrong size on ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked");
static_assert(offsetof(ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked, ItemId) == 0x000000, "Member 'ChallengesMenuRewardTrackSubPresenter_OnRewardItemClicked::ItemId' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuRitualsSubPresenter.OnChallengeItemSelected
// 0x0010 (0x0010 - 0x0000)
struct ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected final
{
public:
	class FString                                 ChallengeId;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected) == 0x000008, "Wrong alignment on ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected");
static_assert(sizeof(ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected) == 0x000010, "Wrong size on ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected");
static_assert(offsetof(ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected, ChallengeId) == 0x000000, "Member 'ChallengesMenuRitualsSubPresenter_OnChallengeItemSelected::ChallengeId' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuRitualsSubPresenter.OnSearchBarTextChanged
// 0x0010 (0x0010 - 0x0000)
struct ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged final
{
public:
	class FString                                 EnteredText;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged) == 0x000008, "Wrong alignment on ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged");
static_assert(sizeof(ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged) == 0x000010, "Wrong size on ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged");
static_assert(offsetof(ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged, EnteredText) == 0x000000, "Member 'ChallengesMenuRitualsSubPresenter_OnSearchBarTextChanged::EnteredText' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuRitualsSubPresenter.OnSortingChanged
// 0x0004 (0x0004 - 0x0000)
struct ChallengesMenuRitualsSubPresenter_OnSortingChanged final
{
public:
	ESortingOption                                Sorting;                                           // 0x0000(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESortingOrder                                 Order;                                             // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChallengesMenuRitualsSubPresenter_OnSortingChanged) == 0x000002, "Wrong alignment on ChallengesMenuRitualsSubPresenter_OnSortingChanged");
static_assert(sizeof(ChallengesMenuRitualsSubPresenter_OnSortingChanged) == 0x000004, "Wrong size on ChallengesMenuRitualsSubPresenter_OnSortingChanged");
static_assert(offsetof(ChallengesMenuRitualsSubPresenter_OnSortingChanged, Sorting) == 0x000000, "Member 'ChallengesMenuRitualsSubPresenter_OnSortingChanged::Sorting' has a wrong offset!");
static_assert(offsetof(ChallengesMenuRitualsSubPresenter_OnSortingChanged, Order) == 0x000002, "Member 'ChallengesMenuRitualsSubPresenter_OnSortingChanged::Order' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuStoreSubPresenter.OnCustomizationGridItemClicked
// 0x0004 (0x0004 - 0x0000)
struct ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked) == 0x000004, "Wrong alignment on ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked");
static_assert(sizeof(ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked) == 0x000004, "Wrong size on ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked");
static_assert(offsetof(ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked, SelectedIndex) == 0x000000, "Member 'ChallengesMenuStoreSubPresenter_OnCustomizationGridItemClicked::SelectedIndex' has a wrong offset!");

// Function DBDUIPresenters.ChallengesMenuStoreSubPresenter.OnPreviewAreaItemClicked
// 0x0004 (0x0004 - 0x0000)
struct ChallengesMenuStoreSubPresenter_OnPreviewAreaItemClicked final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuStoreSubPresenter_OnPreviewAreaItemClicked) == 0x000004, "Wrong alignment on ChallengesMenuStoreSubPresenter_OnPreviewAreaItemClicked");
static_assert(sizeof(ChallengesMenuStoreSubPresenter_OnPreviewAreaItemClicked) == 0x000004, "Wrong size on ChallengesMenuStoreSubPresenter_OnPreviewAreaItemClicked");
