#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewsCore

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum DBDUIViewsCore.EButtonWidgetVisibility
// NumValues: 0x0004
enum class EButtonWidgetVisibility : uint8
{
	Visible                                  = 0,
	Collapsed                                = 1,
	Hidden                                   = 2,
	EButtonWidgetVisibility_MAX              = 3,
};

// Enum DBDUIViewsCore.EAnalogCursorStickiness
// NumValues: 0x0007
enum class EAnalogCursorStickiness : uint8
{
	None                                     = 0,
	ButtonSmall                              = 1,
	ButtonMedium                             = 2,
	ButtonLarge                              = 3,
	Bloodweb                                 = 4,
	Slow                                     = 5,
	EAnalogCursorStickiness_MAX              = 6,
};

// Enum DBDUIViewsCore.EChallengeReminderUpdateType
// NumValues: 0x0003
enum class EChallengeReminderUpdateType : uint8
{
	Reveal                                   = 0,
	Swap                                     = 1,
	EChallengeReminderUpdateType_MAX         = 2,
};

// Enum DBDUIViewsCore.EEditorMode
// NumValues: 0x0003
enum class EEditorMode : uint8
{
	Node                                     = 0,
	Path                                     = 1,
	EEditorMode_MAX                          = 2,
};

// Enum DBDUIViewsCore.ENodeStatusChange
// NumValues: 0x0007
enum class ENodeStatusChange : uint8
{
	NodeQuestActivate                        = 0,
	NodeQuestPaused                          = 1,
	NodeQuestUnlock                          = 2,
	NodeRewardAvailableForClaim              = 3,
	NodeQuestClaimed                         = 4,
	None                                     = 5,
	ENodeStatusChange_MAX                    = 6,
};

// Enum DBDUIViewsCore.EBackgroundProgressBarState
// NumValues: 0x0006
enum class EBackgroundProgressBarState : uint8
{
	Empty                                    = 0,
	Quarter                                  = 1,
	Half                                     = 2,
	ThreeQuarters                            = 3,
	Full                                     = 4,
	EBackgroundProgressBarState_MAX          = 5,
};

// Enum DBDUIViewsCore.EInputSwitcherDisplayRule
// NumValues: 0x0005
enum class EInputSwitcherDisplayRule : uint8
{
	Undefined                                = 0,
	OnlyGamepad                              = 1,
	OnlyKeyboard                             = 2,
	Always                                   = 3,
	EInputSwitcherDisplayRule_MAX            = 4,
};

// Enum DBDUIViewsCore.EMainMenuButtonTemplate
// NumValues: 0x0005
enum class EMainMenuButtonTemplate : uint8
{
	Default                                  = 0,
	Navigation                               = 1,
	SubMenu                                  = 2,
	Event                                    = 3,
	EMainMenuButtonTemplate_MAX              = 4,
};

// Enum DBDUIViewsCore.EPlayerStatusBloodSplatterType
// NumValues: 0x0004
enum class EPlayerStatusBloodSplatterType : uint8
{
	None                                     = 0,
	Top                                      = 1,
	Bottom                                   = 2,
	EPlayerStatusBloodSplatterType_MAX       = 3,
};

// Enum DBDUIViewsCore.EPreConstructableItemVisibility
// NumValues: 0x0003
enum class EPreConstructableItemVisibility : uint8
{
	Visible                                  = 0,
	Collapsed                                = 1,
	EPreConstructableItemVisibility_MAX      = 2,
};

// Enum DBDUIViewsCore.ECollectionItemScaleType
// NumValues: 0x0003
enum class ECollectionItemScaleType : uint8
{
	Featured                                 = 0,
	All                                      = 1,
	ECollectionItemScaleType_MAX             = 2,
};

// Enum DBDUIViewsCore.EToastNotificationType
// NumValues: 0x0003
enum class EToastNotificationType : uint8
{
	Simple                                   = 0,
	Interactable                             = 1,
	EToastNotificationType_MAX               = 2,
};

// Enum DBDUIViewsCore.EShowScrollDisplayPrompt
// NumValues: 0x0005
enum class EShowScrollDisplayPrompt : uint8
{
	DontShow                                 = 0,
	AlwaysShow                               = 1,
	AlwaysShowIfScrollable                   = 2,
	ShowOnMouseOver                          = 3,
	EShowScrollDisplayPrompt_MAX             = 4,
};

// Enum DBDUIViewsCore.ETooltipHorizontalAlignment
// NumValues: 0x0006
enum class ETooltipHorizontalAlignment : uint8
{
	Default                                  = 0,
	OutsideLeft                              = 1,
	OutsideRight                             = 2,
	InsideLeft                               = 3,
	InsideRight                              = 4,
	ETooltipHorizontalAlignment_MAX          = 5,
};

// Enum DBDUIViewsCore.ETooltipVerticalAlignment
// NumValues: 0x0006
enum class ETooltipVerticalAlignment : uint8
{
	Default                                  = 0,
	InsideTop                                = 1,
	InsideBottom                             = 2,
	OutsideTop                               = 3,
	OutsideBottom                            = 4,
	ETooltipVerticalAlignment_MAX            = 5,
};

// Enum DBDUIViewsCore.EDragZoneAxis
// NumValues: 0x0003
enum class EDragZoneAxis : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	EDragZoneAxis_MAX                        = 2,
};

// Enum DBDUIViewsCore.EFriendItemWidgetType
// NumValues: 0x0007
enum class EFriendItemWidgetType : uint8
{
	Friend                                   = 0,
	ViewProfile                              = 1,
	PendingSentRequest                       = 2,
	PendingReceivedRequest                   = 3,
	NotFriend                                = 4,
	Blocked                                  = 5,
	EFriendItemWidgetType_MAX                = 6,
};

// Enum DBDUIViewsCore.EPlayerListItemState
// NumValues: 0x0006
enum class EPlayerListItemState : uint8
{
	Locked                                   = 0,
	Invite                                   = 1,
	Details                                  = 2,
	Searching                                = 3,
	Empty                                    = 4,
	EPlayerListItemState_MAX                 = 5,
};

// Enum DBDUIViewsCore.ETooltipType
// NumValues: 0x0010
enum class ETooltipType : uint8
{
	None                                     = 0,
	ArchiveCompendium                        = 1,
	ArchiveNode                              = 2,
	ArchiveRewardNode                        = 3,
	Character                                = 4,
	CurrencyProgression                      = 5,
	Customization                            = 6,
	Label                                    = 7,
	Loadout                                  = 8,
	ObjectiveTracker                         = 9,
	PlayerLevel                              = 10,
	Rank                                     = 11,
	ArchivePass                              = 12,
	LockedFeature                            = 13,
	NotEnoughCurrency                        = 14,
	ETooltipType_MAX                         = 15,
};

// Enum DBDUIViewsCore.ETooltipPriority
// NumValues: 0x0004
enum class ETooltipPriority : uint8
{
	Tooltip                                  = 0,
	Modal                                    = 1,
	Count                                    = 2,
	ETooltipPriority_MAX                     = 3,
};

// ScriptStruct DBDUIViewsCore.AnalyticsComponent
// 0x0040 (0x0040 - 0x0000)
struct FAnalyticsComponent final
{
public:
	class UObject*                                _owner;                                            // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIAnalyticsManager*                    _uiAnalyticsManager;                               // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _sendAnalyticsData;                                // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _analyticsName;                                    // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _prependCurrentTabNameToAnalyticsName;             // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDTextBlock*                          _debugAnalyticsTB;                                 // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FAnalyticsComponent) == 0x000008, "Wrong alignment on FAnalyticsComponent");
static_assert(sizeof(FAnalyticsComponent) == 0x000040, "Wrong size on FAnalyticsComponent");
static_assert(offsetof(FAnalyticsComponent, _owner) == 0x000000, "Member 'FAnalyticsComponent::_owner' has a wrong offset!");
static_assert(offsetof(FAnalyticsComponent, _uiAnalyticsManager) == 0x000008, "Member 'FAnalyticsComponent::_uiAnalyticsManager' has a wrong offset!");
static_assert(offsetof(FAnalyticsComponent, _sendAnalyticsData) == 0x000018, "Member 'FAnalyticsComponent::_sendAnalyticsData' has a wrong offset!");
static_assert(offsetof(FAnalyticsComponent, _analyticsName) == 0x000020, "Member 'FAnalyticsComponent::_analyticsName' has a wrong offset!");
static_assert(offsetof(FAnalyticsComponent, _prependCurrentTabNameToAnalyticsName) == 0x000030, "Member 'FAnalyticsComponent::_prependCurrentTabNameToAnalyticsName' has a wrong offset!");
static_assert(offsetof(FAnalyticsComponent, _debugAnalyticsTB) == 0x000038, "Member 'FAnalyticsComponent::_debugAnalyticsTB' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.LinePair
// 0x0020 (0x0020 - 0x0000)
struct FLinePair final
{
public:
	struct FVector2D                              Start;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              End;                                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLinePair) == 0x000008, "Wrong alignment on FLinePair");
static_assert(sizeof(FLinePair) == 0x000020, "Wrong size on FLinePair");
static_assert(offsetof(FLinePair, Start) == 0x000000, "Member 'FLinePair::Start' has a wrong offset!");
static_assert(offsetof(FLinePair, End) == 0x000010, "Member 'FLinePair::End' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CoreDisabledStateConfiguration
// 0x0008 (0x0008 - 0x0000)
struct FCoreDisabledStateConfiguration final
{
public:
	class UMaterialInterface*                     OverlayMaterial;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCoreDisabledStateConfiguration) == 0x000008, "Wrong alignment on FCoreDisabledStateConfiguration");
static_assert(sizeof(FCoreDisabledStateConfiguration) == 0x000008, "Wrong size on FCoreDisabledStateConfiguration");
static_assert(offsetof(FCoreDisabledStateConfiguration, OverlayMaterial) == 0x000000, "Member 'FCoreDisabledStateConfiguration::OverlayMaterial' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CoreDisabledStateWidgetConfiguration
// 0x0050 (0x0050 - 0x0000)
struct FCoreDisabledStateWidgetConfiguration final
{
public:
	TMap<EDisabledItemOption, struct FCoreDisabledStateConfiguration> DisabledOverlayMaterials;                          // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCoreDisabledStateWidgetConfiguration) == 0x000008, "Wrong alignment on FCoreDisabledStateWidgetConfiguration");
static_assert(sizeof(FCoreDisabledStateWidgetConfiguration) == 0x000050, "Wrong size on FCoreDisabledStateWidgetConfiguration");
static_assert(offsetof(FCoreDisabledStateWidgetConfiguration, DisabledOverlayMaterials) == 0x000000, "Member 'FCoreDisabledStateWidgetConfiguration::DisabledOverlayMaterials' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.OnboardingTutorialButtonViewData
// 0x0078 (0x0078 - 0x0000)
struct FOnboardingTutorialButtonViewData final
{
public:
	EOnboardingStepStatus                         StepStatus;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StepId;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TutorialId;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0028(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0040(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRewardWrapperViewData>         RewardsData;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EOnboardingTutorialButtonStyle                ButtonStyle;                                       // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOnboardingTutorialButtonViewData) == 0x000008, "Wrong alignment on FOnboardingTutorialButtonViewData");
static_assert(sizeof(FOnboardingTutorialButtonViewData) == 0x000078, "Wrong size on FOnboardingTutorialButtonViewData");
static_assert(offsetof(FOnboardingTutorialButtonViewData, StepStatus) == 0x000000, "Member 'FOnboardingTutorialButtonViewData::StepStatus' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, StepId) == 0x000008, "Member 'FOnboardingTutorialButtonViewData::StepId' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, TutorialId) == 0x000018, "Member 'FOnboardingTutorialButtonViewData::TutorialId' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, Title) == 0x000028, "Member 'FOnboardingTutorialButtonViewData::Title' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, Description) == 0x000040, "Member 'FOnboardingTutorialButtonViewData::Description' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, Icon) == 0x000058, "Member 'FOnboardingTutorialButtonViewData::Icon' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, RewardsData) == 0x000060, "Member 'FOnboardingTutorialButtonViewData::RewardsData' has a wrong offset!");
static_assert(offsetof(FOnboardingTutorialButtonViewData, ButtonStyle) == 0x000070, "Member 'FOnboardingTutorialButtonViewData::ButtonStyle' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.PendingStepData
// 0x0010 (0x0010 - 0x0000)
struct FPendingStepData final
{
public:
	TArray<struct FOnboardingTutorialButtonViewData> UpdatedButtonViewData;                             // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPendingStepData) == 0x000008, "Wrong alignment on FPendingStepData");
static_assert(sizeof(FPendingStepData) == 0x000010, "Wrong size on FPendingStepData");
static_assert(offsetof(FPendingStepData, UpdatedButtonViewData) == 0x000000, "Member 'FPendingStepData::UpdatedButtonViewData' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.PlayerStatusAssets
// 0x0018 (0x0018 - 0x0000)
struct FPlayerStatusAssets final
{
public:
	EPlayerStatusBloodSplatterType                BloodSplatterType;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             BloodTexture;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             IconTexture;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayerStatusAssets) == 0x000008, "Wrong alignment on FPlayerStatusAssets");
static_assert(sizeof(FPlayerStatusAssets) == 0x000018, "Wrong size on FPlayerStatusAssets");
static_assert(offsetof(FPlayerStatusAssets, BloodSplatterType) == 0x000000, "Member 'FPlayerStatusAssets::BloodSplatterType' has a wrong offset!");
static_assert(offsetof(FPlayerStatusAssets, BloodTexture) == 0x000008, "Member 'FPlayerStatusAssets::BloodTexture' has a wrong offset!");
static_assert(offsetof(FPlayerStatusAssets, IconTexture) == 0x000010, "Member 'FPlayerStatusAssets::IconTexture' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CorePrestigeTierConfiguration
// 0x0008 (0x0008 - 0x0000)
struct FCorePrestigeTierConfiguration final
{
public:
	class UTexture2D*                             PrestigeTierTexture;                               // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCorePrestigeTierConfiguration) == 0x000008, "Wrong alignment on FCorePrestigeTierConfiguration");
static_assert(sizeof(FCorePrestigeTierConfiguration) == 0x000008, "Wrong size on FCorePrestigeTierConfiguration");
static_assert(offsetof(FCorePrestigeTierConfiguration, PrestigeTierTexture) == 0x000000, "Member 'FCorePrestigeTierConfiguration::PrestigeTierTexture' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CorePrestigeMilestoneConfiguration
// 0x0010 (0x0010 - 0x0000)
struct FCorePrestigeMilestoneConfiguration final
{
public:
	TArray<struct FCorePrestigeTierConfiguration> PrestigeTiers;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCorePrestigeMilestoneConfiguration) == 0x000008, "Wrong alignment on FCorePrestigeMilestoneConfiguration");
static_assert(sizeof(FCorePrestigeMilestoneConfiguration) == 0x000010, "Wrong size on FCorePrestigeMilestoneConfiguration");
static_assert(offsetof(FCorePrestigeMilestoneConfiguration, PrestigeTiers) == 0x000000, "Member 'FCorePrestigeMilestoneConfiguration::PrestigeTiers' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CorePrestigeProgressConfiguration
// 0x0018 (0x0018 - 0x0000)
struct FCorePrestigeProgressConfiguration final
{
public:
	TArray<class UMaterialInstance*>              ProgressFillMaterials;                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UTexture2D*                             ProgressBackgroundTexture;                         // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCorePrestigeProgressConfiguration) == 0x000008, "Wrong alignment on FCorePrestigeProgressConfiguration");
static_assert(sizeof(FCorePrestigeProgressConfiguration) == 0x000018, "Wrong size on FCorePrestigeProgressConfiguration");
static_assert(offsetof(FCorePrestigeProgressConfiguration, ProgressFillMaterials) == 0x000000, "Member 'FCorePrestigeProgressConfiguration::ProgressFillMaterials' has a wrong offset!");
static_assert(offsetof(FCorePrestigeProgressConfiguration, ProgressBackgroundTexture) == 0x000010, "Member 'FCorePrestigeProgressConfiguration::ProgressBackgroundTexture' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CorePrestigeWidgetConfiguration
// 0x0140 (0x0140 - 0x0000)
struct FCorePrestigeWidgetConfiguration final
{
public:
	TMap<int32, struct FCorePrestigeMilestoneConfiguration> PrestigeMilestones;                                // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, struct FCorePrestigeProgressConfiguration> PrestigeProgress;                                  // 0x0050(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UTexture2D*>                ClawTextures;                                      // 0x00A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UTexture2D*>                OrnamentTextures;                                  // 0x00F0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCorePrestigeWidgetConfiguration) == 0x000008, "Wrong alignment on FCorePrestigeWidgetConfiguration");
static_assert(sizeof(FCorePrestigeWidgetConfiguration) == 0x000140, "Wrong size on FCorePrestigeWidgetConfiguration");
static_assert(offsetof(FCorePrestigeWidgetConfiguration, PrestigeMilestones) == 0x000000, "Member 'FCorePrestigeWidgetConfiguration::PrestigeMilestones' has a wrong offset!");
static_assert(offsetof(FCorePrestigeWidgetConfiguration, PrestigeProgress) == 0x000050, "Member 'FCorePrestigeWidgetConfiguration::PrestigeProgress' has a wrong offset!");
static_assert(offsetof(FCorePrestigeWidgetConfiguration, ClawTextures) == 0x0000A0, "Member 'FCorePrestigeWidgetConfiguration::ClawTextures' has a wrong offset!");
static_assert(offsetof(FCorePrestigeWidgetConfiguration, OrnamentTextures) == 0x0000F0, "Member 'FCorePrestigeWidgetConfiguration::OrnamentTextures' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CoreRanksConfiguration
// 0x0020 (0x0020 - 0x0000)
struct FCoreRanksConfiguration final
{
public:
	class UTexture2D*                             RankBackgroundImage;                               // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            NumberColor;                                       // 0x0008(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCoreRanksConfiguration) == 0x000008, "Wrong alignment on FCoreRanksConfiguration");
static_assert(sizeof(FCoreRanksConfiguration) == 0x000020, "Wrong size on FCoreRanksConfiguration");
static_assert(offsetof(FCoreRanksConfiguration, RankBackgroundImage) == 0x000000, "Member 'FCoreRanksConfiguration::RankBackgroundImage' has a wrong offset!");
static_assert(offsetof(FCoreRanksConfiguration, NumberColor) == 0x000008, "Member 'FCoreRanksConfiguration::NumberColor' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.CoreRankWidgetConfiguration
// 0x00F0 (0x00F0 - 0x0000)
struct FCoreRankWidgetConfiguration final
{
public:
	TMap<int32, struct FCoreRanksConfiguration>   SurvivorRanks;                                     // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, struct FCoreRanksConfiguration>   KillerRanks;                                       // 0x0050(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UTexture2D*>                RankNumberImages;                                  // 0x00A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCoreRankWidgetConfiguration) == 0x000008, "Wrong alignment on FCoreRankWidgetConfiguration");
static_assert(sizeof(FCoreRankWidgetConfiguration) == 0x0000F0, "Wrong size on FCoreRankWidgetConfiguration");
static_assert(offsetof(FCoreRankWidgetConfiguration, SurvivorRanks) == 0x000000, "Member 'FCoreRankWidgetConfiguration::SurvivorRanks' has a wrong offset!");
static_assert(offsetof(FCoreRankWidgetConfiguration, KillerRanks) == 0x000050, "Member 'FCoreRankWidgetConfiguration::KillerRanks' has a wrong offset!");
static_assert(offsetof(FCoreRankWidgetConfiguration, RankNumberImages) == 0x0000A0, "Member 'FCoreRankWidgetConfiguration::RankNumberImages' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.HtmlToRichTagConvertRow
// 0x0020 (0x0028 - 0x0008)
struct FHtmlToRichTagConvertRow final : public FTableRowBase
{
public:
	class FString                                 HtmlTag;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RichTextTag;                                       // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHtmlToRichTagConvertRow) == 0x000008, "Wrong alignment on FHtmlToRichTagConvertRow");
static_assert(sizeof(FHtmlToRichTagConvertRow) == 0x000028, "Wrong size on FHtmlToRichTagConvertRow");
static_assert(offsetof(FHtmlToRichTagConvertRow, HtmlTag) == 0x000008, "Member 'FHtmlToRichTagConvertRow::HtmlTag' has a wrong offset!");
static_assert(offsetof(FHtmlToRichTagConvertRow, RichTextTag) == 0x000018, "Member 'FHtmlToRichTagConvertRow::RichTextTag' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.HtmlRichTextTag
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FHtmlRichTextTag final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHtmlRichTextTag) == 0x000008, "Wrong alignment on FHtmlRichTextTag");
static_assert(sizeof(FHtmlRichTextTag) == 0x000050, "Wrong size on FHtmlRichTextTag");

// ScriptStruct DBDUIViewsCore.InputPromptDataRow
// 0x0078 (0x0080 - 0x0008)
struct FInputPromptDataRow final : public FTableRowBase
{
public:
	class FText                                   InputLabel;                                        // 0x0008(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FKey                                   InputKey;                                          // 0x0020(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              PromptTexture;                                     // 0x0040(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowLabel;                                         // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInputPromptDataRow) == 0x000008, "Wrong alignment on FInputPromptDataRow");
static_assert(sizeof(FInputPromptDataRow) == 0x000080, "Wrong size on FInputPromptDataRow");
static_assert(offsetof(FInputPromptDataRow, InputLabel) == 0x000008, "Member 'FInputPromptDataRow::InputLabel' has a wrong offset!");
static_assert(offsetof(FInputPromptDataRow, InputKey) == 0x000020, "Member 'FInputPromptDataRow::InputKey' has a wrong offset!");
static_assert(offsetof(FInputPromptDataRow, PromptTexture) == 0x000040, "Member 'FInputPromptDataRow::PromptTexture' has a wrong offset!");
static_assert(offsetof(FInputPromptDataRow, ShowLabel) == 0x000078, "Member 'FInputPromptDataRow::ShowLabel' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.LoadedLocalTextures
// 0x0050 (0x0050 - 0x0000)
struct FLoadedLocalTextures final
{
public:
	TMap<class FString, class UTexture2D*>        Textures;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLoadedLocalTextures) == 0x000008, "Wrong alignment on FLoadedLocalTextures");
static_assert(sizeof(FLoadedLocalTextures) == 0x000050, "Wrong size on FLoadedLocalTextures");
static_assert(offsetof(FLoadedLocalTextures, Textures) == 0x000000, "Member 'FLoadedLocalTextures::Textures' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.MilestoneTrackerEventBasedSkinViewData
// 0x0070 (0x0070 - 0x0000)
struct FMilestoneTrackerEventBasedSkinViewData final
{
public:
	TSoftObjectPtr<class UMaterialInstance>       MilestoneTrackerBackground;                        // 0x0000(0x0038)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       MilestoneTrackerHighlightBar;                      // 0x0038(0x0038)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMilestoneTrackerEventBasedSkinViewData) == 0x000008, "Wrong alignment on FMilestoneTrackerEventBasedSkinViewData");
static_assert(sizeof(FMilestoneTrackerEventBasedSkinViewData) == 0x000070, "Wrong size on FMilestoneTrackerEventBasedSkinViewData");
static_assert(offsetof(FMilestoneTrackerEventBasedSkinViewData, MilestoneTrackerBackground) == 0x000000, "Member 'FMilestoneTrackerEventBasedSkinViewData::MilestoneTrackerBackground' has a wrong offset!");
static_assert(offsetof(FMilestoneTrackerEventBasedSkinViewData, MilestoneTrackerHighlightBar) == 0x000038, "Member 'FMilestoneTrackerEventBasedSkinViewData::MilestoneTrackerHighlightBar' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.TextBlockOverrideProperties
// 0x002C (0x002C - 0x0000)
struct FTextBlockOverrideProperties final
{
public:
	bool                                          UseColor;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Color;                                             // 0x0004(0x0014)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                          UseOpacity;                                        // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Opacity;                                           // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSize;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Size;                                              // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTextBlockOverrideProperties) == 0x000004, "Wrong alignment on FTextBlockOverrideProperties");
static_assert(sizeof(FTextBlockOverrideProperties) == 0x00002C, "Wrong size on FTextBlockOverrideProperties");
static_assert(offsetof(FTextBlockOverrideProperties, UseColor) == 0x000000, "Member 'FTextBlockOverrideProperties::UseColor' has a wrong offset!");
static_assert(offsetof(FTextBlockOverrideProperties, Color) == 0x000004, "Member 'FTextBlockOverrideProperties::Color' has a wrong offset!");
static_assert(offsetof(FTextBlockOverrideProperties, UseOpacity) == 0x000018, "Member 'FTextBlockOverrideProperties::UseOpacity' has a wrong offset!");
static_assert(offsetof(FTextBlockOverrideProperties, Opacity) == 0x00001C, "Member 'FTextBlockOverrideProperties::Opacity' has a wrong offset!");
static_assert(offsetof(FTextBlockOverrideProperties, UseSize) == 0x000020, "Member 'FTextBlockOverrideProperties::UseSize' has a wrong offset!");
static_assert(offsetof(FTextBlockOverrideProperties, Size) == 0x000024, "Member 'FTextBlockOverrideProperties::Size' has a wrong offset!");

// ScriptStruct DBDUIViewsCore.TooltipWidgetData
// 0x0010 (0x0018 - 0x0008)
struct FTooltipWidgetData final : public FDBDTableRowBase
{
public:
	ETooltipType                                  TooltipType;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTooltipWidgetData) == 0x000008, "Wrong alignment on FTooltipWidgetData");
static_assert(sizeof(FTooltipWidgetData) == 0x000018, "Wrong size on FTooltipWidgetData");
static_assert(offsetof(FTooltipWidgetData, TooltipType) == 0x000008, "Member 'FTooltipWidgetData::TooltipType' has a wrong offset!");
static_assert(offsetof(FTooltipWidgetData, WidgetClass) == 0x000010, "Member 'FTooltipWidgetData::WidgetClass' has a wrong offset!");

}

