#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewsCore

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDInput_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "NewsAndMessagesCommon_structs.hpp"
#include "RemoteContentCache_structs.hpp"
#include "PreviewScene_structs.hpp"


namespace SDK::Params
{

// Function DBDUIViewsCore.CoreBaseUserWidget.OnControlModeChangedBP
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseUserWidget_OnControlModeChangedBP final
{
public:
	EControlMode                                  ControlMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_OnControlModeChangedBP) == 0x000001, "Wrong alignment on CoreBaseUserWidget_OnControlModeChangedBP");
static_assert(sizeof(CoreBaseUserWidget_OnControlModeChangedBP) == 0x000001, "Wrong size on CoreBaseUserWidget_OnControlModeChangedBP");
static_assert(offsetof(CoreBaseUserWidget_OnControlModeChangedBP, ControlMode) == 0x000000, "Member 'CoreBaseUserWidget_OnControlModeChangedBP::ControlMode' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.PlayAnimationByName
// 0x0020 (0x0020 - 0x0000)
struct CoreBaseUserWidget_PlayAnimationByName final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Starttime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Loopcount;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreBaseUserWidget_PlayAnimationByName) == 0x000004, "Wrong alignment on CoreBaseUserWidget_PlayAnimationByName");
static_assert(sizeof(CoreBaseUserWidget_PlayAnimationByName) == 0x000020, "Wrong size on CoreBaseUserWidget_PlayAnimationByName");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, AnimName) == 0x000000, "Member 'CoreBaseUserWidget_PlayAnimationByName::AnimName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, Starttime) == 0x00000C, "Member 'CoreBaseUserWidget_PlayAnimationByName::Starttime' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, Loopcount) == 0x000010, "Member 'CoreBaseUserWidget_PlayAnimationByName::Loopcount' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, PlayMode) == 0x000014, "Member 'CoreBaseUserWidget_PlayAnimationByName::PlayMode' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, PlaybackSpeed) == 0x000018, "Member 'CoreBaseUserWidget_PlayAnimationByName::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByName, ReturnValue) == 0x00001C, "Member 'CoreBaseUserWidget_PlayAnimationByName::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.PlayAnimationByNameWithFinishedDelegate
// 0x0038 (0x0038 - 0x0000)
struct CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             AnimationFinishedDelegate;                         // 0x000C(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Starttime;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Loopcount;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UWidgetAnimation*                 ReturnValue;                                       // 0x0030(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate) == 0x000008, "Wrong alignment on CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate");
static_assert(sizeof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate) == 0x000038, "Wrong size on CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, AnimName) == 0x000000, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::AnimName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, AnimationFinishedDelegate) == 0x00000C, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::AnimationFinishedDelegate' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, Starttime) == 0x000020, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::Starttime' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, Loopcount) == 0x000024, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::Loopcount' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, PlayMode) == 0x000028, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::PlayMode' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, PlaybackSpeed) == 0x00002C, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate, ReturnValue) == 0x000030, "Member 'CoreBaseUserWidget_PlayAnimationByNameWithFinishedDelegate::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.StopAnimationByName
// 0x0010 (0x0010 - 0x0000)
struct CoreBaseUserWidget_StopAnimationByName final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreBaseUserWidget_StopAnimationByName) == 0x000004, "Wrong alignment on CoreBaseUserWidget_StopAnimationByName");
static_assert(sizeof(CoreBaseUserWidget_StopAnimationByName) == 0x000010, "Wrong size on CoreBaseUserWidget_StopAnimationByName");
static_assert(offsetof(CoreBaseUserWidget_StopAnimationByName, AnimName) == 0x000000, "Member 'CoreBaseUserWidget_StopAnimationByName::AnimName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_StopAnimationByName, ReturnValue) == 0x00000C, "Member 'CoreBaseUserWidget_StopAnimationByName::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.UpdateScale
// 0x0004 (0x0004 - 0x0000)
struct CoreBaseUserWidget_UpdateScale final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_UpdateScale) == 0x000004, "Wrong alignment on CoreBaseUserWidget_UpdateScale");
static_assert(sizeof(CoreBaseUserWidget_UpdateScale) == 0x000004, "Wrong size on CoreBaseUserWidget_UpdateScale");
static_assert(offsetof(CoreBaseUserWidget_UpdateScale, Scale) == 0x000000, "Member 'CoreBaseUserWidget_UpdateScale::Scale' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseUserWidget.GetAnimationByName
// 0x0018 (0x0018 - 0x0000)
struct CoreBaseUserWidget_GetAnimationByName final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseUserWidget_GetAnimationByName) == 0x000008, "Wrong alignment on CoreBaseUserWidget_GetAnimationByName");
static_assert(sizeof(CoreBaseUserWidget_GetAnimationByName) == 0x000018, "Wrong size on CoreBaseUserWidget_GetAnimationByName");
static_assert(offsetof(CoreBaseUserWidget_GetAnimationByName, AnimName) == 0x000000, "Member 'CoreBaseUserWidget_GetAnimationByName::AnimName' has a wrong offset!");
static_assert(offsetof(CoreBaseUserWidget_GetAnimationByName, ReturnValue) == 0x000010, "Member 'CoreBaseUserWidget_GetAnimationByName::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.BaseFilterWidget.OnPlayerClick
// 0x0080 (0x0080 - 0x0000)
struct BaseFilterWidget_OnPlayerClick final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseFilterWidget_OnPlayerClick) == 0x000008, "Wrong alignment on BaseFilterWidget_OnPlayerClick");
static_assert(sizeof(BaseFilterWidget_OnPlayerClick) == 0x000080, "Wrong size on BaseFilterWidget_OnPlayerClick");
static_assert(offsetof(BaseFilterWidget_OnPlayerClick, PointerEvent) == 0x000000, "Member 'BaseFilterWidget_OnPlayerClick::PointerEvent' has a wrong offset!");

// Function DBDUIViewsCore.BaseFilterWidget.OnWidgetVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct BaseFilterWidget_OnWidgetVisibilityChanged final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseFilterWidget_OnWidgetVisibilityChanged) == 0x000001, "Wrong alignment on BaseFilterWidget_OnWidgetVisibilityChanged");
static_assert(sizeof(BaseFilterWidget_OnWidgetVisibilityChanged) == 0x000001, "Wrong size on BaseFilterWidget_OnWidgetVisibilityChanged");
static_assert(offsetof(BaseFilterWidget_OnWidgetVisibilityChanged, NewVisibility) == 0x000000, "Member 'BaseFilterWidget_OnWidgetVisibilityChanged::NewVisibility' has a wrong offset!");

// Function DBDUIViewsCore.CoreChallengeFilterWidget.OnClearFiltersClicked
// 0x0008 (0x0008 - 0x0000)
struct CoreChallengeFilterWidget_OnClearFiltersClicked final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreChallengeFilterWidget_OnClearFiltersClicked) == 0x000008, "Wrong alignment on CoreChallengeFilterWidget_OnClearFiltersClicked");
static_assert(sizeof(CoreChallengeFilterWidget_OnClearFiltersClicked) == 0x000008, "Wrong size on CoreChallengeFilterWidget_OnClearFiltersClicked");
static_assert(offsetof(CoreChallengeFilterWidget_OnClearFiltersClicked, buttonTarget) == 0x000000, "Member 'CoreChallengeFilterWidget_OnClearFiltersClicked::buttonTarget' has a wrong offset!");

// Function DBDUIViewsCore.CoreChallengeFilterWidget.OnSortingChanged
// 0x0004 (0x0004 - 0x0000)
struct CoreChallengeFilterWidget_OnSortingChanged final
{
public:
	ESortingOption                                Sorting;                                           // 0x0000(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESortingOrder                                 Order;                                             // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreChallengeFilterWidget_OnSortingChanged) == 0x000002, "Wrong alignment on CoreChallengeFilterWidget_OnSortingChanged");
static_assert(sizeof(CoreChallengeFilterWidget_OnSortingChanged) == 0x000004, "Wrong size on CoreChallengeFilterWidget_OnSortingChanged");
static_assert(offsetof(CoreChallengeFilterWidget_OnSortingChanged, Sorting) == 0x000000, "Member 'CoreChallengeFilterWidget_OnSortingChanged::Sorting' has a wrong offset!");
static_assert(offsetof(CoreChallengeFilterWidget_OnSortingChanged, Order) == 0x000002, "Member 'CoreChallengeFilterWidget_OnSortingChanged::Order' has a wrong offset!");

// Function DBDUIViewsCore.TooltipWidget.GetPriority
// 0x0001 (0x0001 - 0x0000)
struct TooltipWidget_GetPriority final
{
public:
	ETooltipPriority                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TooltipWidget_GetPriority) == 0x000001, "Wrong alignment on TooltipWidget_GetPriority");
static_assert(sizeof(TooltipWidget_GetPriority) == 0x000001, "Wrong size on TooltipWidget_GetPriority");
static_assert(offsetof(TooltipWidget_GetPriority, ReturnValue) == 0x000000, "Member 'TooltipWidget_GetPriority::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.ArchiveCompendiumTooltipWidget.SetTooltipData
// 0x0078 (0x0078 - 0x0000)
struct ArchiveCompendiumTooltipWidget_SetTooltipData final
{
public:
	struct FCompendiumButtonData                  TooltipViewData;                                   // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveCompendiumTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on ArchiveCompendiumTooltipWidget_SetTooltipData");
static_assert(sizeof(ArchiveCompendiumTooltipWidget_SetTooltipData) == 0x000078, "Wrong size on ArchiveCompendiumTooltipWidget_SetTooltipData");
static_assert(offsetof(ArchiveCompendiumTooltipWidget_SetTooltipData, TooltipViewData) == 0x000000, "Member 'ArchiveCompendiumTooltipWidget_SetTooltipData::TooltipViewData' has a wrong offset!");

// Function DBDUIViewsCore.ArchiveNodeTooltipWidget.SetNodeType
// 0x0001 (0x0001 - 0x0000)
struct ArchiveNodeTooltipWidget_SetNodeType final
{
public:
	EArchiveNodeType                              Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveNodeTooltipWidget_SetNodeType) == 0x000001, "Wrong alignment on ArchiveNodeTooltipWidget_SetNodeType");
static_assert(sizeof(ArchiveNodeTooltipWidget_SetNodeType) == 0x000001, "Wrong size on ArchiveNodeTooltipWidget_SetNodeType");
static_assert(offsetof(ArchiveNodeTooltipWidget_SetNodeType, Type) == 0x000000, "Member 'ArchiveNodeTooltipWidget_SetNodeType::Type' has a wrong offset!");

// Function DBDUIViewsCore.ArchiveNodeTooltipWidget.SetTooltipData
// 0x00B8 (0x00B8 - 0x0000)
struct ArchiveNodeTooltipWidget_SetTooltipData final
{
public:
	struct FArchiveNodeViewData                   NodeViewData;                                      // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveNodeTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on ArchiveNodeTooltipWidget_SetTooltipData");
static_assert(sizeof(ArchiveNodeTooltipWidget_SetTooltipData) == 0x0000B8, "Wrong size on ArchiveNodeTooltipWidget_SetTooltipData");
static_assert(offsetof(ArchiveNodeTooltipWidget_SetTooltipData, NodeViewData) == 0x000000, "Member 'ArchiveNodeTooltipWidget_SetTooltipData::NodeViewData' has a wrong offset!");

// Function DBDUIViewsCore.ArchivePassTooltipWidget.SetTooltipData
// 0x0098 (0x0098 - 0x0000)
struct ArchivePassTooltipWidget_SetTooltipData final
{
public:
	struct FArchivePassTooltipViewData            Data;                                              // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchivePassTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on ArchivePassTooltipWidget_SetTooltipData");
static_assert(sizeof(ArchivePassTooltipWidget_SetTooltipData) == 0x000098, "Wrong size on ArchivePassTooltipWidget_SetTooltipData");
static_assert(offsetof(ArchivePassTooltipWidget_SetTooltipData, Data) == 0x000000, "Member 'ArchivePassTooltipWidget_SetTooltipData::Data' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBox.SetAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct AspectRatioBox_SetAspectRatio final
{
public:
	float                                         InAspectRatio;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBox_SetAspectRatio) == 0x000004, "Wrong alignment on AspectRatioBox_SetAspectRatio");
static_assert(sizeof(AspectRatioBox_SetAspectRatio) == 0x000004, "Wrong size on AspectRatioBox_SetAspectRatio");
static_assert(offsetof(AspectRatioBox_SetAspectRatio, InAspectRatio) == 0x000000, "Member 'AspectRatioBox_SetAspectRatio::InAspectRatio' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBoxSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AspectRatioBoxSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBoxSlot_SetHorizontalAlignment) == 0x000001, "Wrong alignment on AspectRatioBoxSlot_SetHorizontalAlignment");
static_assert(sizeof(AspectRatioBoxSlot_SetHorizontalAlignment) == 0x000001, "Wrong size on AspectRatioBoxSlot_SetHorizontalAlignment");
static_assert(offsetof(AspectRatioBoxSlot_SetHorizontalAlignment, InHorizontalAlignment) == 0x000000, "Member 'AspectRatioBoxSlot_SetHorizontalAlignment::InHorizontalAlignment' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBoxSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct AspectRatioBoxSlot_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBoxSlot_SetPadding) == 0x000004, "Wrong alignment on AspectRatioBoxSlot_SetPadding");
static_assert(sizeof(AspectRatioBoxSlot_SetPadding) == 0x000010, "Wrong size on AspectRatioBoxSlot_SetPadding");
static_assert(offsetof(AspectRatioBoxSlot_SetPadding, InPadding) == 0x000000, "Member 'AspectRatioBoxSlot_SetPadding::InPadding' has a wrong offset!");

// Function DBDUIViewsCore.AspectRatioBoxSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AspectRatioBoxSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AspectRatioBoxSlot_SetVerticalAlignment) == 0x000001, "Wrong alignment on AspectRatioBoxSlot_SetVerticalAlignment");
static_assert(sizeof(AspectRatioBoxSlot_SetVerticalAlignment) == 0x000001, "Wrong size on AspectRatioBoxSlot_SetVerticalAlignment");
static_assert(offsetof(AspectRatioBoxSlot_SetVerticalAlignment, InVerticalAlignment) == 0x000000, "Member 'AspectRatioBoxSlot_SetVerticalAlignment::InVerticalAlignment' has a wrong offset!");

// Function DBDUIViewsCore.CoreTabContentWidget.StopFadeInTweening
// 0x0004 (0x0004 - 0x0000)
struct CoreTabContentWidget_StopFadeInTweening final
{
public:
	float                                         OpacityValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreTabContentWidget_StopFadeInTweening) == 0x000004, "Wrong alignment on CoreTabContentWidget_StopFadeInTweening");
static_assert(sizeof(CoreTabContentWidget_StopFadeInTweening) == 0x000004, "Wrong size on CoreTabContentWidget_StopFadeInTweening");
static_assert(offsetof(CoreTabContentWidget_StopFadeInTweening, OpacityValue) == 0x000000, "Member 'CoreTabContentWidget_StopFadeInTweening::OpacityValue' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuChallengeSetWidget.OnChallengeSetTabSelected
// 0x0008 (0x0008 - 0x0000)
struct ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected final
{
public:
	class UCoreSelectableButtonWidget*            SelectedButton;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected) == 0x000008, "Wrong alignment on ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected");
static_assert(sizeof(ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected) == 0x000008, "Wrong size on ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected");
static_assert(offsetof(ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected, SelectedButton) == 0x000000, "Member 'ChallengesMenuChallengeSetWidget_OnChallengeSetTabSelected::SelectedButton' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuChallengeSetWidget.GetSkinData
// 0x0078 (0x0078 - 0x0000)
struct ChallengesMenuChallengeSetWidget_GetSkinData final
{
public:
	struct FChallengeSkinUIData                   ReturnValue;                                       // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuChallengeSetWidget_GetSkinData) == 0x000008, "Wrong alignment on ChallengesMenuChallengeSetWidget_GetSkinData");
static_assert(sizeof(ChallengesMenuChallengeSetWidget_GetSkinData) == 0x000078, "Wrong size on ChallengesMenuChallengeSetWidget_GetSkinData");
static_assert(offsetof(ChallengesMenuChallengeSetWidget_GetSkinData, ReturnValue) == 0x000000, "Member 'ChallengesMenuChallengeSetWidget_GetSkinData::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRewardTrackTierItem.OnRewardClicked
// 0x0008 (0x0008 - 0x0000)
struct ChallengesMenuRewardTrackTierItem_OnRewardClicked final
{
public:
	class UCoreButtonWidget*                      Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRewardTrackTierItem_OnRewardClicked) == 0x000008, "Wrong alignment on ChallengesMenuRewardTrackTierItem_OnRewardClicked");
static_assert(sizeof(ChallengesMenuRewardTrackTierItem_OnRewardClicked) == 0x000008, "Wrong size on ChallengesMenuRewardTrackTierItem_OnRewardClicked");
static_assert(offsetof(ChallengesMenuRewardTrackTierItem_OnRewardClicked, Button) == 0x000000, "Member 'ChallengesMenuRewardTrackTierItem_OnRewardClicked::Button' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRewardTrackTierItem.SetGenericData
// 0x0028 (0x0028 - 0x0000)
struct ChallengesMenuRewardTrackTierItem_SetGenericData final
{
public:
	struct FChallengeSetRewardTrackTierInfoViewData Data;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRewardTrackTierItem_SetGenericData) == 0x000008, "Wrong alignment on ChallengesMenuRewardTrackTierItem_SetGenericData");
static_assert(sizeof(ChallengesMenuRewardTrackTierItem_SetGenericData) == 0x000028, "Wrong size on ChallengesMenuRewardTrackTierItem_SetGenericData");
static_assert(offsetof(ChallengesMenuRewardTrackTierItem_SetGenericData, Data) == 0x000000, "Member 'ChallengesMenuRewardTrackTierItem_SetGenericData::Data' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRewardTrackTierItem.SetLockedState
// 0x0001 (0x0001 - 0x0000)
struct ChallengesMenuRewardTrackTierItem_SetLockedState final
{
public:
	bool                                          IsLocked;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRewardTrackTierItem_SetLockedState) == 0x000001, "Wrong alignment on ChallengesMenuRewardTrackTierItem_SetLockedState");
static_assert(sizeof(ChallengesMenuRewardTrackTierItem_SetLockedState) == 0x000001, "Wrong size on ChallengesMenuRewardTrackTierItem_SetLockedState");
static_assert(offsetof(ChallengesMenuRewardTrackTierItem_SetLockedState, IsLocked) == 0x000000, "Member 'ChallengesMenuRewardTrackTierItem_SetLockedState::IsLocked' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRewardTrackWidget.DisplayPage
// 0x0008 (0x0008 - 0x0000)
struct ChallengesMenuRewardTrackWidget_DisplayPage final
{
public:
	class UUITweenInstance*                       Tween;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRewardTrackWidget_DisplayPage) == 0x000008, "Wrong alignment on ChallengesMenuRewardTrackWidget_DisplayPage");
static_assert(sizeof(ChallengesMenuRewardTrackWidget_DisplayPage) == 0x000008, "Wrong size on ChallengesMenuRewardTrackWidget_DisplayPage");
static_assert(offsetof(ChallengesMenuRewardTrackWidget_DisplayPage, Tween) == 0x000000, "Member 'ChallengesMenuRewardTrackWidget_DisplayPage::Tween' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRewardTrackWidget.OnRewardItemClicked
// 0x0018 (0x0018 - 0x0000)
struct ChallengesMenuRewardTrackWidget_OnRewardItemClicked final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreButtonWidget*                      Button;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChallengesMenuRewardTrackWidget_OnRewardItemClicked) == 0x000008, "Wrong alignment on ChallengesMenuRewardTrackWidget_OnRewardItemClicked");
static_assert(sizeof(ChallengesMenuRewardTrackWidget_OnRewardItemClicked) == 0x000018, "Wrong size on ChallengesMenuRewardTrackWidget_OnRewardItemClicked");
static_assert(offsetof(ChallengesMenuRewardTrackWidget_OnRewardItemClicked, Tier) == 0x000000, "Member 'ChallengesMenuRewardTrackWidget_OnRewardItemClicked::Tier' has a wrong offset!");
static_assert(offsetof(ChallengesMenuRewardTrackWidget_OnRewardItemClicked, Button) == 0x000008, "Member 'ChallengesMenuRewardTrackWidget_OnRewardItemClicked::Button' has a wrong offset!");
static_assert(offsetof(ChallengesMenuRewardTrackWidget_OnRewardItemClicked, Param_Index) == 0x000010, "Member 'ChallengesMenuRewardTrackWidget_OnRewardItemClicked::Param_Index' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRitualsWidget.OnButtonSelectedChanged
// 0x0010 (0x0010 - 0x0000)
struct ChallengesMenuRitualsWidget_OnButtonSelectedChanged final
{
public:
	class UCoreSelectableButtonWidget*            TargetButton;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSelected;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChallengesMenuRitualsWidget_OnButtonSelectedChanged) == 0x000008, "Wrong alignment on ChallengesMenuRitualsWidget_OnButtonSelectedChanged");
static_assert(sizeof(ChallengesMenuRitualsWidget_OnButtonSelectedChanged) == 0x000010, "Wrong size on ChallengesMenuRitualsWidget_OnButtonSelectedChanged");
static_assert(offsetof(ChallengesMenuRitualsWidget_OnButtonSelectedChanged, TargetButton) == 0x000000, "Member 'ChallengesMenuRitualsWidget_OnButtonSelectedChanged::TargetButton' has a wrong offset!");
static_assert(offsetof(ChallengesMenuRitualsWidget_OnButtonSelectedChanged, IsSelected) == 0x000008, "Member 'ChallengesMenuRitualsWidget_OnButtonSelectedChanged::IsSelected' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuRitualsWidget.OnFiltersButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct ChallengesMenuRitualsWidget_OnFiltersButtonClicked final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuRitualsWidget_OnFiltersButtonClicked) == 0x000008, "Wrong alignment on ChallengesMenuRitualsWidget_OnFiltersButtonClicked");
static_assert(sizeof(ChallengesMenuRitualsWidget_OnFiltersButtonClicked) == 0x000008, "Wrong size on ChallengesMenuRitualsWidget_OnFiltersButtonClicked");
static_assert(offsetof(ChallengesMenuRitualsWidget_OnFiltersButtonClicked, buttonTarget) == 0x000000, "Member 'ChallengesMenuRitualsWidget_OnFiltersButtonClicked::buttonTarget' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuStoreWidget.OnCustomizationGridItemClicked
// 0x0004 (0x0004 - 0x0000)
struct ChallengesMenuStoreWidget_OnCustomizationGridItemClicked final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuStoreWidget_OnCustomizationGridItemClicked) == 0x000004, "Wrong alignment on ChallengesMenuStoreWidget_OnCustomizationGridItemClicked");
static_assert(sizeof(ChallengesMenuStoreWidget_OnCustomizationGridItemClicked) == 0x000004, "Wrong size on ChallengesMenuStoreWidget_OnCustomizationGridItemClicked");
static_assert(offsetof(ChallengesMenuStoreWidget_OnCustomizationGridItemClicked, SelectedIndex) == 0x000000, "Member 'ChallengesMenuStoreWidget_OnCustomizationGridItemClicked::SelectedIndex' has a wrong offset!");

// Function DBDUIViewsCore.ChallengesMenuStoreWidget.OnPreviewAreaItemClicked
// 0x0004 (0x0004 - 0x0000)
struct ChallengesMenuStoreWidget_OnPreviewAreaItemClicked final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengesMenuStoreWidget_OnPreviewAreaItemClicked) == 0x000004, "Wrong alignment on ChallengesMenuStoreWidget_OnPreviewAreaItemClicked");
static_assert(sizeof(ChallengesMenuStoreWidget_OnPreviewAreaItemClicked) == 0x000004, "Wrong size on ChallengesMenuStoreWidget_OnPreviewAreaItemClicked");
static_assert(offsetof(ChallengesMenuStoreWidget_OnPreviewAreaItemClicked, SelectedIndex) == 0x000000, "Member 'ChallengesMenuStoreWidget_OnPreviewAreaItemClicked::SelectedIndex' has a wrong offset!");

// Function DBDUIViewsCore.ReportFeedbackInfoWidget.SetData
// 0x0040 (0x0040 - 0x0000)
struct ReportFeedbackInfoWidget_SetData final
{
public:
	struct FReportFeedbackData                    ReportData;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ReportFeedbackInfoWidget_SetData) == 0x000008, "Wrong alignment on ReportFeedbackInfoWidget_SetData");
static_assert(sizeof(ReportFeedbackInfoWidget_SetData) == 0x000040, "Wrong size on ReportFeedbackInfoWidget_SetData");
static_assert(offsetof(ReportFeedbackInfoWidget_SetData, ReportData) == 0x000000, "Member 'ReportFeedbackInfoWidget_SetData::ReportData' has a wrong offset!");

// Function DBDUIViewsCore.CharacterTooltipWidget.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct CharacterTooltipWidget_SetLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTooltipWidget_SetLevel) == 0x000004, "Wrong alignment on CharacterTooltipWidget_SetLevel");
static_assert(sizeof(CharacterTooltipWidget_SetLevel) == 0x000004, "Wrong size on CharacterTooltipWidget_SetLevel");
static_assert(offsetof(CharacterTooltipWidget_SetLevel, Level) == 0x000000, "Member 'CharacterTooltipWidget_SetLevel::Level' has a wrong offset!");

// Function DBDUIViewsCore.CharacterTooltipWidget.SetLockDetails
// 0x0088 (0x0088 - 0x0000)
struct CharacterTooltipWidget_SetLockDetails final
{
public:
	struct FCharacterTooltipViewData              CharacterViewData;                                 // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTooltipWidget_SetLockDetails) == 0x000008, "Wrong alignment on CharacterTooltipWidget_SetLockDetails");
static_assert(sizeof(CharacterTooltipWidget_SetLockDetails) == 0x000088, "Wrong size on CharacterTooltipWidget_SetLockDetails");
static_assert(offsetof(CharacterTooltipWidget_SetLockDetails, CharacterViewData) == 0x000000, "Member 'CharacterTooltipWidget_SetLockDetails::CharacterViewData' has a wrong offset!");

// Function DBDUIViewsCore.CharacterTooltipWidget.SetTooltipData
// 0x0088 (0x0088 - 0x0000)
struct CharacterTooltipWidget_SetTooltipData final
{
public:
	struct FCharacterTooltipViewData              CharacterViewData;                                 // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTooltipWidget_SetTooltipData) == 0x000008, "Wrong alignment on CharacterTooltipWidget_SetTooltipData");
static_assert(sizeof(CharacterTooltipWidget_SetTooltipData) == 0x000088, "Wrong size on CharacterTooltipWidget_SetTooltipData");
static_assert(offsetof(CharacterTooltipWidget_SetTooltipData, CharacterViewData) == 0x000000, "Member 'CharacterTooltipWidget_SetTooltipData::CharacterViewData' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseHudWidget.ShouldPlayFocusAnimation
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseHudWidget_ShouldPlayFocusAnimation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseHudWidget_ShouldPlayFocusAnimation) == 0x000001, "Wrong alignment on CoreBaseHudWidget_ShouldPlayFocusAnimation");
static_assert(sizeof(CoreBaseHudWidget_ShouldPlayFocusAnimation) == 0x000001, "Wrong size on CoreBaseHudWidget_ShouldPlayFocusAnimation");
static_assert(offsetof(CoreBaseHudWidget_ShouldPlayFocusAnimation, ReturnValue) == 0x000000, "Member 'CoreBaseHudWidget_ShouldPlayFocusAnimation::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetActiveState
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetActiveState final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetActiveState) == 0x000001, "Wrong alignment on CoreBaseLoadoutPartWidget_SetActiveState");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetActiveState) == 0x000001, "Wrong size on CoreBaseLoadoutPartWidget_SetActiveState");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetActiveState, IsActive) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetActiveState::IsActive' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutPartIcon
// 0x0038 (0x0038 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetLoadoutPartIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0038)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetLoadoutPartIcon) == 0x000008, "Wrong alignment on CoreBaseLoadoutPartWidget_SetLoadoutPartIcon");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetLoadoutPartIcon) == 0x000038, "Wrong size on CoreBaseLoadoutPartWidget_SetLoadoutPartIcon");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetLoadoutPartIcon, Icon) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetLoadoutPartIcon::Icon' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutPartRarity
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetLoadoutPartRarity final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetLoadoutPartRarity) == 0x000001, "Wrong alignment on CoreBaseLoadoutPartWidget_SetLoadoutPartRarity");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetLoadoutPartRarity) == 0x000001, "Wrong size on CoreBaseLoadoutPartWidget_SetLoadoutPartRarity");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetLoadoutPartRarity, Rarity) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetLoadoutPartRarity::Rarity' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetLoadoutStackCount
// 0x0004 (0x0004 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetLoadoutStackCount final
{
public:
	int32                                         StackCount;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetLoadoutStackCount) == 0x000004, "Wrong alignment on CoreBaseLoadoutPartWidget_SetLoadoutStackCount");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetLoadoutStackCount) == 0x000004, "Wrong size on CoreBaseLoadoutPartWidget_SetLoadoutStackCount");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetLoadoutStackCount, StackCount) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetLoadoutStackCount::StackCount' has a wrong offset!");

// Function DBDUIViewsCore.CoreBaseLoadoutPartWidget.SetStatusEffect
// 0x0001 (0x0001 - 0x0000)
struct CoreBaseLoadoutPartWidget_SetStatusEffect final
{
public:
	EStatusEffectType                             StatusEffectType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreBaseLoadoutPartWidget_SetStatusEffect) == 0x000001, "Wrong alignment on CoreBaseLoadoutPartWidget_SetStatusEffect");
static_assert(sizeof(CoreBaseLoadoutPartWidget_SetStatusEffect) == 0x000001, "Wrong size on CoreBaseLoadoutPartWidget_SetStatusEffect");
static_assert(offsetof(CoreBaseLoadoutPartWidget_SetStatusEffect, StatusEffectType) == 0x000000, "Member 'CoreBaseLoadoutPartWidget_SetStatusEffect::StatusEffectType' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.AddElementsToSequence
// 0x0060 (0x0060 - 0x0000)
struct CoreAlertsWidget_AddElementsToSequence final
{
public:
	struct FAlertsViewData                        AlertsViewData;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_AddElementsToSequence) == 0x000008, "Wrong alignment on CoreAlertsWidget_AddElementsToSequence");
static_assert(sizeof(CoreAlertsWidget_AddElementsToSequence) == 0x000060, "Wrong size on CoreAlertsWidget_AddElementsToSequence");
static_assert(offsetof(CoreAlertsWidget_AddElementsToSequence, AlertsViewData) == 0x000000, "Member 'CoreAlertsWidget_AddElementsToSequence::AlertsViewData' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.HideRewardTooltip
// 0x0008 (0x0008 - 0x0000)
struct CoreAlertsWidget_HideRewardTooltip final
{
public:
	class UCoreButtonWidget*                      RewardWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_HideRewardTooltip) == 0x000008, "Wrong alignment on CoreAlertsWidget_HideRewardTooltip");
static_assert(sizeof(CoreAlertsWidget_HideRewardTooltip) == 0x000008, "Wrong size on CoreAlertsWidget_HideRewardTooltip");
static_assert(offsetof(CoreAlertsWidget_HideRewardTooltip, RewardWidget) == 0x000000, "Member 'CoreAlertsWidget_HideRewardTooltip::RewardWidget' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.PlayDisplayRewardSound
// 0x0528 (0x0528 - 0x0000)
struct CoreAlertsWidget_PlayDisplayRewardSound final
{
public:
	struct FRewardWrapperViewData                 RewardData;                                        // 0x0000(0x0528)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_PlayDisplayRewardSound) == 0x000008, "Wrong alignment on CoreAlertsWidget_PlayDisplayRewardSound");
static_assert(sizeof(CoreAlertsWidget_PlayDisplayRewardSound) == 0x000528, "Wrong size on CoreAlertsWidget_PlayDisplayRewardSound");
static_assert(offsetof(CoreAlertsWidget_PlayDisplayRewardSound, RewardData) == 0x000000, "Member 'CoreAlertsWidget_PlayDisplayRewardSound::RewardData' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.PlayNextChallengesCompletedSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation final
{
public:
	TArray<struct FChallengeViewData>             ChallengesCompleted;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation) == 0x000008, "Wrong alignment on CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation");
static_assert(sizeof(CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation) == 0x000010, "Wrong size on CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation");
static_assert(offsetof(CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation, ChallengesCompleted) == 0x000000, "Member 'CoreAlertsWidget_PlayNextChallengesCompletedSequenceAnimation::ChallengesCompleted' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.PlayNextChallengesRewardsSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation final
{
public:
	TArray<struct FRewardWrapperViewData>         ChallengesRewards;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation) == 0x000008, "Wrong alignment on CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation");
static_assert(sizeof(CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation) == 0x000010, "Wrong size on CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation");
static_assert(offsetof(CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation, ChallengesRewards) == 0x000000, "Member 'CoreAlertsWidget_PlayNextChallengesRewardsSequenceAnimation::ChallengesRewards' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.PlayNextChallengesTrackersSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation final
{
public:
	TArray<struct FChallengeTrackerViewData>      ChallengesTrackers;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation) == 0x000008, "Wrong alignment on CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation");
static_assert(sizeof(CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation) == 0x000010, "Wrong size on CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation");
static_assert(offsetof(CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation, ChallengesTrackers) == 0x000000, "Member 'CoreAlertsWidget_PlayNextChallengesTrackersSequenceAnimation::ChallengesTrackers' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.PlayNextRewardsSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct CoreAlertsWidget_PlayNextRewardsSequenceAnimation final
{
public:
	TArray<struct FRewardWrapperViewData>         AlertRewards;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_PlayNextRewardsSequenceAnimation) == 0x000008, "Wrong alignment on CoreAlertsWidget_PlayNextRewardsSequenceAnimation");
static_assert(sizeof(CoreAlertsWidget_PlayNextRewardsSequenceAnimation) == 0x000010, "Wrong size on CoreAlertsWidget_PlayNextRewardsSequenceAnimation");
static_assert(offsetof(CoreAlertsWidget_PlayNextRewardsSequenceAnimation, AlertRewards) == 0x000000, "Member 'CoreAlertsWidget_PlayNextRewardsSequenceAnimation::AlertRewards' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.PlaySoundEffect
// 0x0008 (0x0008 - 0x0000)
struct CoreAlertsWidget_PlaySoundEffect final
{
public:
	class UAkAudioEvent*                          SoundFx;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_PlaySoundEffect) == 0x000008, "Wrong alignment on CoreAlertsWidget_PlaySoundEffect");
static_assert(sizeof(CoreAlertsWidget_PlaySoundEffect) == 0x000008, "Wrong size on CoreAlertsWidget_PlaySoundEffect");
static_assert(offsetof(CoreAlertsWidget_PlaySoundEffect, SoundFx) == 0x000000, "Member 'CoreAlertsWidget_PlaySoundEffect::SoundFx' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.ShowRewardTooltip
// 0x0008 (0x0008 - 0x0000)
struct CoreAlertsWidget_ShowRewardTooltip final
{
public:
	class UCoreButtonWidget*                      RewardWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_ShowRewardTooltip) == 0x000008, "Wrong alignment on CoreAlertsWidget_ShowRewardTooltip");
static_assert(sizeof(CoreAlertsWidget_ShowRewardTooltip) == 0x000008, "Wrong size on CoreAlertsWidget_ShowRewardTooltip");
static_assert(offsetof(CoreAlertsWidget_ShowRewardTooltip, RewardWidget) == 0x000000, "Member 'CoreAlertsWidget_ShowRewardTooltip::RewardWidget' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.GetDisplayRewardSound
// 0x0530 (0x0530 - 0x0000)
struct CoreAlertsWidget_GetDisplayRewardSound final
{
public:
	struct FRewardWrapperViewData                 RewardData;                                        // 0x0000(0x0528)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          ReturnValue;                                       // 0x0528(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreAlertsWidget_GetDisplayRewardSound) == 0x000008, "Wrong alignment on CoreAlertsWidget_GetDisplayRewardSound");
static_assert(sizeof(CoreAlertsWidget_GetDisplayRewardSound) == 0x000530, "Wrong size on CoreAlertsWidget_GetDisplayRewardSound");
static_assert(offsetof(CoreAlertsWidget_GetDisplayRewardSound, RewardData) == 0x000000, "Member 'CoreAlertsWidget_GetDisplayRewardSound::RewardData' has a wrong offset!");
static_assert(offsetof(CoreAlertsWidget_GetDisplayRewardSound, ReturnValue) == 0x000528, "Member 'CoreAlertsWidget_GetDisplayRewardSound::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.IsChallengeCompleted
// 0x0650 (0x0650 - 0x0000)
struct CoreAlertsWidget_IsChallengeCompleted final
{
public:
	struct FChallengeViewData                     Challenge;                                         // 0x0000(0x0648)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0648(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreAlertsWidget_IsChallengeCompleted) == 0x000008, "Wrong alignment on CoreAlertsWidget_IsChallengeCompleted");
static_assert(sizeof(CoreAlertsWidget_IsChallengeCompleted) == 0x000650, "Wrong size on CoreAlertsWidget_IsChallengeCompleted");
static_assert(offsetof(CoreAlertsWidget_IsChallengeCompleted, Challenge) == 0x000000, "Member 'CoreAlertsWidget_IsChallengeCompleted::Challenge' has a wrong offset!");
static_assert(offsetof(CoreAlertsWidget_IsChallengeCompleted, ReturnValue) == 0x000648, "Member 'CoreAlertsWidget_IsChallengeCompleted::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreAlertsWidget.IsChallengeTrackerCompleted
// 0x0058 (0x0058 - 0x0000)
struct CoreAlertsWidget_IsChallengeTrackerCompleted final
{
public:
	struct FChallengeTrackerViewData              Challenge;                                         // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreAlertsWidget_IsChallengeTrackerCompleted) == 0x000008, "Wrong alignment on CoreAlertsWidget_IsChallengeTrackerCompleted");
static_assert(sizeof(CoreAlertsWidget_IsChallengeTrackerCompleted) == 0x000058, "Wrong size on CoreAlertsWidget_IsChallengeTrackerCompleted");
static_assert(offsetof(CoreAlertsWidget_IsChallengeTrackerCompleted, Challenge) == 0x000000, "Member 'CoreAlertsWidget_IsChallengeTrackerCompleted::Challenge' has a wrong offset!");
static_assert(offsetof(CoreAlertsWidget_IsChallengeTrackerCompleted, ReturnValue) == 0x000050, "Member 'CoreAlertsWidget_IsChallengeTrackerCompleted::ReturnValue' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_OnAlignmentChanged final
{
public:
	ETextJustify                                  NewAlignment;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_OnAlignmentChanged) == 0x000001, "Wrong alignment on CoreButtonWidget_OnAlignmentChanged");
static_assert(sizeof(CoreButtonWidget_OnAlignmentChanged) == 0x000001, "Wrong size on CoreButtonWidget_OnAlignmentChanged");
static_assert(offsetof(CoreButtonWidget_OnAlignmentChanged, NewAlignment) == 0x000000, "Member 'CoreButtonWidget_OnAlignmentChanged::NewAlignment' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.OnButtonVisibilityChanged
// 0x0002 (0x0002 - 0x0000)
struct CoreButtonWidget_OnButtonVisibilityChanged final
{
public:
	EButtonWidgetVisibility                       PreviousVisibility;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonWidgetVisibility                       NewVisibility;                                     // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_OnButtonVisibilityChanged) == 0x000001, "Wrong alignment on CoreButtonWidget_OnButtonVisibilityChanged");
static_assert(sizeof(CoreButtonWidget_OnButtonVisibilityChanged) == 0x000002, "Wrong size on CoreButtonWidget_OnButtonVisibilityChanged");
static_assert(offsetof(CoreButtonWidget_OnButtonVisibilityChanged, PreviousVisibility) == 0x000000, "Member 'CoreButtonWidget_OnButtonVisibilityChanged::PreviousVisibility' has a wrong offset!");
static_assert(offsetof(CoreButtonWidget_OnButtonVisibilityChanged, NewVisibility) == 0x000001, "Member 'CoreButtonWidget_OnButtonVisibilityChanged::NewVisibility' has a wrong offset!");

// DelegateFunction DBDUIViewsCore.CoreButtonWidget.OnButtonVisibilityChangedDelegate__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature final
{
public:
	EButtonWidgetVisibility                       PreviousVisibility;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonWidgetVisibility                       NewVisibility;                                     // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature) == 0x000001, "Wrong alignment on CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature");
static_assert(sizeof(CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature) == 0x000002, "Wrong size on CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature");
static_assert(offsetof(CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature, PreviousVisibility) == 0x000000, "Member 'CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature::PreviousVisibility' has a wrong offset!");
static_assert(offsetof(CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature, NewVisibility) == 0x000001, "Member 'CoreButtonWidget_OnButtonVisibilityChangedDelegate__DelegateSignature::NewVisibility' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.OnChargingTick
// 0x0004 (0x0004 - 0x0000)
struct CoreButtonWidget_OnChargingTick final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreButtonWidget_OnChargingTick) == 0x000004, "Wrong alignment on CoreButtonWidget_OnChargingTick");
static_assert(sizeof(CoreButtonWidget_OnChargingTick) == 0x000004, "Wrong size on CoreButtonWidget_OnChargingTick");
static_assert(offsetof(CoreButtonWidget_OnChargingTick, Progress) == 0x000000, "Member 'CoreButtonWidget_OnChargingTick::Progress' has a wrong offset!");

// Function DBDUIViewsCore.CoreButtonWidget.OnClickableChanged
// 0x0001 (0x0001 - 0x0000)
struct CoreButtonWidget_OnClickableChanged final
{
public:
