#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewInterfaces

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function DBDUIViewInterfaces.AddonViewInterface.SetData
// 0x0070 (0x0070 - 0x0000)
struct AddonViewInterface_SetData final
{
public:
	struct FAddonViewData                         BaseLoadoutPartViewData;                           // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AddonViewInterface_SetData) == 0x000008, "Wrong alignment on AddonViewInterface_SetData");
static_assert(sizeof(AddonViewInterface_SetData) == 0x000070, "Wrong size on AddonViewInterface_SetData");
static_assert(offsetof(AddonViewInterface_SetData, BaseLoadoutPartViewData) == 0x000000, "Member 'AddonViewInterface_SetData::BaseLoadoutPartViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.StoreCharactersSelectionViewInterface.SetData
// 0x0018 (0x0018 - 0x0000)
struct StoreCharactersSelectionViewInterface_SetData final
{
public:
	struct FStoreCharactersSelectionViewData      Data;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(StoreCharactersSelectionViewInterface_SetData) == 0x000008, "Wrong alignment on StoreCharactersSelectionViewInterface_SetData");
static_assert(sizeof(StoreCharactersSelectionViewInterface_SetData) == 0x000018, "Wrong size on StoreCharactersSelectionViewInterface_SetData");
static_assert(offsetof(StoreCharactersSelectionViewInterface_SetData, Data) == 0x000000, "Member 'StoreCharactersSelectionViewInterface_SetData::Data' has a wrong offset!");

// Function DBDUIViewInterfaces.StoreCharactersSelectionViewInterface.SetKillerPower
// 0x0008 (0x0008 - 0x0000)
struct StoreCharactersSelectionViewInterface_SetKillerPower final
{
public:
	class UMenuPowerViewData*                     KillerPowerViewData;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StoreCharactersSelectionViewInterface_SetKillerPower) == 0x000008, "Wrong alignment on StoreCharactersSelectionViewInterface_SetKillerPower");
static_assert(sizeof(StoreCharactersSelectionViewInterface_SetKillerPower) == 0x000008, "Wrong size on StoreCharactersSelectionViewInterface_SetKillerPower");
static_assert(offsetof(StoreCharactersSelectionViewInterface_SetKillerPower, KillerPowerViewData) == 0x000000, "Member 'StoreCharactersSelectionViewInterface_SetKillerPower::KillerPowerViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.StoreCharactersSelectionViewInterface.SetPerksData
// 0x0018 (0x0018 - 0x0000)
struct StoreCharactersSelectionViewInterface_SetPerksData final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMenuPerkViewData*>              Perks;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(StoreCharactersSelectionViewInterface_SetPerksData) == 0x000008, "Wrong alignment on StoreCharactersSelectionViewInterface_SetPerksData");
static_assert(sizeof(StoreCharactersSelectionViewInterface_SetPerksData) == 0x000018, "Wrong size on StoreCharactersSelectionViewInterface_SetPerksData");
static_assert(offsetof(StoreCharactersSelectionViewInterface_SetPerksData, Role) == 0x000000, "Member 'StoreCharactersSelectionViewInterface_SetPerksData::Role' has a wrong offset!");
static_assert(offsetof(StoreCharactersSelectionViewInterface_SetPerksData, Perks) == 0x000008, "Member 'StoreCharactersSelectionViewInterface_SetPerksData::Perks' has a wrong offset!");

// Function DBDUIViewInterfaces.StoreCharactersSelectionViewInterface.UpdateSelectedCharacter
// 0x0008 (0x0008 - 0x0000)
struct StoreCharactersSelectionViewInterface_UpdateSelectedCharacter final
{
public:
	int32                                         SelectedCharacterIndex;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ScrollToSelection;                                 // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(StoreCharactersSelectionViewInterface_UpdateSelectedCharacter) == 0x000004, "Wrong alignment on StoreCharactersSelectionViewInterface_UpdateSelectedCharacter");
static_assert(sizeof(StoreCharactersSelectionViewInterface_UpdateSelectedCharacter) == 0x000008, "Wrong size on StoreCharactersSelectionViewInterface_UpdateSelectedCharacter");
static_assert(offsetof(StoreCharactersSelectionViewInterface_UpdateSelectedCharacter, SelectedCharacterIndex) == 0x000000, "Member 'StoreCharactersSelectionViewInterface_UpdateSelectedCharacter::SelectedCharacterIndex' has a wrong offset!");
static_assert(offsetof(StoreCharactersSelectionViewInterface_UpdateSelectedCharacter, ScrollToSelection) == 0x000004, "Member 'StoreCharactersSelectionViewInterface_UpdateSelectedCharacter::ScrollToSelection' has a wrong offset!");

// Function DBDUIViewInterfaces.StoreCharactersSelectionViewInterface.GetSearchBarViewInterface
// 0x0010 (0x0010 - 0x0000)
struct StoreCharactersSelectionViewInterface_GetSearchBarViewInterface final
{
public:
	TScriptInterface<class ISearchBarViewInterface> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StoreCharactersSelectionViewInterface_GetSearchBarViewInterface) == 0x000008, "Wrong alignment on StoreCharactersSelectionViewInterface_GetSearchBarViewInterface");
static_assert(sizeof(StoreCharactersSelectionViewInterface_GetSearchBarViewInterface) == 0x000010, "Wrong size on StoreCharactersSelectionViewInterface_GetSearchBarViewInterface");
static_assert(offsetof(StoreCharactersSelectionViewInterface_GetSearchBarViewInterface, ReturnValue) == 0x000000, "Member 'StoreCharactersSelectionViewInterface_GetSearchBarViewInterface::ReturnValue' has a wrong offset!");

// Function DBDUIViewInterfaces.StoreCharactersSelectionViewInterface.GetStoreCharactersFilterInterface
// 0x0010 (0x0010 - 0x0000)
struct StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface final
{
public:
	TScriptInterface<class IStoreCharactersFilterViewInterface> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface) == 0x000008, "Wrong alignment on StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface");
static_assert(sizeof(StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface) == 0x000010, "Wrong size on StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface");
static_assert(offsetof(StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface, ReturnValue) == 0x000000, "Member 'StoreCharactersSelectionViewInterface_GetStoreCharactersFilterInterface::ReturnValue' has a wrong offset!");

// Function DBDUIViewInterfaces.GlobalProcessingIconViewInterface.SetGlobalLoadingIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility) == 0x000001, "Wrong alignment on GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility");
static_assert(sizeof(GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility) == 0x000001, "Wrong size on GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility");
static_assert(offsetof(GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility, IsVisible) == 0x000000, "Member 'GlobalProcessingIconViewInterface_SetGlobalLoadingIconVisibility::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.GlobalProcessingIconViewInterface.SetGlobalSavingIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility) == 0x000001, "Wrong alignment on GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility");
static_assert(sizeof(GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility) == 0x000001, "Wrong size on GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility");
static_assert(offsetof(GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility, IsVisible) == 0x000000, "Member 'GlobalProcessingIconViewInterface_SetGlobalSavingIconVisibility::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.KillerStatusData.IsEqual
// 0x0010 (0x0010 - 0x0000)
struct KillerStatusData_IsEqual final
{
public:
	const class UKillerStatusData*                Other;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KillerStatusData_IsEqual) == 0x000008, "Wrong alignment on KillerStatusData_IsEqual");
static_assert(sizeof(KillerStatusData_IsEqual) == 0x000010, "Wrong size on KillerStatusData_IsEqual");
static_assert(offsetof(KillerStatusData_IsEqual, Other) == 0x000000, "Member 'KillerStatusData_IsEqual::Other' has a wrong offset!");
static_assert(offsetof(KillerStatusData_IsEqual, ReturnValue) == 0x000008, "Member 'KillerStatusData_IsEqual::ReturnValue' has a wrong offset!");

// Function DBDUIViewInterfaces.AntiCampSelfUnhookMeterViewInterface.SetProgress
// 0x0004 (0x0004 - 0x0000)
struct AntiCampSelfUnhookMeterViewInterface_SetProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AntiCampSelfUnhookMeterViewInterface_SetProgress) == 0x000004, "Wrong alignment on AntiCampSelfUnhookMeterViewInterface_SetProgress");
static_assert(sizeof(AntiCampSelfUnhookMeterViewInterface_SetProgress) == 0x000004, "Wrong size on AntiCampSelfUnhookMeterViewInterface_SetProgress");
static_assert(offsetof(AntiCampSelfUnhookMeterViewInterface_SetProgress, Progress) == 0x000000, "Member 'AntiCampSelfUnhookMeterViewInterface_SetProgress::Progress' has a wrong offset!");

// Function DBDUIViewInterfaces.AntiCampSelfUnhookMeterViewInterface.SetState
// 0x0001 (0x0001 - 0x0000)
struct AntiCampSelfUnhookMeterViewInterface_SetState final
{
public:
	EAntiCampSelfUnhookMeterState                 NewState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AntiCampSelfUnhookMeterViewInterface_SetState) == 0x000001, "Wrong alignment on AntiCampSelfUnhookMeterViewInterface_SetState");
static_assert(sizeof(AntiCampSelfUnhookMeterViewInterface_SetState) == 0x000001, "Wrong size on AntiCampSelfUnhookMeterViewInterface_SetState");
static_assert(offsetof(AntiCampSelfUnhookMeterViewInterface_SetState, NewState) == 0x000000, "Member 'AntiCampSelfUnhookMeterViewInterface_SetState::NewState' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveCompendiumViewInterface.SetPastTomesViewData
// 0x0010 (0x0010 - 0x0000)
struct ArchiveCompendiumViewInterface_SetPastTomesViewData final
{
public:
	TArray<struct FCompendiumButtonData>          PastStoryButtonData;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveCompendiumViewInterface_SetPastTomesViewData) == 0x000008, "Wrong alignment on ArchiveCompendiumViewInterface_SetPastTomesViewData");
static_assert(sizeof(ArchiveCompendiumViewInterface_SetPastTomesViewData) == 0x000010, "Wrong size on ArchiveCompendiumViewInterface_SetPastTomesViewData");
static_assert(offsetof(ArchiveCompendiumViewInterface_SetPastTomesViewData, PastStoryButtonData) == 0x000000, "Member 'ArchiveCompendiumViewInterface_SetPastTomesViewData::PastStoryButtonData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveEditorViewInterface.DisplayEditorSaving
// 0x0010 (0x0010 - 0x0000)
struct ArchiveEditorViewInterface_DisplayEditorSaving final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveEditorViewInterface_DisplayEditorSaving) == 0x000008, "Wrong alignment on ArchiveEditorViewInterface_DisplayEditorSaving");
static_assert(sizeof(ArchiveEditorViewInterface_DisplayEditorSaving) == 0x000010, "Wrong size on ArchiveEditorViewInterface_DisplayEditorSaving");
static_assert(offsetof(ArchiveEditorViewInterface_DisplayEditorSaving, Path) == 0x000000, "Member 'ArchiveEditorViewInterface_DisplayEditorSaving::Path' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.SetTextVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerViewInterface_SetTextVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_SetTextVisibility) == 0x000001, "Wrong alignment on ArchiveImageViewerViewInterface_SetTextVisibility");
static_assert(sizeof(ArchiveImageViewerViewInterface_SetTextVisibility) == 0x000001, "Wrong size on ArchiveImageViewerViewInterface_SetTextVisibility");
static_assert(offsetof(ArchiveImageViewerViewInterface_SetTextVisibility, Visible) == 0x000000, "Member 'ArchiveImageViewerViewInterface_SetTextVisibility::Visible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.SetVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerViewInterface_SetVoiceOverAutoplay final
{
public:
	bool                                          VoiceOverAutoplay;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveImageViewerViewInterface_SetVoiceOverAutoplay");
static_assert(sizeof(ArchiveImageViewerViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveImageViewerViewInterface_SetVoiceOverAutoplay");
static_assert(offsetof(ArchiveImageViewerViewInterface_SetVoiceOverAutoplay, VoiceOverAutoplay) == 0x000000, "Member 'ArchiveImageViewerViewInterface_SetVoiceOverAutoplay::VoiceOverAutoplay' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.SetVoiceOverPlaying
// 0x0001 (0x0001 - 0x0000)
struct ArchiveImageViewerViewInterface_SetVoiceOverPlaying final
{
public:
	bool                                          VoiceOverPlaying;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong alignment on ArchiveImageViewerViewInterface_SetVoiceOverPlaying");
static_assert(sizeof(ArchiveImageViewerViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong size on ArchiveImageViewerViewInterface_SetVoiceOverPlaying");
static_assert(offsetof(ArchiveImageViewerViewInterface_SetVoiceOverPlaying, VoiceOverPlaying) == 0x000000, "Member 'ArchiveImageViewerViewInterface_SetVoiceOverPlaying::VoiceOverPlaying' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveImageViewerViewInterface.UpdateContent
// 0x0078 (0x0078 - 0x0000)
struct ArchiveImageViewerViewInterface_UpdateContent final
{
public:
	struct FArchivesVignetteEntryViewData         Data;                                              // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveImageViewerViewInterface_UpdateContent) == 0x000008, "Wrong alignment on ArchiveImageViewerViewInterface_UpdateContent");
static_assert(sizeof(ArchiveImageViewerViewInterface_UpdateContent) == 0x000078, "Wrong size on ArchiveImageViewerViewInterface_UpdateContent");
static_assert(offsetof(ArchiveImageViewerViewInterface_UpdateContent, Data) == 0x000000, "Member 'ArchiveImageViewerViewInterface_UpdateContent::Data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.OnImageViewerVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay final
{
public:
	bool                                          Autoplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay");
static_assert(sizeof(ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay");
static_assert(offsetof(ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay, Autoplay) == 0x000000, "Member 'ArchiveJournalViewInterface_OnImageViewerVoiceOverAutoplay::Autoplay' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetArrowButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetArrowButtonEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetArrowButtonEnabled) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetArrowButtonEnabled");
static_assert(sizeof(ArchiveJournalViewInterface_SetArrowButtonEnabled) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetArrowButtonEnabled");
static_assert(offsetof(ArchiveJournalViewInterface_SetArrowButtonEnabled, IsEnabled) == 0x000000, "Member 'ArchiveJournalViewInterface_SetArrowButtonEnabled::IsEnabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetCinematicButtonsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetCinematicButtonsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetCinematicButtonsEnabled) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetCinematicButtonsEnabled");
static_assert(sizeof(ArchiveJournalViewInterface_SetCinematicButtonsEnabled) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetCinematicButtonsEnabled");
static_assert(offsetof(ArchiveJournalViewInterface_SetCinematicButtonsEnabled, Enabled) == 0x000000, "Member 'ArchiveJournalViewInterface_SetCinematicButtonsEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetEntryData
// 0x0078 (0x0078 - 0x0000)
struct ArchiveJournalViewInterface_SetEntryData final
{
public:
	struct FArchivesVignetteEntryViewData         EntryViewData;                                     // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetEntryData) == 0x000008, "Wrong alignment on ArchiveJournalViewInterface_SetEntryData");
static_assert(sizeof(ArchiveJournalViewInterface_SetEntryData) == 0x000078, "Wrong size on ArchiveJournalViewInterface_SetEntryData");
static_assert(offsetof(ArchiveJournalViewInterface_SetEntryData, EntryViewData) == 0x000000, "Member 'ArchiveJournalViewInterface_SetEntryData::EntryViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVignetteData
// 0x0060 (0x0060 - 0x0000)
struct ArchiveJournalViewInterface_SetVignetteData final
{
public:
	struct FArchivesVignetteViewData              VignetteViewData;                                  // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVignetteData) == 0x000008, "Wrong alignment on ArchiveJournalViewInterface_SetVignetteData");
static_assert(sizeof(ArchiveJournalViewInterface_SetVignetteData) == 0x000060, "Wrong size on ArchiveJournalViewInterface_SetVignetteData");
static_assert(offsetof(ArchiveJournalViewInterface_SetVignetteData, VignetteViewData) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVignetteData::VignetteViewData' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVignetteInputsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetVignetteInputsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVignetteInputsEnabled) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetVignetteInputsEnabled");
static_assert(sizeof(ArchiveJournalViewInterface_SetVignetteInputsEnabled) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetVignetteInputsEnabled");
static_assert(offsetof(ArchiveJournalViewInterface_SetVignetteInputsEnabled, Enabled) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVignetteInputsEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVignetteList
// 0x0010 (0x0010 - 0x0000)
struct ArchiveJournalViewInterface_SetVignetteList final
{
public:
	TArray<struct FArchivesVignetteViewData>      VignetteDataList;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVignetteList) == 0x000008, "Wrong alignment on ArchiveJournalViewInterface_SetVignetteList");
static_assert(sizeof(ArchiveJournalViewInterface_SetVignetteList) == 0x000010, "Wrong size on ArchiveJournalViewInterface_SetVignetteList");
static_assert(offsetof(ArchiveJournalViewInterface_SetVignetteList, VignetteDataList) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVignetteList::VignetteDataList' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVoiceOverAutoplay
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetVoiceOverAutoplay final
{
public:
	bool                                          VoiceOverAutoplay;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetVoiceOverAutoplay");
static_assert(sizeof(ArchiveJournalViewInterface_SetVoiceOverAutoplay) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetVoiceOverAutoplay");
static_assert(offsetof(ArchiveJournalViewInterface_SetVoiceOverAutoplay, VoiceOverAutoplay) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVoiceOverAutoplay::VoiceOverAutoplay' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveJournalViewInterface.SetVoiceOverPlaying
// 0x0001 (0x0001 - 0x0000)
struct ArchiveJournalViewInterface_SetVoiceOverPlaying final
{
public:
	bool                                          VoiceOverPlaying;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveJournalViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong alignment on ArchiveJournalViewInterface_SetVoiceOverPlaying");
static_assert(sizeof(ArchiveJournalViewInterface_SetVoiceOverPlaying) == 0x000001, "Wrong size on ArchiveJournalViewInterface_SetVoiceOverPlaying");
static_assert(offsetof(ArchiveJournalViewInterface_SetVoiceOverPlaying, VoiceOverPlaying) == 0x000000, "Member 'ArchiveJournalViewInterface_SetVoiceOverPlaying::VoiceOverPlaying' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.GoToNextLevel
// 0x0004 (0x0004 - 0x0000)
struct ArchiveLevelProgressionViewInterface_GoToNextLevel final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_GoToNextLevel) == 0x000004, "Wrong alignment on ArchiveLevelProgressionViewInterface_GoToNextLevel");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_GoToNextLevel) == 0x000004, "Wrong size on ArchiveLevelProgressionViewInterface_GoToNextLevel");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_GoToNextLevel, LevelIndex) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_GoToNextLevel::LevelIndex' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetActiveLevel
// 0x0008 (0x0008 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetActiveLevel final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PerformAction;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetActiveLevel) == 0x000004, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetActiveLevel");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetActiveLevel) == 0x000008, "Wrong size on ArchiveLevelProgressionViewInterface_SetActiveLevel");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetActiveLevel, LevelIndex) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetActiveLevel::LevelIndex' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetActiveLevel, PerformAction) == 0x000004, "Member 'ArchiveLevelProgressionViewInterface_SetActiveLevel::PerformAction' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetLevelSelectorEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled) == 0x000001, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled) == 0x000001, "Wrong size on ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled, Enabled) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetLevelSelectorEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetLevelSelectorVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility) == 0x000001, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility) == 0x000001, "Wrong size on ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility, IsVisible) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetLevelSelectorVisibility::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetRewardsContainerVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility) == 0x000001, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility) == 0x000001, "Wrong size on ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility, IsVisible) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetRewardsContainerVisibility::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetTomeLevelsData
// 0x0018 (0x0018 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetTomeLevelsData final
{
public:
	TArray<class UArchiveStoryLevelViewData*>     LevelsData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SelectedLevel;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData) == 0x000008, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetTomeLevelsData");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData) == 0x000018, "Wrong size on ArchiveLevelProgressionViewInterface_SetTomeLevelsData");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData, LevelsData) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetTomeLevelsData::LevelsData' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeLevelsData, SelectedLevel) == 0x000010, "Member 'ArchiveLevelProgressionViewInterface_SetTomeLevelsData::SelectedLevel' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.SetTomeRewardsData
// 0x0018 (0x0018 - 0x0000)
struct ArchiveLevelProgressionViewInterface_SetTomeRewardsData final
{
public:
	TArray<struct FRewardWrapperViewData>         RewardsData;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          AreLocked;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData) == 0x000008, "Wrong alignment on ArchiveLevelProgressionViewInterface_SetTomeRewardsData");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData) == 0x000018, "Wrong size on ArchiveLevelProgressionViewInterface_SetTomeRewardsData");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData, RewardsData) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_SetTomeRewardsData::RewardsData' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_SetTomeRewardsData, AreLocked) == 0x000010, "Member 'ArchiveLevelProgressionViewInterface_SetTomeRewardsData::AreLocked' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveLevelProgressionViewInterface.UpdateLevelStatus
// 0x0008 (0x0008 - 0x0000)
struct ArchiveLevelProgressionViewInterface_UpdateLevelStatus final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchivesStoryLevelStatus                     Status;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus) == 0x000004, "Wrong alignment on ArchiveLevelProgressionViewInterface_UpdateLevelStatus");
static_assert(sizeof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus) == 0x000008, "Wrong size on ArchiveLevelProgressionViewInterface_UpdateLevelStatus");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus, Level) == 0x000000, "Member 'ArchiveLevelProgressionViewInterface_UpdateLevelStatus::Level' has a wrong offset!");
static_assert(offsetof(ArchiveLevelProgressionViewInterface_UpdateLevelStatus, Status) == 0x000004, "Member 'ArchiveLevelProgressionViewInterface_UpdateLevelStatus::Status' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.ClearChallengeReminderData
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_ClearChallengeReminderData final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_ClearChallengeReminderData) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_ClearChallengeReminderData");
static_assert(sizeof(ArchiveMenuViewInterface_ClearChallengeReminderData) == 0x000001, "Wrong size on ArchiveMenuViewInterface_ClearChallengeReminderData");
static_assert(offsetof(ArchiveMenuViewInterface_ClearChallengeReminderData, Role) == 0x000000, "Member 'ArchiveMenuViewInterface_ClearChallengeReminderData::Role' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetChallengeReminderData
// 0x00E8 (0x00E8 - 0x0000)
struct ArchiveMenuViewInterface_SetChallengeReminderData final
{
public:
	struct FArchiveChallengeReminderViewData      Data;                                              // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EPlayerRole                                   Role;                                              // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeedsAnimation;                                    // 0x00D1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              AnimationOriginalPosition;                         // 0x00D8(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetChallengeReminderData) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetChallengeReminderData");
static_assert(sizeof(ArchiveMenuViewInterface_SetChallengeReminderData) == 0x0000E8, "Wrong size on ArchiveMenuViewInterface_SetChallengeReminderData");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, Data) == 0x000000, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::Data' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, Role) == 0x0000D0, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::Role' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, NeedsAnimation) == 0x0000D1, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::NeedsAnimation' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderData, AnimationOriginalPosition) == 0x0000D8, "Member 'ArchiveMenuViewInterface_SetChallengeReminderData::AnimationOriginalPosition' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetChallengeReminderVisibility
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetChallengeReminderVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetChallengeReminderVisibility) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetChallengeReminderVisibility");
static_assert(sizeof(ArchiveMenuViewInterface_SetChallengeReminderVisibility) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetChallengeReminderVisibility");
static_assert(offsetof(ArchiveMenuViewInterface_SetChallengeReminderVisibility, IsVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetChallengeReminderVisibility::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetControllerElementsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetControllerElementsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetControllerElementsEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetControllerElementsEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetControllerElementsEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetControllerElementsEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetControllerElementsEnabled, Enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetControllerElementsEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetDisplayStandAreaEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetDisplayStandAreaEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetDisplayStandAreaEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetDisplayStandAreaEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetDisplayStandAreaEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetDisplayStandAreaEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetDisplayStandAreaEnabled, Enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetDisplayStandAreaEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetEventLabel
// 0x0010 (0x0010 - 0x0000)
struct ArchiveMenuViewInterface_SetEventLabel final
{
public:
	class FString                                 EventLabel;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetEventLabel) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetEventLabel");
static_assert(sizeof(ArchiveMenuViewInterface_SetEventLabel) == 0x000010, "Wrong size on ArchiveMenuViewInterface_SetEventLabel");
static_assert(offsetof(ArchiveMenuViewInterface_SetEventLabel, EventLabel) == 0x000000, "Member 'ArchiveMenuViewInterface_SetEventLabel::EventLabel' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetInfoButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetInfoButtonEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetInfoButtonEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetInfoButtonEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetInfoButtonEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetInfoButtonEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetInfoButtonEnabled, IsEnabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetInfoButtonEnabled::IsEnabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetInfoButtonVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetInfoButtonVisible final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetInfoButtonVisible) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetInfoButtonVisible");
static_assert(sizeof(ArchiveMenuViewInterface_SetInfoButtonVisible) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetInfoButtonVisible");
static_assert(offsetof(ArchiveMenuViewInterface_SetInfoButtonVisible, IsVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetInfoButtonVisible::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetMenuState
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetMenuState final
{
public:
	EArchiveMenuState                             MenuState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetMenuState) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetMenuState");
static_assert(sizeof(ArchiveMenuViewInterface_SetMenuState) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetMenuState");
static_assert(offsetof(ArchiveMenuViewInterface_SetMenuState, MenuState) == 0x000000, "Member 'ArchiveMenuViewInterface_SetMenuState::MenuState' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetQuestNodeHoverEffect
// 0x0002 (0x0002 - 0x0000)
struct ArchiveMenuViewInterface_SetQuestNodeHoverEffect final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHovered;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetQuestNodeHoverEffect");
static_assert(sizeof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect) == 0x000002, "Wrong size on ArchiveMenuViewInterface_SetQuestNodeHoverEffect");
static_assert(offsetof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect, Role) == 0x000000, "Member 'ArchiveMenuViewInterface_SetQuestNodeHoverEffect::Role' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetQuestNodeHoverEffect, IsHovered) == 0x000001, "Member 'ArchiveMenuViewInterface_SetQuestNodeHoverEffect::IsHovered' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetRemainingTime
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetRemainingTime final
{
public:
	class FString                                 RemainingTime;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMoreThanWarningThreshold;                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArchiveMenuState                             MenuState;                                         // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetRemainingTime) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetRemainingTime");
static_assert(sizeof(ArchiveMenuViewInterface_SetRemainingTime) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetRemainingTime");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTime, RemainingTime) == 0x000000, "Member 'ArchiveMenuViewInterface_SetRemainingTime::RemainingTime' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTime, IsMoreThanWarningThreshold) == 0x000010, "Member 'ArchiveMenuViewInterface_SetRemainingTime::IsMoreThanWarningThreshold' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTime, MenuState) == 0x000011, "Member 'ArchiveMenuViewInterface_SetRemainingTime::MenuState' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetRemainingTimeVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetRemainingTimeVisible final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetRemainingTimeVisible) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetRemainingTimeVisible");
static_assert(sizeof(ArchiveMenuViewInterface_SetRemainingTimeVisible) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetRemainingTimeVisible");
static_assert(offsetof(ArchiveMenuViewInterface_SetRemainingTimeVisible, IsVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetRemainingTimeVisible::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetReminderSlotsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetReminderSlotsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetReminderSlotsEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetReminderSlotsEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetReminderSlotsEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetReminderSlotsEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetReminderSlotsEnabled, Enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetReminderSlotsEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetRiftPackButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetRiftPackButtonEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetRiftPackButtonEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetRiftPackButtonEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetRiftPackButtonEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetRiftPackButtonEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetRiftPackButtonEnabled, IsEnabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetRiftPackButtonEnabled::IsEnabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetSubtitle
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetSubtitle final
{
public:
	class FText                                   Subtitle;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetSubtitle) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetSubtitle");
static_assert(sizeof(ArchiveMenuViewInterface_SetSubtitle) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetSubtitle");
static_assert(offsetof(ArchiveMenuViewInterface_SetSubtitle, Subtitle) == 0x000000, "Member 'ArchiveMenuViewInterface_SetSubtitle::Subtitle' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetSubtitleVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetSubtitleVisible final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetSubtitleVisible) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetSubtitleVisible");
static_assert(sizeof(ArchiveMenuViewInterface_SetSubtitleVisible) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetSubtitleVisible");
static_assert(offsetof(ArchiveMenuViewInterface_SetSubtitleVisible, IsVisible) == 0x000000, "Member 'ArchiveMenuViewInterface_SetSubtitleVisible::IsVisible' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabEnabled
// 0x0008 (0x0008 - 0x0000)
struct ArchiveMenuViewInterface_SetTabEnabled final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabEnabled) == 0x000004, "Wrong alignment on ArchiveMenuViewInterface_SetTabEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabEnabled) == 0x000008, "Wrong size on ArchiveMenuViewInterface_SetTabEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabEnabled, Key) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabEnabled::Key' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabEnabled, Enabled) == 0x000004, "Member 'ArchiveMenuViewInterface_SetTabEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabsData
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetTabsData final
{
public:
	TArray<struct FTabWidgetData>                 TabsData;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SelectedKey;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabsData) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetTabsData");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabsData) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetTabsData");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabsData, TabsData) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabsData::TabsData' has a wrong offset!");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabsData, SelectedKey) == 0x000010, "Member 'ArchiveMenuViewInterface_SetTabsData::SelectedKey' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabSelected
// 0x0004 (0x0004 - 0x0000)
struct ArchiveMenuViewInterface_SetTabSelected final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabSelected) == 0x000004, "Wrong alignment on ArchiveMenuViewInterface_SetTabSelected");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabSelected) == 0x000004, "Wrong size on ArchiveMenuViewInterface_SetTabSelected");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabSelected, Key) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabSelected::Key' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTabsInputsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ArchiveMenuViewInterface_SetTabsInputsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetTabsInputsEnabled) == 0x000001, "Wrong alignment on ArchiveMenuViewInterface_SetTabsInputsEnabled");
static_assert(sizeof(ArchiveMenuViewInterface_SetTabsInputsEnabled) == 0x000001, "Wrong size on ArchiveMenuViewInterface_SetTabsInputsEnabled");
static_assert(offsetof(ArchiveMenuViewInterface_SetTabsInputsEnabled, Enabled) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTabsInputsEnabled::Enabled' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct ArchiveMenuViewInterface_SetTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_SetTitle) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_SetTitle");
static_assert(sizeof(ArchiveMenuViewInterface_SetTitle) == 0x000018, "Wrong size on ArchiveMenuViewInterface_SetTitle");
static_assert(offsetof(ArchiveMenuViewInterface_SetTitle, Title) == 0x000000, "Member 'ArchiveMenuViewInterface_SetTitle::Title' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.ShowSlotSelector
// 0x00B8 (0x00B8 - 0x0000)
struct ArchiveMenuViewInterface_ShowSlotSelector final
{
public:
	struct FArchiveNodeViewData                   Data;                                              // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArchiveMenuViewInterface_ShowSlotSelector) == 0x000008, "Wrong alignment on ArchiveMenuViewInterface_ShowSlotSelector");
static_assert(sizeof(ArchiveMenuViewInterface_ShowSlotSelector) == 0x0000B8, "Wrong size on ArchiveMenuViewInterface_ShowSlotSelector");
static_assert(offsetof(ArchiveMenuViewInterface_ShowSlotSelector, Data) == 0x000000, "Member 'ArchiveMenuViewInterface_ShowSlotSelector::Data' has a wrong offset!");

// Function DBDUIViewInterfaces.ArchiveMenuViewInterface.UpdateBackgroundSkin
// 0x0040 (0x0040 - 0x0000)
struct ArchiveMenuViewInterface_UpdateBackgroundSkin final
{
public:
