#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIPresenters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DBDUIPresenters_structs.hpp"
#include "Customization_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DBDUIPresenters.UIComponent
// 0x0000 (0x0030 - 0x0030)
class UUIComponent : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIComponent">();
	}
	static class UUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIComponent>();
	}
};
static_assert(alignof(UUIComponent) == 0x000008, "Wrong alignment on UUIComponent");
static_assert(sizeof(UUIComponent) == 0x000030, "Wrong size on UUIComponent");

// Class DBDUIPresenters.Presenter
// 0x00B8 (0x00E8 - 0x0030)
class UPresenter : public UUIComponent
{
public:
	bool                                          _overrideWidgetInstantiationPhase;                 // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPresenterPhase                               _widgetInstantiationPhase;                         // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              InitialVisibility;                                 // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _widgetZOrder;                                     // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                            _widget;                                           // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPresenterParentInfo*                   _parentInfo;                                       // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           _ignoredPresentationRequirementFunctions;          // 0x0058(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class UPresenterRequirementFunction*>  _presentationRequirementFunctions;                 // 0x00A8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         _filter;                                           // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         _currencyFilter;                                   // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class ILockedFeatureElementViewInterface>> _lockedFeatureElements;                            // 0x00D0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FString> GetIgnoredPresentationRequirementFunctionOptions();
	void OnContextChanged(EContext Context);
	void OnContextFocus(EContext Context);
	void OnContextUnfocus(EContext Context);

	bool IsContextReady() const;
	bool ShouldPresent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Presenter">();
	}
	static class UPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPresenter>();
	}
};
static_assert(alignof(UPresenter) == 0x000008, "Wrong alignment on UPresenter");
static_assert(sizeof(UPresenter) == 0x0000E8, "Wrong size on UPresenter");
static_assert(offsetof(UPresenter, _overrideWidgetInstantiationPhase) == 0x000030, "Member 'UPresenter::_overrideWidgetInstantiationPhase' has a wrong offset!");
static_assert(offsetof(UPresenter, _widgetInstantiationPhase) == 0x000031, "Member 'UPresenter::_widgetInstantiationPhase' has a wrong offset!");
static_assert(offsetof(UPresenter, InitialVisibility) == 0x000032, "Member 'UPresenter::InitialVisibility' has a wrong offset!");
static_assert(offsetof(UPresenter, _widgetZOrder) == 0x000034, "Member 'UPresenter::_widgetZOrder' has a wrong offset!");
static_assert(offsetof(UPresenter, _widget) == 0x000038, "Member 'UPresenter::_widget' has a wrong offset!");
static_assert(offsetof(UPresenter, _parentInfo) == 0x000040, "Member 'UPresenter::_parentInfo' has a wrong offset!");
static_assert(offsetof(UPresenter, _ignoredPresentationRequirementFunctions) == 0x000058, "Member 'UPresenter::_ignoredPresentationRequirementFunctions' has a wrong offset!");
static_assert(offsetof(UPresenter, _presentationRequirementFunctions) == 0x0000A8, "Member 'UPresenter::_presentationRequirementFunctions' has a wrong offset!");
static_assert(offsetof(UPresenter, _filter) == 0x0000C8, "Member 'UPresenter::_filter' has a wrong offset!");
static_assert(offsetof(UPresenter, _currencyFilter) == 0x0000C9, "Member 'UPresenter::_currencyFilter' has a wrong offset!");
static_assert(offsetof(UPresenter, _lockedFeatureElements) == 0x0000D0, "Member 'UPresenter::_lockedFeatureElements' has a wrong offset!");

// Class DBDUIPresenters.HudPresenter
// 0x0040 (0x0128 - 0x00E8)
class UHudPresenter : public UPresenter
{
public:
	EHudParentContainerType                       HudParentContainer;                                // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             _pendingCharacter;                                 // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADBDPlayer*                             _presentedCharacter;                               // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDSpectator*                          _spectatorPawn;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudScreen*                             _hudScreen;                                        // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCoreHudRootWidget*                     _rootWidget;                                       // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsHudReady();
	void OnLocallyObservedChanged();
	void OnPawnPossessed(class APawn* Pawn);
	void OnPawnUnpossessed(class APawn* Pawn);

	bool IsGameStateReady() const;
	bool IsPendingPawnReady() const;
	bool IsPlayerStateReady() const;
	bool IsVisibleForCurrentGameMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudPresenter">();
	}
	static class UHudPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudPresenter>();
	}
};
static_assert(alignof(UHudPresenter) == 0x000008, "Wrong alignment on UHudPresenter");
static_assert(sizeof(UHudPresenter) == 0x000128, "Wrong size on UHudPresenter");
static_assert(offsetof(UHudPresenter, HudParentContainer) == 0x0000E8, "Member 'UHudPresenter::HudParentContainer' has a wrong offset!");
static_assert(offsetof(UHudPresenter, _pendingCharacter) == 0x0000F0, "Member 'UHudPresenter::_pendingCharacter' has a wrong offset!");
static_assert(offsetof(UHudPresenter, _presentedCharacter) == 0x0000F8, "Member 'UHudPresenter::_presentedCharacter' has a wrong offset!");
static_assert(offsetof(UHudPresenter, _spectatorPawn) == 0x000100, "Member 'UHudPresenter::_spectatorPawn' has a wrong offset!");
static_assert(offsetof(UHudPresenter, _hudScreen) == 0x000110, "Member 'UHudPresenter::_hudScreen' has a wrong offset!");
static_assert(offsetof(UHudPresenter, _rootWidget) == 0x000118, "Member 'UHudPresenter::_rootWidget' has a wrong offset!");

// Class DBDUIPresenters.HudKillerEquippedPowerPresenter
// 0x09A0 (0x0AC8 - 0x0128)
class UHudKillerEquippedPowerPresenter final : public UHudPresenter
{
public:
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                KillerEquippedPowerWidgetClass;                    // 0x0130(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPowerBundleViewData                   _powerBundleViewData;                              // 0x0138(0x0228)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x768];                                    // 0x0360(0x0768)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudKillerEquippedPowerPresenter">();
	}
	static class UHudKillerEquippedPowerPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudKillerEquippedPowerPresenter>();
	}
};
static_assert(alignof(UHudKillerEquippedPowerPresenter) == 0x000008, "Wrong alignment on UHudKillerEquippedPowerPresenter");
static_assert(sizeof(UHudKillerEquippedPowerPresenter) == 0x000AC8, "Wrong size on UHudKillerEquippedPowerPresenter");
static_assert(offsetof(UHudKillerEquippedPowerPresenter, KillerEquippedPowerWidgetClass) == 0x000130, "Member 'UHudKillerEquippedPowerPresenter::KillerEquippedPowerWidgetClass' has a wrong offset!");
static_assert(offsetof(UHudKillerEquippedPowerPresenter, _powerBundleViewData) == 0x000138, "Member 'UHudKillerEquippedPowerPresenter::_powerBundleViewData' has a wrong offset!");

// Class DBDUIPresenters.HudKillerStatusPresenter
// 0x00F0 (0x0218 - 0x0128)
class UHudKillerStatusPresenter final : public UHudPresenter
{
public:
	TSubclassOf<class UUserWidget>                KillerStatusWidgetClass;                           // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0xE8];                                     // 0x0130(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudKillerStatusPresenter">();
	}
	static class UHudKillerStatusPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudKillerStatusPresenter>();
	}
};
static_assert(alignof(UHudKillerStatusPresenter) == 0x000008, "Wrong alignment on UHudKillerStatusPresenter");
static_assert(sizeof(UHudKillerStatusPresenter) == 0x000218, "Wrong size on UHudKillerStatusPresenter");
static_assert(offsetof(UHudKillerStatusPresenter, KillerStatusWidgetClass) == 0x000128, "Member 'UHudKillerStatusPresenter::KillerStatusWidgetClass' has a wrong offset!");

// Class DBDUIPresenters.HudMatchResultPresenter
// 0x0018 (0x0140 - 0x0128)
class UHudMatchResultPresenter final : public UHudPresenter
{
public:
	TSubclassOf<class UUserWidget>                MatchResultWidgetClass;                            // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifyInParadiseOrEscaped();
	void OnMatchResultFadeOutCompleted();
	void ShowEndSequence(float Duration, bool IsSlasher, int32 MatchResult);
	void StartEndGameSequence();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudMatchResultPresenter">();
	}
	static class UHudMatchResultPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudMatchResultPresenter>();
	}
};
static_assert(alignof(UHudMatchResultPresenter) == 0x000008, "Wrong alignment on UHudMatchResultPresenter");
static_assert(sizeof(UHudMatchResultPresenter) == 0x000140, "Wrong size on UHudMatchResultPresenter");
static_assert(offsetof(UHudMatchResultPresenter, MatchResultWidgetClass) == 0x000128, "Member 'UHudMatchResultPresenter::MatchResultWidgetClass' has a wrong offset!");

// Class DBDUIPresenters.HudObjectivesPresenter
// 0x00C0 (0x01E8 - 0x0128)
class UHudObjectivesPresenter final : public UHudPresenter
{
public:
	TSubclassOf<class UUserWidget>                CoreHudObjectivesWidgetClass;                      // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0xB8];                                     // 0x0130(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HudObjectivesPresenter">();
	}
	static class UHudObjectivesPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudObjectivesPresenter>();
	}
};
static_assert(alignof(UHudObjectivesPresenter) == 0x000008, "Wrong alignment on UHudObjectivesPresenter");
static_assert(sizeof(UHudObjectivesPresenter) == 0x0001E8, "Wrong size on UHudObjectivesPresenter");
static_assert(offsetof(UHudObjectivesPresenter, CoreHudObjectivesWidgetClass) == 0x000128, "Member 'UHudObjectivesPresenter::CoreHudObjectivesWidgetClass' has a wrong offset!");

// Class DBDUIPresenters.AimingCrosshairPresenter
// 0x0028 (0x0150 - 0x0128)
class UAimingCrosshairPresenter final : public UHudPresenter
{
public:
	TSubclassOf<class UUserWidget>                AimingCrosshairWidgetClass;                        // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x20];                                     // 0x0130(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimingCrosshairPresenter">();
	}
	static class UAimingCrosshairPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimingCrosshairPresenter>();
	}
};
static_assert(alignof(UAimingCrosshairPresenter) == 0x000008, "Wrong alignment on UAimingCrosshairPresenter");
static_assert(sizeof(UAimingCrosshairPresenter) == 0x000150, "Wrong size on UAimingCrosshairPresenter");
static_assert(offsetof(UAimingCrosshairPresenter, AimingCrosshairWidgetClass) == 0x000128, "Member 'UAimingCrosshairPresenter::AimingCrosshairWidgetClass' has a wrong offset!");

// Class DBDUIPresenters.AlertsPresenter
// 0x00C0 (0x01A8 - 0x00E8)
class UAlertsPresenter final : public UPresenter
{
public:
	TSubclassOf<class UUserWidget>                AlertsWidgetClass;                                 // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0xB8];                                      // 0x00F0(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanStartRewardSequence();
	void OnRewardAlertSequenceCompleted();

	bool HasPendingViewData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlertsPresenter">();
	}
	static class UAlertsPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlertsPresenter>();
	}
};
static_assert(alignof(UAlertsPresenter) == 0x000008, "Wrong alignment on UAlertsPresenter");
static_assert(sizeof(UAlertsPresenter) == 0x0001A8, "Wrong size on UAlertsPresenter");
static_assert(offsetof(UAlertsPresenter, AlertsWidgetClass) == 0x0000E8, "Member 'UAlertsPresenter::AlertsWidgetClass' has a wrong offset!");

// Class DBDUIPresenters.AnimationPreviewPresenter
// 0x0040 (0x0128 - 0x00E8)
class UAnimationPreviewPresenter final : public UPresenter
{
public:
	TSoftClassPtr<class UClass>                   AnimationPreviewWidgetClass;                       // 0x00E8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContext                                      ObservedContext;                                   // 0x0120(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnContextEnter(EContext Context);
	void OnContextLeave(EContext Context);

	bool IsContextEntered() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimationPreviewPresenter">();
	}
	static class UAnimationPreviewPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimationPreviewPresenter>();
	}
};
static_assert(alignof(UAnimationPreviewPresenter) == 0x000008, "Wrong alignment on UAnimationPreviewPresenter");
static_assert(sizeof(UAnimationPreviewPresenter) == 0x000128, "Wrong size on UAnimationPreviewPresenter");
static_assert(offsetof(UAnimationPreviewPresenter, AnimationPreviewWidgetClass) == 0x0000E8, "Member 'UAnimationPreviewPresenter::AnimationPreviewWidgetClass' has a wrong offset!");
static_assert(offsetof(UAnimationPreviewPresenter, ObservedContext) == 0x000120, "Member 'UAnimationPreviewPresenter::ObservedContext' has a wrong offset!");

// Class DBDUIPresenters.AntiCampSelfUnhookMeterPresenter
// 0x0028 (0x0150 - 0x0128)
class UAntiCampSelfUnhookMeterPresenter final : public UHudPresenter
{
public:
	TSubclassOf<class UUserWidget>                AntiCampSelfUnhookMeterWidget;                     // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x20];                                     // 0x0130(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AntiCampSelfUnhookMeterPresenter">();
	}
	static class UAntiCampSelfUnhookMeterPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAntiCampSelfUnhookMeterPresenter>();
	}
};
static_assert(alignof(UAntiCampSelfUnhookMeterPresenter) == 0x000008, "Wrong alignment on UAntiCampSelfUnhookMeterPresenter");
static_assert(sizeof(UAntiCampSelfUnhookMeterPresenter) == 0x000150, "Wrong size on UAntiCampSelfUnhookMeterPresenter");
static_assert(offsetof(UAntiCampSelfUnhookMeterPresenter, AntiCampSelfUnhookMeterWidget) == 0x000128, "Member 'UAntiCampSelfUnhookMeterPresenter::AntiCampSelfUnhookMeterWidget' has a wrong offset!");

// Class DBDUIPresenters.SubPresenter
// 0x0040 (0x0070 - 0x0030)
class USubPresenter : public UObject
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPresenterStartAsyncOperation();
	void OnPresenterStopAsyncOperation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubPresenter">();
	}
	static class USubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubPresenter>();
	}
};
static_assert(alignof(USubPresenter) == 0x000008, "Wrong alignment on USubPresenter");
static_assert(sizeof(USubPresenter) == 0x000070, "Wrong size on USubPresenter");

// Class DBDUIPresenters.ArchiveCompendiumSubPresenter
// 0x0080 (0x00F0 - 0x0070)
class UArchiveCompendiumSubPresenter final : public USubPresenter
{
public:
	TScriptInterface<class IArchiveCompendiumViewInterface> _archiveCompendiumWidget;                          // 0x0070(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x70];                                      // 0x0080(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTomeSelected(const class FString& TomeId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveCompendiumSubPresenter">();
	}
	static class UArchiveCompendiumSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveCompendiumSubPresenter>();
	}
};
static_assert(alignof(UArchiveCompendiumSubPresenter) == 0x000008, "Wrong alignment on UArchiveCompendiumSubPresenter");
static_assert(sizeof(UArchiveCompendiumSubPresenter) == 0x0000F0, "Wrong size on UArchiveCompendiumSubPresenter");
static_assert(offsetof(UArchiveCompendiumSubPresenter, _archiveCompendiumWidget) == 0x000070, "Member 'UArchiveCompendiumSubPresenter::_archiveCompendiumWidget' has a wrong offset!");

// Class DBDUIPresenters.ArchiveQuestMapSubPresenter
// 0x0200 (0x0270 - 0x0070)
class UArchiveQuestMapSubPresenter : public USubPresenter
{
public:
	uint8                                         Pad_70[0x150];                                     // 0x0070(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IArchiveQuestMapViewInterface> _archiveQuestMapWidget;                            // 0x01C0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IArchiveLevelProgressionViewInterface> _archiveLevelProgressionWidget;                    // 0x01D0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E0[0x60];                                     // 0x01E0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EArchivesStoryLevelStatus>             _storyLevelStatusCache;                            // 0x0240(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x20];                                     // 0x0250(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetCurrentLevel();
	void NavigateToNextLevelAfterUnlock();
	void OnLevelSelected(const int32 LevelIndex);
	void OnNodeSelected(const class FName& NodeId, EPlayerRole Role, const struct FVector2D& Position);
	void OnPlayerCardUpdated(const class FString& badgeId, const class FString& bannerId);
	void OnQuestNodeHovered(EPlayerRole Role);
	void OnQuestNodeUnhovered(EPlayerRole Role);
	void OnTomeLevelRewardAnimationDone();
	void OnTomeMapCreated();
	void UpdateTomeLevels();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveQuestMapSubPresenter">();
	}
	static class UArchiveQuestMapSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveQuestMapSubPresenter>();
	}
};
static_assert(alignof(UArchiveQuestMapSubPresenter) == 0x000008, "Wrong alignment on UArchiveQuestMapSubPresenter");
static_assert(sizeof(UArchiveQuestMapSubPresenter) == 0x000270, "Wrong size on UArchiveQuestMapSubPresenter");
static_assert(offsetof(UArchiveQuestMapSubPresenter, _archiveQuestMapWidget) == 0x0001C0, "Member 'UArchiveQuestMapSubPresenter::_archiveQuestMapWidget' has a wrong offset!");
static_assert(offsetof(UArchiveQuestMapSubPresenter, _archiveLevelProgressionWidget) == 0x0001D0, "Member 'UArchiveQuestMapSubPresenter::_archiveLevelProgressionWidget' has a wrong offset!");
static_assert(offsetof(UArchiveQuestMapSubPresenter, _storyLevelStatusCache) == 0x000240, "Member 'UArchiveQuestMapSubPresenter::_storyLevelStatusCache' has a wrong offset!");

// Class DBDUIPresenters.ArchiveEditorSubPresenter
// 0x0028 (0x0298 - 0x0270)
class UArchiveEditorSubPresenter final : public UArchiveQuestMapSubPresenter
{
public:
	uint8                                         Pad_270[0x18];                                     // 0x0270(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IArchiveEditorViewInterface> _archiveEditorWidget;                              // 0x0288(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSaveTomeGraph(const TArray<struct FArchiveNodeGraphViewData>& NodeList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveEditorSubPresenter">();
	}
	static class UArchiveEditorSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveEditorSubPresenter>();
	}
};
static_assert(alignof(UArchiveEditorSubPresenter) == 0x000008, "Wrong alignment on UArchiveEditorSubPresenter");
static_assert(sizeof(UArchiveEditorSubPresenter) == 0x000298, "Wrong size on UArchiveEditorSubPresenter");
static_assert(offsetof(UArchiveEditorSubPresenter, _archiveEditorWidget) == 0x000288, "Member 'UArchiveEditorSubPresenter::_archiveEditorWidget' has a wrong offset!");

// Class DBDUIPresenters.ArchiveImageViewerPresenter
// 0x0098 (0x0180 - 0x00E8)
class UArchiveImageViewerPresenter final : public UPresenter
{
public:
	TSubclassOf<class UUserWidget>                ArchiveImageViewerWidgetClass;                     // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x90];                                      // 0x00F0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnArchivesVoiceOverAutoplay(bool Autoplay);
	void OnArchivesVoiceOverPlayed(bool Playing);
	void OnBackAction();
	void OnImageViewerVoiceOverAutoplay(bool Autoplay);
	void OnImageViewerVoiceOverPlayed();
	void OnTextVisibilityChanged();

	bool CanShowFullScreenMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveImageViewerPresenter">();
	}
	static class UArchiveImageViewerPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveImageViewerPresenter>();
	}
};
static_assert(alignof(UArchiveImageViewerPresenter) == 0x000008, "Wrong alignment on UArchiveImageViewerPresenter");
static_assert(sizeof(UArchiveImageViewerPresenter) == 0x000180, "Wrong size on UArchiveImageViewerPresenter");
static_assert(offsetof(UArchiveImageViewerPresenter, ArchiveImageViewerWidgetClass) == 0x0000E8, "Member 'UArchiveImageViewerPresenter::ArchiveImageViewerWidgetClass' has a wrong offset!");

// Class DBDUIPresenters.ArchiveJournalSubPresenter
// 0x00D8 (0x0148 - 0x0070)
class UArchiveJournalSubPresenter final : public USubPresenter
{
public:
	uint8                                         Pad_70[0x38];                                      // 0x0070(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IArchiveJournalViewInterface> _archiveJournalWidget;                             // 0x00A8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x90];                                      // 0x00B8(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAutoplayChanged(bool AutoplayActive, int32 EntryIndex);
	void OnClickPlayButton(int32 EntryIndex);
	void OnEntrySelected(int32 EntryIndex);
	void OnImageViewerVoiceOverAutoplay(bool Autoplay);
	void OnImageViewerVoiceOverPlayed();
	void OnPlayCinematic(const int32 Param_Index);
	void OnShowImageViewer();
	void OnVignetteSelected(const class FString& VignetteId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveJournalSubPresenter">();
	}
	static class UArchiveJournalSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveJournalSubPresenter>();
	}
};
static_assert(alignof(UArchiveJournalSubPresenter) == 0x000008, "Wrong alignment on UArchiveJournalSubPresenter");
static_assert(sizeof(UArchiveJournalSubPresenter) == 0x000148, "Wrong size on UArchiveJournalSubPresenter");
static_assert(offsetof(UArchiveJournalSubPresenter, _archiveJournalWidget) == 0x0000A8, "Member 'UArchiveJournalSubPresenter::_archiveJournalWidget' has a wrong offset!");

// Class DBDUIPresenters.ArchiveMenuPresenter
// 0x0158 (0x0240 - 0x00E8)
class UArchiveMenuPresenter final : public UPresenter
{
public:
	TSubclassOf<class UUserWidget>                ArchiveMenuWidgetClass;                            // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArchiveTomeSubPresenter*               _archiveTomeSubPresenter;                          // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArchiveRiftSubPresenter*               _archiveRiftSubPresenter;                          // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArchiveCompendiumSubPresenter*         _archiveCompendiumSubPresenter;                    // 0x0100(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USubPresenter*                          _activeSubPresenter;                               // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x130];                                    // 0x0110(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBackAction();
	void OnChallengeReminderClicked(EPlayerRole Role);
	void OnChallengeReminderSlotSelected(EPlayerRole Role);
	void OnDisplayStandRotationDelegate(float Distance);
	void OnHideImageViewer();
	void OnInfoClicked();
	void OnMenuTabSelected(EArchiveMenuState MenuState, bool AlreadySelected);
	void OnPremiumPassPurchased();
	void OnRiftPackButtonClicked();
	void OnShowImageViewer(bool VoiceOverIsPlaying);
	void OnSlotSelectorClosed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveMenuPresenter">();
	}
	static class UArchiveMenuPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveMenuPresenter>();
	}
};
static_assert(alignof(UArchiveMenuPresenter) == 0x000008, "Wrong alignment on UArchiveMenuPresenter");
static_assert(sizeof(UArchiveMenuPresenter) == 0x000240, "Wrong size on UArchiveMenuPresenter");
static_assert(offsetof(UArchiveMenuPresenter, ArchiveMenuWidgetClass) == 0x0000E8, "Member 'UArchiveMenuPresenter::ArchiveMenuWidgetClass' has a wrong offset!");
static_assert(offsetof(UArchiveMenuPresenter, _archiveTomeSubPresenter) == 0x0000F0, "Member 'UArchiveMenuPresenter::_archiveTomeSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveMenuPresenter, _archiveRiftSubPresenter) == 0x0000F8, "Member 'UArchiveMenuPresenter::_archiveRiftSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveMenuPresenter, _archiveCompendiumSubPresenter) == 0x000100, "Member 'UArchiveMenuPresenter::_archiveCompendiumSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveMenuPresenter, _activeSubPresenter) == 0x000108, "Member 'UArchiveMenuPresenter::_activeSubPresenter' has a wrong offset!");

// Class DBDUIPresenters.BasePopupPresenter
// 0x0080 (0x0168 - 0x00E8)
class UBasePopupPresenter : public UPresenter
{
public:
	EContext                                      ObservedContext;                                   // 0x00E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                PopupWidgetClass;                                  // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWIP;                                             // 0x00F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   WIPPopupWidgetClass;                               // 0x0100(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBasePopupViewData*                     _viewData;                                         // 0x0140(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x20];                                     // 0x0148(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnContextEnter(EContext Context);
	void OnContextLeave(EContext Context);

	bool IsContextEntered() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePopupPresenter">();
	}
	static class UBasePopupPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePopupPresenter>();
	}
};
static_assert(alignof(UBasePopupPresenter) == 0x000008, "Wrong alignment on UBasePopupPresenter");
static_assert(sizeof(UBasePopupPresenter) == 0x000168, "Wrong size on UBasePopupPresenter");
static_assert(offsetof(UBasePopupPresenter, ObservedContext) == 0x0000E8, "Member 'UBasePopupPresenter::ObservedContext' has a wrong offset!");
static_assert(offsetof(UBasePopupPresenter, PopupWidgetClass) == 0x0000F0, "Member 'UBasePopupPresenter::PopupWidgetClass' has a wrong offset!");
static_assert(offsetof(UBasePopupPresenter, IsWIP) == 0x0000F8, "Member 'UBasePopupPresenter::IsWIP' has a wrong offset!");
static_assert(offsetof(UBasePopupPresenter, WIPPopupWidgetClass) == 0x000100, "Member 'UBasePopupPresenter::WIPPopupWidgetClass' has a wrong offset!");
static_assert(offsetof(UBasePopupPresenter, _viewData) == 0x000140, "Member 'UBasePopupPresenter::_viewData' has a wrong offset!");

// Class DBDUIPresenters.GenericPopupPresenter
// 0x0058 (0x01C0 - 0x0168)
class UGenericPopupPresenter : public UBasePopupPresenter
{
public:
	uint8                                         Pad_168[0x58];                                     // 0x0168(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAction(EPopupButtonType PopupAction);
	void OnAppResumed(bool IsAppResumed);
	void OnBack();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericPopupPresenter">();
	}
	static class UGenericPopupPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericPopupPresenter>();
	}
};
static_assert(alignof(UGenericPopupPresenter) == 0x000008, "Wrong alignment on UGenericPopupPresenter");
static_assert(sizeof(UGenericPopupPresenter) == 0x0001C0, "Wrong size on UGenericPopupPresenter");

// Class DBDUIPresenters.ArchivePassPurchasePopupPresenter
// 0x0000 (0x01C0 - 0x01C0)
class UArchivePassPurchasePopupPresenter final : public UGenericPopupPresenter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePassPurchasePopupPresenter">();
	}
	static class UArchivePassPurchasePopupPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchivePassPurchasePopupPresenter>();
	}
};
static_assert(alignof(UArchivePassPurchasePopupPresenter) == 0x000008, "Wrong alignment on UArchivePassPurchasePopupPresenter");
static_assert(sizeof(UArchivePassPurchasePopupPresenter) == 0x0001C0, "Wrong size on UArchivePassPurchasePopupPresenter");

// Class DBDUIPresenters.ArchivePresenterHelper
// 0x0000 (0x0030 - 0x0030)
class UArchivePresenterHelper final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePresenterHelper">();
	}
	static class UArchivePresenterHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchivePresenterHelper>();
	}
};
static_assert(alignof(UArchivePresenterHelper) == 0x000008, "Wrong alignment on UArchivePresenterHelper");
static_assert(sizeof(UArchivePresenterHelper) == 0x000030, "Wrong size on UArchivePresenterHelper");

// Class DBDUIPresenters.ArchiveRiftSubPresenter
// 0x0138 (0x01A8 - 0x0070)
class UArchiveRiftSubPresenter final : public USubPresenter
{
public:
	uint8                                         Pad_70[0x90];                                      // 0x0070(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IArchiveRiftViewInterface> _archiveRiftWidget;                                // 0x0100(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x98];                                     // 0x0110(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBonusTierTooltipShown();
	void OnClickPurchasePremiumPass();
	void OnClickPurchaseTiers();
	void OnPlayMoriClicked();
	void OnPlaySecondMoriClicked();
	void OnRewardCurrencyClicked(const ECurrencyType CurrencyType);
	void OnRewardItemClicked(const class FName ItemId);
	void OnToggleOutfitDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveRiftSubPresenter">();
	}
	static class UArchiveRiftSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveRiftSubPresenter>();
	}
};
static_assert(alignof(UArchiveRiftSubPresenter) == 0x000008, "Wrong alignment on UArchiveRiftSubPresenter");
static_assert(sizeof(UArchiveRiftSubPresenter) == 0x0001A8, "Wrong size on UArchiveRiftSubPresenter");
static_assert(offsetof(UArchiveRiftSubPresenter, _archiveRiftWidget) == 0x000100, "Member 'UArchiveRiftSubPresenter::_archiveRiftWidget' has a wrong offset!");

// Class DBDUIPresenters.ArchiveTierPurchasePopupPresenter
// 0x0010 (0x01D0 - 0x01C0)
class UArchiveTierPurchasePopupPresenter final : public UGenericPopupPresenter
{
public:
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnConfirmPurchase(int32 TiersToPurchaseNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTierPurchasePopupPresenter">();
	}
	static class UArchiveTierPurchasePopupPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTierPurchasePopupPresenter>();
	}
};
static_assert(alignof(UArchiveTierPurchasePopupPresenter) == 0x000008, "Wrong alignment on UArchiveTierPurchasePopupPresenter");
static_assert(sizeof(UArchiveTierPurchasePopupPresenter) == 0x0001D0, "Wrong size on UArchiveTierPurchasePopupPresenter");

// Class DBDUIPresenters.ArchiveTomeSubPresenter
// 0x0090 (0x0100 - 0x0070)
class UArchiveTomeSubPresenter final : public USubPresenter
{
public:
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveQuestMapSubPresenter*           _archiveQuestMapSubPresenter;                      // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArchiveEditorSubPresenter*             _archiveEditorSubPresenter;                        // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArchiveJournalSubPresenter*            _archiveJournalSubPresenter;                       // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USubPresenter*                          _activeSubPresenter;                               // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IArchiveTomeViewInterface> _archiveTomeWidget;                                // 0x00C0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     _archiveSideNavSkinMaterial;                       // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x28];                                      // 0x00D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEditorWidgetSwitchComplete();
	void OnMenuTabSelected(EArchiveTomeMenuState MenuState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveTomeSubPresenter">();
	}
	static class UArchiveTomeSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTomeSubPresenter>();
	}
};
static_assert(alignof(UArchiveTomeSubPresenter) == 0x000008, "Wrong alignment on UArchiveTomeSubPresenter");
static_assert(sizeof(UArchiveTomeSubPresenter) == 0x000100, "Wrong size on UArchiveTomeSubPresenter");
static_assert(offsetof(UArchiveTomeSubPresenter, _archiveQuestMapSubPresenter) == 0x0000A0, "Member 'UArchiveTomeSubPresenter::_archiveQuestMapSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveTomeSubPresenter, _archiveEditorSubPresenter) == 0x0000A8, "Member 'UArchiveTomeSubPresenter::_archiveEditorSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveTomeSubPresenter, _archiveJournalSubPresenter) == 0x0000B0, "Member 'UArchiveTomeSubPresenter::_archiveJournalSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveTomeSubPresenter, _activeSubPresenter) == 0x0000B8, "Member 'UArchiveTomeSubPresenter::_activeSubPresenter' has a wrong offset!");
static_assert(offsetof(UArchiveTomeSubPresenter, _archiveTomeWidget) == 0x0000C0, "Member 'UArchiveTomeSubPresenter::_archiveTomeWidget' has a wrong offset!");
static_assert(offsetof(UArchiveTomeSubPresenter, _archiveSideNavSkinMaterial) == 0x0000D0, "Member 'UArchiveTomeSubPresenter::_archiveSideNavSkinMaterial' has a wrong offset!");

// Class DBDUIPresenters.AuricCellsPresenter
// 0x0098 (0x0180 - 0x00E8)
class UAuricCellsPresenter final : public UPresenter
{
public:
	TSubclassOf<class UUserWidget>                AuricCellsWidgetClass;                             // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuricCellsFirstPurchaseViewData       _firstPurchaseViewData;                            // 0x00F0(0x0068)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x28];                                     // 0x0158(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBackAction();
	void OnBuyAction(class FName bundleId);
	void OnPremiumTransactionCompleted(bool Success, class FName ItemId, const struct FPremiumPurchaseCompleteData& PurchaseCompleteData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuricCellsPresenter">();
	}
	static class UAuricCellsPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuricCellsPresenter>();
	}
};
static_assert(alignof(UAuricCellsPresenter) == 0x000008, "Wrong alignment on UAuricCellsPresenter");
static_assert(sizeof(UAuricCellsPresenter) == 0x000180, "Wrong size on UAuricCellsPresenter");
static_assert(offsetof(UAuricCellsPresenter, AuricCellsWidgetClass) == 0x0000E8, "Member 'UAuricCellsPresenter::AuricCellsWidgetClass' has a wrong offset!");
static_assert(offsetof(UAuricCellsPresenter, _firstPurchaseViewData) == 0x0000F0, "Member 'UAuricCellsPresenter::_firstPurchaseViewData' has a wrong offset!");

// Class DBDUIPresenters.ChallengesMenuChallengeSetSubPresenter
// 0x0060 (0x00D0 - 0x0070)
class UChallengesMenuChallengeSetSubPresenter final : public USubPresenter
{
public:
	class UChallengesMenuRitualsSubPresenter*     _ritualsSubPresenter;                              // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChallengesMenuRewardTrackSubPresenter* _rewardTrackSubPresenter;                          // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChallengesMenuStoreSubPresenter*       _storeSubPresenter;                                // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USubPresenter*                          _activeSubPresenter;                               // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IChallengesMenuChallengeSetViewInterface> _challengesMenuChallengeSetWidget;                 // 0x0090(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x30];                                      // 0x00A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnStoreRedirectionRequested(const struct FCustomizationRewardViewData& SelectedItem);
	void SetChallengeSetState(const EChallengesMenuChallengeSetState State);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuChallengeSetSubPresenter">();
	}
	static class UChallengesMenuChallengeSetSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuChallengeSetSubPresenter>();
	}
};
static_assert(alignof(UChallengesMenuChallengeSetSubPresenter) == 0x000008, "Wrong alignment on UChallengesMenuChallengeSetSubPresenter");
static_assert(sizeof(UChallengesMenuChallengeSetSubPresenter) == 0x0000D0, "Wrong size on UChallengesMenuChallengeSetSubPresenter");
static_assert(offsetof(UChallengesMenuChallengeSetSubPresenter, _ritualsSubPresenter) == 0x000070, "Member 'UChallengesMenuChallengeSetSubPresenter::_ritualsSubPresenter' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetSubPresenter, _rewardTrackSubPresenter) == 0x000078, "Member 'UChallengesMenuChallengeSetSubPresenter::_rewardTrackSubPresenter' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetSubPresenter, _storeSubPresenter) == 0x000080, "Member 'UChallengesMenuChallengeSetSubPresenter::_storeSubPresenter' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetSubPresenter, _activeSubPresenter) == 0x000088, "Member 'UChallengesMenuChallengeSetSubPresenter::_activeSubPresenter' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetSubPresenter, _challengesMenuChallengeSetWidget) == 0x000090, "Member 'UChallengesMenuChallengeSetSubPresenter::_challengesMenuChallengeSetWidget' has a wrong offset!");

// Class DBDUIPresenters.ChallengesMenuPresenter
// 0x0078 (0x0160 - 0x00E8)
class UChallengesMenuPresenter final : public UPresenter
{
public:
	TSoftClassPtr<class UClass>                   ChallengesMenuWidgetClass;                         // 0x00E8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UChallengesMenuChallengeSetSubPresenter*> _subPresenters;                                    // 0x0120(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class USubPresenter*                          _activeSubPresenter;                               // 0x0130(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FChallengeSetViewData>          _challengeSetViewData;                             // 0x0138(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x18];                                     // 0x0148(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBackButtonClicked();
	void OnSettingsButtonClicked();
	void OnStoreRedirectionRequested(const class FString& ChallengeSetId, const EChallengesMenuChallengeSetState& TabState, const struct FCustomizationRewardViewData& SelectedItem);
	void OnTabSelected(const int32 SelectedKey);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuPresenter">();
	}
	static class UChallengesMenuPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuPresenter>();
	}
};
static_assert(alignof(UChallengesMenuPresenter) == 0x000008, "Wrong alignment on UChallengesMenuPresenter");
static_assert(sizeof(UChallengesMenuPresenter) == 0x000160, "Wrong size on UChallengesMenuPresenter");
static_assert(offsetof(UChallengesMenuPresenter, ChallengesMenuWidgetClass) == 0x0000E8, "Member 'UChallengesMenuPresenter::ChallengesMenuWidgetClass' has a wrong offset!");
static_assert(offsetof(UChallengesMenuPresenter, _subPresenters) == 0x000120, "Member 'UChallengesMenuPresenter::_subPresenters' has a wrong offset!");
static_assert(offsetof(UChallengesMenuPresenter, _activeSubPresenter) == 0x000130, "Member 'UChallengesMenuPresenter::_activeSubPresenter' has a wrong offset!");
static_assert(offsetof(UChallengesMenuPresenter, _challengeSetViewData) == 0x000138, "Member 'UChallengesMenuPresenter::_challengeSetViewData' has a wrong offset!");

// Class DBDUIPresenters.ChallengesMenuRewardTrackSubPresenter
// 0x0038 (0x00A8 - 0x0070)
class UChallengesMenuRewardTrackSubPresenter final : public USubPresenter
{
public:
	TScriptInterface<class IChallengesMenuRewardTrackViewInterface> _challengesMenuRewardTrackWidget;                  // 0x0070(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRewardCurrencyClicked(ECurrencyType CurrencyType);
	void OnRewardItemClicked(class FName ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRewardTrackSubPresenter">();
	}
	static class UChallengesMenuRewardTrackSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuRewardTrackSubPresenter>();
	}
};
static_assert(alignof(UChallengesMenuRewardTrackSubPresenter) == 0x000008, "Wrong alignment on UChallengesMenuRewardTrackSubPresenter");
static_assert(sizeof(UChallengesMenuRewardTrackSubPresenter) == 0x0000A8, "Wrong size on UChallengesMenuRewardTrackSubPresenter");
static_assert(offsetof(UChallengesMenuRewardTrackSubPresenter, _challengesMenuRewardTrackWidget) == 0x000070, "Member 'UChallengesMenuRewardTrackSubPresenter::_challengesMenuRewardTrackWidget' has a wrong offset!");

// Class DBDUIPresenters.ChallengesMenuRitualsSubPresenter
// 0x0038 (0x00A8 - 0x0070)
class UChallengesMenuRitualsSubPresenter final : public USubPresenter
{
public:
	TScriptInterface<class IChallengesMenuRitualsViewInterface> _challengesMenuRitualsWidget;                      // 0x0070(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChallengeItemSelected(const class FString& ChallengeId);
	void OnSearchBarTextChanged(const class FString& EnteredText);
	void OnSortingChanged(ESortingOption Sorting, ESortingOrder Order);
	void RefreshChallengesList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRitualsSubPresenter">();
	}
	static class UChallengesMenuRitualsSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuRitualsSubPresenter>();
	}
};
static_assert(alignof(UChallengesMenuRitualsSubPresenter) == 0x000008, "Wrong alignment on UChallengesMenuRitualsSubPresenter");
static_assert(sizeof(UChallengesMenuRitualsSubPresenter) == 0x0000A8, "Wrong size on UChallengesMenuRitualsSubPresenter");
static_assert(offsetof(UChallengesMenuRitualsSubPresenter, _challengesMenuRitualsWidget) == 0x000070, "Member 'UChallengesMenuRitualsSubPresenter::_challengesMenuRitualsWidget' has a wrong offset!");

// Class DBDUIPresenters.ChallengesMenuStoreSubPresenter
// 0x0060 (0x00D0 - 0x0070)
class UChallengesMenuStoreSubPresenter final : public USubPresenter
{
public:
	TScriptInterface<class IChallengesMenuStoreViewInterface> _challengesMenuStoreWidget;                        // 0x0070(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UStoreCustomizationItemViewData*> _itemsData;                                        // 0x0080(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UStoreCustomizationItemViewData*> _previewAreaItemsData;                             // 0x0090(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x30];                                      // 0x00A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCustomizationGridItemClicked(const int32 SelectedIndex);
	void OnPreviewAreaItemClicked(const int32 SelectedIndex);
	void OnStoreButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuStoreSubPresenter">();
	}
	static class UChallengesMenuStoreSubPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuStoreSubPresenter>();
	}
};
static_assert(alignof(UChallengesMenuStoreSubPresenter) == 0x000008, "Wrong alignment on UChallengesMenuStoreSubPresenter");
static_assert(sizeof(UChallengesMenuStoreSubPresenter) == 0x0000D0, "Wrong size on UChallengesMenuStoreSubPresenter");
static_assert(offsetof(UChallengesMenuStoreSubPresenter, _challengesMenuStoreWidget) == 0x000070, "Member 'UChallengesMenuStoreSubPresenter::_challengesMenuStoreWidget' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreSubPresenter, _itemsData) == 0x000080, "Member 'UChallengesMenuStoreSubPresenter::_itemsData' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreSubPresenter, _previewAreaItemsData) == 0x000090, "Member 'UChallengesMenuStoreSubPresenter::_previewAreaItemsData' has a wrong offset!");

// Class DBDUIPresenters.ChallengeTrackerPresenter
// 0x0078 (0x01A0 - 0x0128)
class UChallengeTrackerPresenter final : public UHudPresenter
{
public:
	TSubclassOf<class UUserWidget>                ChallengeTrackerContainerWidgetClass;              // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReadingTimeDelaySec;                               // 0x0130(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_134[0x6C];                                     // 0x0134(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindToQuestRepetitionEvents();
	void OnQuestEventRepetitionValueChanged(int32 Value, const class FString& QuestEventIdTracked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengeTrackerPresenter">();
	}
	static class UChallengeTrackerPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeTrackerPresenter>();
	}
};
static_assert(alignof(UChallengeTrackerPresenter) == 0x000008, "Wrong alignment on UChallengeTrackerPresenter");
static_assert(sizeof(UChallengeTrackerPresenter) == 0x0001A0, "Wrong size on UChallengeTrackerPresenter");
static_assert(offsetof(UChallengeTrackerPresenter, ChallengeTrackerContainerWidgetClass) == 0x000128, "Member 'UChallengeTrackerPresenter::ChallengeTrackerContainerWidgetClass' has a wrong offset!");
static_assert(offsetof(UChallengeTrackerPresenter, ReadingTimeDelaySec) == 0x000130, "Member 'UChallengeTrackerPresenter::ReadingTimeDelaySec' has a wrong offset!");

// Class DBDUIPresenters.CharacterSelectionManager
// 0x00D8 (0x0108 - 0x0030)
class UCharacterSelectionManager final : public UObject
{
public:
	uint8                                         Pad_30[0x90];                                      // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStoreCharacterItemViewData*>    _characters;                                       // 0x00C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UStoreCharacterItemViewData*            _selectedCharacter;                                // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStoreCharacterItemViewData*            _lastEquippedCharacter;                            // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
