#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewsCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DBDInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "UITween_structs.hpp"
#include "DBDUIManagers_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Slate_structs.hpp"
#include "NewsAndMessagesCommon_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreCommonUIUtils_structs.hpp"
#include "PreviewScene_structs.hpp"


namespace SDK
{

// Class DBDUIViewsCore.CoreBaseUserWidget
// 0x0078 (0x0320 - 0x02A8)
class UCoreBaseUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_2A8[0x10];                                     // 0x02A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBox*                              ScaleContainer;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsInteractive;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EControlMode                                  _controlMode;                                      // 0x02C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EScaleType                                    ScaleType;                                         // 0x02C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDInputManager*                       _inputManager;                                     // 0x02C8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UWidgetAnimation*>    _animationMap;                                     // 0x02D0(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	void DeregisterFromInput();
	void OnControlModeChangedBP(EControlMode ControlMode);
	bool PlayAnimationByName(class FName AnimName, float Starttime, int32 Loopcount, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	const class UWidgetAnimation* PlayAnimationByNameWithFinishedDelegate(class FName AnimName, TDelegate<void()> AnimationFinishedDelegate, float Starttime, int32 Loopcount, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void RegisterForInput();
	bool StopAnimationByName(class FName AnimName);
	void UpdateScale(float Scale);

	class UWidgetAnimation* GetAnimationByName(class FName AnimName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CoreBaseUserWidget">();
	}
	static class UCoreBaseUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreBaseUserWidget>();
	}
};
static_assert(alignof(UCoreBaseUserWidget) == 0x000008, "Wrong alignment on UCoreBaseUserWidget");
static_assert(sizeof(UCoreBaseUserWidget) == 0x000320, "Wrong size on UCoreBaseUserWidget");
static_assert(offsetof(UCoreBaseUserWidget, ScaleContainer) == 0x0002B8, "Member 'UCoreBaseUserWidget::ScaleContainer' has a wrong offset!");
static_assert(offsetof(UCoreBaseUserWidget, IsInteractive) == 0x0002C0, "Member 'UCoreBaseUserWidget::IsInteractive' has a wrong offset!");
static_assert(offsetof(UCoreBaseUserWidget, _controlMode) == 0x0002C1, "Member 'UCoreBaseUserWidget::_controlMode' has a wrong offset!");
static_assert(offsetof(UCoreBaseUserWidget, ScaleType) == 0x0002C2, "Member 'UCoreBaseUserWidget::ScaleType' has a wrong offset!");
static_assert(offsetof(UCoreBaseUserWidget, _inputManager) == 0x0002C8, "Member 'UCoreBaseUserWidget::_inputManager' has a wrong offset!");
static_assert(offsetof(UCoreBaseUserWidget, _animationMap) == 0x0002D0, "Member 'UCoreBaseUserWidget::_animationMap' has a wrong offset!");

// Class DBDUIViewsCore.BaseFilterWidget
// 0x0078 (0x0398 - 0x0320)
class UBaseFilterWidget : public UCoreBaseUserWidget
{
public:
	class UDBDTextBlock*                          TitleTB;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreButtonWidget*                      ClearFiltersButton;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           CheckBoxesContainer;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _defaultFilterAvailable;                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _defaultFilterOwned;                               // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _sortingOptions;                                   // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESortingOption                                _defaultSortingOption;                             // 0x0340(0x0002)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESortingOrder                                 _defaultSortingOrder;                              // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCoreFilterButtonWidget*>        _filtersCheckBoxArray;                             // 0x0348(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UWidget*>                        _ignoreClickWidgets;                               // 0x0358(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          _isShowing;                                        // 0x0368(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreSortingWidget*                     SortButton;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             _onWidgetVisibilityChanged;                        // 0x0378(0x0010)(ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	uint8                                         Pad_388[0x10];                                     // 0x0388(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCheckBoxToggled();
	void OnPlayerClick(const struct FPointerEvent& PointerEvent);
	void OnWidgetVisibilityChanged(ESlateVisibility NewVisibility);
	void ToggleWidgetVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseFilterWidget">();
	}
	static class UBaseFilterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseFilterWidget>();
	}
};
static_assert(alignof(UBaseFilterWidget) == 0x000008, "Wrong alignment on UBaseFilterWidget");
static_assert(sizeof(UBaseFilterWidget) == 0x000398, "Wrong size on UBaseFilterWidget");
static_assert(offsetof(UBaseFilterWidget, TitleTB) == 0x000320, "Member 'UBaseFilterWidget::TitleTB' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, ClearFiltersButton) == 0x000328, "Member 'UBaseFilterWidget::ClearFiltersButton' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, CheckBoxesContainer) == 0x000330, "Member 'UBaseFilterWidget::CheckBoxesContainer' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _defaultFilterAvailable) == 0x000338, "Member 'UBaseFilterWidget::_defaultFilterAvailable' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _defaultFilterOwned) == 0x000339, "Member 'UBaseFilterWidget::_defaultFilterOwned' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _sortingOptions) == 0x00033C, "Member 'UBaseFilterWidget::_sortingOptions' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _defaultSortingOption) == 0x000340, "Member 'UBaseFilterWidget::_defaultSortingOption' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _defaultSortingOrder) == 0x000342, "Member 'UBaseFilterWidget::_defaultSortingOrder' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _filtersCheckBoxArray) == 0x000348, "Member 'UBaseFilterWidget::_filtersCheckBoxArray' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _ignoreClickWidgets) == 0x000358, "Member 'UBaseFilterWidget::_ignoreClickWidgets' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _isShowing) == 0x000368, "Member 'UBaseFilterWidget::_isShowing' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, SortButton) == 0x000370, "Member 'UBaseFilterWidget::SortButton' has a wrong offset!");
static_assert(offsetof(UBaseFilterWidget, _onWidgetVisibilityChanged) == 0x000378, "Member 'UBaseFilterWidget::_onWidgetVisibilityChanged' has a wrong offset!");

// Class DBDUIViewsCore.CoreChallengeFilterWidget
// 0x0020 (0x03B8 - 0x0398)
class UCoreChallengeFilterWidget final : public UBaseFilterWidget
{
public:
	FMulticastInlineDelegateProperty_             _onClearFiltersClicked;                            // 0x0398(0x0010)(ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             _onFiltersChanged;                                 // 0x03A8(0x0010)(ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected)

public:
	void OnClearFiltersClicked(class UCoreButtonWidget* buttonTarget);
	void OnSortingChanged(ESortingOption Sorting, ESortingOrder Order);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CoreChallengeFilterWidget">();
	}
	static class UCoreChallengeFilterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreChallengeFilterWidget>();
	}
};
static_assert(alignof(UCoreChallengeFilterWidget) == 0x000008, "Wrong alignment on UCoreChallengeFilterWidget");
static_assert(sizeof(UCoreChallengeFilterWidget) == 0x0003B8, "Wrong size on UCoreChallengeFilterWidget");
static_assert(offsetof(UCoreChallengeFilterWidget, _onClearFiltersClicked) == 0x000398, "Member 'UCoreChallengeFilterWidget::_onClearFiltersClicked' has a wrong offset!");
static_assert(offsetof(UCoreChallengeFilterWidget, _onFiltersChanged) == 0x0003A8, "Member 'UCoreChallengeFilterWidget::_onFiltersChanged' has a wrong offset!");

// Class DBDUIViewsCore.AnimationDelegates
// 0x0000 (0x0030 - 0x0030)
class UAnimationDelegates final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimationDelegates">();
	}
	static class UAnimationDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimationDelegates>();
	}
};
static_assert(alignof(UAnimationDelegates) == 0x000008, "Wrong alignment on UAnimationDelegates");
static_assert(sizeof(UAnimationDelegates) == 0x000030, "Wrong size on UAnimationDelegates");

// Class DBDUIViewsCore.TooltipWidget
// 0x0010 (0x0330 - 0x0320)
class UTooltipWidget : public UCoreBaseUserWidget
{
public:
	struct FMargin                                _tooltipMargin;                                    // 0x0320(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnHideTooltip();
	void OnShowTooltip();

	ETooltipPriority GetPriority() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TooltipWidget">();
	}
	static class UTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipWidget>();
	}
};
static_assert(alignof(UTooltipWidget) == 0x000008, "Wrong alignment on UTooltipWidget");
static_assert(sizeof(UTooltipWidget) == 0x000330, "Wrong size on UTooltipWidget");
static_assert(offsetof(UTooltipWidget, _tooltipMargin) == 0x000320, "Member 'UTooltipWidget::_tooltipMargin' has a wrong offset!");

// Class DBDUIViewsCore.ArchiveCompendiumTooltipWidget
// 0x0018 (0x0348 - 0x0330)
class UArchiveCompendiumTooltipWidget : public UTooltipWidget
{
public:
	class UDBDTextBlock*                          TomeTitleTB;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                          DescriptionTB;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreStoryLevelsSelectorWidget*         StoryLevelsSelector;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Reset();
	void SetTooltipData(const struct FCompendiumButtonData& TooltipViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveCompendiumTooltipWidget">();
	}
	static class UArchiveCompendiumTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveCompendiumTooltipWidget>();
	}
};
static_assert(alignof(UArchiveCompendiumTooltipWidget) == 0x000008, "Wrong alignment on UArchiveCompendiumTooltipWidget");
static_assert(sizeof(UArchiveCompendiumTooltipWidget) == 0x000348, "Wrong size on UArchiveCompendiumTooltipWidget");
static_assert(offsetof(UArchiveCompendiumTooltipWidget, TomeTitleTB) == 0x000330, "Member 'UArchiveCompendiumTooltipWidget::TomeTitleTB' has a wrong offset!");
static_assert(offsetof(UArchiveCompendiumTooltipWidget, DescriptionTB) == 0x000338, "Member 'UArchiveCompendiumTooltipWidget::DescriptionTB' has a wrong offset!");
static_assert(offsetof(UArchiveCompendiumTooltipWidget, StoryLevelsSelector) == 0x000340, "Member 'UArchiveCompendiumTooltipWidget::StoryLevelsSelector' has a wrong offset!");

// Class DBDUIViewsCore.ArchiveNodeTooltipWidget
// 0x0050 (0x0380 - 0x0330)
class UArchiveNodeTooltipWidget : public UTooltipWidget
{
public:
	class UDBDImage*                              BackgroundIMG;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDImage*                              RarityIMG;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                          NodeTitleTB;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                          SubtitleTB;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                      NodeDescriptionRTB;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCoreArchiveObjectiveWidget> ObjectiveWidgetClass;                              // 0x0358(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCoreCurrencyForTooltipsWidget> RewardWidgetClass;                                 // 0x0360(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ArchiveObjectivesContainer;                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         RewardsContainer;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                      VignetteRTB;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Reset();
	void SetNodeType(EArchiveNodeType Type);
	void SetTooltipData(const struct FArchiveNodeViewData& NodeViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveNodeTooltipWidget">();
	}
	static class UArchiveNodeTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveNodeTooltipWidget>();
	}
};
static_assert(alignof(UArchiveNodeTooltipWidget) == 0x000008, "Wrong alignment on UArchiveNodeTooltipWidget");
static_assert(sizeof(UArchiveNodeTooltipWidget) == 0x000380, "Wrong size on UArchiveNodeTooltipWidget");
static_assert(offsetof(UArchiveNodeTooltipWidget, BackgroundIMG) == 0x000330, "Member 'UArchiveNodeTooltipWidget::BackgroundIMG' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, RarityIMG) == 0x000338, "Member 'UArchiveNodeTooltipWidget::RarityIMG' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, NodeTitleTB) == 0x000340, "Member 'UArchiveNodeTooltipWidget::NodeTitleTB' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, SubtitleTB) == 0x000348, "Member 'UArchiveNodeTooltipWidget::SubtitleTB' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, NodeDescriptionRTB) == 0x000350, "Member 'UArchiveNodeTooltipWidget::NodeDescriptionRTB' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, ObjectiveWidgetClass) == 0x000358, "Member 'UArchiveNodeTooltipWidget::ObjectiveWidgetClass' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, RewardWidgetClass) == 0x000360, "Member 'UArchiveNodeTooltipWidget::RewardWidgetClass' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, ArchiveObjectivesContainer) == 0x000368, "Member 'UArchiveNodeTooltipWidget::ArchiveObjectivesContainer' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, RewardsContainer) == 0x000370, "Member 'UArchiveNodeTooltipWidget::RewardsContainer' has a wrong offset!");
static_assert(offsetof(UArchiveNodeTooltipWidget, VignetteRTB) == 0x000378, "Member 'UArchiveNodeTooltipWidget::VignetteRTB' has a wrong offset!");

// Class DBDUIViewsCore.ArchivePassTooltipWidget
// 0x0028 (0x0358 - 0x0330)
class UArchivePassTooltipWidget : public UTooltipWidget
{
public:
	float                                         _priceTagScaleFactor;                              // 0x0330(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDTextBlock*                          TitleTB;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                          SubtitleTB;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                      DescriptionRTB;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCorePriceTagWidget*                    PriceTag;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetTooltipData(const struct FArchivePassTooltipViewData& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchivePassTooltipWidget">();
	}
	static class UArchivePassTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchivePassTooltipWidget>();
	}
};
static_assert(alignof(UArchivePassTooltipWidget) == 0x000008, "Wrong alignment on UArchivePassTooltipWidget");
static_assert(sizeof(UArchivePassTooltipWidget) == 0x000358, "Wrong size on UArchivePassTooltipWidget");
static_assert(offsetof(UArchivePassTooltipWidget, _priceTagScaleFactor) == 0x000330, "Member 'UArchivePassTooltipWidget::_priceTagScaleFactor' has a wrong offset!");
static_assert(offsetof(UArchivePassTooltipWidget, TitleTB) == 0x000338, "Member 'UArchivePassTooltipWidget::TitleTB' has a wrong offset!");
static_assert(offsetof(UArchivePassTooltipWidget, SubtitleTB) == 0x000340, "Member 'UArchivePassTooltipWidget::SubtitleTB' has a wrong offset!");
static_assert(offsetof(UArchivePassTooltipWidget, DescriptionRTB) == 0x000348, "Member 'UArchivePassTooltipWidget::DescriptionRTB' has a wrong offset!");
static_assert(offsetof(UArchivePassTooltipWidget, PriceTag) == 0x000350, "Member 'UArchivePassTooltipWidget::PriceTag' has a wrong offset!");

// Class DBDUIViewsCore.ArchiveRewardNodeTooltipWidget
// 0x0010 (0x0340 - 0x0330)
class UArchiveRewardNodeTooltipWidget : public UTooltipWidget
{
public:
	class UCustomizationTooltipWidget*            CustomizationTooltip;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurrencyProgressionTooltipWidget*      CurrencyProgressionTooltip;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArchiveRewardNodeTooltipWidget">();
	}
	static class UArchiveRewardNodeTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveRewardNodeTooltipWidget>();
	}
};
static_assert(alignof(UArchiveRewardNodeTooltipWidget) == 0x000008, "Wrong alignment on UArchiveRewardNodeTooltipWidget");
static_assert(sizeof(UArchiveRewardNodeTooltipWidget) == 0x000340, "Wrong size on UArchiveRewardNodeTooltipWidget");
static_assert(offsetof(UArchiveRewardNodeTooltipWidget, CustomizationTooltip) == 0x000330, "Member 'UArchiveRewardNodeTooltipWidget::CustomizationTooltip' has a wrong offset!");
static_assert(offsetof(UArchiveRewardNodeTooltipWidget, CurrencyProgressionTooltip) == 0x000338, "Member 'UArchiveRewardNodeTooltipWidget::CurrencyProgressionTooltip' has a wrong offset!");

// Class DBDUIViewsCore.AspectRatioBox
// 0x0018 (0x01A0 - 0x0188)
class UAspectRatioBox final : public UContentWidget
{
public:
	float                                         AspectRatio;                                       // 0x0188(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IsAspectRatioOverridden : 1;                       // 0x018C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_18D[0x13];                                     // 0x018D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAspectRatio();
	void SetAspectRatio(float InAspectRatio);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AspectRatioBox">();
	}
	static class UAspectRatioBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAspectRatioBox>();
	}
};
static_assert(alignof(UAspectRatioBox) == 0x000008, "Wrong alignment on UAspectRatioBox");
static_assert(sizeof(UAspectRatioBox) == 0x0001A0, "Wrong size on UAspectRatioBox");
static_assert(offsetof(UAspectRatioBox, AspectRatio) == 0x000188, "Member 'UAspectRatioBox::AspectRatio' has a wrong offset!");

// Class DBDUIViewsCore.AspectRatioBoxSlot
// 0x0028 (0x0068 - 0x0040)
class UAspectRatioBoxSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0051(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x16];                                      // 0x0052(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AspectRatioBoxSlot">();
	}
	static class UAspectRatioBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAspectRatioBoxSlot>();
	}
};
static_assert(alignof(UAspectRatioBoxSlot) == 0x000008, "Wrong alignment on UAspectRatioBoxSlot");
static_assert(sizeof(UAspectRatioBoxSlot) == 0x000068, "Wrong size on UAspectRatioBoxSlot");
static_assert(offsetof(UAspectRatioBoxSlot, Padding) == 0x000040, "Member 'UAspectRatioBoxSlot::Padding' has a wrong offset!");
static_assert(offsetof(UAspectRatioBoxSlot, HorizontalAlignment) == 0x000050, "Member 'UAspectRatioBoxSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UAspectRatioBoxSlot, VerticalAlignment) == 0x000051, "Member 'UAspectRatioBoxSlot::VerticalAlignment' has a wrong offset!");

// Class DBDUIViewsCore.AudioEventWrapper
// 0x0018 (0x0048 - 0x0030)
class UAudioEventWrapper final : public UObject
{
public:
	class FString                                 SfxName;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          SfxEvent;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void PostAudioEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioEventWrapper">();
	}
	static class UAudioEventWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioEventWrapper>();
	}
};
static_assert(alignof(UAudioEventWrapper) == 0x000008, "Wrong alignment on UAudioEventWrapper");
static_assert(sizeof(UAudioEventWrapper) == 0x000048, "Wrong size on UAudioEventWrapper");
static_assert(offsetof(UAudioEventWrapper, SfxName) == 0x000030, "Member 'UAudioEventWrapper::SfxName' has a wrong offset!");
static_assert(offsetof(UAudioEventWrapper, SfxEvent) == 0x000040, "Member 'UAudioEventWrapper::SfxEvent' has a wrong offset!");

// Class DBDUIViewsCore.CoreTabContentWidget
// 0x0020 (0x0340 - 0x0320)
class UCoreTabContentWidget : public UCoreBaseUserWidget
{
public:
	TArray<class UWidget*>                        ContentWidgets;                                    // 0x0320(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	float                                         _contentFadeInTime;                                // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEasingType                                   _contentFadeInEasing;                              // 0x0334(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _contentFadeOutTime;                               // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEasingType                                   _contentFadeOutEasing;                             // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FadeInContent();
	void FadeOutContent();
	void ResetFade();
	void StopFadeInTweening(float OpacityValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CoreTabContentWidget">();
	}
	static class UCoreTabContentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreTabContentWidget>();
	}
};
static_assert(alignof(UCoreTabContentWidget) == 0x000008, "Wrong alignment on UCoreTabContentWidget");
static_assert(sizeof(UCoreTabContentWidget) == 0x000340, "Wrong size on UCoreTabContentWidget");
static_assert(offsetof(UCoreTabContentWidget, ContentWidgets) == 0x000320, "Member 'UCoreTabContentWidget::ContentWidgets' has a wrong offset!");
static_assert(offsetof(UCoreTabContentWidget, _contentFadeInTime) == 0x000330, "Member 'UCoreTabContentWidget::_contentFadeInTime' has a wrong offset!");
static_assert(offsetof(UCoreTabContentWidget, _contentFadeInEasing) == 0x000334, "Member 'UCoreTabContentWidget::_contentFadeInEasing' has a wrong offset!");
static_assert(offsetof(UCoreTabContentWidget, _contentFadeOutTime) == 0x000338, "Member 'UCoreTabContentWidget::_contentFadeOutTime' has a wrong offset!");
static_assert(offsetof(UCoreTabContentWidget, _contentFadeOutEasing) == 0x00033C, "Member 'UCoreTabContentWidget::_contentFadeOutEasing' has a wrong offset!");

// Class DBDUIViewsCore.ChallengesMenuChallengeSetWidget
// 0x00A8 (0x03E8 - 0x0340)
class UChallengesMenuChallengeSetWidget final : public UCoreTabContentWidget
{
public:
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreTabContainerWidget*                TabsContainer;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetSwitcher*                        TabContentSwitcher;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             _eventSkinDataTable;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoClear, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FChallengeSkinUIData                   _skinData;                                         // 0x0360(0x0078)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             _challengeSetTabSelectedDelegate;                  // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected)

public:
	void OnChallengeSetTabSelected(class UCoreSelectableButtonWidget* SelectedButton);
	void RefreshMenuSkin();

	const struct FChallengeSkinUIData GetSkinData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuChallengeSetWidget">();
	}
	static class UChallengesMenuChallengeSetWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuChallengeSetWidget>();
	}
};
static_assert(alignof(UChallengesMenuChallengeSetWidget) == 0x000008, "Wrong alignment on UChallengesMenuChallengeSetWidget");
static_assert(sizeof(UChallengesMenuChallengeSetWidget) == 0x0003E8, "Wrong size on UChallengesMenuChallengeSetWidget");
static_assert(offsetof(UChallengesMenuChallengeSetWidget, TabsContainer) == 0x000348, "Member 'UChallengesMenuChallengeSetWidget::TabsContainer' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetWidget, TabContentSwitcher) == 0x000350, "Member 'UChallengesMenuChallengeSetWidget::TabContentSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetWidget, _eventSkinDataTable) == 0x000358, "Member 'UChallengesMenuChallengeSetWidget::_eventSkinDataTable' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetWidget, _skinData) == 0x000360, "Member 'UChallengesMenuChallengeSetWidget::_skinData' has a wrong offset!");
static_assert(offsetof(UChallengesMenuChallengeSetWidget, _challengeSetTabSelectedDelegate) == 0x0003D8, "Member 'UChallengesMenuChallengeSetWidget::_challengeSetTabSelectedDelegate' has a wrong offset!");

// Class DBDUIViewsCore.ChallengesMenuRewardTrackTierItem
// 0x0040 (0x02E8 - 0x02A8)
class UChallengesMenuRewardTrackTierItem final : public UUserWidget
{
public:
	TSubclassOf<class UCoreRewardWrapperWidget>   RewardWrapperWidgetClass;                          // 0x02A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             _itemClickedDelegate;                              // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	class UGridPanel*                             RewardsContainer;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCoreRewardWrapperWidget*>       _rewardWidgets;                                    // 0x02C8(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          _unlockAnimationCompleteSound;                     // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();
	void OnRewardClicked(class UCoreButtonWidget* Button);
	void SetGenericData(const struct FChallengeSetRewardTrackTierInfoViewData& Data);
	void SetLockedState(const bool IsLocked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRewardTrackTierItem">();
	}
	static class UChallengesMenuRewardTrackTierItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuRewardTrackTierItem>();
	}
};
static_assert(alignof(UChallengesMenuRewardTrackTierItem) == 0x000008, "Wrong alignment on UChallengesMenuRewardTrackTierItem");
static_assert(sizeof(UChallengesMenuRewardTrackTierItem) == 0x0002E8, "Wrong size on UChallengesMenuRewardTrackTierItem");
static_assert(offsetof(UChallengesMenuRewardTrackTierItem, RewardWrapperWidgetClass) == 0x0002A8, "Member 'UChallengesMenuRewardTrackTierItem::RewardWrapperWidgetClass' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackTierItem, _itemClickedDelegate) == 0x0002B0, "Member 'UChallengesMenuRewardTrackTierItem::_itemClickedDelegate' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackTierItem, RewardsContainer) == 0x0002C0, "Member 'UChallengesMenuRewardTrackTierItem::RewardsContainer' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackTierItem, _rewardWidgets) == 0x0002C8, "Member 'UChallengesMenuRewardTrackTierItem::_rewardWidgets' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackTierItem, _unlockAnimationCompleteSound) == 0x0002D8, "Member 'UChallengesMenuRewardTrackTierItem::_unlockAnimationCompleteSound' has a wrong offset!");

// Class DBDUIViewsCore.ChallengesMenuRewardTrackWidget
// 0x0148 (0x0488 - 0x0340)
class UChallengesMenuRewardTrackWidget final : public UCoreTabContentWidget
{
public:
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             _eventSkinDataTable;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UChallengesMenuRewardTrackTierItem> RewardTrackTierItemClass;                          // 0x0350(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxTierItemsPerPage;                               // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PageSwitchFadeDuration;                            // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEasingType                                   PageSwitchFadeTweenEasing;                         // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         TierItemGrid;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                          PaginationTB;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputSwitcherWidget*               PaginationPreviousButton;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputSwitcherWidget*               PaginationNextButton;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreImagePreviewAreaWidget*            PreviewArea;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreLargeCurrencyIconWidget*           CurrencyPreview;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                      AdditionalDescriptionText;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UChallengesMenuRewardTrackTierItem*> TierItemPool;                                      // 0x03A0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	int32                                         CurrentPage;                                       // 0x03B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       PageSwitchVisibilityTween;                         // 0x03B8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCoreSelectableButtonWidget*            CurrentSelectedReward;                             // 0x03C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             _rewardItemClickedDelegate;                        // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             _rewardCurrencyClickedDelegate;                    // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0xA0];                                     // 0x03E8(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisplayPage(class UUITweenInstance* Tween);
	void OnNextButtonClicked();
	void OnPreviousButtonClicked();
	void OnRewardItemClicked(int32 Tier, class UCoreButtonWidget* Button, int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRewardTrackWidget">();
	}
	static class UChallengesMenuRewardTrackWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuRewardTrackWidget>();
	}
};
static_assert(alignof(UChallengesMenuRewardTrackWidget) == 0x000008, "Wrong alignment on UChallengesMenuRewardTrackWidget");
static_assert(sizeof(UChallengesMenuRewardTrackWidget) == 0x000488, "Wrong size on UChallengesMenuRewardTrackWidget");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, _eventSkinDataTable) == 0x000348, "Member 'UChallengesMenuRewardTrackWidget::_eventSkinDataTable' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, RewardTrackTierItemClass) == 0x000350, "Member 'UChallengesMenuRewardTrackWidget::RewardTrackTierItemClass' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, MaxTierItemsPerPage) == 0x000358, "Member 'UChallengesMenuRewardTrackWidget::MaxTierItemsPerPage' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PageSwitchFadeDuration) == 0x00035C, "Member 'UChallengesMenuRewardTrackWidget::PageSwitchFadeDuration' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PageSwitchFadeTweenEasing) == 0x000360, "Member 'UChallengesMenuRewardTrackWidget::PageSwitchFadeTweenEasing' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, TierItemGrid) == 0x000368, "Member 'UChallengesMenuRewardTrackWidget::TierItemGrid' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PaginationTB) == 0x000370, "Member 'UChallengesMenuRewardTrackWidget::PaginationTB' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PaginationPreviousButton) == 0x000378, "Member 'UChallengesMenuRewardTrackWidget::PaginationPreviousButton' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PaginationNextButton) == 0x000380, "Member 'UChallengesMenuRewardTrackWidget::PaginationNextButton' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PreviewArea) == 0x000388, "Member 'UChallengesMenuRewardTrackWidget::PreviewArea' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, CurrencyPreview) == 0x000390, "Member 'UChallengesMenuRewardTrackWidget::CurrencyPreview' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, AdditionalDescriptionText) == 0x000398, "Member 'UChallengesMenuRewardTrackWidget::AdditionalDescriptionText' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, TierItemPool) == 0x0003A0, "Member 'UChallengesMenuRewardTrackWidget::TierItemPool' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, CurrentPage) == 0x0003B0, "Member 'UChallengesMenuRewardTrackWidget::CurrentPage' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, PageSwitchVisibilityTween) == 0x0003B8, "Member 'UChallengesMenuRewardTrackWidget::PageSwitchVisibilityTween' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, CurrentSelectedReward) == 0x0003C0, "Member 'UChallengesMenuRewardTrackWidget::CurrentSelectedReward' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, _rewardItemClickedDelegate) == 0x0003C8, "Member 'UChallengesMenuRewardTrackWidget::_rewardItemClickedDelegate' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRewardTrackWidget, _rewardCurrencyClickedDelegate) == 0x0003D8, "Member 'UChallengesMenuRewardTrackWidget::_rewardCurrencyClickedDelegate' has a wrong offset!");

// Class DBDUIViewsCore.RichTextHTMLDecorator
// 0x0000 (0x0030 - 0x0030)
class URichTextHTMLDecorator final : public URichTextBlockDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextHTMLDecorator">();
	}
	static class URichTextHTMLDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextHTMLDecorator>();
	}
};
static_assert(alignof(URichTextHTMLDecorator) == 0x000008, "Wrong alignment on URichTextHTMLDecorator");
static_assert(sizeof(URichTextHTMLDecorator) == 0x000030, "Wrong size on URichTextHTMLDecorator");

// Class DBDUIViewsCore.ChallengesMenuRitualsWidget
// 0x0108 (0x0448 - 0x0340)
class UChallengesMenuRitualsWidget final : public UCoreTabContentWidget
{
public:
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCoreChallengeCardWidget>   ChallengeCardWidgetClass;                          // 0x0348(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreChallengeDetailsWidget*            ChallengeDetailsWidget;                            // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ChallengeCardsVerticalBox;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCoreChallengeCardWidget*>       _challengeCards;                                   // 0x0360(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UCoreSelectableButtonWidget*            _currentSelectedButton;                            // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                      AdditionalDescriptionText;                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FChallengeSetMenuViewData              _challengeSetData;                                 // 0x0380(0x0078)(Protected, NativeAccessSpecifierProtected)
	TScriptInterface<class ISearchBarViewInterface> _searchBar;                                        // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreSearchBarWidget*                   SearchBar;                                         // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreIconToggleWidget*                  FiltersButton;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreChallengeFilterWidget*             FiltersWidget;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _sortingOptions;                                   // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_424[0x24];                                     // 0x0424(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnButtonSelectedChanged(class UCoreSelectableButtonWidget* TargetButton, bool IsSelected);
	void OnFiltersButtonClicked(class UCoreButtonWidget* buttonTarget);
	void OnSortingChanged();
	void UpdateView();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuRitualsWidget">();
	}
	static class UChallengesMenuRitualsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuRitualsWidget>();
	}
};
static_assert(alignof(UChallengesMenuRitualsWidget) == 0x000008, "Wrong alignment on UChallengesMenuRitualsWidget");
static_assert(sizeof(UChallengesMenuRitualsWidget) == 0x000448, "Wrong size on UChallengesMenuRitualsWidget");
static_assert(offsetof(UChallengesMenuRitualsWidget, ChallengeCardWidgetClass) == 0x000348, "Member 'UChallengesMenuRitualsWidget::ChallengeCardWidgetClass' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, ChallengeDetailsWidget) == 0x000350, "Member 'UChallengesMenuRitualsWidget::ChallengeDetailsWidget' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, ChallengeCardsVerticalBox) == 0x000358, "Member 'UChallengesMenuRitualsWidget::ChallengeCardsVerticalBox' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, _challengeCards) == 0x000360, "Member 'UChallengesMenuRitualsWidget::_challengeCards' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, _currentSelectedButton) == 0x000370, "Member 'UChallengesMenuRitualsWidget::_currentSelectedButton' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, AdditionalDescriptionText) == 0x000378, "Member 'UChallengesMenuRitualsWidget::AdditionalDescriptionText' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, _challengeSetData) == 0x000380, "Member 'UChallengesMenuRitualsWidget::_challengeSetData' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, _searchBar) == 0x0003F8, "Member 'UChallengesMenuRitualsWidget::_searchBar' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, SearchBar) == 0x000408, "Member 'UChallengesMenuRitualsWidget::SearchBar' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, FiltersButton) == 0x000410, "Member 'UChallengesMenuRitualsWidget::FiltersButton' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, FiltersWidget) == 0x000418, "Member 'UChallengesMenuRitualsWidget::FiltersWidget' has a wrong offset!");
static_assert(offsetof(UChallengesMenuRitualsWidget, _sortingOptions) == 0x000420, "Member 'UChallengesMenuRitualsWidget::_sortingOptions' has a wrong offset!");

// Class DBDUIViewsCore.ChallengesMenuStoreWidget
// 0x0050 (0x0390 - 0x0340)
class UChallengesMenuStoreWidget final : public UCoreTabContentWidget
{
public:
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationItemGridContainer*        CustomizationGrid;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreImagePreviewAreaWidget*            PreviewArea;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputSwitcherWidget*               GoToStoreButton;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             _onChallengeStoreCustomizationItemClickedDelegate; // 0x0360(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             _onChallengeStorePreviewCustomizationItemClickedDelegate; // 0x0370(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             _onChallengeStoreGoToStoreButtonClickedDelegate;   // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)

public:
	void OnCustomizationGridItemClicked(const int32 SelectedIndex);
	void OnGoToStoreButtonClicked();
	void OnPreviewAreaItemClicked(const int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengesMenuStoreWidget">();
	}
	static class UChallengesMenuStoreWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengesMenuStoreWidget>();
	}
};
static_assert(alignof(UChallengesMenuStoreWidget) == 0x000008, "Wrong alignment on UChallengesMenuStoreWidget");
static_assert(sizeof(UChallengesMenuStoreWidget) == 0x000390, "Wrong size on UChallengesMenuStoreWidget");
static_assert(offsetof(UChallengesMenuStoreWidget, CustomizationGrid) == 0x000348, "Member 'UChallengesMenuStoreWidget::CustomizationGrid' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreWidget, PreviewArea) == 0x000350, "Member 'UChallengesMenuStoreWidget::PreviewArea' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreWidget, GoToStoreButton) == 0x000358, "Member 'UChallengesMenuStoreWidget::GoToStoreButton' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreWidget, _onChallengeStoreCustomizationItemClickedDelegate) == 0x000360, "Member 'UChallengesMenuStoreWidget::_onChallengeStoreCustomizationItemClickedDelegate' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreWidget, _onChallengeStorePreviewCustomizationItemClickedDelegate) == 0x000370, "Member 'UChallengesMenuStoreWidget::_onChallengeStorePreviewCustomizationItemClickedDelegate' has a wrong offset!");
static_assert(offsetof(UChallengesMenuStoreWidget, _onChallengeStoreGoToStoreButtonClickedDelegate) == 0x000380, "Member 'UChallengesMenuStoreWidget::_onChallengeStoreGoToStoreButtonClickedDelegate' has a wrong offset!");

// Class DBDUIViewsCore.ReportFeedbackInfoWidget
// 0x0010 (0x0330 - 0x0320)
class UReportFeedbackInfoWidget final : public UCoreBaseUserWidget
{
public:
