#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDUIViewInterfaces

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreCommonUIUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "RemoteContentCache_structs.hpp"


namespace SDK
{

// Enum DBDUIViewInterfaces.EArchiveTomeMenuState
// NumValues: 0x0003
enum class EArchiveTomeMenuState : uint8
{
	QuestMap                                 = 0,
	Journal                                  = 1,
	EArchiveTomeMenuState_MAX                = 2,
};

// Enum DBDUIViewInterfaces.EChallengesMenuChallengeSetState
// NumValues: 0x0004
enum class EChallengesMenuChallengeSetState : uint8
{
	Rituals                                  = 0,
	RewardTrack                              = 1,
	Store                                    = 2,
	EChallengesMenuChallengeSetState_MAX     = 3,
};

// Enum DBDUIViewInterfaces.EInboxTab
// NumValues: 0x0004
enum class EInboxTab : uint8
{
	News                                     = 0,
	Messages                                 = 1,
	Count                                    = 2,
	EInboxTab_MAX                            = 3,
};

// Enum DBDUIViewInterfaces.ELobbyCharactersMenuState
// NumValues: 0x0004
enum class ELobbyCharactersMenuState : uint8
{
	Selection                                = 0,
	Customizations                           = 1,
	Bio                                      = 2,
	ELobbyCharactersMenuState_MAX            = 3,
};

// Enum DBDUIViewInterfaces.EOnboardingMenuState
// NumValues: 0x0003
enum class EOnboardingMenuState : uint8
{
	Tutorial                                 = 0,
	GameManual                               = 1,
	EOnboardingMenuState_MAX                 = 2,
};

// Enum DBDUIViewInterfaces.EProfileMenuState
// NumValues: 0x0004
enum class EProfileMenuState : uint8
{
	Stats                                    = 0,
	Badge                                    = 1,
	Banner                                   = 2,
	EProfileMenuState_MAX                    = 3,
};

// Enum DBDUIViewInterfaces.EStoreMenuState
// NumValues: 0x0007
enum class EStoreMenuState : uint8
{
	Featured                                 = 0,
	Specials                                 = 1,
	Collections                              = 2,
	SpecialPacks                             = 3,
	Killers                                  = 4,
	Survivors                                = 5,
	EStoreMenuState_MAX                      = 6,
};

// Enum DBDUIViewInterfaces.EOriginWidgetState
// NumValues: 0x0007
enum class EOriginWidgetState : uint8
{
	None                                     = 0,
	CurrencyPurchase                         = 1,
	Store                                    = 2,
	Archives                                 = 3,
	Gameplay                                 = 4,
	MilestonePoints                          = 5,
	EOriginWidgetState_MAX                   = 6,
};

// Enum DBDUIViewInterfaces.EStoreItemAvailabilityType
// NumValues: 0x0006
enum class EStoreItemAvailabilityType : uint8
{
	None                                     = 0,
	Disabled                                 = 1,
	Unavailable                              = 2,
	Available                                = 3,
	AlsoAvailable                            = 4,
	EStoreItemAvailabilityType_MAX           = 5,
};

// Enum DBDUIViewInterfaces.EStoreItemUnlockType
// NumValues: 0x000A
enum class EStoreItemUnlockType : uint8
{
	None                                     = 0,
	Tutorial                                 = 1,
	Store                                    = 2,
	Event                                    = 3,
	ChapterPack                              = 4,
	HeritagePack                             = 5,
	SpecialPack                              = 6,
	ArchiveTome                              = 7,
	ArchiveRift                              = 8,
	EStoreItemUnlockType_MAX                 = 9,
};

// Enum DBDUIViewInterfaces.EAntiCampSelfUnhookMeterState
// NumValues: 0x0005
enum class EAntiCampSelfUnhookMeterState : uint8
{
	Hidden                                   = 0,
	FillingUp                                = 1,
	Stopped                                  = 2,
	Full                                     = 3,
	EAntiCampSelfUnhookMeterState_MAX        = 4,
};

// Enum DBDUIViewInterfaces.EArchivePathStatus
// NumValues: 0x0004
enum class EArchivePathStatus : uint8
{
	Closed                                   = 0,
	Available                                = 1,
	Completed                                = 2,
	EArchivePathStatus_MAX                   = 3,
};

// Enum DBDUIViewInterfaces.ETierType
// NumValues: 0x0003
enum class ETierType : uint8
{
	None                                     = 0,
	Bonus                                    = 1,
	ETierType_MAX                            = 2,
};

// Enum DBDUIViewInterfaces.EArchiveTomeType
// NumValues: 0x0004
enum class EArchiveTomeType : uint8
{
	CurrentTome                              = 0,
	PastTome                                 = 1,
	EventTome                                = 2,
	EArchiveTomeType_MAX                     = 3,
};

// Enum DBDUIViewInterfaces.ECrossPromoMediaResourceLinkType
// NumValues: 0x0004
enum class ECrossPromoMediaResourceLinkType : uint32
{
	None                                     = 0,
	External                                 = 1,
	InProvider                               = 2,
	ECrossPromoMediaResourceLinkType_MAX     = 3,
};

// Enum DBDUIViewInterfaces.EEventEntryTabState
// NumValues: 0x0005
enum class EEventEntryTabState : uint8
{
	Event                                    = 0,
	Details                                  = 1,
	Collection                               = 2,
	Store                                    = 3,
	EEventEntryTabState_MAX                  = 4,
};

// Enum DBDUIViewInterfaces.EGameManualMenuState
// NumValues: 0x0003
enum class EGameManualMenuState : uint8
{
	Categories                               = 0,
	Topics                                   = 1,
	EGameManualMenuState_MAX                 = 2,
};

// Enum DBDUIViewInterfaces.ESingleHookState
// NumValues: 0x0006
enum class ESingleHookState : uint8
{
	EMPTY                                    = 0,
	UNHOOKED                                 = 1,
	HOOKED                                   = 2,
	HOOKED_ASSISTED                          = 3,
	DISCONNECTED                             = 4,
	ESingleHookState_MAX                     = 5,
};

// Enum DBDUIViewInterfaces.EAimingCrosshairState
// NumValues: 0x000B
enum class EAimingCrosshairState : uint8
{
	Invalid                                  = 0,
	Hidden                                   = 1,
	NoTarget                                 = 2,
	Cooldown                                 = 3,
	Assimilating                             = 4,
	Teleporting                              = 5,
	AssimilatingProgressDecreasing           = 6,
	TeleportingProgressDecreasing            = 7,
	LockedOut                                = 8,
	Leaving                                  = 9,
	EAimingCrosshairState_MAX                = 10,
};

// Enum DBDUIViewInterfaces.EHudStatusEffectAlertViewType
// NumValues: 0x0005
enum class EHudStatusEffectAlertViewType : uint8
{
	Unhandled                                = 0,
	Perk                                     = 1,
	Item                                     = 2,
	Addon                                    = 3,
	EHudStatusEffectAlertViewType_MAX        = 4,
};

// Enum DBDUIViewInterfaces.EInboxRewardStatus
// NumValues: 0x0004
enum class EInboxRewardStatus : uint8
{
	NoReward                                 = 0,
	Unclaimed                                = 1,
	Claimed                                  = 2,
	EInboxRewardStatus_MAX                   = 3,
};

// Enum DBDUIViewInterfaces.EInteractionPromptType
// NumValues: 0x0009
enum class EInteractionPromptType : uint8
{
	None                                     = 0,
	PressButton                              = 1,
	MashButton                               = 2,
	HoldButton                               = 3,
	AlternateTwoButtons                      = 4,
	WiggleThumbstick                         = 5,
	MovementAxes                             = 6,
	MovementKeys                             = 7,
	EInteractionPromptType_MAX               = 8,
};

// Enum DBDUIViewInterfaces.ELoadingScreenType
// NumValues: 0x0007
enum class ELoadingScreenType : uint8
{
	None                                     = 0,
	Simple                                   = 1,
	Regular                                  = 2,
	Special                                  = 3,
	LTECustom                                = 4,
	LTEGeneric                               = 5,
	ELoadingScreenType_MAX                   = 6,
};

// Enum DBDUIViewInterfaces.ELobbyMenuState
// NumValues: 0x0005
enum class ELobbyMenuState : uint8
{
	None                                     = 0,
	Characters                               = 1,
	PlayerList                               = 2,
	Scaleform                                = 3,
	ELobbyMenuState_MAX                      = 4,
};

// Enum DBDUIViewInterfaces.ELockedElementType
// NumValues: 0x0004
enum class ELockedElementType : uint8
{
	Default                                  = 0,
	MainMenuButton                           = 1,
	FooterButton                             = 2,
	ELockedElementType_MAX                   = 3,
};

// Enum DBDUIViewInterfaces.EMainMenuButtonType
// NumValues: 0x0015
enum class EMainMenuButtonType : uint8
{
	News                                     = 0,
	Play                                     = 1,
	PlaySurvivor                             = 2,
	PlayKiller                               = 3,
	KillYourFriends                          = 4,
	PlayLTE                                  = 5,
	PlaySurvivorLTE                          = 6,
	PlayKillerLTE                            = 7,
	DailyRituals                             = 8,
	Store                                    = 9,
	Settings                                 = 10,
	Onboarding                               = 11,
	Credits                                  = 12,
	QuitGame                                 = 13,
	Friends                                  = 14,
	Archives                                 = 15,
	Event                                    = 16,
	MarketingInvitation                      = 17,
	Challenges                               = 18,
	Count                                    = 19,
	EMainMenuButtonType_MAX                  = 20,
};

// Enum DBDUIViewInterfaces.EMilestoneTrackerItemState
// NumValues: 0x0004
enum class EMilestoneTrackerItemState : uint8
{
	Unlocked                                 = 0,
	InProgress                               = 1,
	Locked                                   = 2,
	EMilestoneTrackerItemState_MAX           = 3,
};

// Enum DBDUIViewInterfaces.EButtonDisableState
// NumValues: 0x0005
enum class EButtonDisableState : uint8
{
	Default                                  = 0,
	Loading                                  = 1,
	Locked                                   = 2,
	Disabled                                 = 3,
	EButtonDisableState_MAX                  = 4,
};

// Enum DBDUIViewInterfaces.EPerkRandomSuccessType
// NumValues: 0x0003
enum class EPerkRandomSuccessType : uint8
{
	Default                                  = 0,
	D20                                      = 1,
	EPerkRandomSuccessType_MAX               = 2,
};

// Enum DBDUIViewInterfaces.EPerkRandomSuccessResult
// NumValues: 0x0005
enum class EPerkRandomSuccessResult : uint8
{
	CriticalFail                             = 0,
	BasicSuccess                             = 1,
	MediumSuccess                            = 2,
	CriticalSuccess                          = 3,
	EPerkRandomSuccessResult_MAX             = 4,
};

// Enum DBDUIViewInterfaces.EScrollAction
// NumValues: 0x0004
enum class EScrollAction : uint8
{
	NoAction                                 = 0,
	ScrollToTop                              = 1,
	ScrollToSelected                         = 2,
	EScrollAction_MAX                        = 3,
};

// Enum DBDUIViewInterfaces.EStoreCharactersMenuState
// NumValues: 0x0004
enum class EStoreCharactersMenuState : uint8
{
	Selection                                = 0,
	Customizations                           = 1,
	Bio                                      = 2,
	EStoreCharactersMenuState_MAX            = 3,
};

// Enum DBDUIViewInterfaces.EStoreCollectionsMenuState
// NumValues: 0x0003
enum class EStoreCollectionsMenuState : uint8
{
	List                                     = 0,
	Customizations                           = 1,
	EStoreCollectionsMenuState_MAX           = 2,
};

// Enum DBDUIViewInterfaces.EStoreItemLayout
// NumValues: 0x000B
enum class EStoreItemLayout : uint16
{
	None                                     = 0,
	OwnedTag                                 = 1,
	LockedTag                                = 2,
	TimerTags                                = 4,
	PriceTags                                = 8,
	EventCheckmarkTag                        = 16,
	EventIconTag                             = 32,
	UnavailableTag                           = 64,
	NotificationTag                          = 128,
	PrestigeTag                              = 256,
	EStoreItemLayout_MAX                     = 257,
};

// Enum DBDUIViewInterfaces.ERightStickMode
// NumValues: 0x0004
enum class ERightStickMode : uint8
{
	None                                     = 0,
	Scrolling                                = 1,
	Rotation                                 = 2,
	ERightStickMode_MAX                      = 3,
};

// Enum DBDUIViewInterfaces.EStoreSpecialPacksTabState
// NumValues: 0x0004
enum class EStoreSpecialPacksTabState : uint8
{
	Special                                  = 0,
	Chapter                                  = 1,
	Heritage                                 = 2,
	EStoreSpecialPacksTabState_MAX           = 3,
};

// Enum DBDUIViewInterfaces.EStoreSpecialPacksScreenState
// NumValues: 0x0003
enum class EStoreSpecialPacksScreenState : uint8
{
	Tabs                                     = 0,
	Details                                  = 1,
	EStoreSpecialPacksScreenState_MAX        = 2,
};

// Enum DBDUIViewInterfaces.ETallyTabState
// NumValues: 0x0003
enum class ETallyTabState : uint8
{
	None                                     = 0,
	Scoreboard                               = 1,
	ETallyTabState_MAX                       = 2,
};

// Enum DBDUIViewInterfaces.ETestBuildFlagPosition
// NumValues: 0x0004
enum class ETestBuildFlagPosition : uint8
{
	Hud                                      = 0,
	MainMenu                                 = 1,
	Lobby                                    = 2,
	ETestBuildFlagPosition_MAX               = 3,
};

// Enum DBDUIViewInterfaces.EFlagType
// NumValues: 0x0005
enum class EFlagType : uint8
{
	Default                                  = 0,
	Sale                                     = 1,
	Limited                                  = 2,
	ArchiveRift                              = 3,
	EFlagType_MAX                            = 4,
};

// Enum DBDUIViewInterfaces.EFlagSize
// NumValues: 0x0005
enum class EFlagSize : uint8
{
	Short                                    = 0,
	Medium                                   = 1,
	Large                                    = 2,
	Preview                                  = 3,
	EFlagSize_MAX                            = 4,
};

// Enum DBDUIViewInterfaces.EFlagItemType
// NumValues: 0x0004
enum class EFlagItemType : uint8
{
	Unbreakable                              = 0,
	Outfit                                   = 1,
	Item                                     = 2,
	EFlagItemType_MAX                        = 3,
};

// Enum DBDUIViewInterfaces.EWardrobeActionButtonState
// NumValues: 0x0004
enum class EWardrobeActionButtonState : uint8
{
	Invisible                                = 0,
	VisibleAndEnabled                        = 1,
	VisibleAndDisabled                       = 2,
	EWardrobeActionButtonState_MAX           = 3,
};

// ScriptStruct DBDUIViewInterfaces.EventObjectiveTargetData
// 0x0008 (0x0008 - 0x0000)
struct FEventObjectiveTargetData final
{
public:
	int32                                         Progression;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bonus;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventObjectiveTargetData) == 0x000004, "Wrong alignment on FEventObjectiveTargetData");
static_assert(sizeof(FEventObjectiveTargetData) == 0x000008, "Wrong size on FEventObjectiveTargetData");
static_assert(offsetof(FEventObjectiveTargetData, Progression) == 0x000000, "Member 'FEventObjectiveTargetData::Progression' has a wrong offset!");
static_assert(offsetof(FEventObjectiveTargetData, Bonus) == 0x000004, "Member 'FEventObjectiveTargetData::Bonus' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CustomIconPathExclusionUIDataRow
// 0x0010 (0x0018 - 0x0008)
struct FCustomIconPathExclusionUIDataRow final : public FTableRowBase
{
public:
	class FString                                 Path;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCustomIconPathExclusionUIDataRow) == 0x000008, "Wrong alignment on FCustomIconPathExclusionUIDataRow");
static_assert(sizeof(FCustomIconPathExclusionUIDataRow) == 0x000018, "Wrong size on FCustomIconPathExclusionUIDataRow");
static_assert(offsetof(FCustomIconPathExclusionUIDataRow, Path) == 0x000008, "Member 'FCustomIconPathExclusionUIDataRow::Path' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.StoreCharactersFiltersData
// 0x0058 (0x0058 - 0x0000)
struct FStoreCharactersFiltersData final
{
public:
	bool                                          IsAvailable;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOwned;                                           // 0x0001(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EItemRarity, bool>                       _rarityFiltersMap;                                 // 0x0008(0x0050)(Edit, DisableEditOnTemplate, Transient, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FStoreCharactersFiltersData) == 0x000008, "Wrong alignment on FStoreCharactersFiltersData");
static_assert(sizeof(FStoreCharactersFiltersData) == 0x000058, "Wrong size on FStoreCharactersFiltersData");
static_assert(offsetof(FStoreCharactersFiltersData, IsAvailable) == 0x000000, "Member 'FStoreCharactersFiltersData::IsAvailable' has a wrong offset!");
static_assert(offsetof(FStoreCharactersFiltersData, IsOwned) == 0x000001, "Member 'FStoreCharactersFiltersData::IsOwned' has a wrong offset!");
static_assert(offsetof(FStoreCharactersFiltersData, _rarityFiltersMap) == 0x000008, "Member 'FStoreCharactersFiltersData::_rarityFiltersMap' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.StoreItemUnlockInfoViewData
// 0x0030 (0x0030 - 0x0000)
struct FStoreItemUnlockInfoViewData final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0010(0x0018)(Edit, BlueprintVisible, Transient, ExposeOnSpawn, NativeAccessSpecifierPublic)
	EStoreItemUnlockType                          UnlockType;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStoreItemAvailabilityType                    AvailabilityType;                                  // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStoreItemUnlockInfoViewData) == 0x000008, "Wrong alignment on FStoreItemUnlockInfoViewData");
static_assert(sizeof(FStoreItemUnlockInfoViewData) == 0x000030, "Wrong size on FStoreItemUnlockInfoViewData");
static_assert(offsetof(FStoreItemUnlockInfoViewData, ID) == 0x000000, "Member 'FStoreItemUnlockInfoViewData::ID' has a wrong offset!");
static_assert(offsetof(FStoreItemUnlockInfoViewData, Title) == 0x000010, "Member 'FStoreItemUnlockInfoViewData::Title' has a wrong offset!");
static_assert(offsetof(FStoreItemUnlockInfoViewData, UnlockType) == 0x000028, "Member 'FStoreItemUnlockInfoViewData::UnlockType' has a wrong offset!");
static_assert(offsetof(FStoreItemUnlockInfoViewData, AvailabilityType) == 0x000029, "Member 'FStoreItemUnlockInfoViewData::AvailabilityType' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CharacterTooltipViewData
// 0x0088 (0x0088 - 0x0000)
struct FCharacterTooltipViewData final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   Biography;                                         // 0x0018(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	struct FStoreItemUnlockInfoViewData           UnlockInfo;                                        // 0x0030(0x0030)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNewInStore;                                      // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOwned;                                           // 0x0065(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTutorialItem;                                    // 0x0066(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAvailableInStore;                                // 0x0067(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnabled;                                         // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDisabledItemOption                           DisabledItemOption;                                // 0x0069(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CharacterDisabledMessage;                          // 0x0070(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCharacterTooltipViewData) == 0x000008, "Wrong alignment on FCharacterTooltipViewData");
static_assert(sizeof(FCharacterTooltipViewData) == 0x000088, "Wrong size on FCharacterTooltipViewData");
static_assert(offsetof(FCharacterTooltipViewData, DisplayName) == 0x000000, "Member 'FCharacterTooltipViewData::DisplayName' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, Biography) == 0x000018, "Member 'FCharacterTooltipViewData::Biography' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, UnlockInfo) == 0x000030, "Member 'FCharacterTooltipViewData::UnlockInfo' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, Level) == 0x000060, "Member 'FCharacterTooltipViewData::Level' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, IsNewInStore) == 0x000064, "Member 'FCharacterTooltipViewData::IsNewInStore' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, IsOwned) == 0x000065, "Member 'FCharacterTooltipViewData::IsOwned' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, IsTutorialItem) == 0x000066, "Member 'FCharacterTooltipViewData::IsTutorialItem' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, IsAvailableInStore) == 0x000067, "Member 'FCharacterTooltipViewData::IsAvailableInStore' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, IsEnabled) == 0x000068, "Member 'FCharacterTooltipViewData::IsEnabled' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, DisabledItemOption) == 0x000069, "Member 'FCharacterTooltipViewData::DisabledItemOption' has a wrong offset!");
static_assert(offsetof(FCharacterTooltipViewData, CharacterDisabledMessage) == 0x000070, "Member 'FCharacterTooltipViewData::CharacterDisabledMessage' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.RewardViewData
// 0x0070 (0x0070 - 0x0000)
struct FRewardViewData
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0038)(Edit, BlueprintVisible, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AnimationWidgetClass;                              // 0x0038(0x0038)(Edit, BlueprintVisible, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRewardViewData) == 0x000008, "Wrong alignment on FRewardViewData");
static_assert(sizeof(FRewardViewData) == 0x000070, "Wrong size on FRewardViewData");
static_assert(offsetof(FRewardViewData, Icon) == 0x000000, "Member 'FRewardViewData::Icon' has a wrong offset!");
static_assert(offsetof(FRewardViewData, AnimationWidgetClass) == 0x000038, "Member 'FRewardViewData::AnimationWidgetClass' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CharacterRewardViewData
// 0x00A0 (0x0110 - 0x0070)
struct FCharacterRewardViewData final : public FRewardViewData
{
public:
	class FName                                   ItemId;                                            // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOwned;                                           // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterTooltipViewData              TooltipData;                                       // 0x0080(0x0088)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	bool                                          IsEnabled;                                         // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerRole                                   PlayerRole;                                        // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLegacyRewardPrestigeEnabled;                     // 0x010A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCharacterRewardViewData) == 0x000008, "Wrong alignment on FCharacterRewardViewData");
static_assert(sizeof(FCharacterRewardViewData) == 0x000110, "Wrong size on FCharacterRewardViewData");
static_assert(offsetof(FCharacterRewardViewData, ItemId) == 0x000070, "Member 'FCharacterRewardViewData::ItemId' has a wrong offset!");
static_assert(offsetof(FCharacterRewardViewData, IsOwned) == 0x00007C, "Member 'FCharacterRewardViewData::IsOwned' has a wrong offset!");
static_assert(offsetof(FCharacterRewardViewData, TooltipData) == 0x000080, "Member 'FCharacterRewardViewData::TooltipData' has a wrong offset!");
static_assert(offsetof(FCharacterRewardViewData, IsEnabled) == 0x000108, "Member 'FCharacterRewardViewData::IsEnabled' has a wrong offset!");
static_assert(offsetof(FCharacterRewardViewData, PlayerRole) == 0x000109, "Member 'FCharacterRewardViewData::PlayerRole' has a wrong offset!");
static_assert(offsetof(FCharacterRewardViewData, IsLegacyRewardPrestigeEnabled) == 0x00010A, "Member 'FCharacterRewardViewData::IsLegacyRewardPrestigeEnabled' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.NotEnoughCurrencyModalViewData
// 0x0038 (0x0038 - 0x0000)
struct FNotEnoughCurrencyModalViewData final
{
public:
	class FText                                   Content;                                           // 0x0000(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   ButtonText;                                        // 0x0018(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	ECurrencyType                                 CurrencyType;                                      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldShowButton;                                  // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNotEnoughCurrencyModalViewData) == 0x000008, "Wrong alignment on FNotEnoughCurrencyModalViewData");
static_assert(sizeof(FNotEnoughCurrencyModalViewData) == 0x000038, "Wrong size on FNotEnoughCurrencyModalViewData");
static_assert(offsetof(FNotEnoughCurrencyModalViewData, Content) == 0x000000, "Member 'FNotEnoughCurrencyModalViewData::Content' has a wrong offset!");
static_assert(offsetof(FNotEnoughCurrencyModalViewData, ButtonText) == 0x000018, "Member 'FNotEnoughCurrencyModalViewData::ButtonText' has a wrong offset!");
static_assert(offsetof(FNotEnoughCurrencyModalViewData, CurrencyType) == 0x000030, "Member 'FNotEnoughCurrencyModalViewData::CurrencyType' has a wrong offset!");
static_assert(offsetof(FNotEnoughCurrencyModalViewData, ShouldShowButton) == 0x000031, "Member 'FNotEnoughCurrencyModalViewData::ShouldShowButton' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.PriceTagViewData
// 0x0050 (0x0050 - 0x0000)
struct FPriceTagViewData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ECurrencyType                                 Type;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAffordable;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FullAmount;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNotEnoughCurrencyModalViewData        NotEnoughCurrencyViewData;                         // 0x0018(0x0038)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPriceTagViewData) == 0x000008, "Wrong alignment on FPriceTagViewData");
static_assert(sizeof(FPriceTagViewData) == 0x000050, "Wrong size on FPriceTagViewData");
static_assert(offsetof(FPriceTagViewData, Type) == 0x000008, "Member 'FPriceTagViewData::Type' has a wrong offset!");
static_assert(offsetof(FPriceTagViewData, Amount) == 0x00000C, "Member 'FPriceTagViewData::Amount' has a wrong offset!");
static_assert(offsetof(FPriceTagViewData, IsAffordable) == 0x000010, "Member 'FPriceTagViewData::IsAffordable' has a wrong offset!");
static_assert(offsetof(FPriceTagViewData, FullAmount) == 0x000014, "Member 'FPriceTagViewData::FullAmount' has a wrong offset!");
static_assert(offsetof(FPriceTagViewData, NotEnoughCurrencyViewData) == 0x000018, "Member 'FPriceTagViewData::NotEnoughCurrencyViewData' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CustomizationTooltipViewData
// 0x0130 (0x0130 - 0x0000)
struct FCustomizationTooltipViewData final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   ParentName;                                        // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	class FText                                   RarityPartInfo;                                    // 0x0030(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   CollectionDisplayName;                             // 0x0048(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0060(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   RoleCategoryInfo;                                  // 0x0078(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	EOriginWidgetState                            CustomizationOriginState;                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CustomizationOriginInfo;                           // 0x0098(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	bool                                          IsLocked;                                          // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUnbreakable;                                     // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEquipped;                                        // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBuyable;                                         // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAvailable;                                       // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOwned;                                           // 0x00B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowAvailability;                                  // 0x00B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisceral;                                        // 0x00B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOutfitPart;                                      // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutfitInfoText;                                    // 0x00C0(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	EPlayerRole                                   AssociatedRole;                                    // 0x00D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemRarity                                   Rarity;                                            // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPriceTagViewData>              Prices;                                            // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	bool                                          IsEnabled;                                         // 0x00F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDisabledItemOption                           DisabledItemOption;                                // 0x00F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CustomizationDisabledMessage;                      // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	class FString                                 EventBannerLabel;                                  // 0x0110(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasOutfitParts;                                    // 0x0120(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationRewardOutfitPartsViewData* OutfitParts;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCustomizationTooltipViewData) == 0x000008, "Wrong alignment on FCustomizationTooltipViewData");
static_assert(sizeof(FCustomizationTooltipViewData) == 0x000130, "Wrong size on FCustomizationTooltipViewData");
static_assert(offsetof(FCustomizationTooltipViewData, DisplayName) == 0x000000, "Member 'FCustomizationTooltipViewData::DisplayName' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, ParentName) == 0x000018, "Member 'FCustomizationTooltipViewData::ParentName' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, RarityPartInfo) == 0x000030, "Member 'FCustomizationTooltipViewData::RarityPartInfo' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, CollectionDisplayName) == 0x000048, "Member 'FCustomizationTooltipViewData::CollectionDisplayName' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, Description) == 0x000060, "Member 'FCustomizationTooltipViewData::Description' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, RoleCategoryInfo) == 0x000078, "Member 'FCustomizationTooltipViewData::RoleCategoryInfo' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, CustomizationOriginState) == 0x000090, "Member 'FCustomizationTooltipViewData::CustomizationOriginState' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, CustomizationOriginInfo) == 0x000098, "Member 'FCustomizationTooltipViewData::CustomizationOriginInfo' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsLocked) == 0x0000B0, "Member 'FCustomizationTooltipViewData::IsLocked' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsUnbreakable) == 0x0000B1, "Member 'FCustomizationTooltipViewData::IsUnbreakable' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsEquipped) == 0x0000B2, "Member 'FCustomizationTooltipViewData::IsEquipped' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsBuyable) == 0x0000B3, "Member 'FCustomizationTooltipViewData::IsBuyable' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsAvailable) == 0x0000B4, "Member 'FCustomizationTooltipViewData::IsAvailable' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsOwned) == 0x0000B5, "Member 'FCustomizationTooltipViewData::IsOwned' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, ShowAvailability) == 0x0000B6, "Member 'FCustomizationTooltipViewData::ShowAvailability' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsVisceral) == 0x0000B7, "Member 'FCustomizationTooltipViewData::IsVisceral' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsOutfitPart) == 0x0000B8, "Member 'FCustomizationTooltipViewData::IsOutfitPart' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, OutfitInfoText) == 0x0000C0, "Member 'FCustomizationTooltipViewData::OutfitInfoText' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, AssociatedRole) == 0x0000D8, "Member 'FCustomizationTooltipViewData::AssociatedRole' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, Rarity) == 0x0000D9, "Member 'FCustomizationTooltipViewData::Rarity' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, Prices) == 0x0000E0, "Member 'FCustomizationTooltipViewData::Prices' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, IsEnabled) == 0x0000F0, "Member 'FCustomizationTooltipViewData::IsEnabled' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, DisabledItemOption) == 0x0000F1, "Member 'FCustomizationTooltipViewData::DisabledItemOption' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, CustomizationDisabledMessage) == 0x0000F8, "Member 'FCustomizationTooltipViewData::CustomizationDisabledMessage' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, EventBannerLabel) == 0x000110, "Member 'FCustomizationTooltipViewData::EventBannerLabel' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, HasOutfitParts) == 0x000120, "Member 'FCustomizationTooltipViewData::HasOutfitParts' has a wrong offset!");
static_assert(offsetof(FCustomizationTooltipViewData, OutfitParts) == 0x000128, "Member 'FCustomizationTooltipViewData::OutfitParts' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CustomizationRewardViewData
// 0x01A0 (0x0210 - 0x0070)
struct FCustomizationRewardViewData final : public FRewardViewData
{
public:
	class FName                                   CustomizationId;                                   // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutfitId;                                          // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReleaseDate;                                       // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemRarity                                   Rarity;                                            // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOwned;                                           // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBuyable;                                         // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEquipped;                                        // 0x0093(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUnbreakable;                                     // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEventItem;                                       // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisceral;                                        // 0x0096(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EventID;                                           // 0x0098(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationTooltipViewData          TooltipData;                                       // 0x00A8(0x0130)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	ECustomizationCategory                        CustomizationCategory;                             // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssociatedCharacter;                               // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnabled;                                         // 0x01E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GrantsMilestonePointOnUnlock;                      // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPriceTagViewData>              PriceTagData;                                      // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class FString                                 InclusionVersion;                                  // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowLockedOverlay;                                 // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomizationRewardViewData) == 0x000008, "Wrong alignment on FCustomizationRewardViewData");
static_assert(sizeof(FCustomizationRewardViewData) == 0x000210, "Wrong size on FCustomizationRewardViewData");
static_assert(offsetof(FCustomizationRewardViewData, CustomizationId) == 0x000070, "Member 'FCustomizationRewardViewData::CustomizationId' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, OutfitId) == 0x00007C, "Member 'FCustomizationRewardViewData::OutfitId' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, ReleaseDate) == 0x000088, "Member 'FCustomizationRewardViewData::ReleaseDate' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, Rarity) == 0x000090, "Member 'FCustomizationRewardViewData::Rarity' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsOwned) == 0x000091, "Member 'FCustomizationRewardViewData::IsOwned' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsBuyable) == 0x000092, "Member 'FCustomizationRewardViewData::IsBuyable' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsEquipped) == 0x000093, "Member 'FCustomizationRewardViewData::IsEquipped' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsUnbreakable) == 0x000094, "Member 'FCustomizationRewardViewData::IsUnbreakable' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsEventItem) == 0x000095, "Member 'FCustomizationRewardViewData::IsEventItem' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsVisceral) == 0x000096, "Member 'FCustomizationRewardViewData::IsVisceral' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, EventID) == 0x000098, "Member 'FCustomizationRewardViewData::EventID' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, TooltipData) == 0x0000A8, "Member 'FCustomizationRewardViewData::TooltipData' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, CustomizationCategory) == 0x0001D8, "Member 'FCustomizationRewardViewData::CustomizationCategory' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, AssociatedCharacter) == 0x0001DC, "Member 'FCustomizationRewardViewData::AssociatedCharacter' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, IsEnabled) == 0x0001E0, "Member 'FCustomizationRewardViewData::IsEnabled' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, GrantsMilestonePointOnUnlock) == 0x0001E1, "Member 'FCustomizationRewardViewData::GrantsMilestonePointOnUnlock' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, PriceTagData) == 0x0001E8, "Member 'FCustomizationRewardViewData::PriceTagData' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, InclusionVersion) == 0x0001F8, "Member 'FCustomizationRewardViewData::InclusionVersion' has a wrong offset!");
static_assert(offsetof(FCustomizationRewardViewData, ShowLockedOverlay) == 0x000208, "Member 'FCustomizationRewardViewData::ShowLockedOverlay' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CurrencyExpirationLabelViewData
// 0x0020 (0x0020 - 0x0000)
struct FCurrencyExpirationLabelViewData final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ExpirationDate;                                    // 0x0008(0x0018)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCurrencyExpirationLabelViewData) == 0x000008, "Wrong alignment on FCurrencyExpirationLabelViewData");
static_assert(sizeof(FCurrencyExpirationLabelViewData) == 0x000020, "Wrong size on FCurrencyExpirationLabelViewData");
static_assert(offsetof(FCurrencyExpirationLabelViewData, Amount) == 0x000000, "Member 'FCurrencyExpirationLabelViewData::Amount' has a wrong offset!");
static_assert(offsetof(FCurrencyExpirationLabelViewData, ExpirationDate) == 0x000008, "Member 'FCurrencyExpirationLabelViewData::ExpirationDate' has a wrong offset!");

// ScriptStruct DBDUIViewInterfaces.CurrencyProgressionTooltipViewData
// 0x0100 (0x0100 - 0x0000)
struct FCurrencyProgressionTooltipViewData final
{
public:
	bool                                          IsCurrency;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TooltipHeaderMaterial;                             // 0x0038(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              TooltipDecorationIcon;                             // 0x0070(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   EventName;                                         // 0x00A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	class FText                                   EventDescription;                                  // 0x00C0(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class FText                                   EventTimer;                                        // 0x00D8(0x0018)(Edit, BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	TArray<struct FCurrencyExpirationLabelViewData> ExpirationData;                                    // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCurrencyProgressionTooltipViewData) == 0x000008, "Wrong alignment on FCurrencyProgressionTooltipViewData");
static_assert(sizeof(FCurrencyProgressionTooltipViewData) == 0x000100, "Wrong size on FCurrencyProgressionTooltipViewData");
static_assert(offsetof(FCurrencyProgressionTooltipViewData, IsCurrency) == 0x000000, "Member 'FCurrencyProgressionTooltipViewData::IsCurrency' has a wrong offset!");
static_assert(offsetof(FCurrencyProgressionTooltipViewData, Title) == 0x000008, "Member 'FCurrencyProgressionTooltipViewData::Title' has a wrong offset!");
static_assert(offsetof(FCurrencyProgressionTooltipViewData, Description) == 0x000020, "Member 'FCurrencyProgressionTooltipViewData::Description' has a wrong offset!");
