#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDVideoPlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataTableUtilities_structs.hpp"


namespace SDK
{

// ScriptStruct DBDVideoPlayer.VideoThumbnailProperties
// 0x0068 (0x0070 - 0x0008)
struct FVideoThumbnailProperties final : public FDBDTableRowBase
{
public:
	class FName                                   _id;                                               // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _hasAudio;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              _size;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMediaSource>            _source;                                           // 0x0028(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fadeInDuration;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fadeOutDuration;                                  // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _delayDuration;                                    // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVideoThumbnailProperties) == 0x000008, "Wrong alignment on FVideoThumbnailProperties");
static_assert(sizeof(FVideoThumbnailProperties) == 0x000070, "Wrong size on FVideoThumbnailProperties");
static_assert(offsetof(FVideoThumbnailProperties, _id) == 0x000008, "Member 'FVideoThumbnailProperties::_id' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _hasAudio) == 0x000014, "Member 'FVideoThumbnailProperties::_hasAudio' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _size) == 0x000018, "Member 'FVideoThumbnailProperties::_size' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _source) == 0x000028, "Member 'FVideoThumbnailProperties::_source' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _fadeInDuration) == 0x000060, "Member 'FVideoThumbnailProperties::_fadeInDuration' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _fadeOutDuration) == 0x000064, "Member 'FVideoThumbnailProperties::_fadeOutDuration' has a wrong offset!");
static_assert(offsetof(FVideoThumbnailProperties, _delayDuration) == 0x000068, "Member 'FVideoThumbnailProperties::_delayDuration' has a wrong offset!");

}

