#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadHardPerkAnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DeadHardPerkAnimInstance.DeadHardPerkAnimInstance_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct DeadHardPerkAnimInstance_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DeadHardPerkAnimInstance_C_AnimGraph) == 0x000008, "Wrong alignment on DeadHardPerkAnimInstance_C_AnimGraph");
static_assert(sizeof(DeadHardPerkAnimInstance_C_AnimGraph) == 0x000010, "Wrong size on DeadHardPerkAnimInstance_C_AnimGraph");
static_assert(offsetof(DeadHardPerkAnimInstance_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'DeadHardPerkAnimInstance_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function DeadHardPerkAnimInstance.DeadHardPerkAnimInstance_C.ExecuteUbergraph_DeadHardPerkAnimInstance
// 0x0004 (0x0004 - 0x0000)
struct DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance) == 0x000004, "Wrong alignment on DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance");
static_assert(sizeof(DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance) == 0x000004, "Wrong size on DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance");
static_assert(offsetof(DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance, EntryPoint) == 0x000000, "Member 'DeadHardPerkAnimInstance_C_ExecuteUbergraph_DeadHardPerkAnimInstance::EntryPoint' has a wrong offset!");

// Function DeadHardPerkAnimInstance.DeadHardPerkAnimInstance_C.Survivor_Perk_Layer
// 0x0020 (0x0020 - 0x0000)
struct DeadHardPerkAnimInstance_C_Survivor_Perk_Layer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_Survivor_Perk_Layer;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DeadHardPerkAnimInstance_C_Survivor_Perk_Layer) == 0x000008, "Wrong alignment on DeadHardPerkAnimInstance_C_Survivor_Perk_Layer");
static_assert(sizeof(DeadHardPerkAnimInstance_C_Survivor_Perk_Layer) == 0x000020, "Wrong size on DeadHardPerkAnimInstance_C_Survivor_Perk_Layer");
static_assert(offsetof(DeadHardPerkAnimInstance_C_Survivor_Perk_Layer, InPose) == 0x000000, "Member 'DeadHardPerkAnimInstance_C_Survivor_Perk_Layer::InPose' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance_C_Survivor_Perk_Layer, Param_Survivor_Perk_Layer) == 0x000010, "Member 'DeadHardPerkAnimInstance_C_Survivor_Perk_Layer::Param_Survivor_Perk_Layer' has a wrong offset!");

}

