#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadHardPerkAnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TheS38_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DeadHardPerkAnimInstance.DeadHardPerkAnimInstance_C
// 0x0400 (0x0A20 - 0x0620)
class UDeadHardPerkAnimInstance_C final : public USurvivorPerkAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0628(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0630(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0638(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0658(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0750(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0778(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07C0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07E0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0810(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0830(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x08F8(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A00(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_PerksLayerDone();
	void ExecuteUbergraph_DeadHardPerkAnimInstance(int32 EntryPoint);
	void Survivor_Perk_Layer(const struct FPoseLink& InPose, struct FPoseLink* Param_Survivor_Perk_Layer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadHardPerkAnimInstance_C">();
	}
	static class UDeadHardPerkAnimInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadHardPerkAnimInstance_C>();
	}
};
static_assert(alignof(UDeadHardPerkAnimInstance_C) == 0x000010, "Wrong alignment on UDeadHardPerkAnimInstance_C");
static_assert(sizeof(UDeadHardPerkAnimInstance_C) == 0x000A20, "Wrong size on UDeadHardPerkAnimInstance_C");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, UberGraphFrame) == 0x000620, "Member 'UDeadHardPerkAnimInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimBlueprintExtension_PropertyAccess) == 0x000628, "Member 'UDeadHardPerkAnimInstance_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimBlueprintExtension_Base) == 0x000630, "Member 'UDeadHardPerkAnimInstance_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_Root_1) == 0x000638, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_LinkedInputPose) == 0x000658, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_TransitionResult_1) == 0x000728, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_TransitionResult) == 0x000750, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_SequencePlayer) == 0x000778, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_StateResult_1) == 0x0007C0, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_UseCachedPose) == 0x0007E0, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_StateResult) == 0x000810, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_StateMachine) == 0x000830, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_SaveCachedPose) == 0x0008F8, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDeadHardPerkAnimInstance_C, AnimGraphNode_Root) == 0x000A00, "Member 'UDeadHardPerkAnimInstance_C::AnimGraphNode_Root' has a wrong offset!");

}

