#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadHardPerkAnimInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct DeadHardPerkAnimInstance.DeadHardPerkAnimInstance_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_37;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_38;                                 // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_39;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_40;                               // 0x0018(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_41;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_42;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_43;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_44;                                 // 0x004A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_45;                                 // 0x004C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_46;                                  // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_47;                                 // 0x005C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_48;                                  // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_49;                               // 0x0070(0x0028)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_50;                                 // 0x0098(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_51;                                 // 0x00A4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_37) == 0x000004, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_37' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __BoolProperty_38) == 0x000010, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__BoolProperty_38' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __FloatProperty_39) == 0x000014, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__FloatProperty_39' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __StructProperty_40) == 0x000018, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__StructProperty_40' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __FloatProperty_41) == 0x000044, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__FloatProperty_41' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __BoolProperty_42) == 0x000048, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__BoolProperty_42' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __EnumProperty_43) == 0x000049, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__EnumProperty_43' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __ByteProperty_44) == 0x00004A, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__ByteProperty_44' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_45) == 0x00004C, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_45' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __IntProperty_46) == 0x000058, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__IntProperty_46' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_47) == 0x00005C, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_47' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __IntProperty_48) == 0x000068, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__IntProperty_48' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __StructProperty_49) == 0x000070, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__StructProperty_49' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_50) == 0x000098, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_50' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, __NameProperty_51) == 0x0000A4, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::__NameProperty_51' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'DeadHardPerkAnimInstance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

