#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadByDaylight

#include "Basic.hpp"

#include "Projectile_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "AIModule_structs.hpp"
#include "Customization_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "ReversibleActionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationUtilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Competence_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "NetworkUtilities_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayUtilities_structs.hpp"
#include "Niagara_structs.hpp"


namespace SDK::Params
{

// Function DeadByDaylight.HudStateComponent.OnRep_IsHudVisible
// 0x0001 (0x0001 - 0x0000)
struct HudStateComponent_OnRep_IsHudVisible final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HudStateComponent_OnRep_IsHudVisible) == 0x000001, "Wrong alignment on HudStateComponent_OnRep_IsHudVisible");
static_assert(sizeof(HudStateComponent_OnRep_IsHudVisible) == 0x000001, "Wrong size on HudStateComponent_OnRep_IsHudVisible");
static_assert(offsetof(HudStateComponent_OnRep_IsHudVisible, OldValue) == 0x000000, "Member 'HudStateComponent_OnRep_IsHudVisible::OldValue' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Client final
{
public:
	class FString                                 CommandLine;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Client) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Client");
static_assert(sizeof(DBDPlayerControllerBase_Client) == 0x000010, "Wrong size on DBDPlayerControllerBase_Client");
static_assert(offsetof(DBDPlayerControllerBase_Client, CommandLine) == 0x000000, "Member 'DBDPlayerControllerBase_Client::CommandLine' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client_CallConsoleCmdOnClient
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Client_CallConsoleCmdOnClient final
{
public:
	class FString                                 CommandLine;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Client_CallConsoleCmdOnClient) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Client_CallConsoleCmdOnClient");
static_assert(sizeof(DBDPlayerControllerBase_Client_CallConsoleCmdOnClient) == 0x000010, "Wrong size on DBDPlayerControllerBase_Client_CallConsoleCmdOnClient");
static_assert(offsetof(DBDPlayerControllerBase_Client_CallConsoleCmdOnClient, CommandLine) == 0x000000, "Member 'DBDPlayerControllerBase_Client_CallConsoleCmdOnClient::CommandLine' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client_DisplayChatMessage
// 0x0038 (0x0038 - 0x0000)
struct DBDPlayerControllerBase_Client_DisplayChatMessage final
{
public:
	class FString                                 ChatIdentifier;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerIndex;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MirrorsId;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Client_DisplayChatMessage) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Client_DisplayChatMessage");
static_assert(sizeof(DBDPlayerControllerBase_Client_DisplayChatMessage) == 0x000038, "Wrong size on DBDPlayerControllerBase_Client_DisplayChatMessage");
static_assert(offsetof(DBDPlayerControllerBase_Client_DisplayChatMessage, ChatIdentifier) == 0x000000, "Member 'DBDPlayerControllerBase_Client_DisplayChatMessage::ChatIdentifier' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Client_DisplayChatMessage, PlayerIndex) == 0x000010, "Member 'DBDPlayerControllerBase_Client_DisplayChatMessage::PlayerIndex' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Client_DisplayChatMessage, MirrorsId) == 0x000018, "Member 'DBDPlayerControllerBase_Client_DisplayChatMessage::MirrorsId' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Client_DisplayChatMessage, Msg) == 0x000028, "Member 'DBDPlayerControllerBase_Client_DisplayChatMessage::Msg' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client_EACMessageFromServer
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Client_EACMessageFromServer final
{
public:
	TArray<uint8>                                 Message;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Client_EACMessageFromServer) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Client_EACMessageFromServer");
static_assert(sizeof(DBDPlayerControllerBase_Client_EACMessageFromServer) == 0x000010, "Wrong size on DBDPlayerControllerBase_Client_EACMessageFromServer");
static_assert(offsetof(DBDPlayerControllerBase_Client_EACMessageFromServer, Message) == 0x000000, "Member 'DBDPlayerControllerBase_Client_EACMessageFromServer::Message' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client_SendLogs
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Client_SendLogs final
{
public:
	TArray<class FString>                         Ensures;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Client_SendLogs) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Client_SendLogs");
static_assert(sizeof(DBDPlayerControllerBase_Client_SendLogs) == 0x000010, "Wrong size on DBDPlayerControllerBase_Client_SendLogs");
static_assert(offsetof(DBDPlayerControllerBase_Client_SendLogs, Ensures) == 0x000000, "Member 'DBDPlayerControllerBase_Client_SendLogs::Ensures' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client_SendServerAuthentication
// 0x0020 (0x0020 - 0x0000)
struct DBDPlayerControllerBase_Client_SendServerAuthentication final
{
public:
	class FString                                 AuthServerTicket;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        SteamId;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TicketLength;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DBDPlayerControllerBase_Client_SendServerAuthentication) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Client_SendServerAuthentication");
static_assert(sizeof(DBDPlayerControllerBase_Client_SendServerAuthentication) == 0x000020, "Wrong size on DBDPlayerControllerBase_Client_SendServerAuthentication");
static_assert(offsetof(DBDPlayerControllerBase_Client_SendServerAuthentication, AuthServerTicket) == 0x000000, "Member 'DBDPlayerControllerBase_Client_SendServerAuthentication::AuthServerTicket' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Client_SendServerAuthentication, SteamId) == 0x000010, "Member 'DBDPlayerControllerBase_Client_SendServerAuthentication::SteamId' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Client_SendServerAuthentication, TicketLength) == 0x000018, "Member 'DBDPlayerControllerBase_Client_SendServerAuthentication::TicketLength' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Client_SendWarning
// 0x0008 (0x0008 - 0x0000)
struct DBDPlayerControllerBase_Client_SendWarning final
{
public:
	bool                                          PenaltyStarts;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Seconds;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Client_SendWarning) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_Client_SendWarning");
static_assert(sizeof(DBDPlayerControllerBase_Client_SendWarning) == 0x000008, "Wrong size on DBDPlayerControllerBase_Client_SendWarning");
static_assert(offsetof(DBDPlayerControllerBase_Client_SendWarning, PenaltyStarts) == 0x000000, "Member 'DBDPlayerControllerBase_Client_SendWarning::PenaltyStarts' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Client_SendWarning, Seconds) == 0x000004, "Member 'DBDPlayerControllerBase_Client_SendWarning::Seconds' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_BuildFromMap
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_DBD_BuildFromMap final
{
public:
	class FString                                 Map;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_BuildFromMap) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_DBD_BuildFromMap");
static_assert(sizeof(DBDPlayerControllerBase_DBD_BuildFromMap) == 0x000010, "Wrong size on DBDPlayerControllerBase_DBD_BuildFromMap");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromMap, Map) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_BuildFromMap::Map' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_BuildFromPlayerCount
// 0x0004 (0x0004 - 0x0000)
struct DBDPlayerControllerBase_DBD_BuildFromPlayerCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_BuildFromPlayerCount) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_DBD_BuildFromPlayerCount");
static_assert(sizeof(DBDPlayerControllerBase_DBD_BuildFromPlayerCount) == 0x000004, "Wrong size on DBDPlayerControllerBase_DBD_BuildFromPlayerCount");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromPlayerCount, Count) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_BuildFromPlayerCount::Count' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_BuildFromPremadeMap
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_DBD_BuildFromPremadeMap final
{
public:
	class FString                                 Map;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_BuildFromPremadeMap) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_DBD_BuildFromPremadeMap");
static_assert(sizeof(DBDPlayerControllerBase_DBD_BuildFromPremadeMap) == 0x000010, "Wrong size on DBDPlayerControllerBase_DBD_BuildFromPremadeMap");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromPremadeMap, Map) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_BuildFromPremadeMap::Map' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_BuildFromSeed
// 0x0004 (0x0004 - 0x0000)
struct DBDPlayerControllerBase_DBD_BuildFromSeed final
{
public:
	int32                                         Seed;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_BuildFromSeed) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_DBD_BuildFromSeed");
static_assert(sizeof(DBDPlayerControllerBase_DBD_BuildFromSeed) == 0x000004, "Wrong size on DBDPlayerControllerBase_DBD_BuildFromSeed");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromSeed, Seed) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_BuildFromSeed::Seed' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_BuildFromTile
// 0x0020 (0x0020 - 0x0000)
struct DBDPlayerControllerBase_DBD_BuildFromTile final
{
public:
	int32                                         MatrixX;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatrixY;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rotation;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_BuildFromTile) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_DBD_BuildFromTile");
static_assert(sizeof(DBDPlayerControllerBase_DBD_BuildFromTile) == 0x000020, "Wrong size on DBDPlayerControllerBase_DBD_BuildFromTile");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromTile, MatrixX) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_BuildFromTile::MatrixX' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromTile, MatrixY) == 0x000004, "Member 'DBDPlayerControllerBase_DBD_BuildFromTile::MatrixY' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromTile, Rotation) == 0x000008, "Member 'DBDPlayerControllerBase_DBD_BuildFromTile::Rotation' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_DBD_BuildFromTile, Param_Name) == 0x000010, "Member 'DBDPlayerControllerBase_DBD_BuildFromTile::Param_Name' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_DebugSendChatMessage
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_DBD_DebugSendChatMessage final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_DebugSendChatMessage) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_DBD_DebugSendChatMessage");
static_assert(sizeof(DBDPlayerControllerBase_DBD_DebugSendChatMessage) == 0x000010, "Wrong size on DBDPlayerControllerBase_DBD_DebugSendChatMessage");
static_assert(offsetof(DBDPlayerControllerBase_DBD_DebugSendChatMessage, Msg) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_DebugSendChatMessage::Msg' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_FillScoreCategory
// 0x0004 (0x0004 - 0x0000)
struct DBDPlayerControllerBase_DBD_FillScoreCategory final
{
public:
	int32                                         Category;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_FillScoreCategory) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_DBD_FillScoreCategory");
static_assert(sizeof(DBDPlayerControllerBase_DBD_FillScoreCategory) == 0x000004, "Wrong size on DBDPlayerControllerBase_DBD_FillScoreCategory");
static_assert(offsetof(DBDPlayerControllerBase_DBD_FillScoreCategory, Category) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_FillScoreCategory::Category' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.DBD_FireTestScore
// 0x0008 (0x0008 - 0x0000)
struct DBDPlayerControllerBase_DBD_FireTestScore final
{
public:
	int32                                         Category;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_DBD_FireTestScore) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_DBD_FireTestScore");
static_assert(sizeof(DBDPlayerControllerBase_DBD_FireTestScore) == 0x000008, "Wrong size on DBDPlayerControllerBase_DBD_FireTestScore");
static_assert(offsetof(DBDPlayerControllerBase_DBD_FireTestScore, Category) == 0x000000, "Member 'DBDPlayerControllerBase_DBD_FireTestScore::Category' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_DBD_FireTestScore, Value) == 0x000004, "Member 'DBDPlayerControllerBase_DBD_FireTestScore::Value' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Server final
{
public:
	class FString                                 CommandLine;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server");
static_assert(sizeof(DBDPlayerControllerBase_Server) == 0x000010, "Wrong size on DBDPlayerControllerBase_Server");
static_assert(offsetof(DBDPlayerControllerBase_Server, CommandLine) == 0x000000, "Member 'DBDPlayerControllerBase_Server::CommandLine' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_CallConsoleCmdOnServer
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Server_CallConsoleCmdOnServer final
{
public:
	class FString                                 CommandLine;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_CallConsoleCmdOnServer) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server_CallConsoleCmdOnServer");
static_assert(sizeof(DBDPlayerControllerBase_Server_CallConsoleCmdOnServer) == 0x000010, "Wrong size on DBDPlayerControllerBase_Server_CallConsoleCmdOnServer");
static_assert(offsetof(DBDPlayerControllerBase_Server_CallConsoleCmdOnServer, CommandLine) == 0x000000, "Member 'DBDPlayerControllerBase_Server_CallConsoleCmdOnServer::CommandLine' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_EACMessageFromClient
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Server_EACMessageFromClient final
{
public:
	TArray<uint8>                                 Message;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_EACMessageFromClient) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server_EACMessageFromClient");
static_assert(sizeof(DBDPlayerControllerBase_Server_EACMessageFromClient) == 0x000010, "Wrong size on DBDPlayerControllerBase_Server_EACMessageFromClient");
static_assert(offsetof(DBDPlayerControllerBase_Server_EACMessageFromClient, Message) == 0x000000, "Member 'DBDPlayerControllerBase_Server_EACMessageFromClient::Message' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_ReceivePlayerProfile
// 0x0128 (0x0128 - 0x0000)
struct DBDPlayerControllerBase_Server_ReceivePlayerProfile final
{
public:
	struct FPlayerSavedProfileDataShared          SavedProfileData;                                  // 0x0000(0x0068)(Parm, NativeAccessSpecifierPublic)
	struct FPlayerLoadoutData                     PlayerLoadout;                                     // 0x0068(0x00C0)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_ReceivePlayerProfile) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server_ReceivePlayerProfile");
static_assert(sizeof(DBDPlayerControllerBase_Server_ReceivePlayerProfile) == 0x000128, "Wrong size on DBDPlayerControllerBase_Server_ReceivePlayerProfile");
static_assert(offsetof(DBDPlayerControllerBase_Server_ReceivePlayerProfile, SavedProfileData) == 0x000000, "Member 'DBDPlayerControllerBase_Server_ReceivePlayerProfile::SavedProfileData' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Server_ReceivePlayerProfile, PlayerLoadout) == 0x000068, "Member 'DBDPlayerControllerBase_Server_ReceivePlayerProfile::PlayerLoadout' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_SendClientAuthentication
// 0x0020 (0x0020 - 0x0000)
struct DBDPlayerControllerBase_Server_SendClientAuthentication final
{
public:
	class FString                                 AuthClientTicket;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        SteamId;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TicketLength;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DBDPlayerControllerBase_Server_SendClientAuthentication) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server_SendClientAuthentication");
static_assert(sizeof(DBDPlayerControllerBase_Server_SendClientAuthentication) == 0x000020, "Wrong size on DBDPlayerControllerBase_Server_SendClientAuthentication");
static_assert(offsetof(DBDPlayerControllerBase_Server_SendClientAuthentication, AuthClientTicket) == 0x000000, "Member 'DBDPlayerControllerBase_Server_SendClientAuthentication::AuthClientTicket' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Server_SendClientAuthentication, SteamId) == 0x000010, "Member 'DBDPlayerControllerBase_Server_SendClientAuthentication::SteamId' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Server_SendClientAuthentication, TicketLength) == 0x000018, "Member 'DBDPlayerControllerBase_Server_SendClientAuthentication::TicketLength' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_SendMessage
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerControllerBase_Server_SendMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_SendMessage) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server_SendMessage");
static_assert(sizeof(DBDPlayerControllerBase_Server_SendMessage) == 0x000010, "Wrong size on DBDPlayerControllerBase_Server_SendMessage");
static_assert(offsetof(DBDPlayerControllerBase_Server_SendMessage, Message) == 0x000000, "Member 'DBDPlayerControllerBase_Server_SendMessage::Message' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_SetConsecutiveMatchStreak
// 0x0004 (0x0004 - 0x0000)
struct DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak final
{
public:
	int32                                         ConsecutiveMatch;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak");
static_assert(sizeof(DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak) == 0x000004, "Wrong size on DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak");
static_assert(offsetof(DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak, ConsecutiveMatch) == 0x000000, "Member 'DBDPlayerControllerBase_Server_SetConsecutiveMatchStreak::ConsecutiveMatch' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_SetPlayerCard
// 0x0020 (0x0020 - 0x0000)
struct DBDPlayerControllerBase_Server_SetPlayerCard final
{
public:
	class FString                                 badgeId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bannerId;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_SetPlayerCard) == 0x000008, "Wrong alignment on DBDPlayerControllerBase_Server_SetPlayerCard");
static_assert(sizeof(DBDPlayerControllerBase_Server_SetPlayerCard) == 0x000020, "Wrong size on DBDPlayerControllerBase_Server_SetPlayerCard");
static_assert(offsetof(DBDPlayerControllerBase_Server_SetPlayerCard, badgeId) == 0x000000, "Member 'DBDPlayerControllerBase_Server_SetPlayerCard::badgeId' has a wrong offset!");
static_assert(offsetof(DBDPlayerControllerBase_Server_SetPlayerCard, bannerId) == 0x000010, "Member 'DBDPlayerControllerBase_Server_SetPlayerCard::bannerId' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerControllerBase.Server_UpdateReplicatedPips
// 0x0004 (0x0004 - 0x0000)
struct DBDPlayerControllerBase_Server_UpdateReplicatedPips final
{
public:
	int32                                         PipsToAdd;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerControllerBase_Server_UpdateReplicatedPips) == 0x000004, "Wrong alignment on DBDPlayerControllerBase_Server_UpdateReplicatedPips");
static_assert(sizeof(DBDPlayerControllerBase_Server_UpdateReplicatedPips) == 0x000004, "Wrong size on DBDPlayerControllerBase_Server_UpdateReplicatedPips");
static_assert(offsetof(DBDPlayerControllerBase_Server_UpdateReplicatedPips, PipsToAdd) == 0x000000, "Member 'DBDPlayerControllerBase_Server_UpdateReplicatedPips::PipsToAdd' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Authority_SetPlayerReady
// 0x0001 (0x0001 - 0x0000)
struct DBDPlayerController_Menu_Authority_SetPlayerReady final
{
public:
	bool                                          IsReady;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_Authority_SetPlayerReady) == 0x000001, "Wrong alignment on DBDPlayerController_Menu_Authority_SetPlayerReady");
static_assert(sizeof(DBDPlayerController_Menu_Authority_SetPlayerReady) == 0x000001, "Wrong size on DBDPlayerController_Menu_Authority_SetPlayerReady");
static_assert(offsetof(DBDPlayerController_Menu_Authority_SetPlayerReady, IsReady) == 0x000000, "Member 'DBDPlayerController_Menu_Authority_SetPlayerReady::IsReady' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_GamePresetDataFromClient
// 0x0090 (0x0090 - 0x0000)
struct DBDPlayerController_Menu_Server_GamePresetDataFromClient final
{
public:
	struct FGamePresetData                        GameState;                                         // 0x0000(0x0090)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_Server_GamePresetDataFromClient) == 0x000008, "Wrong alignment on DBDPlayerController_Menu_Server_GamePresetDataFromClient");
static_assert(sizeof(DBDPlayerController_Menu_Server_GamePresetDataFromClient) == 0x000090, "Wrong size on DBDPlayerController_Menu_Server_GamePresetDataFromClient");
static_assert(offsetof(DBDPlayerController_Menu_Server_GamePresetDataFromClient, GameState) == 0x000000, "Member 'DBDPlayerController_Menu_Server_GamePresetDataFromClient::GameState' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetCharacterData
// 0x00C8 (0x00C8 - 0x0000)
struct DBDPlayerController_Menu_Server_SetCharacterData final
{
public:
	int32                                         CharacterIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerDataSync                        PlayerDataSync;                                    // 0x0008(0x00C0)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetCharacterData) == 0x000008, "Wrong alignment on DBDPlayerController_Menu_Server_SetCharacterData");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetCharacterData) == 0x0000C8, "Wrong size on DBDPlayerController_Menu_Server_SetCharacterData");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCharacterData, CharacterIndex) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetCharacterData::CharacterIndex' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCharacterData, PlayerDataSync) == 0x000008, "Member 'DBDPlayerController_Menu_Server_SetCharacterData::PlayerDataSync' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetCharacterLevel
// 0x000C (0x000C - 0x0000)
struct DBDPlayerController_Menu_Server_SetCharacterLevel final
{
public:
	int32                                         CharacterLevel;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrestigeLevel;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallOnRep;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetCharacterLevel) == 0x000004, "Wrong alignment on DBDPlayerController_Menu_Server_SetCharacterLevel");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetCharacterLevel) == 0x00000C, "Wrong size on DBDPlayerController_Menu_Server_SetCharacterLevel");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCharacterLevel, CharacterLevel) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetCharacterLevel::CharacterLevel' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCharacterLevel, PrestigeLevel) == 0x000004, "Member 'DBDPlayerController_Menu_Server_SetCharacterLevel::PrestigeLevel' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCharacterLevel, CallOnRep) == 0x000008, "Member 'DBDPlayerController_Menu_Server_SetCharacterLevel::CallOnRep' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetCustomizationCharm
// 0x0010 (0x0010 - 0x0000)
struct DBDPlayerController_Menu_Server_SetCustomizationCharm final
{
public:
	class FName                                   CharmId;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SlotIndex;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetCustomizationCharm) == 0x000004, "Wrong alignment on DBDPlayerController_Menu_Server_SetCustomizationCharm");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetCustomizationCharm) == 0x000010, "Wrong size on DBDPlayerController_Menu_Server_SetCustomizationCharm");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCustomizationCharm, CharmId) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetCustomizationCharm::CharmId' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCustomizationCharm, SlotIndex) == 0x00000C, "Member 'DBDPlayerController_Menu_Server_SetCustomizationCharm::SlotIndex' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetCustomizationMeshes
// 0x0024 (0x0024 - 0x0000)
struct DBDPlayerController_Menu_Server_SetCustomizationMeshes final
{
public:
	struct FCharacterCustomization                Customization;                                     // 0x0000(0x0024)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetCustomizationMeshes) == 0x000004, "Wrong alignment on DBDPlayerController_Menu_Server_SetCustomizationMeshes");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetCustomizationMeshes) == 0x000024, "Wrong size on DBDPlayerController_Menu_Server_SetCustomizationMeshes");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetCustomizationMeshes, Customization) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetCustomizationMeshes::Customization' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetEquipedPerks
// 0x0028 (0x0028 - 0x0000)
struct DBDPlayerController_Menu_Server_SetEquipedPerks final
{
public:
	TArray<class FName>                           PerkIds;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 PerkLevels;                                        // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          CallOnRep;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AreRandomPerks;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetEquipedPerks) == 0x000008, "Wrong alignment on DBDPlayerController_Menu_Server_SetEquipedPerks");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetEquipedPerks) == 0x000028, "Wrong size on DBDPlayerController_Menu_Server_SetEquipedPerks");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetEquipedPerks, PerkIds) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetEquipedPerks::PerkIds' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetEquipedPerks, PerkLevels) == 0x000010, "Member 'DBDPlayerController_Menu_Server_SetEquipedPerks::PerkLevels' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetEquipedPerks, CallOnRep) == 0x000020, "Member 'DBDPlayerController_Menu_Server_SetEquipedPerks::CallOnRep' has a wrong offset!");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetEquipedPerks, AreRandomPerks) == 0x000021, "Member 'DBDPlayerController_Menu_Server_SetEquipedPerks::AreRandomPerks' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetPlayerLoadout
// 0x00C0 (0x00C0 - 0x0000)
struct DBDPlayerController_Menu_Server_SetPlayerLoadout final
{
public:
	struct FPlayerLoadoutData                     DesiredLoadout;                                    // 0x0000(0x00C0)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetPlayerLoadout) == 0x000008, "Wrong alignment on DBDPlayerController_Menu_Server_SetPlayerLoadout");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetPlayerLoadout) == 0x0000C0, "Wrong size on DBDPlayerController_Menu_Server_SetPlayerLoadout");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetPlayerLoadout, DesiredLoadout) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetPlayerLoadout::DesiredLoadout' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.Server_SetPlayerReady
// 0x0001 (0x0001 - 0x0000)
struct DBDPlayerController_Menu_Server_SetPlayerReady final
{
public:
	bool                                          IsReady;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_Server_SetPlayerReady) == 0x000001, "Wrong alignment on DBDPlayerController_Menu_Server_SetPlayerReady");
static_assert(sizeof(DBDPlayerController_Menu_Server_SetPlayerReady) == 0x000001, "Wrong size on DBDPlayerController_Menu_Server_SetPlayerReady");
static_assert(offsetof(DBDPlayerController_Menu_Server_SetPlayerReady, IsReady) == 0x000000, "Member 'DBDPlayerController_Menu_Server_SetPlayerReady::IsReady' has a wrong offset!");

// Function DeadByDaylight.DBDPlayerController_Menu.SetPlayerReady
// 0x0001 (0x0001 - 0x0000)
struct DBDPlayerController_Menu_SetPlayerReady final
{
public:
	bool                                          IsReady;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDPlayerController_Menu_SetPlayerReady) == 0x000001, "Wrong alignment on DBDPlayerController_Menu_SetPlayerReady");
static_assert(sizeof(DBDPlayerController_Menu_SetPlayerReady) == 0x000001, "Wrong size on DBDPlayerController_Menu_SetPlayerReady");
static_assert(offsetof(DBDPlayerController_Menu_SetPlayerReady, IsReady) == 0x000000, "Member 'DBDPlayerController_Menu_SetPlayerReady::IsReady' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.Apply
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_Apply final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_Apply) == 0x000004, "Wrong alignment on GameplayModifierContainer_Apply");
static_assert(sizeof(GameplayModifierContainer_Apply) == 0x000004, "Wrong size on GameplayModifierContainer_Apply");
static_assert(offsetof(GameplayModifierContainer_Apply, DeltaTime) == 0x000000, "Member 'GameplayModifierContainer_Apply::DeltaTime' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.Authority_SetActivationTimerPaused
// 0x0001 (0x0001 - 0x0000)
struct GameplayModifierContainer_Authority_SetActivationTimerPaused final
{
public:
	bool                                          Paused;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_Authority_SetActivationTimerPaused) == 0x000001, "Wrong alignment on GameplayModifierContainer_Authority_SetActivationTimerPaused");
static_assert(sizeof(GameplayModifierContainer_Authority_SetActivationTimerPaused) == 0x000001, "Wrong size on GameplayModifierContainer_Authority_SetActivationTimerPaused");
static_assert(offsetof(GameplayModifierContainer_Authority_SetActivationTimerPaused, Paused) == 0x000000, "Member 'GameplayModifierContainer_Authority_SetActivationTimerPaused::Paused' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.Authority_TriggerActivationTimer
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_Authority_TriggerActivationTimer final
{
public:
	float                                         ActivationTime;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_Authority_TriggerActivationTimer) == 0x000004, "Wrong alignment on GameplayModifierContainer_Authority_TriggerActivationTimer");
static_assert(sizeof(GameplayModifierContainer_Authority_TriggerActivationTimer) == 0x000004, "Wrong size on GameplayModifierContainer_Authority_TriggerActivationTimer");
static_assert(offsetof(GameplayModifierContainer_Authority_TriggerActivationTimer, ActivationTime) == 0x000000, "Member 'GameplayModifierContainer_Authority_TriggerActivationTimer::ActivationTime' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.ListenToDispatcherGameEvent
// 0x000C (0x000C - 0x0000)
struct GameplayModifierContainer_ListenToDispatcherGameEvent final
{
public:
	struct FGameplayTag                           EventType;                                         // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_ListenToDispatcherGameEvent) == 0x000004, "Wrong alignment on GameplayModifierContainer_ListenToDispatcherGameEvent");
static_assert(sizeof(GameplayModifierContainer_ListenToDispatcherGameEvent) == 0x00000C, "Wrong size on GameplayModifierContainer_ListenToDispatcherGameEvent");
static_assert(offsetof(GameplayModifierContainer_ListenToDispatcherGameEvent, EventType) == 0x000000, "Member 'GameplayModifierContainer_ListenToDispatcherGameEvent::EventType' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.OnGameEventDispatched
// 0x0040 (0x0040 - 0x0000)
struct GameplayModifierContainer_OnGameEventDispatched final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_OnGameEventDispatched) == 0x000008, "Wrong alignment on GameplayModifierContainer_OnGameEventDispatched");
static_assert(sizeof(GameplayModifierContainer_OnGameEventDispatched) == 0x000040, "Wrong size on GameplayModifierContainer_OnGameEventDispatched");
static_assert(offsetof(GameplayModifierContainer_OnGameEventDispatched, GameEventType) == 0x000000, "Member 'GameplayModifierContainer_OnGameEventDispatched::GameEventType' has a wrong offset!");
static_assert(offsetof(GameplayModifierContainer_OnGameEventDispatched, GameEventData) == 0x000010, "Member 'GameplayModifierContainer_OnGameEventDispatched::GameEventData' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.OnRep_OperationConditionsData
// 0x0018 (0x0018 - 0x0000)
struct GameplayModifierContainer_OnRep_OperationConditionsData final
{
public:
	struct FOperationConditionsReplicatedData     OldOperationConditionsData;                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_OnRep_OperationConditionsData) == 0x000008, "Wrong alignment on GameplayModifierContainer_OnRep_OperationConditionsData");
static_assert(sizeof(GameplayModifierContainer_OnRep_OperationConditionsData) == 0x000018, "Wrong size on GameplayModifierContainer_OnRep_OperationConditionsData");
static_assert(offsetof(GameplayModifierContainer_OnRep_OperationConditionsData, OldOperationConditionsData) == 0x000000, "Member 'GameplayModifierContainer_OnRep_OperationConditionsData::OldOperationConditionsData' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.OnRep_TickableConditionsData
// 0x0018 (0x0018 - 0x0000)
struct GameplayModifierContainer_OnRep_TickableConditionsData final
{
public:
	struct FModifierTickableConditionReplicatedData OldTickableConditionsData;                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_OnRep_TickableConditionsData) == 0x000008, "Wrong alignment on GameplayModifierContainer_OnRep_TickableConditionsData");
static_assert(sizeof(GameplayModifierContainer_OnRep_TickableConditionsData) == 0x000018, "Wrong size on GameplayModifierContainer_OnRep_TickableConditionsData");
static_assert(offsetof(GameplayModifierContainer_OnRep_TickableConditionsData, OldTickableConditionsData) == 0x000000, "Member 'GameplayModifierContainer_OnRep_TickableConditionsData::OldTickableConditionsData' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.RemoveModifier
// 0x000C (0x000C - 0x0000)
struct GameplayModifierContainer_RemoveModifier final
{
public:
	struct FGameplayTag                           Type;                                              // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_RemoveModifier) == 0x000004, "Wrong alignment on GameplayModifierContainer_RemoveModifier");
static_assert(sizeof(GameplayModifierContainer_RemoveModifier) == 0x00000C, "Wrong size on GameplayModifierContainer_RemoveModifier");
static_assert(offsetof(GameplayModifierContainer_RemoveModifier, Type) == 0x000000, "Member 'GameplayModifierContainer_RemoveModifier::Type' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.SetFlag
// 0x0010 (0x0010 - 0x0000)
struct GameplayModifierContainer_SetFlag final
{
public:
	struct FGameplayTag                           Flag;                                              // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FlagValue;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayModifierContainer_SetFlag) == 0x000004, "Wrong alignment on GameplayModifierContainer_SetFlag");
static_assert(sizeof(GameplayModifierContainer_SetFlag) == 0x000010, "Wrong size on GameplayModifierContainer_SetFlag");
static_assert(offsetof(GameplayModifierContainer_SetFlag, Flag) == 0x000000, "Member 'GameplayModifierContainer_SetFlag::Flag' has a wrong offset!");
static_assert(offsetof(GameplayModifierContainer_SetFlag, FlagValue) == 0x00000C, "Member 'GameplayModifierContainer_SetFlag::FlagValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.SetModifierValue
// 0x0010 (0x0010 - 0x0000)
struct GameplayModifierContainer_SetModifierValue final
{
public:
	struct FGameplayTag                           Type;                                              // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GameplayModifierValue;                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_SetModifierValue) == 0x000004, "Wrong alignment on GameplayModifierContainer_SetModifierValue");
static_assert(sizeof(GameplayModifierContainer_SetModifierValue) == 0x000010, "Wrong size on GameplayModifierContainer_SetModifierValue");
static_assert(offsetof(GameplayModifierContainer_SetModifierValue, Type) == 0x000000, "Member 'GameplayModifierContainer_SetModifierValue::Type' has a wrong offset!");
static_assert(offsetof(GameplayModifierContainer_SetModifierValue, GameplayModifierValue) == 0x00000C, "Member 'GameplayModifierContainer_SetModifierValue::GameplayModifierValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.UnlistenToDispatcherGameEvent
// 0x000C (0x000C - 0x0000)
struct GameplayModifierContainer_UnlistenToDispatcherGameEvent final
{
public:
	struct FGameplayTag                           EventType;                                         // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_UnlistenToDispatcherGameEvent) == 0x000004, "Wrong alignment on GameplayModifierContainer_UnlistenToDispatcherGameEvent");
static_assert(sizeof(GameplayModifierContainer_UnlistenToDispatcherGameEvent) == 0x00000C, "Wrong size on GameplayModifierContainer_UnlistenToDispatcherGameEvent");
static_assert(offsetof(GameplayModifierContainer_UnlistenToDispatcherGameEvent, EventType) == 0x000000, "Member 'GameplayModifierContainer_UnlistenToDispatcherGameEvent::EventType' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.FireActiveStatusViewEvent
// 0x0044 (0x0044 - 0x0000)
struct GameplayModifierContainer_FireActiveStatusViewEvent final
{
public:
	class FName                                   Param_StatusViewID;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UniqueSourceID;                                    // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatusViewSource                      StatusViewSource;                                  // 0x0018(0x002C)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_FireActiveStatusViewEvent) == 0x000004, "Wrong alignment on GameplayModifierContainer_FireActiveStatusViewEvent");
static_assert(sizeof(GameplayModifierContainer_FireActiveStatusViewEvent) == 0x000044, "Wrong size on GameplayModifierContainer_FireActiveStatusViewEvent");
static_assert(offsetof(GameplayModifierContainer_FireActiveStatusViewEvent, Param_StatusViewID) == 0x000000, "Member 'GameplayModifierContainer_FireActiveStatusViewEvent::Param_StatusViewID' has a wrong offset!");
static_assert(offsetof(GameplayModifierContainer_FireActiveStatusViewEvent, UniqueSourceID) == 0x00000C, "Member 'GameplayModifierContainer_FireActiveStatusViewEvent::UniqueSourceID' has a wrong offset!");
static_assert(offsetof(GameplayModifierContainer_FireActiveStatusViewEvent, StatusViewSource) == 0x000018, "Member 'GameplayModifierContainer_FireActiveStatusViewEvent::StatusViewSource' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerDuration
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_GetActivationTimerDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_GetActivationTimerDuration) == 0x000004, "Wrong alignment on GameplayModifierContainer_GetActivationTimerDuration");
static_assert(sizeof(GameplayModifierContainer_GetActivationTimerDuration) == 0x000004, "Wrong size on GameplayModifierContainer_GetActivationTimerDuration");
static_assert(offsetof(GameplayModifierContainer_GetActivationTimerDuration, ReturnValue) == 0x000000, "Member 'GameplayModifierContainer_GetActivationTimerDuration::ReturnValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerElapsedTime
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_GetActivationTimerElapsedTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_GetActivationTimerElapsedTime) == 0x000004, "Wrong alignment on GameplayModifierContainer_GetActivationTimerElapsedTime");
static_assert(sizeof(GameplayModifierContainer_GetActivationTimerElapsedTime) == 0x000004, "Wrong size on GameplayModifierContainer_GetActivationTimerElapsedTime");
static_assert(offsetof(GameplayModifierContainer_GetActivationTimerElapsedTime, ReturnValue) == 0x000000, "Member 'GameplayModifierContainer_GetActivationTimerElapsedTime::ReturnValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerElapsedTimePercent
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_GetActivationTimerElapsedTimePercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_GetActivationTimerElapsedTimePercent) == 0x000004, "Wrong alignment on GameplayModifierContainer_GetActivationTimerElapsedTimePercent");
static_assert(sizeof(GameplayModifierContainer_GetActivationTimerElapsedTimePercent) == 0x000004, "Wrong size on GameplayModifierContainer_GetActivationTimerElapsedTimePercent");
static_assert(offsetof(GameplayModifierContainer_GetActivationTimerElapsedTimePercent, ReturnValue) == 0x000000, "Member 'GameplayModifierContainer_GetActivationTimerElapsedTimePercent::ReturnValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerPercentRemaining
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_GetActivationTimerPercentRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_GetActivationTimerPercentRemaining) == 0x000004, "Wrong alignment on GameplayModifierContainer_GetActivationTimerPercentRemaining");
static_assert(sizeof(GameplayModifierContainer_GetActivationTimerPercentRemaining) == 0x000004, "Wrong size on GameplayModifierContainer_GetActivationTimerPercentRemaining");
static_assert(offsetof(GameplayModifierContainer_GetActivationTimerPercentRemaining, ReturnValue) == 0x000000, "Member 'GameplayModifierContainer_GetActivationTimerPercentRemaining::ReturnValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerRemainingTime
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_GetActivationTimerRemainingTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_GetActivationTimerRemainingTime) == 0x000004, "Wrong alignment on GameplayModifierContainer_GetActivationTimerRemainingTime");
static_assert(sizeof(GameplayModifierContainer_GetActivationTimerRemainingTime) == 0x000004, "Wrong size on GameplayModifierContainer_GetActivationTimerRemainingTime");
static_assert(offsetof(GameplayModifierContainer_GetActivationTimerRemainingTime, ReturnValue) == 0x000000, "Member 'GameplayModifierContainer_GetActivationTimerRemainingTime::ReturnValue' has a wrong offset!");

// Function DeadByDaylight.GameplayModifierContainer.GetIconFilePathIndex
// 0x0004 (0x0004 - 0x0000)
struct GameplayModifierContainer_GetIconFilePathIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayModifierContainer_GetIconFilePathIndex) == 0x000004, "Wrong alignment on GameplayModifierContainer_GetIconFilePathIndex");
static_assert(sizeof(GameplayModifierContainer_GetIconFilePathIndex) == 0x000004, "Wrong size on GameplayModifierContainer_GetIconFilePathIndex");
static_assert(offsetof(GameplayModifierContainer_GetIconFilePathIndex, ReturnValue) == 0x000000, "Member 'GameplayModifierContainer_GetIconFilePathIndex::ReturnValue' has a wrong offset!");

