#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropBySkillCheck

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function DropBySkillCheck.DropBySkillCheck_C.ExecuteUbergraph_DropBySkillCheck
// 0x0058 (0x0058 - 0x0000)
struct DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerkModifierMaxValue_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMultiplicativeModifierValue_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_B_ImplicitCast;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ExitInteractionTime_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck) == 0x000008, "Wrong alignment on DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck");
static_assert(sizeof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck) == 0x000058, "Wrong size on DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, EntryPoint) == 0x000000, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::EntryPoint' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, K2Node_Event_player) == 0x000008, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, K2Node_Event_actualSnapTime) == 0x000010, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_GetCamper_ReturnValue) == 0x000018, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_GetPerkModifierMaxValue_ReturnValue) == 0x000024, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_GetPerkModifierMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_GetPerkManager_ReturnValue) == 0x000028, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_GetMultiplicativeModifierValue_ReturnValue) == 0x000030, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_GetMultiplicativeModifierValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000038, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_FMax_ReturnValue) == 0x000040, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, CallFunc_FMax_B_ImplicitCast) == 0x000048, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::CallFunc_FMax_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck, K2Node_VariableSet_ExitInteractionTime_ImplicitCast) == 0x000050, "Member 'DropBySkillCheck_C_ExecuteUbergraph_DropBySkillCheck::K2Node_VariableSet_ExitInteractionTime_ImplicitCast' has a wrong offset!");

// Function DropBySkillCheck.DropBySkillCheck_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct DropBySkillCheck_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropBySkillCheck_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on DropBySkillCheck_C_OnInteractionEnterStart");
static_assert(sizeof(DropBySkillCheck_C_OnInteractionEnterStart) == 0x000010, "Wrong size on DropBySkillCheck_C_OnInteractionEnterStart");
static_assert(offsetof(DropBySkillCheck_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'DropBySkillCheck_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'DropBySkillCheck_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function DropBySkillCheck.DropBySkillCheck_C.CanOverrideInteraction
// 0x0010 (0x0010 - 0x0000)
struct DropBySkillCheck_C_CanOverrideInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOverrideInteraction_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropBySkillCheck_C_CanOverrideInteraction) == 0x000008, "Wrong alignment on DropBySkillCheck_C_CanOverrideInteraction");
static_assert(sizeof(DropBySkillCheck_C_CanOverrideInteraction) == 0x000010, "Wrong size on DropBySkillCheck_C_CanOverrideInteraction");
static_assert(offsetof(DropBySkillCheck_C_CanOverrideInteraction, Interaction) == 0x000000, "Member 'DropBySkillCheck_C_CanOverrideInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_CanOverrideInteraction, ReturnValue) == 0x000008, "Member 'DropBySkillCheck_C_CanOverrideInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_CanOverrideInteraction, CallFunc_CanOverrideInteraction_ReturnValue) == 0x000009, "Member 'DropBySkillCheck_C_CanOverrideInteraction::CallFunc_CanOverrideInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_CanOverrideInteraction, CallFunc_Array_Contains_ReturnValue) == 0x00000A, "Member 'DropBySkillCheck_C_CanOverrideInteraction::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_CanOverrideInteraction, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'DropBySkillCheck_C_CanOverrideInteraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function DropBySkillCheck.DropBySkillCheck_C.IsInteractionPossibleBP
// 0x0010 (0x0010 - 0x0000)
struct DropBySkillCheck_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropBySkillCheck_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on DropBySkillCheck_C_IsInteractionPossibleBP");
static_assert(sizeof(DropBySkillCheck_C_IsInteractionPossibleBP) == 0x000010, "Wrong size on DropBySkillCheck_C_IsInteractionPossibleBP");
static_assert(offsetof(DropBySkillCheck_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'DropBySkillCheck_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'DropBySkillCheck_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(DropBySkillCheck_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'DropBySkillCheck_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");

}

