#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropByStunningFlashlight

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function DropByStunningFlashlight.DropByStunningFlashlight_C.DispatchStunEvent
// 0x0008 (0x0008 - 0x0000)
struct DropByStunningFlashlight_C_DispatchStunEvent final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByStunningFlashlight_C_DispatchStunEvent) == 0x000008, "Wrong alignment on DropByStunningFlashlight_C_DispatchStunEvent");
static_assert(sizeof(DropByStunningFlashlight_C_DispatchStunEvent) == 0x000008, "Wrong size on DropByStunningFlashlight_C_DispatchStunEvent");
static_assert(offsetof(DropByStunningFlashlight_C_DispatchStunEvent, Player) == 0x000000, "Member 'DropByStunningFlashlight_C_DispatchStunEvent::Player' has a wrong offset!");

// Function DropByStunningFlashlight.DropByStunningFlashlight_C.ExecuteUbergraph_DropByStunningFlashlight
// 0x00A8 (0x00A8 - 0x0000)
struct DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPlayerProperties           CallFunc_GetInteractionPlayerProperties_ReturnValue; // 0x0020(0x0078)(ConstParm, NoDestructor)
	class ACamperPlayer*                          CallFunc_GetCarriedCamper_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCarrying_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight) == 0x000008, "Wrong alignment on DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight");
static_assert(sizeof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight) == 0x0000A8, "Wrong size on DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, EntryPoint) == 0x000000, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, K2Node_Event_player) == 0x000008, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, K2Node_DynamicCast_AsSlasher_Player) == 0x000010, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, CallFunc_GetInteractionPlayerProperties_ReturnValue) == 0x000020, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::CallFunc_GetInteractionPlayerProperties_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, CallFunc_GetCarriedCamper_ReturnValue) == 0x000098, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::CallFunc_GetCarriedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight, CallFunc_IsCarrying_ReturnValue) == 0x0000A0, "Member 'DropByStunningFlashlight_C_ExecuteUbergraph_DropByStunningFlashlight::CallFunc_IsCarrying_ReturnValue' has a wrong offset!");

}

