#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop

#include "Basic.hpp"

#include "BaseSlasherInteraction_classes.hpp"
#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Drop.Drop_C
// 0x0010 (0x0790 - 0x0780)
class UDrop_C : public UBaseSlasherInteraction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SetCamperDamageToInjured;                          // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStunDrop;                                        // 0x0789(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCamperAsStunInstigator;                         // 0x078A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DispatchStunEvent(class ADBDPlayer* Player);
	void ExecuteUbergraph_Drop(int32 EntryPoint);
	void OnInteractionEnterStart(class ADBDPlayer* Player, float ActualSnapTime);
	void OnInteractionExitStart(class ADBDPlayer* Player);
	void OnInteractionFinished(class ADBDPlayer* Player, bool HasInteractionStarted);
	void OnInteractionUpdateMontageReachedMiddle(class ADBDPlayer* Player);
	void OnInteractionUpdateStart(class ADBDPlayer* Player);
	void OnSurvivorFreed(class ASlasherPlayer* Slasher);
	void SetCarry(class ADBDPlayer* Killer, class ADBDPlayer* Survivor, bool Carry);

	TArray<class AActor*> GetActorsToIgnoreOverlap() const;
	bool HasSlasherClearPathToDropOffPoint(class ASlasherPlayer* Slasher) const;
	bool IsInteractionPossibleBP(const class ADBDPlayer* Player, EInputInteractionType InteractionType) const;
	bool TestKillerGuidedCamperIsOwner(class ASlasherPlayer* Killer) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Drop_C">();
	}
	static class UDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrop_C>();
	}
};
static_assert(alignof(UDrop_C) == 0x000010, "Wrong alignment on UDrop_C");
static_assert(sizeof(UDrop_C) == 0x000790, "Wrong size on UDrop_C");
static_assert(offsetof(UDrop_C, UberGraphFrame) == 0x000780, "Member 'UDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDrop_C, SetCamperDamageToInjured) == 0x000788, "Member 'UDrop_C::SetCamperDamageToInjured' has a wrong offset!");
static_assert(offsetof(UDrop_C, IsStunDrop) == 0x000789, "Member 'UDrop_C::IsStunDrop' has a wrong offset!");
static_assert(offsetof(UDrop_C, UseCamperAsStunInstigator) == 0x00078A, "Member 'UDrop_C::UseCamperAsStunInstigator' has a wrong offset!");

}

