#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropByStunningPallet

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function DropByStunningPallet.DropByStunningPallet_C.DispatchStunEvent
// 0x0008 (0x0008 - 0x0000)
struct DropByStunningPallet_C_DispatchStunEvent final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByStunningPallet_C_DispatchStunEvent) == 0x000008, "Wrong alignment on DropByStunningPallet_C_DispatchStunEvent");
static_assert(sizeof(DropByStunningPallet_C_DispatchStunEvent) == 0x000008, "Wrong size on DropByStunningPallet_C_DispatchStunEvent");
static_assert(offsetof(DropByStunningPallet_C_DispatchStunEvent, Player) == 0x000000, "Member 'DropByStunningPallet_C_DispatchStunEvent::Player' has a wrong offset!");

// Function DropByStunningPallet.DropByStunningPallet_C.ExecuteUbergraph_DropByStunningPallet
// 0x0130 (0x0130 - 0x0000)
struct DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCarriedCamper_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCarrying_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionPlayerProperties           CallFunc_GetInteractionPlayerProperties_ReturnValue; // 0x0030(0x0078)(ConstParm, NoDestructor)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMultiplicativeModifierValue_ReturnValue; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ExitInteractionTime_ImplicitCast; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DefaultInteractionTime_ImplicitCast; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultExitInteractionTime_ImplicitCast; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast_1;     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_B_ImplicitCast;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_B_ImplicitCast_1;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_InteractionTime_ImplicitCast;   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ExitInteractionTime_ImplicitCast_1; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_InteractionTime_ImplicitCast_1; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet) == 0x000008, "Wrong alignment on DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet");
static_assert(sizeof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet) == 0x000130, "Wrong size on DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, EntryPoint) == 0x000000, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::EntryPoint' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_Event_player_2) == 0x000008, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_DynamicCast_AsSlasher_Player) == 0x000010, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_GetCarriedCamper_ReturnValue) == 0x000020, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_GetCarriedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_IsCarrying_ReturnValue) == 0x000028, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_IsCarrying_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_GetInteractionPlayerProperties_ReturnValue) == 0x000030, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_GetInteractionPlayerProperties_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_Event_player_1) == 0x0000A8, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_Event_actualSnapTime) == 0x0000B0, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_GetPerkManager_ReturnValue) == 0x0000B8, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_GetMultiplicativeModifierValue_ReturnValue) == 0x0000C0, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_GetMultiplicativeModifierValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_Event_player) == 0x0000C8, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_Event_hasInteractionStarted) == 0x0000D0, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_Event_hasInteractionStarted' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D8, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_FMax_ReturnValue) == 0x0000E0, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_FMax_ReturnValue_1) == 0x0000E8, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_VariableSet_ExitInteractionTime_ImplicitCast) == 0x0000F0, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_VariableSet_ExitInteractionTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_VariableSet_DefaultInteractionTime_ImplicitCast) == 0x0000F8, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_VariableSet_DefaultInteractionTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_VariableSet_DefaultExitInteractionTime_ImplicitCast) == 0x000100, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_VariableSet_DefaultExitInteractionTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_Multiply_FloatFloat_A_ImplicitCast) == 0x000108, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_Multiply_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_Multiply_FloatFloat_A_ImplicitCast_1) == 0x00010C, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_Multiply_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_FMax_B_ImplicitCast) == 0x000110, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_FMax_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, CallFunc_FMax_B_ImplicitCast_1) == 0x000118, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::CallFunc_FMax_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_VariableSet_InteractionTime_ImplicitCast) == 0x000120, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_VariableSet_InteractionTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_VariableSet_ExitInteractionTime_ImplicitCast_1) == 0x000124, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_VariableSet_ExitInteractionTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet, K2Node_VariableSet_InteractionTime_ImplicitCast_1) == 0x000128, "Member 'DropByStunningPallet_C_ExecuteUbergraph_DropByStunningPallet::K2Node_VariableSet_InteractionTime_ImplicitCast_1' has a wrong offset!");

// Function DropByStunningPallet.DropByStunningPallet_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct DropByStunningPallet_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByStunningPallet_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on DropByStunningPallet_C_OnInteractionEnterStart");
static_assert(sizeof(DropByStunningPallet_C_OnInteractionEnterStart) == 0x000010, "Wrong size on DropByStunningPallet_C_OnInteractionEnterStart");
static_assert(offsetof(DropByStunningPallet_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'DropByStunningPallet_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'DropByStunningPallet_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function DropByStunningPallet.DropByStunningPallet_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct DropByStunningPallet_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByStunningPallet_C_OnInteractionFinished) == 0x000008, "Wrong alignment on DropByStunningPallet_C_OnInteractionFinished");
static_assert(sizeof(DropByStunningPallet_C_OnInteractionFinished) == 0x000010, "Wrong size on DropByStunningPallet_C_OnInteractionFinished");
static_assert(offsetof(DropByStunningPallet_C_OnInteractionFinished, Player) == 0x000000, "Member 'DropByStunningPallet_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(DropByStunningPallet_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'DropByStunningPallet_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

}

