#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drop

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function Drop.Drop_C.DispatchStunEvent
// 0x0098 (0x0098 - 0x0000)
struct Drop_C_DispatchStunEvent final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInteractionPlayerProperties           CallFunc_GetInteractionPlayerProperties_ReturnValue; // 0x0008(0x0078)(ConstParm, NoDestructor)
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ADBDPlayer>              K2Node_Select_Default;                             // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_DispatchStunEvent) == 0x000008, "Wrong alignment on Drop_C_DispatchStunEvent");
static_assert(sizeof(Drop_C_DispatchStunEvent) == 0x000098, "Wrong size on Drop_C_DispatchStunEvent");
static_assert(offsetof(Drop_C_DispatchStunEvent, Player) == 0x000000, "Member 'Drop_C_DispatchStunEvent::Player' has a wrong offset!");
static_assert(offsetof(Drop_C_DispatchStunEvent, CallFunc_GetInteractionPlayerProperties_ReturnValue) == 0x000008, "Member 'Drop_C_DispatchStunEvent::CallFunc_GetInteractionPlayerProperties_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_DispatchStunEvent, CallFunc_GetCamper_ReturnValue) == 0x000080, "Member 'Drop_C_DispatchStunEvent::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_DispatchStunEvent, Temp_bool_Variable) == 0x000088, "Member 'Drop_C_DispatchStunEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Drop_C_DispatchStunEvent, K2Node_Select_Default) == 0x00008C, "Member 'Drop_C_DispatchStunEvent::K2Node_Select_Default' has a wrong offset!");

// Function Drop.Drop_C.ExecuteUbergraph_Drop
// 0x00D8 (0x00D8 - 0x0000)
struct Drop_C_ExecuteUbergraph_Drop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FScoreEventData                        K2Node_MakeStruct_ScoreEventData;                  // 0x0018(0x0018)(NoDestructor)
	class ADBDPlayer*                             K2Node_Event_player_4;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue_1;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player_1;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectStateProvider>  CallFunc_RemoveStateTag_objectStateProvider_CastInput; // 0x0078(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_2;                             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_3;                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player_2;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectStateProvider>  CallFunc_AddStateTag_objectStateProvider_CastInput; // 0x00C0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_ExecuteUbergraph_Drop) == 0x000008, "Wrong alignment on Drop_C_ExecuteUbergraph_Drop");
static_assert(sizeof(Drop_C_ExecuteUbergraph_Drop) == 0x0000D8, "Wrong size on Drop_C_ExecuteUbergraph_Drop");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, EntryPoint) == 0x000000, "Member 'Drop_C_ExecuteUbergraph_Drop::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_player_1) == 0x000008, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_GetCamper_ReturnValue) == 0x000010, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_MakeStruct_ScoreEventData) == 0x000018, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_MakeStruct_ScoreEventData' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_player_4) == 0x000030, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_hasInteractionStarted) == 0x000038, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_hasInteractionStarted' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_GetCamper_ReturnValue_1) == 0x000040, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_GetCamper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_GetHealthComponent_ReturnValue) == 0x000048, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_DynamicCast_AsSlasher_Player) == 0x000058, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_DynamicCast_AsSlasher_Player_1) == 0x000068, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_DynamicCast_AsSlasher_Player_1' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_RemoveStateTag_objectStateProvider_CastInput) == 0x000078, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_RemoveStateTag_objectStateProvider_CastInput' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_player_2) == 0x000090, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_actualSnapTime) == 0x000098, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_player) == 0x0000A0, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_Event_player_3) == 0x0000A8, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_DynamicCast_AsSlasher_Player_2) == 0x0000B0, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_DynamicCast_AsSlasher_Player_2' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'Drop_C_ExecuteUbergraph_Drop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_AddStateTag_objectStateProvider_CastInput) == 0x0000C0, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_AddStateTag_objectStateProvider_CastInput' has a wrong offset!");
static_assert(offsetof(Drop_C_ExecuteUbergraph_Drop, CallFunc_HasAuthority_ReturnValue) == 0x0000D0, "Member 'Drop_C_ExecuteUbergraph_Drop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Drop.Drop_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct Drop_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on Drop_C_OnInteractionEnterStart");
static_assert(sizeof(Drop_C_OnInteractionEnterStart) == 0x000010, "Wrong size on Drop_C_OnInteractionEnterStart");
static_assert(offsetof(Drop_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'Drop_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(Drop_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'Drop_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function Drop.Drop_C.OnInteractionExitStart
// 0x0008 (0x0008 - 0x0000)
struct Drop_C_OnInteractionExitStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_OnInteractionExitStart) == 0x000008, "Wrong alignment on Drop_C_OnInteractionExitStart");
static_assert(sizeof(Drop_C_OnInteractionExitStart) == 0x000008, "Wrong size on Drop_C_OnInteractionExitStart");
static_assert(offsetof(Drop_C_OnInteractionExitStart, Player) == 0x000000, "Member 'Drop_C_OnInteractionExitStart::Player' has a wrong offset!");

// Function Drop.Drop_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct Drop_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_OnInteractionFinished) == 0x000008, "Wrong alignment on Drop_C_OnInteractionFinished");
static_assert(sizeof(Drop_C_OnInteractionFinished) == 0x000010, "Wrong size on Drop_C_OnInteractionFinished");
static_assert(offsetof(Drop_C_OnInteractionFinished, Player) == 0x000000, "Member 'Drop_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(Drop_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'Drop_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function Drop.Drop_C.OnInteractionUpdateMontageReachedMiddle
// 0x0008 (0x0008 - 0x0000)
struct Drop_C_OnInteractionUpdateMontageReachedMiddle final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_OnInteractionUpdateMontageReachedMiddle) == 0x000008, "Wrong alignment on Drop_C_OnInteractionUpdateMontageReachedMiddle");
static_assert(sizeof(Drop_C_OnInteractionUpdateMontageReachedMiddle) == 0x000008, "Wrong size on Drop_C_OnInteractionUpdateMontageReachedMiddle");
static_assert(offsetof(Drop_C_OnInteractionUpdateMontageReachedMiddle, Player) == 0x000000, "Member 'Drop_C_OnInteractionUpdateMontageReachedMiddle::Player' has a wrong offset!");

// Function Drop.Drop_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct Drop_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on Drop_C_OnInteractionUpdateStart");
static_assert(sizeof(Drop_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on Drop_C_OnInteractionUpdateStart");
static_assert(offsetof(Drop_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'Drop_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function Drop.Drop_C.OnSurvivorFreed
// 0x0028 (0x0028 - 0x0000)
struct Drop_C_OnSurvivorFreed final
{
public:
	class ASlasherPlayer*                         Slasher;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCarriedCamper_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_OnSurvivorFreed) == 0x000008, "Wrong alignment on Drop_C_OnSurvivorFreed");
static_assert(sizeof(Drop_C_OnSurvivorFreed) == 0x000028, "Wrong size on Drop_C_OnSurvivorFreed");
static_assert(offsetof(Drop_C_OnSurvivorFreed, Slasher) == 0x000000, "Member 'Drop_C_OnSurvivorFreed::Slasher' has a wrong offset!");
static_assert(offsetof(Drop_C_OnSurvivorFreed, CallFunc_GetCamper_ReturnValue) == 0x000008, "Member 'Drop_C_OnSurvivorFreed::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_OnSurvivorFreed, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Drop_C_OnSurvivorFreed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_OnSurvivorFreed, CallFunc_GetCarriedCamper_ReturnValue) == 0x000018, "Member 'Drop_C_OnSurvivorFreed::CallFunc_GetCarriedCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_OnSurvivorFreed, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'Drop_C_OnSurvivorFreed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Drop.Drop_C.SetCarry
// 0x0018 (0x0018 - 0x0000)
struct Drop_C_SetCarry final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             Survivor;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Carry;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_SetCarry) == 0x000008, "Wrong alignment on Drop_C_SetCarry");
static_assert(sizeof(Drop_C_SetCarry) == 0x000018, "Wrong size on Drop_C_SetCarry");
static_assert(offsetof(Drop_C_SetCarry, Killer) == 0x000000, "Member 'Drop_C_SetCarry::Killer' has a wrong offset!");
static_assert(offsetof(Drop_C_SetCarry, Survivor) == 0x000008, "Member 'Drop_C_SetCarry::Survivor' has a wrong offset!");
static_assert(offsetof(Drop_C_SetCarry, Carry) == 0x000010, "Member 'Drop_C_SetCarry::Carry' has a wrong offset!");
static_assert(offsetof(Drop_C_SetCarry, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Drop_C_SetCarry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_SetCarry, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'Drop_C_SetCarry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Drop.Drop_C.GetActorsToIgnoreOverlap
// 0x0030 (0x0030 - 0x0000)
struct Drop_C_GetActorsToIgnoreOverlap final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_GetActorsToIgnoreOverlap) == 0x000008, "Wrong alignment on Drop_C_GetActorsToIgnoreOverlap");
static_assert(sizeof(Drop_C_GetActorsToIgnoreOverlap) == 0x000030, "Wrong size on Drop_C_GetActorsToIgnoreOverlap");
static_assert(offsetof(Drop_C_GetActorsToIgnoreOverlap, ReturnValue) == 0x000000, "Member 'Drop_C_GetActorsToIgnoreOverlap::ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_GetActorsToIgnoreOverlap, CallFunc_GetCamper_ReturnValue) == 0x000010, "Member 'Drop_C_GetActorsToIgnoreOverlap::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_GetActorsToIgnoreOverlap, K2Node_MakeArray_Array) == 0x000018, "Member 'Drop_C_GetActorsToIgnoreOverlap::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Drop_C_GetActorsToIgnoreOverlap, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Drop_C_GetActorsToIgnoreOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Drop.Drop_C.HasSlasherClearPathToDropOffPoint
// 0x0030 (0x0030 - 0x0000)
struct Drop_C_HasSlasherClearPathToDropOffPoint final
{
public:
	class ASlasherPlayer*                         Slasher;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPlayerDropOffPoint_ReturnValue;        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasClearPathToTarget_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_HasSlasherClearPathToDropOffPoint) == 0x000008, "Wrong alignment on Drop_C_HasSlasherClearPathToDropOffPoint");
static_assert(sizeof(Drop_C_HasSlasherClearPathToDropOffPoint) == 0x000030, "Wrong size on Drop_C_HasSlasherClearPathToDropOffPoint");
static_assert(offsetof(Drop_C_HasSlasherClearPathToDropOffPoint, Slasher) == 0x000000, "Member 'Drop_C_HasSlasherClearPathToDropOffPoint::Slasher' has a wrong offset!");
static_assert(offsetof(Drop_C_HasSlasherClearPathToDropOffPoint, ReturnValue) == 0x000008, "Member 'Drop_C_HasSlasherClearPathToDropOffPoint::ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_HasSlasherClearPathToDropOffPoint, CallFunc_GetPlayerDropOffPoint_ReturnValue) == 0x000010, "Member 'Drop_C_HasSlasherClearPathToDropOffPoint::CallFunc_GetPlayerDropOffPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_HasSlasherClearPathToDropOffPoint, CallFunc_HasClearPathToTarget_ReturnValue) == 0x000028, "Member 'Drop_C_HasSlasherClearPathToDropOffPoint::CallFunc_HasClearPathToTarget_ReturnValue' has a wrong offset!");

// Function Drop.Drop_C.IsInteractionPossibleBP
// 0x0030 (0x0030 - 0x0000)
struct Drop_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestKillerGuidedCamperIsOwner_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCarrying_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on Drop_C_IsInteractionPossibleBP");
static_assert(sizeof(Drop_C_IsInteractionPossibleBP) == 0x000030, "Wrong size on Drop_C_IsInteractionPossibleBP");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'Drop_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'Drop_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'Drop_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, Result) == 0x00000A, "Member 'Drop_C_IsInteractionPossibleBP::Result' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, K2Node_DynamicCast_AsSlasher_Player) == 0x000010, "Member 'Drop_C_IsInteractionPossibleBP::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Drop_C_IsInteractionPossibleBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_TestKillerGuidedCamperIsOwner_ReturnValue) == 0x000019, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_TestKillerGuidedCamperIsOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_IsFalling_ReturnValue) == 0x00001A, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_IsCarrying_ReturnValue) == 0x00001B, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_IsCarrying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_GetCamper_ReturnValue) == 0x000020, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000028, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drop_C_IsInteractionPossibleBP, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'Drop_C_IsInteractionPossibleBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Drop.Drop_C.TestKillerGuidedCamperIsOwner
// 0x0030 (0x0030 - 0x0000)
struct Drop_C_TestKillerGuidedCamperIsOwner final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCarriedCamper_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drop_C_TestKillerGuidedCamperIsOwner) == 0x000008, "Wrong alignment on Drop_C_TestKillerGuidedCamperIsOwner");
static_assert(sizeof(Drop_C_TestKillerGuidedCamperIsOwner) == 0x000030, "Wrong size on Drop_C_TestKillerGuidedCamperIsOwner");
static_assert(offsetof(Drop_C_TestKillerGuidedCamperIsOwner, Killer) == 0x000000, "Member 'Drop_C_TestKillerGuidedCamperIsOwner::Killer' has a wrong offset!");
static_assert(offsetof(Drop_C_TestKillerGuidedCamperIsOwner, ReturnValue) == 0x000008, "Member 'Drop_C_TestKillerGuidedCamperIsOwner::ReturnValue' has a wrong offset!");
static_assert(offsetof(Drop_C_TestKillerGuidedCamperIsOwner, Result) == 0x000009, "Member 'Drop_C_TestKillerGuidedCamperIsOwner::Result' has a wrong offset!");
