#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropByStunningPallet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DropByStunning_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DropByStunningPallet.DropByStunningPallet_C
// 0x0010 (0x07C0 - 0x07B0)
class UDropByStunningPallet_C final : public UDropByStunning_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DropByStunningPallet_C;             // 0x07A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DefaultInteractionTime;                            // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultExitInteractionTime;                        // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DispatchStunEvent(class ADBDPlayer* Player);
	void ExecuteUbergraph_DropByStunningPallet(int32 EntryPoint);
	void OnInteractionEnterStart(class ADBDPlayer* Player, float ActualSnapTime);
	void OnInteractionFinished(class ADBDPlayer* Player, bool HasInteractionStarted);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DropByStunningPallet_C">();
	}
	static class UDropByStunningPallet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDropByStunningPallet_C>();
	}
};
static_assert(alignof(UDropByStunningPallet_C) == 0x000010, "Wrong alignment on UDropByStunningPallet_C");
static_assert(sizeof(UDropByStunningPallet_C) == 0x0007C0, "Wrong size on UDropByStunningPallet_C");
static_assert(offsetof(UDropByStunningPallet_C, UberGraphFrame_DropByStunningPallet_C) == 0x0007A8, "Member 'UDropByStunningPallet_C::UberGraphFrame_DropByStunningPallet_C' has a wrong offset!");
static_assert(offsetof(UDropByStunningPallet_C, DefaultInteractionTime) == 0x0007B0, "Member 'UDropByStunningPallet_C::DefaultInteractionTime' has a wrong offset!");
static_assert(offsetof(UDropByStunningPallet_C, DefaultExitInteractionTime) == 0x0007B8, "Member 'UDropByStunningPallet_C::DefaultExitInteractionTime' has a wrong offset!");

}

