#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropByWiggleFree

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function DropByWiggleFree.DropByWiggleFree_C.ExecuteUbergraph_DropByWiggleFree
// 0x0018 (0x0018 - 0x0000)
struct DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetCamper_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree) == 0x000008, "Wrong alignment on DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree");
static_assert(sizeof(DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree) == 0x000018, "Wrong size on DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree");
static_assert(offsetof(DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree, EntryPoint) == 0x000000, "Member 'DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree::EntryPoint' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree, CallFunc_GetCamper_ReturnValue) == 0x000008, "Member 'DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree::CallFunc_GetCamper_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree, K2Node_Event_player) == 0x000010, "Member 'DropByWiggleFree_C_ExecuteUbergraph_DropByWiggleFree::K2Node_Event_player' has a wrong offset!");

// Function DropByWiggleFree.DropByWiggleFree_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct DropByWiggleFree_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByWiggleFree_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on DropByWiggleFree_C_OnInteractionUpdateStart");
static_assert(sizeof(DropByWiggleFree_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on DropByWiggleFree_C_OnInteractionUpdateStart");
static_assert(offsetof(DropByWiggleFree_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'DropByWiggleFree_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function DropByWiggleFree.DropByWiggleFree_C.CanOverrideInteraction
// 0x0010 (0x0010 - 0x0000)
struct DropByWiggleFree_C_CanOverrideInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOverrideInteraction_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByWiggleFree_C_CanOverrideInteraction) == 0x000008, "Wrong alignment on DropByWiggleFree_C_CanOverrideInteraction");
static_assert(sizeof(DropByWiggleFree_C_CanOverrideInteraction) == 0x000010, "Wrong size on DropByWiggleFree_C_CanOverrideInteraction");
static_assert(offsetof(DropByWiggleFree_C_CanOverrideInteraction, Interaction) == 0x000000, "Member 'DropByWiggleFree_C_CanOverrideInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_CanOverrideInteraction, ReturnValue) == 0x000008, "Member 'DropByWiggleFree_C_CanOverrideInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_CanOverrideInteraction, CallFunc_CanOverrideInteraction_ReturnValue) == 0x000009, "Member 'DropByWiggleFree_C_CanOverrideInteraction::CallFunc_CanOverrideInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_CanOverrideInteraction, CallFunc_Array_Contains_ReturnValue) == 0x00000A, "Member 'DropByWiggleFree_C_CanOverrideInteraction::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_CanOverrideInteraction, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'DropByWiggleFree_C_CanOverrideInteraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function DropByWiggleFree.DropByWiggleFree_C.IsInteractionPossibleBP
// 0x0010 (0x0010 - 0x0000)
struct DropByWiggleFree_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionPossibleBP_ReturnValue;      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DropByWiggleFree_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on DropByWiggleFree_C_IsInteractionPossibleBP");
static_assert(sizeof(DropByWiggleFree_C_IsInteractionPossibleBP) == 0x000010, "Wrong size on DropByWiggleFree_C_IsInteractionPossibleBP");
static_assert(offsetof(DropByWiggleFree_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'DropByWiggleFree_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'DropByWiggleFree_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'DropByWiggleFree_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(DropByWiggleFree_C_IsInteractionPossibleBP, CallFunc_IsInteractionPossibleBP_ReturnValue) == 0x00000A, "Member 'DropByWiggleFree_C_IsInteractionPossibleBP::CallFunc_IsInteractionPossibleBP_ReturnValue' has a wrong offset!");

}

