#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicCapsuleResizerTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DynamicCapsuleResizerTrigger.DynamicCapsuleResizerTrigger_C
// 0x0018 (0x02B8 - 0x02A0)
class ADynamicCapsuleResizerTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_DynamicCapsuleResizerTrigger(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DynamicCapsuleResizerTrigger_C">();
	}
	static class ADynamicCapsuleResizerTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicCapsuleResizerTrigger_C>();
	}
};
static_assert(alignof(ADynamicCapsuleResizerTrigger_C) == 0x000008, "Wrong alignment on ADynamicCapsuleResizerTrigger_C");
static_assert(sizeof(ADynamicCapsuleResizerTrigger_C) == 0x0002B8, "Wrong size on ADynamicCapsuleResizerTrigger_C");
static_assert(offsetof(ADynamicCapsuleResizerTrigger_C, UberGraphFrame) == 0x0002A0, "Member 'ADynamicCapsuleResizerTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADynamicCapsuleResizerTrigger_C, Box) == 0x0002A8, "Member 'ADynamicCapsuleResizerTrigger_C::Box' has a wrong offset!");
static_assert(offsetof(ADynamicCapsuleResizerTrigger_C, DefaultSceneRoot) == 0x0002B0, "Member 'ADynamicCapsuleResizerTrigger_C::DefaultSceneRoot' has a wrong offset!");

}

