#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicCapsuleResizerTrigger

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicCapsuleResizerTrigger.DynamicCapsuleResizerTrigger_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap");
static_assert(sizeof(DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'DynamicCapsuleResizerTrigger_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function DynamicCapsuleResizerTrigger.DynamicCapsuleResizerTrigger_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap");
static_assert(sizeof(DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'DynamicCapsuleResizerTrigger_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function DynamicCapsuleResizerTrigger.DynamicCapsuleResizerTrigger_C.ExecuteUbergraph_DynamicCapsuleResizerTrigger
// 0x0030 (0x0030 - 0x0000)
struct DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicCapsuleResizerComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDynamicCapsuleResizerComponent*        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger) == 0x000008, "Wrong alignment on DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger");
static_assert(sizeof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger) == 0x000030, "Wrong size on DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, EntryPoint) == 0x000000, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, K2Node_Event_OtherActor) == 0x000008, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, K2Node_Event_OtherActor_1) == 0x000018, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000020, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'DynamicCapsuleResizerTrigger_C_ExecuteUbergraph_DynamicCapsuleResizerTrigger::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

