#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndGameEffectsComponent

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.EndGameOver
// 0x0040 (0x0040 - 0x0000)
struct EndGameEffectsComponent_C_EndGameOver final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(EndGameEffectsComponent_C_EndGameOver) == 0x000008, "Wrong alignment on EndGameEffectsComponent_C_EndGameOver");
static_assert(sizeof(EndGameEffectsComponent_C_EndGameOver) == 0x000040, "Wrong size on EndGameEffectsComponent_C_EndGameOver");
static_assert(offsetof(EndGameEffectsComponent_C_EndGameOver, GameEventType) == 0x000000, "Member 'EndGameEffectsComponent_C_EndGameOver::GameEventType' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_EndGameOver, GameEventData) == 0x000010, "Member 'EndGameEffectsComponent_C_EndGameOver::GameEventData' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.ExecuteUbergraph_EndGameEffectsComponent
// 0x0418 (0x0418 - 0x0000)
struct EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_1;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_2;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlayerTeam                                   CallFunc_GetPlayerTeam_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerTeam                                   CallFunc_GetPlayerTeam_ReturnValue_1;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_gameEventType_2;                // 0x0054(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameEventData                         K2Node_CustomEvent_gameEventData_2;                // 0x0060(0x0030)(ConstParm, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_gameEventType_1;                // 0x0098(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         K2Node_CustomEvent_gameEventData_1;                // 0x00A8(0x0030)(ConstParm, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDGameState*                          CallFunc_GetDBDGameState_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEndGameStateComponent*                 CallFunc_GetEndGameStateComponent_ReturnValue;     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTimePercent_ReturnValue;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_3;                    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerTeam                                   CallFunc_GetPlayerTeam_ReturnValue_2;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_3;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_4;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_5;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0160(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0174(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_6;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_4;                    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_1;         // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x01AC(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_JustStarted;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_5;                    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_2;         // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_6;                    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlayerTeam                                   CallFunc_GetPlayerTeam_ReturnValue_3;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDGameState*                          CallFunc_GetDBDGameState_ReturnValue_1;            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndGameStateComponent*                 CallFunc_GetEndGameStateComponent_ReturnValue_1;   // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimerSlowedDown_ReturnValue;            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& GameEventType, struct FGameEventData& GameEventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0234(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& GameEventType, struct FGameEventData& GameEventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0248(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameEventDispatcherHandleBP           CallFunc_RegisterEventListener_GameEventDispatcherHandle; // 0x025C(0x0020)(NoDestructor, ContainsInstancedReference)
	struct FGameEventDispatcherHandleBP           CallFunc_RegisterEventListener_GameEventDispatcherHandle_1; // 0x027C(0x0020)(NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FGameplayTag& GameEventType, struct FGameEventData& GameEventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x029C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameEventDispatcherHandleBP           CallFunc_RegisterEventListener_GameEventDispatcherHandle_2; // 0x02B0(0x0020)(NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_gameEventType;                  // 0x02D4(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameEventData                         K2Node_CustomEvent_gameEventData;                  // 0x02E0(0x0030)(ConstParm, NoDestructor)
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_7;                    // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDGameState*                          CallFunc_GetDBDGameState_ReturnValue_2;            // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetOwningPlayerChecked_ReturnValue;       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEndGameStateComponent*                 CallFunc_GetEndGameStateComponent_ReturnValue_2;   // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue;            // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEndGameOver_ReturnValue;                // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0344(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue_1;          // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0360(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_4;                  // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x0378(0x0014)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_5;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_6;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue_2;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x1];                                      // 0x03AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_gameEventType;                        // 0x03AC(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameEventData                         K2Node_Event_gameEventData;                        // 0x03B8(0x0030)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue_3;          // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetDBDPlayer_Player_8;                    // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetPlayerCamera_ReturnValue;              // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast;       // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent) == 0x000008, "Wrong alignment on EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent");
static_assert(sizeof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent) == 0x000418, "Wrong size on EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, EntryPoint) == 0x000000, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player) == 0x000008, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable) == 0x000010, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_DynamicCast_AsBPI_Effect_General) == 0x000028, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_DynamicCast_AsBPI_Effect_General' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_1) == 0x000040, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_2) == 0x000048, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetPlayerTeam_ReturnValue) == 0x000050, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetPlayerTeam_ReturnValue_1) == 0x000051, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetPlayerTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000053, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_gameEventType_2) == 0x000054, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_gameEventType_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_gameEventData_2) == 0x000060, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_gameEventData_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_gameEventType_1) == 0x000098, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_gameEventType_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_gameEventData_1) == 0x0000A8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_gameEventData_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0000D8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwner_ReturnValue_1) == 0x0000E0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue) == 0x0000E8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwner_ReturnValue_2) == 0x0000F0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDGameState_ReturnValue) == 0x0000F8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetEndGameStateComponent_ReturnValue) == 0x000100, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetEndGameStateComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetElapsedTimePercent_ReturnValue) == 0x000108, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetElapsedTimePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_real_Variable) == 0x000110, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000118, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00011C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00011D, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue) == 0x000120, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue_1) == 0x000124, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_real_Variable_1) == 0x000128, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_bool_Variable) == 0x000130, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_3) == 0x000138, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_Select_Default) == 0x000140, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetPlayerTeam_ReturnValue_2) == 0x000148, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetPlayerTeam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000149, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue_2) == 0x00014C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue_3) == 0x000150, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue_4) == 0x000154, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000158, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue_5) == 0x00015C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable_1) == 0x000160, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable_2) == 0x000174, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetFloatValue_ReturnValue_6) == 0x000188, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetFloatValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00018C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_4) == 0x000190, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_4' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_DynamicCast_AsBPI_Effect_General_1) == 0x000198, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_DynamicCast_AsBPI_Effect_General_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable_3) == 0x0001AC, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_JustStarted) == 0x0001C0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_JustStarted' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwner_ReturnValue_3) == 0x0001C8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_5) == 0x0001D0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_5' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue_1) == 0x0001D8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_DynamicCast_AsBPI_Effect_General_2) == 0x0001E0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_DynamicCast_AsBPI_Effect_General_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_DynamicCast_bSuccess_2) == 0x0001F0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_6) == 0x0001F8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_6' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetPlayerTeam_ReturnValue_3) == 0x000200, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetPlayerTeam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDGameState_ReturnValue_1) == 0x000208, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000210, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetEndGameStateComponent_ReturnValue_1) == 0x000218, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetEndGameStateComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsTimerSlowedDown_ReturnValue) == 0x000220, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsTimerSlowedDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwner_ReturnValue_4) == 0x000228, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue_2) == 0x000230, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000234, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000248, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_RegisterEventListener_GameEventDispatcherHandle) == 0x00025C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_RegisterEventListener_GameEventDispatcherHandle' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_RegisterEventListener_GameEventDispatcherHandle_1) == 0x00027C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_RegisterEventListener_GameEventDispatcherHandle_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00029C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_RegisterEventListener_GameEventDispatcherHandle_2) == 0x0002B0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_RegisterEventListener_GameEventDispatcherHandle_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_Event_DeltaSeconds) == 0x0002D0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_gameEventType) == 0x0002D4, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_gameEventType' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_CustomEvent_gameEventData) == 0x0002E0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_CustomEvent_gameEventData' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_7) == 0x000310, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_7' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000318, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsValid_ReturnValue) == 0x000320, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDGameState_ReturnValue_2) == 0x000328, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwningPlayerChecked_ReturnValue) == 0x000330, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwningPlayerChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetEndGameStateComponent_ReturnValue_2) == 0x000338, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetEndGameStateComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsLocallyObserved_ReturnValue) == 0x000340, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsLocallyObserved_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsEndGameOver_ReturnValue) == 0x000341, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsEndGameOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable_4) == 0x000344, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue_3) == 0x000358, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsLocallyObserved_ReturnValue_1) == 0x00035C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsLocallyObserved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable_5) == 0x000360, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue_4) == 0x000374, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, Temp_delegate_Variable_6) == 0x000378, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetOwner_ReturnValue_5) == 0x000390, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue_5) == 0x000398, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_PostEvent_ReturnValue_6) == 0x00039C, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_PostEvent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_Event_player) == 0x0003A0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsLocallyObserved_ReturnValue_2) == 0x0003A8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsLocallyObserved_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_BooleanAND_ReturnValue) == 0x0003A9, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x0003AA, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_Event_gameEventType) == 0x0003AC, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_Event_gameEventType' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, K2Node_Event_gameEventData) == 0x0003B8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::K2Node_Event_gameEventData' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_IsLocallyObserved_ReturnValue_3) == 0x0003E8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_IsLocallyObserved_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0003F0, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetDBDPlayer_Player_8) == 0x0003F8, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetDBDPlayer_Player_8' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_GetPlayerCamera_ReturnValue) == 0x000400, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_GetPlayerCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000408, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent, CallFunc_Multiply_FloatFloat_B_ImplicitCast) == 0x000410, "Member 'EndGameEffectsComponent_C_ExecuteUbergraph_EndGameEffectsComponent::CallFunc_Multiply_FloatFloat_B_ImplicitCast' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.GetDBDPlayer
// 0x0020 (0x0020 - 0x0000)
struct EndGameEffectsComponent_C_GetDBDPlayer final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_DynamicCast_AsDBDPlayer;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndGameEffectsComponent_C_GetDBDPlayer) == 0x000008, "Wrong alignment on EndGameEffectsComponent_C_GetDBDPlayer");
static_assert(sizeof(EndGameEffectsComponent_C_GetDBDPlayer) == 0x000020, "Wrong size on EndGameEffectsComponent_C_GetDBDPlayer");
static_assert(offsetof(EndGameEffectsComponent_C_GetDBDPlayer, Player) == 0x000000, "Member 'EndGameEffectsComponent_C_GetDBDPlayer::Player' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_GetDBDPlayer, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'EndGameEffectsComponent_C_GetDBDPlayer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_GetDBDPlayer, K2Node_DynamicCast_AsDBDPlayer) == 0x000010, "Member 'EndGameEffectsComponent_C_GetDBDPlayer::K2Node_DynamicCast_AsDBDPlayer' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_GetDBDPlayer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'EndGameEffectsComponent_C_GetDBDPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.OnLocallyObservedChanged
// 0x0008 (0x0008 - 0x0000)
struct EndGameEffectsComponent_C_OnLocallyObservedChanged final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndGameEffectsComponent_C_OnLocallyObservedChanged) == 0x000008, "Wrong alignment on EndGameEffectsComponent_C_OnLocallyObservedChanged");
static_assert(sizeof(EndGameEffectsComponent_C_OnLocallyObservedChanged) == 0x000008, "Wrong size on EndGameEffectsComponent_C_OnLocallyObservedChanged");
static_assert(offsetof(EndGameEffectsComponent_C_OnLocallyObservedChanged, Player) == 0x000000, "Member 'EndGameEffectsComponent_C_OnLocallyObservedChanged::Player' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.OnTimeDilationChanged
// 0x0040 (0x0040 - 0x0000)
struct EndGameEffectsComponent_C_OnTimeDilationChanged final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(EndGameEffectsComponent_C_OnTimeDilationChanged) == 0x000008, "Wrong alignment on EndGameEffectsComponent_C_OnTimeDilationChanged");
static_assert(sizeof(EndGameEffectsComponent_C_OnTimeDilationChanged) == 0x000040, "Wrong size on EndGameEffectsComponent_C_OnTimeDilationChanged");
static_assert(offsetof(EndGameEffectsComponent_C_OnTimeDilationChanged, GameEventType) == 0x000000, "Member 'EndGameEffectsComponent_C_OnTimeDilationChanged::GameEventType' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_OnTimeDilationChanged, GameEventData) == 0x000010, "Member 'EndGameEffectsComponent_C_OnTimeDilationChanged::GameEventData' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.PlayCameraShake
// 0x0020 (0x0020 - 0x0000)
struct EndGameEffectsComponent_C_PlayCameraShake final
{
public:
	class UClass*                                 CameraShake;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndGameEffectsComponent_C_PlayCameraShake) == 0x000008, "Wrong alignment on EndGameEffectsComponent_C_PlayCameraShake");
static_assert(sizeof(EndGameEffectsComponent_C_PlayCameraShake) == 0x000020, "Wrong size on EndGameEffectsComponent_C_PlayCameraShake");
static_assert(offsetof(EndGameEffectsComponent_C_PlayCameraShake, CameraShake) == 0x000000, "Member 'EndGameEffectsComponent_C_PlayCameraShake::CameraShake' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_PlayCameraShake, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'EndGameEffectsComponent_C_PlayCameraShake::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_PlayCameraShake, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'EndGameEffectsComponent_C_PlayCameraShake::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_PlayCameraShake, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'EndGameEffectsComponent_C_PlayCameraShake::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EndGameEffectsComponent_C_PlayCameraShake, CallFunc_StartCameraShake_ReturnValue) == 0x000018, "Member 'EndGameEffectsComponent_C_PlayCameraShake::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct EndGameEffectsComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndGameEffectsComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on EndGameEffectsComponent_C_ReceiveTick");
static_assert(sizeof(EndGameEffectsComponent_C_ReceiveTick) == 0x000004, "Wrong size on EndGameEffectsComponent_C_ReceiveTick");
static_assert(offsetof(EndGameEffectsComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'EndGameEffectsComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function EndGameEffectsComponent.EndGameEffectsComponent_C.ReminderEffect
// 0x0040 (0x0040 - 0x0000)
struct EndGameEffectsComponent_C_ReminderEffect final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
