#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndGameEffectsComponent

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DBDGameplay_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EndGameEffectsComponent.EndGameEffectsComponent_C
// 0x0098 (0x0160 - 0x00C8)
class UEndGameEffectsComponent_C final : public UEndGameEffectsComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameEventDispatcherHandleBP           ReminderHandler;                                   // 0x00D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FGameEventDispatcherHandleBP           EndGameOverHandler;                                // 0x00F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	class UCurveFloat*                            EndGameGroundPulsing;                              // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            EndGameGroundIntensity;                            // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_EndGame_Embers;                                  // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            EndGameEmberRate;                                  // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameEventDispatcherHandleBP           TimeDilationChangedHandler;                        // 0x0130(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	class UCameraShakeBase*                       CurrentCameraShakeRef;                             // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialPPEndGameGroundCracks;                     // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EndGameOver(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void ExecuteUbergraph_EndGameEffectsComponent(int32 EntryPoint);
	void GetDBDPlayer(class ADBDPlayer** Player);
	void OnLocallyObservedChanged(class ADBDPlayer* Player);
	void OnTimeDilationChanged(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void PlayCameraShake(class UClass* CameraShake);
	void ReceiveTick(float DeltaSeconds);
	void RegisterLocallyObservedEvents();
	void ReminderEffect(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void StartEndGameEffects(bool JustStarted);
	void StartUpdateTimer(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void StopCameraShake();
	void UnregisterLocallyObservedEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EndGameEffectsComponent_C">();
	}
	static class UEndGameEffectsComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndGameEffectsComponent_C>();
	}
};
static_assert(alignof(UEndGameEffectsComponent_C) == 0x000008, "Wrong alignment on UEndGameEffectsComponent_C");
static_assert(sizeof(UEndGameEffectsComponent_C) == 0x000160, "Wrong size on UEndGameEffectsComponent_C");
static_assert(offsetof(UEndGameEffectsComponent_C, UberGraphFrame) == 0x0000C8, "Member 'UEndGameEffectsComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, ReminderHandler) == 0x0000D0, "Member 'UEndGameEffectsComponent_C::ReminderHandler' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, EndGameOverHandler) == 0x0000F0, "Member 'UEndGameEffectsComponent_C::EndGameOverHandler' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, EndGameGroundPulsing) == 0x000110, "Member 'UEndGameEffectsComponent_C::EndGameGroundPulsing' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, EndGameGroundIntensity) == 0x000118, "Member 'UEndGameEffectsComponent_C::EndGameGroundIntensity' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, P_EndGame_Embers) == 0x000120, "Member 'UEndGameEffectsComponent_C::P_EndGame_Embers' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, EndGameEmberRate) == 0x000128, "Member 'UEndGameEffectsComponent_C::EndGameEmberRate' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, TimeDilationChangedHandler) == 0x000130, "Member 'UEndGameEffectsComponent_C::TimeDilationChangedHandler' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, CurrentCameraShakeRef) == 0x000150, "Member 'UEndGameEffectsComponent_C::CurrentCameraShakeRef' has a wrong offset!");
static_assert(offsetof(UEndGameEffectsComponent_C, MaterialPPEndGameGroundCracks) == 0x000158, "Member 'UEndGameEffectsComponent_C::MaterialPPEndGameGroundCracks' has a wrong offset!");

}

