#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancedInput

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EnhancedInput.EnhancedInputComponent.GetBoundActionValue
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputComponent_GetBoundActionValue final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputComponent_GetBoundActionValue) == 0x000008, "Wrong alignment on EnhancedInputComponent_GetBoundActionValue");
static_assert(sizeof(EnhancedInputComponent_GetBoundActionValue) == 0x000028, "Wrong size on EnhancedInputComponent_GetBoundActionValue");
static_assert(offsetof(EnhancedInputComponent_GetBoundActionValue, Action) == 0x000000, "Member 'EnhancedInputComponent_GetBoundActionValue::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputComponent_GetBoundActionValue, ReturnValue) == 0x000008, "Member 'EnhancedInputComponent_GetBoundActionValue::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.BreakInputActionValue
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputLibrary_BreakInputActionValue final
{
public:
	struct FInputActionValue                      InActionValue;                                     // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        X;                                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         Type;                                              // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_BreakInputActionValue) == 0x000008, "Wrong alignment on EnhancedInputLibrary_BreakInputActionValue");
static_assert(sizeof(EnhancedInputLibrary_BreakInputActionValue) == 0x000040, "Wrong size on EnhancedInputLibrary_BreakInputActionValue");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, InActionValue) == 0x000000, "Member 'EnhancedInputLibrary_BreakInputActionValue::InActionValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, X) == 0x000020, "Member 'EnhancedInputLibrary_BreakInputActionValue::X' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, Y) == 0x000028, "Member 'EnhancedInputLibrary_BreakInputActionValue::Y' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, Z) == 0x000030, "Member 'EnhancedInputLibrary_BreakInputActionValue::Z' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_BreakInputActionValue, Type) == 0x000038, "Member 'EnhancedInputLibrary_BreakInputActionValue::Type' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis1D
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis1D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToAxis1D");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D) == 0x000028, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToAxis1D");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D, InValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis1D::InValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis1D, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis1D::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis2D
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis2D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToAxis2D");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D) == 0x000030, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToAxis2D");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D, InValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis2D::InValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis2D, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis2D::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis3D
// 0x0038 (0x0038 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis3D final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToAxis3D");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D) == 0x000038, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToAxis3D");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D, ActionValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis3D::ActionValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToAxis3D, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToAxis3D::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToBool
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToBool final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToBool) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToBool");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToBool) == 0x000028, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToBool");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToBool, InValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToBool::InValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToBool, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToBool::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToString
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToString final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_Conv_InputActionValueToString) == 0x000008, "Wrong alignment on EnhancedInputLibrary_Conv_InputActionValueToString");
static_assert(sizeof(EnhancedInputLibrary_Conv_InputActionValueToString) == 0x000030, "Wrong size on EnhancedInputLibrary_Conv_InputActionValueToString");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToString, ActionValue) == 0x000000, "Member 'EnhancedInputLibrary_Conv_InputActionValueToString::ActionValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_Conv_InputActionValueToString, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_Conv_InputActionValueToString::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetBoundActionValue
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_GetBoundActionValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetBoundActionValue) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetBoundActionValue");
static_assert(sizeof(EnhancedInputLibrary_GetBoundActionValue) == 0x000030, "Wrong size on EnhancedInputLibrary_GetBoundActionValue");
static_assert(offsetof(EnhancedInputLibrary_GetBoundActionValue, Actor) == 0x000000, "Member 'EnhancedInputLibrary_GetBoundActionValue::Actor' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetBoundActionValue, Action) == 0x000008, "Member 'EnhancedInputLibrary_GetBoundActionValue::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetBoundActionValue, ReturnValue) == 0x000010, "Member 'EnhancedInputLibrary_GetBoundActionValue::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetFirstPlayerMappableKeySlot
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_GetFirstPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetFirstPlayerMappableKeySlot) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetFirstPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetFirstPlayerMappableKeySlot) == 0x000010, "Wrong size on EnhancedInputLibrary_GetFirstPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetFirstPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetFirstPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetFourthPlayerMappableKeySlot
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_GetFourthPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetFourthPlayerMappableKeySlot) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetFourthPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetFourthPlayerMappableKeySlot) == 0x000010, "Wrong size on EnhancedInputLibrary_GetFourthPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetFourthPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetFourthPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetMappingName
// 0x00B8 (0x00B8 - 0x0000)
struct EnhancedInputLibrary_GetMappingName final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x00A8(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_GetMappingName) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetMappingName");
static_assert(sizeof(EnhancedInputLibrary_GetMappingName) == 0x0000B8, "Wrong size on EnhancedInputLibrary_GetMappingName");
static_assert(offsetof(EnhancedInputLibrary_GetMappingName, ActionKeyMapping) == 0x000000, "Member 'EnhancedInputLibrary_GetMappingName::ActionKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetMappingName, ReturnValue) == 0x0000A8, "Member 'EnhancedInputLibrary_GetMappingName::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetPlayerMappableKeySettings
// 0x00B0 (0x00B0 - 0x0000)
struct EnhancedInputLibrary_GetPlayerMappableKeySettings final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UPlayerMappableKeySettings*             ReturnValue;                                       // 0x00A8(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetPlayerMappableKeySettings) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetPlayerMappableKeySettings");
static_assert(sizeof(EnhancedInputLibrary_GetPlayerMappableKeySettings) == 0x0000B0, "Wrong size on EnhancedInputLibrary_GetPlayerMappableKeySettings");
static_assert(offsetof(EnhancedInputLibrary_GetPlayerMappableKeySettings, ActionKeyMapping) == 0x000000, "Member 'EnhancedInputLibrary_GetPlayerMappableKeySettings::ActionKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_GetPlayerMappableKeySettings, ReturnValue) == 0x0000A8, "Member 'EnhancedInputLibrary_GetPlayerMappableKeySettings::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetSecondPlayerMappableKeySlot
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_GetSecondPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetSecondPlayerMappableKeySlot) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetSecondPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetSecondPlayerMappableKeySlot) == 0x000010, "Wrong size on EnhancedInputLibrary_GetSecondPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetSecondPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetSecondPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.GetThirdPlayerMappableKeySlot
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_GetThirdPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_GetThirdPlayerMappableKeySlot) == 0x000008, "Wrong alignment on EnhancedInputLibrary_GetThirdPlayerMappableKeySlot");
static_assert(sizeof(EnhancedInputLibrary_GetThirdPlayerMappableKeySlot) == 0x000010, "Wrong size on EnhancedInputLibrary_GetThirdPlayerMappableKeySlot");
static_assert(offsetof(EnhancedInputLibrary_GetThirdPlayerMappableKeySlot, ReturnValue) == 0x000000, "Member 'EnhancedInputLibrary_GetThirdPlayerMappableKeySlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.IsActionKeyMappingPlayerMappable
// 0x00B0 (0x00B0 - 0x0000)
struct EnhancedInputLibrary_IsActionKeyMappingPlayerMappable final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable) == 0x000008, "Wrong alignment on EnhancedInputLibrary_IsActionKeyMappingPlayerMappable");
static_assert(sizeof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable) == 0x0000B0, "Wrong size on EnhancedInputLibrary_IsActionKeyMappingPlayerMappable");
static_assert(offsetof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable, ActionKeyMapping) == 0x000000, "Member 'EnhancedInputLibrary_IsActionKeyMappingPlayerMappable::ActionKeyMapping' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_IsActionKeyMappingPlayerMappable, ReturnValue) == 0x0000A8, "Member 'EnhancedInputLibrary_IsActionKeyMappingPlayerMappable::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValue
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValue final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      MatchValueType;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0038(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_MakeInputActionValue) == 0x000008, "Wrong alignment on EnhancedInputLibrary_MakeInputActionValue");
static_assert(sizeof(EnhancedInputLibrary_MakeInputActionValue) == 0x000058, "Wrong size on EnhancedInputLibrary_MakeInputActionValue");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, X) == 0x000000, "Member 'EnhancedInputLibrary_MakeInputActionValue::X' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, Y) == 0x000008, "Member 'EnhancedInputLibrary_MakeInputActionValue::Y' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, Z) == 0x000010, "Member 'EnhancedInputLibrary_MakeInputActionValue::Z' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, MatchValueType) == 0x000018, "Member 'EnhancedInputLibrary_MakeInputActionValue::MatchValueType' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValue, ReturnValue) == 0x000038, "Member 'EnhancedInputLibrary_MakeInputActionValue::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValueOfType
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValueOfType final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         ValueType;                                         // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputLibrary_MakeInputActionValueOfType) == 0x000008, "Wrong alignment on EnhancedInputLibrary_MakeInputActionValueOfType");
static_assert(sizeof(EnhancedInputLibrary_MakeInputActionValueOfType) == 0x000040, "Wrong size on EnhancedInputLibrary_MakeInputActionValueOfType");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValueOfType, X) == 0x000000, "Member 'EnhancedInputLibrary_MakeInputActionValueOfType::X' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValueOfType, Y) == 0x000008, "Member 'EnhancedInputLibrary_MakeInputActionValueOfType::Y' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValueOfType, Z) == 0x000010, "Member 'EnhancedInputLibrary_MakeInputActionValueOfType::Z' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValueOfType, ValueType) == 0x000018, "Member 'EnhancedInputLibrary_MakeInputActionValueOfType::ValueType' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_MakeInputActionValueOfType, ReturnValue) == 0x000020, "Member 'EnhancedInputLibrary_MakeInputActionValueOfType::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputLibrary.RequestRebuildControlMappingsUsingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext final
{
public:
	const class UInputMappingContext*             Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext) == 0x000008, "Wrong alignment on EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext");
static_assert(sizeof(EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext) == 0x000010, "Wrong size on EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext");
static_assert(offsetof(EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext, Context) == 0x000000, "Member 'EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext::Context' has a wrong offset!");
static_assert(offsetof(EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext, bForceImmediately) == 0x000008, "Member 'EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext::bForceImmediately' has a wrong offset!");

// Function EnhancedInput.EnhancedInputPlatformData.GetContextRedirect
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputPlatformData_GetContextRedirect final
{
public:
	class UInputMappingContext*                   InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputPlatformData_GetContextRedirect) == 0x000008, "Wrong alignment on EnhancedInputPlatformData_GetContextRedirect");
static_assert(sizeof(EnhancedInputPlatformData_GetContextRedirect) == 0x000010, "Wrong size on EnhancedInputPlatformData_GetContextRedirect");
static_assert(offsetof(EnhancedInputPlatformData_GetContextRedirect, InContext) == 0x000000, "Member 'EnhancedInputPlatformData_GetContextRedirect::InContext' has a wrong offset!");
static_assert(offsetof(EnhancedInputPlatformData_GetContextRedirect, ReturnValue) == 0x000008, "Member 'EnhancedInputPlatformData_GetContextRedirect::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.AddMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_AddMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x000C(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_AddMappingContext) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_AddMappingContext");
static_assert(sizeof(EnhancedInputSubsystemInterface_AddMappingContext) == 0x000010, "Wrong size on EnhancedInputSubsystemInterface_AddMappingContext");
static_assert(offsetof(EnhancedInputSubsystemInterface_AddMappingContext, MappingContext) == 0x000000, "Member 'EnhancedInputSubsystemInterface_AddMappingContext::MappingContext' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_AddMappingContext, Priority) == 0x000008, "Member 'EnhancedInputSubsystemInterface_AddMappingContext::Priority' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_AddMappingContext, Options) == 0x00000C, "Member 'EnhancedInputSubsystemInterface_AddMappingContext::Options' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.AddPlayerMappableConfig
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_AddPlayerMappableConfig final
{
public:
	const class UPlayerMappableInputConfig*       Config;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_AddPlayerMappableConfig) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_AddPlayerMappableConfig");
static_assert(sizeof(EnhancedInputSubsystemInterface_AddPlayerMappableConfig) == 0x000010, "Wrong size on EnhancedInputSubsystemInterface_AddPlayerMappableConfig");
static_assert(offsetof(EnhancedInputSubsystemInterface_AddPlayerMappableConfig, Config) == 0x000000, "Member 'EnhancedInputSubsystemInterface_AddPlayerMappableConfig::Config' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_AddPlayerMappableConfig, Options) == 0x000008, "Member 'EnhancedInputSubsystemInterface_AddPlayerMappableConfig::Options' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputForAction
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_InjectInputForAction) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_InjectInputForAction");
static_assert(sizeof(EnhancedInputSubsystemInterface_InjectInputForAction) == 0x000048, "Wrong size on EnhancedInputSubsystemInterface_InjectInputForAction");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputForAction, Action) == 0x000000, "Member 'EnhancedInputSubsystemInterface_InjectInputForAction::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputForAction, RawValue) == 0x000008, "Member 'EnhancedInputSubsystemInterface_InjectInputForAction::RawValue' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputForAction, Modifiers) == 0x000028, "Member 'EnhancedInputSubsystemInterface_InjectInputForAction::Modifiers' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputForAction, Triggers) == 0x000038, "Member 'EnhancedInputSubsystemInterface_InjectInputForAction::Triggers' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputVectorForAction
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputVectorForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_InjectInputVectorForAction) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_InjectInputVectorForAction");
static_assert(sizeof(EnhancedInputSubsystemInterface_InjectInputVectorForAction) == 0x000040, "Wrong size on EnhancedInputSubsystemInterface_InjectInputVectorForAction");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputVectorForAction, Action) == 0x000000, "Member 'EnhancedInputSubsystemInterface_InjectInputVectorForAction::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputVectorForAction, Value) == 0x000008, "Member 'EnhancedInputSubsystemInterface_InjectInputVectorForAction::Value' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputVectorForAction, Modifiers) == 0x000020, "Member 'EnhancedInputSubsystemInterface_InjectInputVectorForAction::Modifiers' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_InjectInputVectorForAction, Triggers) == 0x000030, "Member 'EnhancedInputSubsystemInterface_InjectInputVectorForAction::Triggers' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.K2_AddPlayerMappedKeyInSlot
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   NewKey;                                            // 0x0010(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerMappableKeySlot                 KeySlot;                                           // 0x0030(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0040(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot");
static_assert(sizeof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot) == 0x000048, "Wrong size on EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot, MappingName) == 0x000000, "Member 'EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot::MappingName' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot, NewKey) == 0x000010, "Member 'EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot::NewKey' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot, KeySlot) == 0x000030, "Member 'EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot::KeySlot' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot, Options) == 0x000040, "Member 'EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot::Options' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot, ReturnValue) == 0x000044, "Member 'EnhancedInputSubsystemInterface_K2_AddPlayerMappedKeyInSlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.K2_RemovePlayerMappedKeyInSlot
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerMappableKeySlot                 KeySlot;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0020(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot");
static_assert(sizeof(EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot) == 0x000028, "Wrong size on EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot, MappingName) == 0x000000, "Member 'EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot::MappingName' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot, KeySlot) == 0x000010, "Member 'EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot::KeySlot' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot, Options) == 0x000020, "Member 'EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot::Options' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot, ReturnValue) == 0x000024, "Member 'EnhancedInputSubsystemInterface_K2_RemovePlayerMappedKeyInSlot::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInActiveContextSet
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet final
{
public:
	const class UInputMappingContext*             InputContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0010(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMappingQueryIssue>             OutIssues;                                         // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMappingQueryIssue                            BlockingIssues;                                    // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMappingQueryResult                           ReturnValue;                                       // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet");
static_assert(sizeof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet) == 0x000048, "Wrong size on EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet, InputContext) == 0x000000, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet::InputContext' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet, Action) == 0x000008, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet, Key) == 0x000010, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet::Key' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet, OutIssues) == 0x000030, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet::OutIssues' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet, BlockingIssues) == 0x000040, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet::BlockingIssues' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet, ReturnValue) == 0x000041, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInContextSet
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryMapKeyInContextSet final
{
public:
	TArray<class UInputMappingContext*>           PrioritizedActiveContexts;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             InputContext;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0020(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMappingQueryIssue>             OutIssues;                                         // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMappingQueryIssue                            BlockingIssues;                                    // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMappingQueryResult                           ReturnValue;                                       // 0x0051(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_QueryMapKeyInContextSet");
static_assert(sizeof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet) == 0x000058, "Wrong size on EnhancedInputSubsystemInterface_QueryMapKeyInContextSet");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, PrioritizedActiveContexts) == 0x000000, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::PrioritizedActiveContexts' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, InputContext) == 0x000010, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::InputContext' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, Action) == 0x000018, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::Action' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, Key) == 0x000020, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::Key' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, OutIssues) == 0x000040, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::OutIssues' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, BlockingIssues) == 0x000050, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::BlockingIssues' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_QueryMapKeyInContextSet, ReturnValue) == 0x000051, "Member 'EnhancedInputSubsystemInterface_QueryMapKeyInContextSet::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemoveAllPlayerMappedKeys
// 0x0001 (0x0001 - 0x0000)
struct EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys final
{
public:
	struct FModifyContextOptions                  Options;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys) == 0x000001, "Wrong alignment on EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys");
static_assert(sizeof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys) == 0x000001, "Wrong size on EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys, Options) == 0x000000, "Member 'EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeys::Options' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemoveAllPlayerMappedKeysForMapping
// 0x0014 (0x0014 - 0x0000)
struct EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x000C(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping) == 0x000004, "Wrong alignment on EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping");
static_assert(sizeof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping) == 0x000014, "Wrong size on EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping, MappingName) == 0x000000, "Member 'EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping::MappingName' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping, Options) == 0x00000C, "Member 'EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping::Options' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping, ReturnValue) == 0x000010, "Member 'EnhancedInputSubsystemInterface_RemoveAllPlayerMappedKeysForMapping::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemoveMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_RemoveMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_RemoveMappingContext) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_RemoveMappingContext");
static_assert(sizeof(EnhancedInputSubsystemInterface_RemoveMappingContext) == 0x000010, "Wrong size on EnhancedInputSubsystemInterface_RemoveMappingContext");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemoveMappingContext, MappingContext) == 0x000000, "Member 'EnhancedInputSubsystemInterface_RemoveMappingContext::MappingContext' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemoveMappingContext, Options) == 0x000008, "Member 'EnhancedInputSubsystemInterface_RemoveMappingContext::Options' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemovePlayerMappableConfig
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_RemovePlayerMappableConfig final
{
public:
	const class UPlayerMappableInputConfig*       Config;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_RemovePlayerMappableConfig) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_RemovePlayerMappableConfig");
static_assert(sizeof(EnhancedInputSubsystemInterface_RemovePlayerMappableConfig) == 0x000010, "Wrong size on EnhancedInputSubsystemInterface_RemovePlayerMappableConfig");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemovePlayerMappableConfig, Config) == 0x000000, "Member 'EnhancedInputSubsystemInterface_RemovePlayerMappableConfig::Config' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_RemovePlayerMappableConfig, Options) == 0x000008, "Member 'EnhancedInputSubsystemInterface_RemovePlayerMappableConfig::Options' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.RequestRebuildControlMappings
// 0x0002 (0x0002 - 0x0000)
struct EnhancedInputSubsystemInterface_RequestRebuildControlMappings final
{
public:
	struct FModifyContextOptions                  Options;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EInputMappingRebuildType                      RebuildType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_RequestRebuildControlMappings) == 0x000001, "Wrong alignment on EnhancedInputSubsystemInterface_RequestRebuildControlMappings");
static_assert(sizeof(EnhancedInputSubsystemInterface_RequestRebuildControlMappings) == 0x000002, "Wrong size on EnhancedInputSubsystemInterface_RequestRebuildControlMappings");
static_assert(offsetof(EnhancedInputSubsystemInterface_RequestRebuildControlMappings, Options) == 0x000000, "Member 'EnhancedInputSubsystemInterface_RequestRebuildControlMappings::Options' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_RequestRebuildControlMappings, RebuildType) == 0x000001, "Member 'EnhancedInputSubsystemInterface_RequestRebuildControlMappings::RebuildType' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.GetAllPlayerMappableActionKeyMappings
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings final
{
public:
	TArray<struct FEnhancedActionKeyMapping>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings");
static_assert(sizeof(EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings) == 0x000010, "Wrong size on EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings");
static_assert(offsetof(EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings, ReturnValue) == 0x000000, "Member 'EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.GetAllPlayerMappedKeys
// 0x0020 (0x0020 - 0x0000)
struct EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys");
static_assert(sizeof(EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys) == 0x000020, "Wrong size on EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys");
static_assert(offsetof(EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys, MappingName) == 0x000000, "Member 'EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys::MappingName' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys, ReturnValue) == 0x000010, "Member 'EnhancedInputSubsystemInterface_GetAllPlayerMappedKeys::ReturnValue' has a wrong offset!");

// Function EnhancedInput.EnhancedInputSubsystemInterface.HasMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_HasMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutFoundPriority;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnhancedInputSubsystemInterface_HasMappingContext) == 0x000008, "Wrong alignment on EnhancedInputSubsystemInterface_HasMappingContext");
static_assert(sizeof(EnhancedInputSubsystemInterface_HasMappingContext) == 0x000010, "Wrong size on EnhancedInputSubsystemInterface_HasMappingContext");
static_assert(offsetof(EnhancedInputSubsystemInterface_HasMappingContext, MappingContext) == 0x000000, "Member 'EnhancedInputSubsystemInterface_HasMappingContext::MappingContext' has a wrong offset!");
static_assert(offsetof(EnhancedInputSubsystemInterface_HasMappingContext, OutFoundPriority) == 0x000008, "Member 'EnhancedInputSubsystemInterface_HasMappingContext::OutFoundPriority' has a wrong offset!");
