#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flashing_Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Flashing_Light.Flashing_Light_C
// 0x0060 (0x0300 - 0x02A0)
class AFlashing_Light_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGMAdaptiveShadowMapSourceComponent*    GMAdaptiveShadowMapSource;                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Ground_Spot;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDistanceBasedTickDisabler*             DistanceBasedTickDisabler;                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   LightGEST;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   LightATL;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spotlight_Under_ATL;                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Top_Spot;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Fire;                                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Brightness_BCB3ACB54875C6E55057DFA70F28E062; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_BCB3ACB54875C6E55057DFA70F28E062; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Flashing_Light(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Flashing_Light_C">();
	}
	static class AFlashing_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlashing_Light_C>();
	}
};
static_assert(alignof(AFlashing_Light_C) == 0x000008, "Wrong alignment on AFlashing_Light_C");
static_assert(sizeof(AFlashing_Light_C) == 0x000300, "Wrong size on AFlashing_Light_C");
static_assert(offsetof(AFlashing_Light_C, UberGraphFrame) == 0x0002A0, "Member 'AFlashing_Light_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, GMAdaptiveShadowMapSource) == 0x0002A8, "Member 'AFlashing_Light_C::GMAdaptiveShadowMapSource' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Ground_Spot) == 0x0002B0, "Member 'AFlashing_Light_C::Ground_Spot' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, DistanceBasedTickDisabler) == 0x0002B8, "Member 'AFlashing_Light_C::DistanceBasedTickDisabler' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, LightGEST) == 0x0002C0, "Member 'AFlashing_Light_C::LightGEST' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, LightATL) == 0x0002C8, "Member 'AFlashing_Light_C::LightATL' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Spotlight_Under_ATL) == 0x0002D0, "Member 'AFlashing_Light_C::Spotlight_Under_ATL' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Top_Spot) == 0x0002D8, "Member 'AFlashing_Light_C::Top_Spot' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, BP_Fire) == 0x0002E0, "Member 'AFlashing_Light_C::BP_Fire' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Scene) == 0x0002E8, "Member 'AFlashing_Light_C::Scene' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Timeline_0_Brightness_BCB3ACB54875C6E55057DFA70F28E062) == 0x0002F0, "Member 'AFlashing_Light_C::Timeline_0_Brightness_BCB3ACB54875C6E55057DFA70F28E062' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Timeline_0__Direction_BCB3ACB54875C6E55057DFA70F28E062) == 0x0002F4, "Member 'AFlashing_Light_C::Timeline_0__Direction_BCB3ACB54875C6E55057DFA70F28E062' has a wrong offset!");
static_assert(offsetof(AFlashing_Light_C, Timeline_0) == 0x0002F8, "Member 'AFlashing_Light_C::Timeline_0' has a wrong offset!");

}

