#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrenzySlasherVault

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function FrenzySlasherVault.FrenzySlasherVault_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct FrenzySlasherVault_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrenzySlasherVault_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on FrenzySlasherVault_C_OnInteractionUpdateStart");
static_assert(sizeof(FrenzySlasherVault_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on FrenzySlasherVault_C_OnInteractionUpdateStart");
static_assert(offsetof(FrenzySlasherVault_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'FrenzySlasherVault_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function FrenzySlasherVault.FrenzySlasherVault_C.OnInteractionUpdateEnd
// 0x0008 (0x0008 - 0x0000)
struct FrenzySlasherVault_C_OnInteractionUpdateEnd final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrenzySlasherVault_C_OnInteractionUpdateEnd) == 0x000008, "Wrong alignment on FrenzySlasherVault_C_OnInteractionUpdateEnd");
static_assert(sizeof(FrenzySlasherVault_C_OnInteractionUpdateEnd) == 0x000008, "Wrong size on FrenzySlasherVault_C_OnInteractionUpdateEnd");
static_assert(offsetof(FrenzySlasherVault_C_OnInteractionUpdateEnd, Player) == 0x000000, "Member 'FrenzySlasherVault_C_OnInteractionUpdateEnd::Player' has a wrong offset!");

// Function FrenzySlasherVault.FrenzySlasherVault_C.ExecuteUbergraph_FrenzySlasherVault
// 0x0038 (0x0038 - 0x0000)
struct FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_OriginalCapsuleRadius_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleRadius_Radius_ImplicitCast;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault) == 0x000008, "Wrong alignment on FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault");
static_assert(sizeof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault) == 0x000038, "Wrong size on FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, EntryPoint) == 0x000000, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, K2Node_Event_player_1) == 0x000008, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, K2Node_Event_player) == 0x000010, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, K2Node_VariableSet_OriginalCapsuleRadius_ImplicitCast) == 0x000020, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::K2Node_VariableSet_OriginalCapsuleRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, CallFunc_Multiply_FloatFloat_B_ImplicitCast) == 0x000028, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::CallFunc_Multiply_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, CallFunc_Multiply_FloatFloat_A_ImplicitCast) == 0x00002C, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::CallFunc_Multiply_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault, CallFunc_SetCapsuleRadius_Radius_ImplicitCast) == 0x000030, "Member 'FrenzySlasherVault_C_ExecuteUbergraph_FrenzySlasherVault::CallFunc_SetCapsuleRadius_Radius_ImplicitCast' has a wrong offset!");

// Function FrenzySlasherVault.FrenzySlasherVault_C.IsInteractionPossibleBP
// 0x0020 (0x0020 - 0x0000)
struct FrenzySlasherVault_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCarrying_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrenzy_IsInFrenzy;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrenzySlasherVault_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on FrenzySlasherVault_C_IsInteractionPossibleBP");
static_assert(sizeof(FrenzySlasherVault_C_IsInteractionPossibleBP) == 0x000020, "Wrong size on FrenzySlasherVault_C_IsInteractionPossibleBP");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, K2Node_DynamicCast_AsSlasher_Player) == 0x000010, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, CallFunc_IsCarrying_ReturnValue) == 0x000019, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::CallFunc_IsCarrying_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, CallFunc_IsInFrenzy_IsInFrenzy) == 0x00001A, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::CallFunc_IsInFrenzy_IsInFrenzy' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'FrenzySlasherVault_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FrenzySlasherVault.FrenzySlasherVault_C.CanOverrideInteraction
// 0x0010 (0x0010 - 0x0000)
struct FrenzySlasherVault_C_CanOverrideInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOverrideInteraction_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrenzySlasherVault_C_CanOverrideInteraction) == 0x000008, "Wrong alignment on FrenzySlasherVault_C_CanOverrideInteraction");
static_assert(sizeof(FrenzySlasherVault_C_CanOverrideInteraction) == 0x000010, "Wrong size on FrenzySlasherVault_C_CanOverrideInteraction");
static_assert(offsetof(FrenzySlasherVault_C_CanOverrideInteraction, Interaction) == 0x000000, "Member 'FrenzySlasherVault_C_CanOverrideInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_CanOverrideInteraction, ReturnValue) == 0x000008, "Member 'FrenzySlasherVault_C_CanOverrideInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_CanOverrideInteraction, CallFunc_CanOverrideInteraction_ReturnValue) == 0x000009, "Member 'FrenzySlasherVault_C_CanOverrideInteraction::CallFunc_CanOverrideInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_CanOverrideInteraction, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00000A, "Member 'FrenzySlasherVault_C_CanOverrideInteraction::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrenzySlasherVault_C_CanOverrideInteraction, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'FrenzySlasherVault_C_CanOverrideInteraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

