#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayTagUtilities

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameplayTagUtilities.DBDGameplayTagUtilities.GameplayTagExists
// 0x0010 (0x0010 - 0x0000)
struct DBDGameplayTagUtilities_GameplayTagExists final
{
public:
	class FName                                   TagName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DBDGameplayTagUtilities_GameplayTagExists) == 0x000004, "Wrong alignment on DBDGameplayTagUtilities_GameplayTagExists");
static_assert(sizeof(DBDGameplayTagUtilities_GameplayTagExists) == 0x000010, "Wrong size on DBDGameplayTagUtilities_GameplayTagExists");
static_assert(offsetof(DBDGameplayTagUtilities_GameplayTagExists, TagName) == 0x000000, "Member 'DBDGameplayTagUtilities_GameplayTagExists::TagName' has a wrong offset!");
static_assert(offsetof(DBDGameplayTagUtilities_GameplayTagExists, ReturnValue) == 0x00000C, "Member 'DBDGameplayTagUtilities_GameplayTagExists::ReturnValue' has a wrong offset!");

// Function GameplayTagUtilities.DBDGameplayTagUtilities.GetScoreModifierName
// 0x0018 (0x0018 - 0x0000)
struct DBDGameplayTagUtilities_GetScoreModifierName final
{
public:
	class FName                                   ScoreEventID;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DBDGameplayTagUtilities_GetScoreModifierName) == 0x000004, "Wrong alignment on DBDGameplayTagUtilities_GetScoreModifierName");
static_assert(sizeof(DBDGameplayTagUtilities_GetScoreModifierName) == 0x000018, "Wrong size on DBDGameplayTagUtilities_GetScoreModifierName");
static_assert(offsetof(DBDGameplayTagUtilities_GetScoreModifierName, ScoreEventID) == 0x000000, "Member 'DBDGameplayTagUtilities_GetScoreModifierName::ScoreEventID' has a wrong offset!");
static_assert(offsetof(DBDGameplayTagUtilities_GetScoreModifierName, ReturnValue) == 0x00000C, "Member 'DBDGameplayTagUtilities_GetScoreModifierName::ReturnValue' has a wrong offset!");

// Function GameplayTagUtilities.GameplayTagContainerComponent.Add
// 0x000C (0x000C - 0x0000)
struct GameplayTagContainerComponent_Add final
{
public:
	struct FGameplayTag                           State;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTagContainerComponent_Add) == 0x000004, "Wrong alignment on GameplayTagContainerComponent_Add");
static_assert(sizeof(GameplayTagContainerComponent_Add) == 0x00000C, "Wrong size on GameplayTagContainerComponent_Add");
static_assert(offsetof(GameplayTagContainerComponent_Add, State) == 0x000000, "Member 'GameplayTagContainerComponent_Add::State' has a wrong offset!");

// Function GameplayTagUtilities.GameplayTagContainerComponent.AddTagWithSource
// 0x0018 (0x0018 - 0x0000)
struct GameplayTagContainerComponent_AddTagWithSource final
{
public:
	struct FGameplayTag                           State;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          Source;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTagContainerComponent_AddTagWithSource) == 0x000008, "Wrong alignment on GameplayTagContainerComponent_AddTagWithSource");
static_assert(sizeof(GameplayTagContainerComponent_AddTagWithSource) == 0x000018, "Wrong size on GameplayTagContainerComponent_AddTagWithSource");
static_assert(offsetof(GameplayTagContainerComponent_AddTagWithSource, State) == 0x000000, "Member 'GameplayTagContainerComponent_AddTagWithSource::State' has a wrong offset!");
static_assert(offsetof(GameplayTagContainerComponent_AddTagWithSource, Source) == 0x000010, "Member 'GameplayTagContainerComponent_AddTagWithSource::Source' has a wrong offset!");

// Function GameplayTagUtilities.GameplayTagContainerComponent.Remove
// 0x000C (0x000C - 0x0000)
struct GameplayTagContainerComponent_Remove final
{
public:
	struct FGameplayTag                           State;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTagContainerComponent_Remove) == 0x000004, "Wrong alignment on GameplayTagContainerComponent_Remove");
static_assert(sizeof(GameplayTagContainerComponent_Remove) == 0x00000C, "Wrong size on GameplayTagContainerComponent_Remove");
static_assert(offsetof(GameplayTagContainerComponent_Remove, State) == 0x000000, "Member 'GameplayTagContainerComponent_Remove::State' has a wrong offset!");

// Function GameplayTagUtilities.GameplayTagContainerComponent.RemoveTagWithSource
// 0x0018 (0x0018 - 0x0000)
struct GameplayTagContainerComponent_RemoveTagWithSource final
{
public:
	struct FGameplayTag                           State;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          Source;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTagContainerComponent_RemoveTagWithSource) == 0x000008, "Wrong alignment on GameplayTagContainerComponent_RemoveTagWithSource");
static_assert(sizeof(GameplayTagContainerComponent_RemoveTagWithSource) == 0x000018, "Wrong size on GameplayTagContainerComponent_RemoveTagWithSource");
static_assert(offsetof(GameplayTagContainerComponent_RemoveTagWithSource, State) == 0x000000, "Member 'GameplayTagContainerComponent_RemoveTagWithSource::State' has a wrong offset!");
static_assert(offsetof(GameplayTagContainerComponent_RemoveTagWithSource, Source) == 0x000010, "Member 'GameplayTagContainerComponent_RemoveTagWithSource::Source' has a wrong offset!");

// Function GameplayTagUtilities.GameplayTagContainerComponent.GetTags
// 0x0020 (0x0020 - 0x0000)
struct GameplayTagContainerComponent_GetTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayTagContainerComponent_GetTags) == 0x000008, "Wrong alignment on GameplayTagContainerComponent_GetTags");
static_assert(sizeof(GameplayTagContainerComponent_GetTags) == 0x000020, "Wrong size on GameplayTagContainerComponent_GetTags");
static_assert(offsetof(GameplayTagContainerComponent_GetTags, ReturnValue) == 0x000000, "Member 'GameplayTagContainerComponent_GetTags::ReturnValue' has a wrong offset!");

}

