#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericStun

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function GenericStun.GenericStun_C.IsInteractionPossibleBP
// 0x0010 (0x0010 - 0x0000)
struct GenericStun_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericStun_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on GenericStun_C_IsInteractionPossibleBP");
static_assert(sizeof(GenericStun_C_IsInteractionPossibleBP) == 0x000010, "Wrong size on GenericStun_C_IsInteractionPossibleBP");
static_assert(offsetof(GenericStun_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'GenericStun_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(GenericStun_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'GenericStun_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(GenericStun_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'GenericStun_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericStun_C_IsInteractionPossibleBP, Result) == 0x00000A, "Member 'GenericStun_C_IsInteractionPossibleBP::Result' has a wrong offset!");

// Function GenericStun.GenericStun_C.CanOverrideInteraction
// 0x0010 (0x0010 - 0x0000)
struct GenericStun_C_CanOverrideInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOverrideInteraction_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericStun_C_CanOverrideInteraction) == 0x000008, "Wrong alignment on GenericStun_C_CanOverrideInteraction");
static_assert(sizeof(GenericStun_C_CanOverrideInteraction) == 0x000010, "Wrong size on GenericStun_C_CanOverrideInteraction");
static_assert(offsetof(GenericStun_C_CanOverrideInteraction, Interaction) == 0x000000, "Member 'GenericStun_C_CanOverrideInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(GenericStun_C_CanOverrideInteraction, ReturnValue) == 0x000008, "Member 'GenericStun_C_CanOverrideInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericStun_C_CanOverrideInteraction, CallFunc_CanOverrideInteraction_ReturnValue) == 0x000009, "Member 'GenericStun_C_CanOverrideInteraction::CallFunc_CanOverrideInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericStun_C_CanOverrideInteraction, CallFunc_Array_Contains_ReturnValue) == 0x00000A, "Member 'GenericStun_C_CanOverrideInteraction::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

