#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeneratorStandard

#include "Basic.hpp"

#include "AnimationUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function GeneratorStandard.GeneratorStandard_C.Activate Damage Particles
// 0x0200 (0x0200 - 0x0000)
struct GeneratorStandard_C_Activate_Damage_Particles final
{
public:
	class UParticleSystemComponent*               Particles;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             Repairer;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Spark_Rotation;                                    // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Spark_Location;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSparkLocationOnRepairer_Location;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSparkLocationOnRepairer_Rotation;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_Player_Repairing_Is_Repairing;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDefaultSparkLocation_ReturnValue;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetDefaultSparkRotation_ReturnValue;      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0110(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GeneratorStandard_C_Activate_Damage_Particles) == 0x000010, "Wrong alignment on GeneratorStandard_C_Activate_Damage_Particles");
static_assert(sizeof(GeneratorStandard_C_Activate_Damage_Particles) == 0x000200, "Wrong size on GeneratorStandard_C_Activate_Damage_Particles");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, Particles) == 0x000000, "Member 'GeneratorStandard_C_Activate_Damage_Particles::Particles' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, Repairer) == 0x000008, "Member 'GeneratorStandard_C_Activate_Damage_Particles::Repairer' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, Spark_Rotation) == 0x000010, "Member 'GeneratorStandard_C_Activate_Damage_Particles::Spark_Rotation' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, Spark_Location) == 0x000028, "Member 'GeneratorStandard_C_Activate_Damage_Particles::Spark_Location' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_GetSparkLocationOnRepairer_Location) == 0x000040, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_GetSparkLocationOnRepairer_Location' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_GetSparkLocationOnRepairer_Rotation) == 0x000058, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_GetSparkLocationOnRepairer_Rotation' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_Is_Player_Repairing_Is_Repairing) == 0x000070, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_Is_Player_Repairing_Is_Repairing' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_IsValid_ReturnValue_1) == 0x000072, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_GetDefaultSparkLocation_ReturnValue) == 0x000078, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_GetDefaultSparkLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_GetDefaultSparkRotation_ReturnValue) == 0x000090, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_GetDefaultSparkRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_Activate_Damage_Particles, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000110, "Member 'GeneratorStandard_C_Activate_Damage_Particles::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.AddHidingPanel
// 0x0010 (0x0010 - 0x0000)
struct GeneratorStandard_C_AddHidingPanel final
{
public:
	class UInteractor*                            Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_AddHidingPanel) == 0x000008, "Wrong alignment on GeneratorStandard_C_AddHidingPanel");
static_assert(sizeof(GeneratorStandard_C_AddHidingPanel) == 0x000010, "Wrong size on GeneratorStandard_C_AddHidingPanel");
static_assert(offsetof(GeneratorStandard_C_AddHidingPanel, Interactor) == 0x000000, "Member 'GeneratorStandard_C_AddHidingPanel::Interactor' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_AddHidingPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'GeneratorStandard_C_AddHidingPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_AddHidingPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000009, "Member 'GeneratorStandard_C_AddHidingPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_AddHidingPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00000A, "Member 'GeneratorStandard_C_AddHidingPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_AddHidingPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x00000B, "Member 'GeneratorStandard_C_AddHidingPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bonus;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerLoudNoise;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HadInput;                                          // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillCheckCustomType                         Type;                                              // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChargeChange;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature) == 0x000008, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature) == 0x000018, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, Success) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::Success' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, Bonus) == 0x000001, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::Bonus' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, Player) == 0x000008, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::Player' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, TriggerLoudNoise) == 0x000010, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::TriggerLoudNoise' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, HadInput) == 0x000011, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::HadInput' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, Type) == 0x000012, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature, ChargeChange) == 0x000014, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_209_ChargeableSkillCheckResponse__DelegateSignature::ChargeChange' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bonus;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerLoudNoise;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HadInput;                                          // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillCheckCustomType                         Type;                                              // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChargeChange;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature) == 0x000008, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature) == 0x000018, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, Success) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::Success' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, Bonus) == 0x000001, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::Bonus' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, Player) == 0x000008, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::Player' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, TriggerLoudNoise) == 0x000010, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::TriggerLoudNoise' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, HadInput) == 0x000011, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::HadInput' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, Type) == 0x000012, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature, ChargeChange) == 0x000014, "Member 'GeneratorStandard_C_BndEvt__GeneratorCharge_K2Node_ComponentBoundEvent_297_ChargeableSkillCheckResponse__DelegateSignature::ChargeChange' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature final
{
public:
	bool                                          Intense;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature) == 0x000001, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature) == 0x000001, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature, Intense) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard__generatorDamageComponent_K2Node_ComponentBoundEvent_5_CosmeticGeneratorDamagedDelegate__DelegateSignature::Intense' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature final
{
public:
	int32                                         CurrentRegressionLevel;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature, CurrentRegressionLevel) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_CosmeticEvent__DelegateSignature::CurrentRegressionLevel' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature final
{
public:
	int32                                         CurrentRegressionLevel;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Blocked;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature) == 0x000004, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature) == 0x000008, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature, CurrentRegressionLevel) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature::CurrentRegressionLevel' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature, Blocked) == 0x000004, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_0_OnBlockingStatusChanged__DelegateSignature::Blocked' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature final
{
public:
	int32                                         CurrentRegressionLevel;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature, CurrentRegressionLevel) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_10_CosmeticEvent__DelegateSignature::CurrentRegressionLevel' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature final
{
public:
	int32                                         CurrentRegressionLevel;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature, CurrentRegressionLevel) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_6_CosmeticEvent__DelegateSignature::CurrentRegressionLevel' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature final
{
public:
	int32                                         CurrentRegressionLevel;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SurvivorInteracting;                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature) == 0x000008, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature, CurrentRegressionLevel) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature::CurrentRegressionLevel' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature, SurvivorInteracting) == 0x000004, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_7_CosmeticEvent__DelegateSignature::SurvivorInteracting' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature final
{
public:
	int32                                         CurrentRegressionLevel;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong alignment on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature");
static_assert(sizeof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature) == 0x000004, "Wrong size on GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature");
static_assert(offsetof(GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature, CurrentRegressionLevel) == 0x000000, "Member 'GeneratorStandard_C_BndEvt__GeneratorStandard_LimitGeneratorRegressionEvent_K2Node_ComponentBoundEvent_8_CosmeticEvent__DelegateSignature::CurrentRegressionLevel' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.CheckInteractorObstruction
// 0x0208 (0x0208 - 0x0000)
struct GeneratorStandard_C_CheckInteractorObstruction final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADBDPlayer*>                     CallFunc_GetInGamePlayers_ReturnValue;             // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractor*>                    K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractor*                            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_DBDCapsuleTraceSingle_OutHit;             // 0x0110(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_DBDCapsuleTraceSingle_ReturnValue;        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_CheckInteractorObstruction) == 0x000008, "Wrong alignment on GeneratorStandard_C_CheckInteractorObstruction");
static_assert(sizeof(GeneratorStandard_C_CheckInteractorObstruction) == 0x000208, "Wrong size on GeneratorStandard_C_CheckInteractorObstruction");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GeneratorStandard_C_CheckInteractorObstruction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GeneratorStandard_C_CheckInteractorObstruction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_GetInGamePlayers_ReturnValue) == 0x000010, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_GetInGamePlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, K2Node_MakeArray_Array) == 0x000028, "Member 'GeneratorStandard_C_CheckInteractorObstruction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Array_Get_Item) == 0x000040, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_GetForwardVector_ReturnValue) == 0x000050, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_NegateVector_ReturnValue) == 0x000098, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0000E0, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0000F8, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_DBDCapsuleTraceSingle_OutHit) == 0x000110, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_DBDCapsuleTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckInteractorObstruction, CallFunc_DBDCapsuleTraceSingle_ReturnValue) == 0x000200, "Member 'GeneratorStandard_C_CheckInteractorObstruction::CallFunc_DBDCapsuleTraceSingle_ReturnValue' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.CheckToolkitShouldContinue
// 0x0040 (0x0040 - 0x0000)
struct GeneratorStandard_C_CheckToolkitShouldContinue final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractionDefinition*                 InteractionDefinition;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldContinue;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterInventoryComponent*           CallFunc_GetCharacterInventoryComponent_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACollectable*                           CallFunc_GetItem_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AToolBox_C*                             K2Node_DynamicCast_AsTool_Box;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharge_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneratorStandard_C_CheckToolkitShouldContinue) == 0x000008, "Wrong alignment on GeneratorStandard_C_CheckToolkitShouldContinue");
static_assert(sizeof(GeneratorStandard_C_CheckToolkitShouldContinue) == 0x000040, "Wrong size on GeneratorStandard_C_CheckToolkitShouldContinue");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, Player) == 0x000000, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::Player' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, InteractionDefinition) == 0x000008, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::InteractionDefinition' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, ShouldContinue) == 0x000010, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::ShouldContinue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, Ret) == 0x000011, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::Ret' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, CallFunc_GetCharacterInventoryComponent_ReturnValue) == 0x000018, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::CallFunc_GetCharacterInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, CallFunc_GetItem_ReturnValue) == 0x000028, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::CallFunc_GetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, K2Node_DynamicCast_AsTool_Box) == 0x000030, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::K2Node_DynamicCast_AsTool_Box' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GeneratorStandard_C_CheckToolkitShouldContinue, CallFunc_HasCharge_ReturnValue) == 0x000039, "Member 'GeneratorStandard_C_CheckToolkitShouldContinue::CallFunc_HasCharge_ReturnValue' has a wrong offset!");

// Function GeneratorStandard.GeneratorStandard_C.ExecuteUbergraph_GeneratorStandard
// 0x0CE0 (0x0CE0 - 0x0000)
struct GeneratorStandard_C_ExecuteUbergraph_GeneratorStandard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     CallFunc_DBD_LoadAudioBankSynchronous_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADBDPlayer*>                     CallFunc_GetRepairers_ReturnValue;                 // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_interactingPlayer;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_explode;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRandomBeamSocketTransform_OutVector;   // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Intensified;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneratorFailSparks_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteracting_ReturnValue;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteracting_ReturnValue_1;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteracting_ReturnValue_2;              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRandomBeamSocketTransform_OutVector_1; // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneratorFailSparks_C*              CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRandomBeamSocketTransform_OutVector_2; // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GeneratorFailSparks_C*              CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRandomBeamSocketTransform_OutVector_3; // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteracting_ReturnValue_3;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GeneratorFailSparks_C*              CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_3;     // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetChildActor_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue;  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectStateProvider>  CallFunc_HasStateTag_objectStateProvider_CastInput; // 0x0280(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasStateTag_ReturnValue;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             CallFunc_GetLocallyObservedCharacter_ReturnValue_1; // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractingWith_ReturnValue;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x02E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_distance;                             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_parameterName;                        // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_showGeneratorCloneLoudNoise;          // 0x0320(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isAutoCompleted;                      // 0x0321(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323[0x5];                                      // 0x0323(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_currentRegressionLevel_5; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxNumberRegressionEventsAllowed_ReturnValue; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxNumberRegressionEventsAllowed_ReturnValue_1; // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_currentRegressionLevel_4; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
