#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryCollectionNodes

#include "Basic.hpp"

#include "Chaos_structs.hpp"
#include "DataflowCore_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GeometryCollectionNodes.EDataflowFieldFalloffType
// NumValues: 0x0007
enum class EDataflowFieldFalloffType : uint8
{
	Dataflow_FieldFalloffType_None           = 0,
	Dataflow_FieldFalloffType_Linear         = 1,
	Dataflow_FieldFalloffType_Inverse        = 2,
	Dataflow_FieldFalloffType_Squared        = 3,
	Dataflow_FieldFalloffType_Logarithmic    = 4,
	Dataflow_Max                             = 5,
	Dataflow_Max_0                           = 6,
};

// Enum GeometryCollectionNodes.EDataflowSetMaskConditionType
// NumValues: 0x0005
enum class EDataflowSetMaskConditionType : uint8
{
	Dataflow_SetMaskConditionType_Always     = 0,
	Dataflow_SetMaskConditionType_IFF_NOT_Interior = 1,
	Dataflow_SetMaskConditionType_IFF_NOT_Exterior = 2,
	Dataflow_Max                             = 3,
	Dataflow_Max_0                           = 4,
};

// Enum GeometryCollectionNodes.EDataflowWaveFunctionType
// NumValues: 0x0006
enum class EDataflowWaveFunctionType : uint8
{
	Dataflow_WaveFunctionType_Cosine         = 0,
	Dataflow_WaveFunctionType_Gaussian       = 1,
	Dataflow_WaveFunctionType_Falloff        = 2,
	Dataflow_WaveFunctionType_Decay          = 3,
	Dataflow_Max                             = 4,
	Dataflow_Max_0                           = 5,
};

// Enum GeometryCollectionNodes.EDataflowFloatFieldOperationType
// NumValues: 0x0008
enum class EDataflowFloatFieldOperationType : uint8
{
	Dataflow_FloatFieldOperationType_Multiply = 0,
	Dataflow_FloatFieldFalloffType_Divide    = 1,
	Dataflow_FloatFieldFalloffType_Add       = 2,
	Dataflow_FloatFieldFalloffType_Substract = 3,
	Dataflow_FloatFieldFalloffType_Min       = 4,
	Dataflow_FloatFieldFalloffType_Max       = 5,
	Dataflow_Max                             = 6,
	Dataflow_Max_0                           = 7,
};

// Enum GeometryCollectionNodes.EDataflowVectorFieldOperationType
// NumValues: 0x0007
enum class EDataflowVectorFieldOperationType : uint8
{
	Dataflow_VectorFieldOperationType_Multiply = 0,
	Dataflow_VectorFieldFalloffType_Divide   = 1,
	Dataflow_VectorFieldFalloffType_Add      = 2,
	Dataflow_VectorFieldFalloffType_Substract = 3,
	Dataflow_VectorFieldFalloffType_CrossProduct = 4,
	Dataflow_Max                             = 5,
	Dataflow_Max_0                           = 6,
};

// Enum GeometryCollectionNodes.ESetMaterialOperationTypeEnum
// NumValues: 0x0004
enum class ESetMaterialOperationTypeEnum : uint8
{
	Dataflow_SetMaterialOperationType_Add    = 0,
	Dataflow_SetMaterialOperationType_Insert = 1,
	Dataflow_Max                             = 2,
	Dataflow_Max_0                           = 3,
};

// Enum GeometryCollectionNodes.EConvexOverlapRemovalMethodEnum
// NumValues: 0x0006
enum class EConvexOverlapRemovalMethodEnum : uint8
{
	Dataflow_EConvexOverlapRemovalMethod_None = 0,
	Dataflow_EConvexOverlapRemovalMethod_All = 1,
	Dataflow_EConvexOverlapRemovalMethod_OnlyClusters = 2,
	Dataflow_EConvexOverlapRemovalMethod_OnlyClustersVsClusters = 3,
	Dataflow_Max                             = 4,
	Dataflow_Max_0                           = 5,
};

// Enum GeometryCollectionNodes.EClusterSizeMethodEnum
// NumValues: 0x0005
enum class EClusterSizeMethodEnum : uint8
{
	Dataflow_ClusterSizeMethod_ByNumber      = 0,
	Dataflow_ClusterSizeMethod_ByFractionOfInput = 1,
	Dataflow_ClusterSizeMethod_BySize        = 2,
	Dataflow_Max                             = 3,
	Dataflow_Max_0                           = 4,
};

// Enum GeometryCollectionNodes.EVisibiltyOptionsEnum
// NumValues: 0x0004
enum class EVisibiltyOptionsEnum : uint8
{
	Dataflow_VisibilityOptions_Visible       = 0,
	Dataflow_VisibilityOptions_Invisible     = 1,
	Dataflow_Max                             = 2,
	Dataflow_Max_0                           = 3,
};

// Enum GeometryCollectionNodes.EMeshBooleanOperationEnum
// NumValues: 0x0005
enum class EMeshBooleanOperationEnum : uint8
{
	Dataflow_MeshBoolean_Union               = 0,
	Dataflow_MeshBoolean_Intersect           = 1,
	Dataflow_MeshBoolean_Difference          = 2,
	Dataflow_Max                             = 3,
	Dataflow_Max_0                           = 4,
};

// Enum GeometryCollectionNodes.EMakeBoxDataTypeEnum
// NumValues: 0x0004
enum class EMakeBoxDataTypeEnum : uint8
{
	Dataflow_MakeBox_DataType_MinMax         = 0,
	Dataflow_MakeBox_DataType_CenterSize     = 1,
	Dataflow_Max                             = 2,
	Dataflow_Max_0                           = 3,
};

// Enum GeometryCollectionNodes.EFloatToIntFunctionEnum
// NumValues: 0x0006
enum class EFloatToIntFunctionEnum : uint8
{
	Dataflow_FloatToInt_Function_Floor       = 0,
	Dataflow_FloatToInt_Function_Ceil        = 1,
	Dataflow_FloatToInt_Function_Round       = 2,
	Dataflow_FloatToInt_Function_Truncate    = 3,
	Dataflow_Max                             = 4,
	Dataflow_Max_0                           = 5,
};

// Enum GeometryCollectionNodes.EFloatArrayToIntArrayFunctionEnum
// NumValues: 0x0008
enum class EFloatArrayToIntArrayFunctionEnum : uint8
{
	Dataflow_FloatToInt_Function_Floor       = 0,
	Dataflow_FloatToInt_Function_Ceil        = 1,
	Dataflow_FloatToInt_Function_Round       = 2,
	Dataflow_FloatToInt_Function_Truncate    = 3,
	Dataflow_FloatToInt_NonZeroToIndex       = 4,
	Dataflow_FloatToInt_ZeroToIndex          = 5,
	Dataflow_Max                             = 6,
	Dataflow_Max_0                           = 7,
};

// Enum GeometryCollectionNodes.EMathConstantsEnum
// NumValues: 0x0010
enum class EMathConstantsEnum : uint8
{
	Dataflow_MathConstants_Pi                = 0,
	Dataflow_MathConstants_HalfPi            = 1,
	Dataflow_MathConstants_TwoPi             = 2,
	Dataflow_MathConstants_FourPi            = 3,
	Dataflow_MathConstants_InvPi             = 4,
	Dataflow_MathConstants_InvTwoPi          = 5,
	Dataflow_MathConstants_Sqrt2             = 6,
	Dataflow_MathConstants_InvSqrt2          = 7,
	Dataflow_MathConstants_Sqrt3             = 8,
	Dataflow_MathConstants_InvSqrt3          = 9,
	Dataflow_FloatToInt_Function_E           = 10,
	Dataflow_FloatToInt_Function_Gamma       = 11,
	Dataflow_FloatToInt_Function_GoldenRatio = 12,
	Dataflow_FloatToInt_Function_ZeroTolerance = 13,
	Dataflow_Max                             = 14,
	Dataflow_Max_0                           = 15,
};

// Enum GeometryCollectionNodes.ERotationOrderEnum
// NumValues: 0x0008
enum class ERotationOrderEnum : uint8
{
	Dataflow_RotationOrder_XYZ               = 0,
	Dataflow_RotationOrder_YZX               = 1,
	Dataflow_RotationOrder_ZXY               = 2,
	Dataflow_RotationOrder_XZY               = 3,
	Dataflow_RotationOrder_YXZ               = 4,
	Dataflow_RotationOrder_ZYX               = 5,
	Dataflow_Max                             = 6,
	Dataflow_Max_0                           = 7,
};

// Enum GeometryCollectionNodes.ECompareOperationEnum
// NumValues: 0x0007
enum class ECompareOperationEnum : uint8
{
	Dataflow_Compare_Equal                   = 0,
	Dataflow_Compare_Smaller                 = 1,
	Dataflow_Compare_SmallerOrEqual          = 2,
	Dataflow_Compare_Greater                 = 3,
	Dataflow_Compare_GreaterOrEqual          = 4,
	Dataflow_Max                             = 5,
	Dataflow_Max_0                           = 6,
};

// Enum GeometryCollectionNodes.EAnchorStateEnum
// NumValues: 0x0004
enum class EAnchorStateEnum : uint8
{
	Dataflow_AnchorState_Anchored            = 0,
	Dataflow_AnchorState_NotAnchored         = 1,
	Dataflow_Max                             = 2,
	Dataflow_Max_0                           = 3,
};

// Enum GeometryCollectionNodes.EProximityMethodEnum
// NumValues: 0x0004
enum class EProximityMethodEnum : uint8
{
	Dataflow_ProximityMethod_Precise         = 0,
	Dataflow_ProximityMethod_ConvexHull      = 1,
	Dataflow_Max                             = 2,
	Dataflow_Max_0                           = 3,
};

// Enum GeometryCollectionNodes.EStandardGroupNameEnum
// NumValues: 0x0009
enum class EStandardGroupNameEnum : uint8
{
	Dataflow_EStandardGroupNameEnum_Transform = 0,
	Dataflow_EStandardGroupNameEnum_Geometry = 1,
	Dataflow_EStandardGroupNameEnum_Faces    = 2,
	Dataflow_EStandardGroupNameEnum_Vertices = 3,
	Dataflow_EStandardGroupNameEnum_Material = 4,
	Dataflow_EStandardGroupNameEnum_Breaking = 5,
	Dataflow_EStandardGroupNameEnum_Custom   = 6,
	Dataflow_Max                             = 7,
	Dataflow_Max_0                           = 8,
};

// Enum GeometryCollectionNodes.ECustomAttributeTypeEnum
// NumValues: 0x001A
enum class ECustomAttributeTypeEnum : uint8
{
	Dataflow_CustomAttributeType_UInt8       = 0,
	Dataflow_CustomAttributeType_Int32       = 1,
	Dataflow_CustomAttributeType_Float       = 2,
	Dataflow_CustomAttributeType_Double      = 3,
	Dataflow_CustomAttributeType_Bool        = 4,
	Dataflow_CustomAttributeType_String      = 5,
	Dataflow_CustomAttributeType_Vector2f    = 6,
	Dataflow_CustomAttributeType_Vector3f    = 7,
	Dataflow_CustomAttributeType_Vector3d    = 8,
	Dataflow_CustomAttributeType_Vector4f    = 9,
	Dataflow_CustomAttributeType_LinearColor = 10,
	Dataflow_CustomAttributeType_Transform   = 11,
	Dataflow_CustomAttributeType_Quat4f      = 12,
	Dataflow_CustomAttributeType_Box         = 13,
	Dataflow_CustomAttributeType_Guid        = 14,
	Dataflow_CustomAttributeType_Int32Set    = 15,
	Dataflow_CustomAttributeType_Int32Array  = 16,
	Dataflow_CustomAttributeType_IntVector   = 17,
	Dataflow_CustomAttributeType_IntVector2  = 18,
	Dataflow_CustomAttributeType_IntVector4  = 19,
	Dataflow_CustomAttributeType_IntVector2Array = 20,
	Dataflow_CustomAttributeType_FloatArray  = 21,
	Dataflow_CustomAttributeType_Vector2fArray = 22,
	Dataflow_CustomAttributeType_FVector3fArray = 23,
	Dataflow_Max                             = 24,
	Dataflow_Max_0                           = 25,
};

// Enum GeometryCollectionNodes.ESetOperationEnum
// NumValues: 0x0005
enum class ESetOperationEnum : uint8
{
	Dataflow_SetOperation_AND                = 0,
	Dataflow_SetOperation_OR                 = 1,
	Dataflow_SetOperation_XOR                = 2,
	Dataflow_Max                             = 3,
	Dataflow_Max_0                           = 4,
};

// Enum GeometryCollectionNodes.ERangeSettingEnum
// NumValues: 0x0004
enum class ERangeSettingEnum : uint8
{
	Dataflow_RangeSetting_InsideRange        = 0,
	Dataflow_RangeSetting_OutsideRange       = 1,
	Dataflow_Max                             = 2,
	Dataflow_Max_0                           = 3,
};

// Enum GeometryCollectionNodes.ESelectSubjectTypeEnum
// NumValues: 0x0005
enum class ESelectSubjectTypeEnum : uint8
{
	Dataflow_SelectSubjectType_Vertices      = 0,
	Dataflow_SelectSubjectType_BoundingBox   = 1,
	Dataflow_SelectSubjectType_Centroid      = 2,
	Dataflow_Max                             = 3,
	Dataflow_Max_0                           = 4,
};

// ScriptStruct GeometryCollectionNodes.MakePointsDataflowNode
// 0x0020 (0x0110 - 0x00F0)
struct FMakePointsDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector>                        Point;                                             // 0x00F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Points;                                            // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMakePointsDataflowNode) == 0x000008, "Wrong alignment on FMakePointsDataflowNode");
static_assert(sizeof(FMakePointsDataflowNode) == 0x000110, "Wrong size on FMakePointsDataflowNode");
static_assert(offsetof(FMakePointsDataflowNode, Point) == 0x0000F0, "Member 'FMakePointsDataflowNode::Point' has a wrong offset!");
static_assert(offsetof(FMakePointsDataflowNode, Points) == 0x000100, "Member 'FMakePointsDataflowNode::Points' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.GeometryCollectionTerminalDataflowNode
// 0x00D0 (0x01C0 - 0x00F0)
struct FGeometryCollectionTerminalDataflowNode final : public FDataflowTerminalNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x00F0(0x00B0)(NativeAccessSpecifierPublic)
	TArray<class UMaterial*>                      Materials;                                         // 0x01A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionAutoInstanceMesh> InstancedMeshes;                                   // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryCollectionTerminalDataflowNode) == 0x000008, "Wrong alignment on FGeometryCollectionTerminalDataflowNode");
static_assert(sizeof(FGeometryCollectionTerminalDataflowNode) == 0x0001C0, "Wrong size on FGeometryCollectionTerminalDataflowNode");
static_assert(offsetof(FGeometryCollectionTerminalDataflowNode, Collection) == 0x0000F0, "Member 'FGeometryCollectionTerminalDataflowNode::Collection' has a wrong offset!");
static_assert(offsetof(FGeometryCollectionTerminalDataflowNode, Materials) == 0x0001A0, "Member 'FGeometryCollectionTerminalDataflowNode::Materials' has a wrong offset!");
static_assert(offsetof(FGeometryCollectionTerminalDataflowNode, InstancedMeshes) == 0x0001B0, "Member 'FGeometryCollectionTerminalDataflowNode::InstancedMeshes' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.PlaneFalloffFieldDataflowNode
// 0x00E0 (0x01D0 - 0x00F0)
struct FPlaneFalloffFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0120(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Translation;                                       // 0x0158(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowFieldFalloffType                     FalloffType;                                       // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x0188(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0198(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               FieldSelectionMask;                                // 0x01A8(0x0020)(NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlaneFalloffFieldDataflowNode) == 0x000008, "Wrong alignment on FPlaneFalloffFieldDataflowNode");
static_assert(sizeof(FPlaneFalloffFieldDataflowNode) == 0x0001D0, "Wrong size on FPlaneFalloffFieldDataflowNode");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FPlaneFalloffFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FPlaneFalloffFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, Position) == 0x000120, "Member 'FPlaneFalloffFieldDataflowNode::Position' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, Normal) == 0x000138, "Member 'FPlaneFalloffFieldDataflowNode::Normal' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, Distance) == 0x000150, "Member 'FPlaneFalloffFieldDataflowNode::Distance' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, Translation) == 0x000158, "Member 'FPlaneFalloffFieldDataflowNode::Translation' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, Magnitude) == 0x000170, "Member 'FPlaneFalloffFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, MinRange) == 0x000174, "Member 'FPlaneFalloffFieldDataflowNode::MinRange' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, MaxRange) == 0x000178, "Member 'FPlaneFalloffFieldDataflowNode::MaxRange' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, Default) == 0x00017C, "Member 'FPlaneFalloffFieldDataflowNode::Default' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, FalloffType) == 0x000180, "Member 'FPlaneFalloffFieldDataflowNode::FalloffType' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, FieldFloatResult) == 0x000188, "Member 'FPlaneFalloffFieldDataflowNode::FieldFloatResult' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, FieldRemap) == 0x000198, "Member 'FPlaneFalloffFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, FieldSelectionMask) == 0x0001A8, "Member 'FPlaneFalloffFieldDataflowNode::FieldSelectionMask' has a wrong offset!");
static_assert(offsetof(FPlaneFalloffFieldDataflowNode, NumSamplePositions) == 0x0001C8, "Member 'FPlaneFalloffFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.MakeLiteralFloatDataflowNode
// 0x0008 (0x00F8 - 0x00F0)
struct FMakeLiteralFloatDataflowNode final : public FDataflowNode
{
public:
	float                                         Value;                                             // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Float;                                             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMakeLiteralFloatDataflowNode) == 0x000008, "Wrong alignment on FMakeLiteralFloatDataflowNode");
static_assert(sizeof(FMakeLiteralFloatDataflowNode) == 0x0000F8, "Wrong size on FMakeLiteralFloatDataflowNode");
static_assert(offsetof(FMakeLiteralFloatDataflowNode, Value) == 0x0000F0, "Member 'FMakeLiteralFloatDataflowNode::Value' has a wrong offset!");
static_assert(offsetof(FMakeLiteralFloatDataflowNode, Float) == 0x0000F4, "Member 'FMakeLiteralFloatDataflowNode::Float' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.GetGeometryCollectionAssetDataflowNode
// 0x0008 (0x00F8 - 0x00F0)
struct FGetGeometryCollectionAssetDataflowNode final : public FDataflowNode
{
public:
	class UGeometryCollection*                    Asset;                                             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetGeometryCollectionAssetDataflowNode) == 0x000008, "Wrong alignment on FGetGeometryCollectionAssetDataflowNode");
static_assert(sizeof(FGetGeometryCollectionAssetDataflowNode) == 0x0000F8, "Wrong size on FGetGeometryCollectionAssetDataflowNode");
static_assert(offsetof(FGetGeometryCollectionAssetDataflowNode, Asset) == 0x0000F0, "Member 'FGetGeometryCollectionAssetDataflowNode::Asset' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.RadialIntMaskFieldDataflowNode
// 0x00A0 (0x0190 - 0x00F0)
struct FRadialIntMaskFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	struct FSphere                                Sphere;                                            // 0x0120(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Translation;                                       // 0x0140(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InteriorValue;                                     // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExteriorValue;                                     // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowSetMaskConditionType                 SetMaskConditionType;                              // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 FieldIntResult;                                    // 0x0168(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0178(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadialIntMaskFieldDataflowNode) == 0x000008, "Wrong alignment on FRadialIntMaskFieldDataflowNode");
static_assert(sizeof(FRadialIntMaskFieldDataflowNode) == 0x000190, "Wrong size on FRadialIntMaskFieldDataflowNode");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FRadialIntMaskFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FRadialIntMaskFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, Sphere) == 0x000120, "Member 'FRadialIntMaskFieldDataflowNode::Sphere' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, Translation) == 0x000140, "Member 'FRadialIntMaskFieldDataflowNode::Translation' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, InteriorValue) == 0x000158, "Member 'FRadialIntMaskFieldDataflowNode::InteriorValue' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, ExteriorValue) == 0x00015C, "Member 'FRadialIntMaskFieldDataflowNode::ExteriorValue' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, SetMaskConditionType) == 0x000160, "Member 'FRadialIntMaskFieldDataflowNode::SetMaskConditionType' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, FieldIntResult) == 0x000168, "Member 'FRadialIntMaskFieldDataflowNode::FieldIntResult' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, FieldRemap) == 0x000178, "Member 'FRadialIntMaskFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FRadialIntMaskFieldDataflowNode, NumSamplePositions) == 0x000188, "Member 'FRadialIntMaskFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.MakeLiteralIntDataflowNode
// 0x0008 (0x00F8 - 0x00F0)
struct FMakeLiteralIntDataflowNode final : public FDataflowNode
{
public:
	int32                                         Value;                                             // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Int;                                               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMakeLiteralIntDataflowNode) == 0x000008, "Wrong alignment on FMakeLiteralIntDataflowNode");
static_assert(sizeof(FMakeLiteralIntDataflowNode) == 0x0000F8, "Wrong size on FMakeLiteralIntDataflowNode");
static_assert(offsetof(FMakeLiteralIntDataflowNode, Value) == 0x0000F0, "Member 'FMakeLiteralIntDataflowNode::Value' has a wrong offset!");
static_assert(offsetof(FMakeLiteralIntDataflowNode, Int) == 0x0000F4, "Member 'FMakeLiteralIntDataflowNode::Int' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.GetGeometryCollectionSourcesDataflowNode
// 0x0018 (0x0108 - 0x00F0)
struct FGetGeometryCollectionSourcesDataflowNode final : public FDataflowNode
{
public:
	class UGeometryCollection*                    Asset;                                             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionSource>      Sources;                                           // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetGeometryCollectionSourcesDataflowNode) == 0x000008, "Wrong alignment on FGetGeometryCollectionSourcesDataflowNode");
static_assert(sizeof(FGetGeometryCollectionSourcesDataflowNode) == 0x000108, "Wrong size on FGetGeometryCollectionSourcesDataflowNode");
static_assert(offsetof(FGetGeometryCollectionSourcesDataflowNode, Asset) == 0x0000F0, "Member 'FGetGeometryCollectionSourcesDataflowNode::Asset' has a wrong offset!");
static_assert(offsetof(FGetGeometryCollectionSourcesDataflowNode, Sources) == 0x0000F8, "Member 'FGetGeometryCollectionSourcesDataflowNode::Sources' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.MakeLiteralVectorDataflowNode
// 0x0028 (0x0118 - 0x00F0)
struct FMakeLiteralVectorDataflowNode final : public FDataflowNode
{
public:
	float                                         X;                                                 // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Vector;                                            // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMakeLiteralVectorDataflowNode) == 0x000008, "Wrong alignment on FMakeLiteralVectorDataflowNode");
static_assert(sizeof(FMakeLiteralVectorDataflowNode) == 0x000118, "Wrong size on FMakeLiteralVectorDataflowNode");
static_assert(offsetof(FMakeLiteralVectorDataflowNode, X) == 0x0000F0, "Member 'FMakeLiteralVectorDataflowNode::X' has a wrong offset!");
static_assert(offsetof(FMakeLiteralVectorDataflowNode, Y) == 0x0000F4, "Member 'FMakeLiteralVectorDataflowNode::Y' has a wrong offset!");
static_assert(offsetof(FMakeLiteralVectorDataflowNode, Z) == 0x0000F8, "Member 'FMakeLiteralVectorDataflowNode::Z' has a wrong offset!");
static_assert(offsetof(FMakeLiteralVectorDataflowNode, Vector) == 0x000100, "Member 'FMakeLiteralVectorDataflowNode::Vector' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.CreateGeometryCollectionFromSourcesDataflowNode
// 0x00E0 (0x01D0 - 0x00F0)
struct FCreateGeometryCollectionFromSourcesDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FGeometryCollectionSource>      Sources;                                           // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection;                                        // 0x0100(0x00B0)(NativeAccessSpecifierPublic)
	TArray<class UMaterial*>                      Materials;                                         // 0x01B0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionAutoInstanceMesh> InstancedMeshes;                                   // 0x01C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCreateGeometryCollectionFromSourcesDataflowNode) == 0x000008, "Wrong alignment on FCreateGeometryCollectionFromSourcesDataflowNode");
static_assert(sizeof(FCreateGeometryCollectionFromSourcesDataflowNode) == 0x0001D0, "Wrong size on FCreateGeometryCollectionFromSourcesDataflowNode");
static_assert(offsetof(FCreateGeometryCollectionFromSourcesDataflowNode, Sources) == 0x0000F0, "Member 'FCreateGeometryCollectionFromSourcesDataflowNode::Sources' has a wrong offset!");
static_assert(offsetof(FCreateGeometryCollectionFromSourcesDataflowNode, Collection) == 0x000100, "Member 'FCreateGeometryCollectionFromSourcesDataflowNode::Collection' has a wrong offset!");
static_assert(offsetof(FCreateGeometryCollectionFromSourcesDataflowNode, Materials) == 0x0001B0, "Member 'FCreateGeometryCollectionFromSourcesDataflowNode::Materials' has a wrong offset!");
static_assert(offsetof(FCreateGeometryCollectionFromSourcesDataflowNode, InstancedMeshes) == 0x0001C0, "Member 'FCreateGeometryCollectionFromSourcesDataflowNode::InstancedMeshes' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.RadialFalloffFieldDataflowNode
// 0x00C8 (0x01B8 - 0x00F0)
struct FRadialFalloffFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	struct FSphere                                Sphere;                                            // 0x0120(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Translation;                                       // 0x0140(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowFieldFalloffType                     FalloffType;                                       // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x0170(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               FieldSelectionMask;                                // 0x0190(0x0020)(NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadialFalloffFieldDataflowNode) == 0x000008, "Wrong alignment on FRadialFalloffFieldDataflowNode");
static_assert(sizeof(FRadialFalloffFieldDataflowNode) == 0x0001B8, "Wrong size on FRadialFalloffFieldDataflowNode");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FRadialFalloffFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FRadialFalloffFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, Sphere) == 0x000120, "Member 'FRadialFalloffFieldDataflowNode::Sphere' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, Translation) == 0x000140, "Member 'FRadialFalloffFieldDataflowNode::Translation' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, Magnitude) == 0x000158, "Member 'FRadialFalloffFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, MinRange) == 0x00015C, "Member 'FRadialFalloffFieldDataflowNode::MinRange' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, MaxRange) == 0x000160, "Member 'FRadialFalloffFieldDataflowNode::MaxRange' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, Default) == 0x000164, "Member 'FRadialFalloffFieldDataflowNode::Default' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, FalloffType) == 0x000168, "Member 'FRadialFalloffFieldDataflowNode::FalloffType' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, FieldFloatResult) == 0x000170, "Member 'FRadialFalloffFieldDataflowNode::FieldFloatResult' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, FieldRemap) == 0x000180, "Member 'FRadialFalloffFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, FieldSelectionMask) == 0x000190, "Member 'FRadialFalloffFieldDataflowNode::FieldSelectionMask' has a wrong offset!");
static_assert(offsetof(FRadialFalloffFieldDataflowNode, NumSamplePositions) == 0x0001B0, "Member 'FRadialFalloffFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.BoxFalloffFieldDataflowNode
// 0x0130 (0x0220 - 0x00F0)
struct FBoxFalloffFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	struct FBox                                   Box;                                               // 0x0120(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0160(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x01C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x01C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x01CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowFieldFalloffType                     FalloffType;                                       // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x01D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x01E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               FieldSelectionMask;                                // 0x01F8(0x0020)(NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBoxFalloffFieldDataflowNode) == 0x000010, "Wrong alignment on FBoxFalloffFieldDataflowNode");
static_assert(sizeof(FBoxFalloffFieldDataflowNode) == 0x000220, "Wrong size on FBoxFalloffFieldDataflowNode");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FBoxFalloffFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FBoxFalloffFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, Box) == 0x000120, "Member 'FBoxFalloffFieldDataflowNode::Box' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, Transform) == 0x000160, "Member 'FBoxFalloffFieldDataflowNode::Transform' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, Magnitude) == 0x0001C0, "Member 'FBoxFalloffFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, MinRange) == 0x0001C4, "Member 'FBoxFalloffFieldDataflowNode::MinRange' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, MaxRange) == 0x0001C8, "Member 'FBoxFalloffFieldDataflowNode::MaxRange' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, Default) == 0x0001CC, "Member 'FBoxFalloffFieldDataflowNode::Default' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, FalloffType) == 0x0001D0, "Member 'FBoxFalloffFieldDataflowNode::FalloffType' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, FieldFloatResult) == 0x0001D8, "Member 'FBoxFalloffFieldDataflowNode::FieldFloatResult' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, FieldRemap) == 0x0001E8, "Member 'FBoxFalloffFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, FieldSelectionMask) == 0x0001F8, "Member 'FBoxFalloffFieldDataflowNode::FieldSelectionMask' has a wrong offset!");
static_assert(offsetof(FBoxFalloffFieldDataflowNode, NumSamplePositions) == 0x000218, "Member 'FBoxFalloffFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.UniformScalarFieldDataflowNode
// 0x0060 (0x0150 - 0x00F0)
struct FUniformScalarFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUniformScalarFieldDataflowNode) == 0x000008, "Wrong alignment on FUniformScalarFieldDataflowNode");
static_assert(sizeof(FUniformScalarFieldDataflowNode) == 0x000150, "Wrong size on FUniformScalarFieldDataflowNode");
static_assert(offsetof(FUniformScalarFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FUniformScalarFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FUniformScalarFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FUniformScalarFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FUniformScalarFieldDataflowNode, Magnitude) == 0x000120, "Member 'FUniformScalarFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FUniformScalarFieldDataflowNode, FieldFloatResult) == 0x000128, "Member 'FUniformScalarFieldDataflowNode::FieldFloatResult' has a wrong offset!");
static_assert(offsetof(FUniformScalarFieldDataflowNode, FieldRemap) == 0x000138, "Member 'FUniformScalarFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FUniformScalarFieldDataflowNode, NumSamplePositions) == 0x000148, "Member 'FUniformScalarFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.UniformVectorFieldDataflowNode
// 0x0078 (0x0168 - 0x00F0)
struct FUniformVectorFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Direction;                                         // 0x0128(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        FieldVectorResult;                                 // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUniformVectorFieldDataflowNode) == 0x000008, "Wrong alignment on FUniformVectorFieldDataflowNode");
static_assert(sizeof(FUniformVectorFieldDataflowNode) == 0x000168, "Wrong size on FUniformVectorFieldDataflowNode");
static_assert(offsetof(FUniformVectorFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FUniformVectorFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FUniformVectorFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FUniformVectorFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FUniformVectorFieldDataflowNode, Magnitude) == 0x000120, "Member 'FUniformVectorFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FUniformVectorFieldDataflowNode, Direction) == 0x000128, "Member 'FUniformVectorFieldDataflowNode::Direction' has a wrong offset!");
static_assert(offsetof(FUniformVectorFieldDataflowNode, FieldVectorResult) == 0x000140, "Member 'FUniformVectorFieldDataflowNode::FieldVectorResult' has a wrong offset!");
static_assert(offsetof(FUniformVectorFieldDataflowNode, FieldRemap) == 0x000150, "Member 'FUniformVectorFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FUniformVectorFieldDataflowNode, NumSamplePositions) == 0x000160, "Member 'FUniformVectorFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.RadialVectorFieldDataflowNode
// 0x0078 (0x0168 - 0x00F0)
struct FRadialVectorFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0128(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        FieldVectorResult;                                 // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadialVectorFieldDataflowNode) == 0x000008, "Wrong alignment on FRadialVectorFieldDataflowNode");
static_assert(sizeof(FRadialVectorFieldDataflowNode) == 0x000168, "Wrong size on FRadialVectorFieldDataflowNode");
static_assert(offsetof(FRadialVectorFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FRadialVectorFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FRadialVectorFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FRadialVectorFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FRadialVectorFieldDataflowNode, Magnitude) == 0x000120, "Member 'FRadialVectorFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FRadialVectorFieldDataflowNode, Position) == 0x000128, "Member 'FRadialVectorFieldDataflowNode::Position' has a wrong offset!");
static_assert(offsetof(FRadialVectorFieldDataflowNode, FieldVectorResult) == 0x000140, "Member 'FRadialVectorFieldDataflowNode::FieldVectorResult' has a wrong offset!");
static_assert(offsetof(FRadialVectorFieldDataflowNode, FieldRemap) == 0x000150, "Member 'FRadialVectorFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FRadialVectorFieldDataflowNode, NumSamplePositions) == 0x000160, "Member 'FRadialVectorFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.RandomVectorFieldDataflowNode
// 0x0060 (0x0150 - 0x00F0)
struct FRandomVectorFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        FieldVectorResult;                                 // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRandomVectorFieldDataflowNode) == 0x000008, "Wrong alignment on FRandomVectorFieldDataflowNode");
static_assert(sizeof(FRandomVectorFieldDataflowNode) == 0x000150, "Wrong size on FRandomVectorFieldDataflowNode");
static_assert(offsetof(FRandomVectorFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FRandomVectorFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FRandomVectorFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FRandomVectorFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FRandomVectorFieldDataflowNode, Magnitude) == 0x000120, "Member 'FRandomVectorFieldDataflowNode::Magnitude' has a wrong offset!");
static_assert(offsetof(FRandomVectorFieldDataflowNode, FieldVectorResult) == 0x000128, "Member 'FRandomVectorFieldDataflowNode::FieldVectorResult' has a wrong offset!");
static_assert(offsetof(FRandomVectorFieldDataflowNode, FieldRemap) == 0x000138, "Member 'FRandomVectorFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FRandomVectorFieldDataflowNode, NumSamplePositions) == 0x000148, "Member 'FRandomVectorFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.NoiseFieldDataflowNode
// 0x00D0 (0x01C0 - 0x00F0)
struct FNoiseFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0130(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 FieldFloatResult;                                  // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0xC];                                      // 0x01B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNoiseFieldDataflowNode) == 0x000010, "Wrong alignment on FNoiseFieldDataflowNode");
static_assert(sizeof(FNoiseFieldDataflowNode) == 0x0001C0, "Wrong size on FNoiseFieldDataflowNode");
static_assert(offsetof(FNoiseFieldDataflowNode, SamplePositions) == 0x0000F0, "Member 'FNoiseFieldDataflowNode::SamplePositions' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, SampleIndices) == 0x000100, "Member 'FNoiseFieldDataflowNode::SampleIndices' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, MinRange) == 0x000120, "Member 'FNoiseFieldDataflowNode::MinRange' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, MaxRange) == 0x000124, "Member 'FNoiseFieldDataflowNode::MaxRange' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, Transform) == 0x000130, "Member 'FNoiseFieldDataflowNode::Transform' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, FieldFloatResult) == 0x000190, "Member 'FNoiseFieldDataflowNode::FieldFloatResult' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, FieldRemap) == 0x0001A0, "Member 'FNoiseFieldDataflowNode::FieldRemap' has a wrong offset!");
static_assert(offsetof(FNoiseFieldDataflowNode, NumSamplePositions) == 0x0001B0, "Member 'FNoiseFieldDataflowNode::NumSamplePositions' has a wrong offset!");

// ScriptStruct GeometryCollectionNodes.UniformIntegerFieldDataflowNode
// 0x0060 (0x0150 - 0x00F0)
struct FUniformIntegerFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x0100(0x0020)(NativeAccessSpecifierPublic)
	int32                                         Magnitude;                                         // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 FieldIntResult;                                    // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUniformIntegerFieldDataflowNode) == 0x000008, "Wrong alignment on FUniformIntegerFieldDataflowNode");
