#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryCollectionTracks

#include "Basic.hpp"

#include "GeometryCollectionTracks_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class GeometryCollectionTracks.MovieSceneGeometryCollectionSection
// 0x0040 (0x0138 - 0x00F8)
class UMovieSceneGeometryCollectionSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneGeometryCollectionParams    Params;                                            // 0x00F8(0x0040)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGeometryCollectionSection">();
	}
	static class UMovieSceneGeometryCollectionSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGeometryCollectionSection>();
	}
};
static_assert(alignof(UMovieSceneGeometryCollectionSection) == 0x000008, "Wrong alignment on UMovieSceneGeometryCollectionSection");
static_assert(sizeof(UMovieSceneGeometryCollectionSection) == 0x000138, "Wrong size on UMovieSceneGeometryCollectionSection");
static_assert(offsetof(UMovieSceneGeometryCollectionSection, Params) == 0x0000F8, "Member 'UMovieSceneGeometryCollectionSection::Params' has a wrong offset!");

// Class GeometryCollectionTracks.MovieSceneGeometryCollectionTrack
// 0x0018 (0x00B8 - 0x00A0)
class UMovieSceneGeometryCollectionTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x00A8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGeometryCollectionTrack">();
	}
	static class UMovieSceneGeometryCollectionTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGeometryCollectionTrack>();
	}
};
static_assert(alignof(UMovieSceneGeometryCollectionTrack) == 0x000008, "Wrong alignment on UMovieSceneGeometryCollectionTrack");
static_assert(sizeof(UMovieSceneGeometryCollectionTrack) == 0x0000B8, "Wrong size on UMovieSceneGeometryCollectionTrack");
static_assert(offsetof(UMovieSceneGeometryCollectionTrack, AnimationSections) == 0x0000A8, "Member 'UMovieSceneGeometryCollectionTrack::AnimationSections' has a wrong offset!");

}

