#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gnome2021

#include "Basic.hpp"

#include "DataTableUtilities_structs.hpp"
#include "SpecialEventUtilities_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Gnome2021.Gnome
// 0x00A0 (0x0470 - 0x03D0)
class AGnome final : public ARespawnableInteractable
{
public:
	class UGnomeInteraction*                      _gnomeInteraction;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGnomeInteraction*                      _gnomeInteractionKiller;                           // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _gnomeInteractionChargeable;                       // 0x03E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _gnomeInteractionChargeableKiller;                 // 0x03E8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _gnomeInteractor;                                  // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _gnomeInteractionZone;                             // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDSkeletalMeshComponentBudgeted*      _gnomeSkeletalMesh;                                // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _gnomeInteractionSecondsToCharge;                  // 0x0410(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _gnomeInteractionSecondsToChargeKiller;            // 0x0438(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _auraColorWhileInteracting;                        // 0x0460(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Cosmetic_OnInteractionCompleted(class ADBDPlayer* InteractingPlayer);
	void Cosmetic_OnStartedInteracting(class ADBDPlayer* InteractingPlayer, float InteractionDuration);
	void Cosmetic_OnStoppedInteracting();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Gnome">();
	}
	static class AGnome* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGnome>();
	}
};
static_assert(alignof(AGnome) == 0x000008, "Wrong alignment on AGnome");
static_assert(sizeof(AGnome) == 0x000470, "Wrong size on AGnome");
static_assert(offsetof(AGnome, _gnomeInteraction) == 0x0003D0, "Member 'AGnome::_gnomeInteraction' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionKiller) == 0x0003D8, "Member 'AGnome::_gnomeInteractionKiller' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionChargeable) == 0x0003E0, "Member 'AGnome::_gnomeInteractionChargeable' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionChargeableKiller) == 0x0003E8, "Member 'AGnome::_gnomeInteractionChargeableKiller' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractor) == 0x0003F0, "Member 'AGnome::_gnomeInteractor' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionZone) == 0x0003F8, "Member 'AGnome::_gnomeInteractionZone' has a wrong offset!");
static_assert(offsetof(AGnome, _outlineComponent) == 0x000400, "Member 'AGnome::_outlineComponent' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeSkeletalMesh) == 0x000408, "Member 'AGnome::_gnomeSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionSecondsToCharge) == 0x000410, "Member 'AGnome::_gnomeInteractionSecondsToCharge' has a wrong offset!");
static_assert(offsetof(AGnome, _gnomeInteractionSecondsToChargeKiller) == 0x000438, "Member 'AGnome::_gnomeInteractionSecondsToChargeKiller' has a wrong offset!");
static_assert(offsetof(AGnome, _auraColorWhileInteracting) == 0x000460, "Member 'AGnome::_auraColorWhileInteracting' has a wrong offset!");

// Class Gnome2021.GnomeEventComponent
// 0x0020 (0x00D8 - 0x00B8)
class UGnomeEventComponent final : public URespawningEventComponent
{
public:
	class UInteractionRespawnableTrigger*         _interactionRespawnableTrigger;                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTimedRespawnableTrigger*               _timedRespawnableTrigger;                          // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnEndGameStarted(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GnomeEventComponent">();
	}
	static class UGnomeEventComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGnomeEventComponent>();
	}
};
static_assert(alignof(UGnomeEventComponent) == 0x000008, "Wrong alignment on UGnomeEventComponent");
static_assert(sizeof(UGnomeEventComponent) == 0x0000D8, "Wrong size on UGnomeEventComponent");
static_assert(offsetof(UGnomeEventComponent, _interactionRespawnableTrigger) == 0x0000B8, "Member 'UGnomeEventComponent::_interactionRespawnableTrigger' has a wrong offset!");
static_assert(offsetof(UGnomeEventComponent, _timedRespawnableTrigger) == 0x0000C0, "Member 'UGnomeEventComponent::_timedRespawnableTrigger' has a wrong offset!");

// Class Gnome2021.GnomeInteraction
// 0x0000 (0x08C0 - 0x08C0)
class UGnomeInteraction final : public UChargeableInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GnomeInteraction">();
	}
	static class UGnomeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGnomeInteraction>();
	}
};
static_assert(alignof(UGnomeInteraction) == 0x000010, "Wrong alignment on UGnomeInteraction");
static_assert(sizeof(UGnomeInteraction) == 0x0008C0, "Wrong size on UGnomeInteraction");

// Class Gnome2021.GnomePlayerComponent
// 0x0020 (0x00C8 - 0x00A8)
class UGnomePlayerComponent final : public UActorComponent
{
public:
	bool                                          _hasInteractedWithGnomeThisGame;                   // 0x00A8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9[0x1F];                                      // 0x00A9(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GnomePlayerComponent">();
	}
	static class UGnomePlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGnomePlayerComponent>();
	}
};
static_assert(alignof(UGnomePlayerComponent) == 0x000008, "Wrong alignment on UGnomePlayerComponent");
static_assert(sizeof(UGnomePlayerComponent) == 0x0000C8, "Wrong size on UGnomePlayerComponent");
static_assert(offsetof(UGnomePlayerComponent, _hasInteractedWithGnomeThisGame) == 0x0000A8, "Member 'UGnomePlayerComponent::_hasInteractedWithGnomeThisGame' has a wrong offset!");

}

