#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gnome2021

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Gnome2021.Gnome.Cosmetic_OnInteractionCompleted
// 0x0008 (0x0008 - 0x0000)
struct Gnome_Cosmetic_OnInteractionCompleted final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Gnome_Cosmetic_OnInteractionCompleted) == 0x000008, "Wrong alignment on Gnome_Cosmetic_OnInteractionCompleted");
static_assert(sizeof(Gnome_Cosmetic_OnInteractionCompleted) == 0x000008, "Wrong size on Gnome_Cosmetic_OnInteractionCompleted");
static_assert(offsetof(Gnome_Cosmetic_OnInteractionCompleted, InteractingPlayer) == 0x000000, "Member 'Gnome_Cosmetic_OnInteractionCompleted::InteractingPlayer' has a wrong offset!");

// Function Gnome2021.Gnome.Cosmetic_OnStartedInteracting
// 0x0010 (0x0010 - 0x0000)
struct Gnome_Cosmetic_OnStartedInteracting final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractionDuration;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Gnome_Cosmetic_OnStartedInteracting) == 0x000008, "Wrong alignment on Gnome_Cosmetic_OnStartedInteracting");
static_assert(sizeof(Gnome_Cosmetic_OnStartedInteracting) == 0x000010, "Wrong size on Gnome_Cosmetic_OnStartedInteracting");
static_assert(offsetof(Gnome_Cosmetic_OnStartedInteracting, InteractingPlayer) == 0x000000, "Member 'Gnome_Cosmetic_OnStartedInteracting::InteractingPlayer' has a wrong offset!");
static_assert(offsetof(Gnome_Cosmetic_OnStartedInteracting, InteractionDuration) == 0x000008, "Member 'Gnome_Cosmetic_OnStartedInteracting::InteractionDuration' has a wrong offset!");

// Function Gnome2021.GnomeEventComponent.Authority_OnEndGameStarted
// 0x0040 (0x0040 - 0x0000)
struct GnomeEventComponent_Authority_OnEndGameStarted final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GnomeEventComponent_Authority_OnEndGameStarted) == 0x000008, "Wrong alignment on GnomeEventComponent_Authority_OnEndGameStarted");
static_assert(sizeof(GnomeEventComponent_Authority_OnEndGameStarted) == 0x000040, "Wrong size on GnomeEventComponent_Authority_OnEndGameStarted");
static_assert(offsetof(GnomeEventComponent_Authority_OnEndGameStarted, GameEventType) == 0x000000, "Member 'GnomeEventComponent_Authority_OnEndGameStarted::GameEventType' has a wrong offset!");
static_assert(offsetof(GnomeEventComponent_Authority_OnEndGameStarted, GameEventData) == 0x000010, "Member 'GnomeEventComponent_Authority_OnEndGameStarted::GameEventData' has a wrong offset!");

}

