#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealOtherMedkit

#include "Basic.hpp"


namespace SDK::Params
{

// Function HealOtherMedkit.HealOtherMedkit_C.Authority_OnPlayerHealed
// 0x0010 (0x0010 - 0x0000)
struct HealOtherMedkit_C_Authority_OnPlayerHealed final
{
public:
	class ADBDPlayer*                             HealingPlayer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             HealedPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealOtherMedkit_C_Authority_OnPlayerHealed) == 0x000008, "Wrong alignment on HealOtherMedkit_C_Authority_OnPlayerHealed");
static_assert(sizeof(HealOtherMedkit_C_Authority_OnPlayerHealed) == 0x000010, "Wrong size on HealOtherMedkit_C_Authority_OnPlayerHealed");
static_assert(offsetof(HealOtherMedkit_C_Authority_OnPlayerHealed, HealingPlayer) == 0x000000, "Member 'HealOtherMedkit_C_Authority_OnPlayerHealed::HealingPlayer' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_Authority_OnPlayerHealed, HealedPlayer) == 0x000008, "Member 'HealOtherMedkit_C_Authority_OnPlayerHealed::HealedPlayer' has a wrong offset!");

// Function HealOtherMedkit.HealOtherMedkit_C.ExecuteUbergraph_HealOtherMedkit
// 0x0048 (0x0048 - 0x0000)
struct HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_healingPlayer;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_healedPlayer;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AInteractable*                          CallFunc_GetInteractable_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAllowsHealing_C>      K2Node_DynamicCast_AsAllows_Healing;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMedkit*                                CallFunc_GetMedkit_Medkit;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit) == 0x000008, "Wrong alignment on HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit");
static_assert(sizeof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit) == 0x000048, "Wrong size on HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, EntryPoint) == 0x000000, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::EntryPoint' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, K2Node_Event_healingPlayer) == 0x000008, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::K2Node_Event_healingPlayer' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, K2Node_Event_healedPlayer) == 0x000010, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::K2Node_Event_healedPlayer' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, CallFunc_GetInteractable_ReturnValue) == 0x000018, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::CallFunc_GetInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, K2Node_DynamicCast_AsAllows_Healing) == 0x000020, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::K2Node_DynamicCast_AsAllows_Healing' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, CallFunc_GetMedkit_Medkit) == 0x000038, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::CallFunc_GetMedkit_Medkit' has a wrong offset!");
static_assert(offsetof(HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'HealOtherMedkit_C_ExecuteUbergraph_HealOtherMedkit::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

