#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealSelfWithMedkit

#include "Basic.hpp"


namespace SDK::Params
{

// Function HealSelfWithMedkit.HealSelfWithMedkit_C.Authority_OnPlayerHealed
// 0x0010 (0x0010 - 0x0000)
struct HealSelfWithMedkit_C_Authority_OnPlayerHealed final
{
public:
	class ADBDPlayer*                             HealingPlayer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             HealedPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealSelfWithMedkit_C_Authority_OnPlayerHealed) == 0x000008, "Wrong alignment on HealSelfWithMedkit_C_Authority_OnPlayerHealed");
static_assert(sizeof(HealSelfWithMedkit_C_Authority_OnPlayerHealed) == 0x000010, "Wrong size on HealSelfWithMedkit_C_Authority_OnPlayerHealed");
static_assert(offsetof(HealSelfWithMedkit_C_Authority_OnPlayerHealed, HealingPlayer) == 0x000000, "Member 'HealSelfWithMedkit_C_Authority_OnPlayerHealed::HealingPlayer' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_Authority_OnPlayerHealed, HealedPlayer) == 0x000008, "Member 'HealSelfWithMedkit_C_Authority_OnPlayerHealed::HealedPlayer' has a wrong offset!");

// Function HealSelfWithMedkit.HealSelfWithMedkit_C.ExecuteUbergraph_HealSelfWithMedkit
// 0x0048 (0x0048 - 0x0000)
struct HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_healingPlayer;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_healedPlayer;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AInteractable*                          CallFunc_GetInteractable_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAllowsHealing_C>      K2Node_DynamicCast_AsAllows_Healing;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMedkit*                                CallFunc_GetMedkit_Medkit;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit) == 0x000008, "Wrong alignment on HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit");
static_assert(sizeof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit) == 0x000048, "Wrong size on HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, EntryPoint) == 0x000000, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::EntryPoint' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, K2Node_Event_healingPlayer) == 0x000008, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::K2Node_Event_healingPlayer' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, K2Node_Event_healedPlayer) == 0x000010, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::K2Node_Event_healedPlayer' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, CallFunc_GetInteractable_ReturnValue) == 0x000018, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::CallFunc_GetInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, K2Node_DynamicCast_AsAllows_Healing) == 0x000020, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::K2Node_DynamicCast_AsAllows_Healing' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, CallFunc_GetMedkit_Medkit) == 0x000038, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::CallFunc_GetMedkit_Medkit' has a wrong offset!");
static_assert(offsetof(HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'HealSelfWithMedkit_C_ExecuteUbergraph_HealSelfWithMedkit::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

