#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IInfectableInteractableInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function IInfectableInteractableInterface.IInfectableInteractableInterface_C.GetInfectedParticles
// 0x0010 (0x0010 - 0x0000)
struct IInfectableInteractableInterface_C_GetInfectedParticles final
{
public:
	TArray<class UParticleSystemComponent*>       InfectedParticleArray;                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(IInfectableInteractableInterface_C_GetInfectedParticles) == 0x000008, "Wrong alignment on IInfectableInteractableInterface_C_GetInfectedParticles");
static_assert(sizeof(IInfectableInteractableInterface_C_GetInfectedParticles) == 0x000010, "Wrong size on IInfectableInteractableInterface_C_GetInfectedParticles");
static_assert(offsetof(IInfectableInteractableInterface_C_GetInfectedParticles, InfectedParticleArray) == 0x000000, "Member 'IInfectableInteractableInterface_C_GetInfectedParticles::InfectedParticleArray' has a wrong offset!");

// Function IInfectableInteractableInterface.IInfectableInteractableInterface_C.GetInfectedDecals
// 0x0010 (0x0010 - 0x0000)
struct IInfectableInteractableInterface_C_GetInfectedDecals final
{
public:
	TArray<class UDecalComponent*>                InfectedDecals;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(IInfectableInteractableInterface_C_GetInfectedDecals) == 0x000008, "Wrong alignment on IInfectableInteractableInterface_C_GetInfectedDecals");
static_assert(sizeof(IInfectableInteractableInterface_C_GetInfectedDecals) == 0x000010, "Wrong size on IInfectableInteractableInterface_C_GetInfectedDecals");
static_assert(offsetof(IInfectableInteractableInterface_C_GetInfectedDecals, InfectedDecals) == 0x000000, "Member 'IInfectableInteractableInterface_C_GetInfectedDecals::InfectedDecals' has a wrong offset!");

}

