#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangePipelines

#include "Basic.hpp"

#include "InterchangePipelines_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InterchangeCore_structs.hpp"
#include "InterchangeCore_classes.hpp"
#include "InterchangeFactoryNodes_structs.hpp"


namespace SDK
{

// Class InterchangePipelines.InterchangeGenericCommonMeshesProperties
// 0x0010 (0x0100 - 0x00F0)
class UInterchangeGenericCommonMeshesProperties final : public UInterchangePipelineBase
{
public:
	EInterchangeForceMeshType                     ForceAllMeshAsType;                                // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportLods;                                       // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBakeMeshes;                                       // 0x00F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeVertexColorImportOption           VertexColorImportOption;                           // 0x00F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 VertexOverrideColor;                               // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecomputeNormals;                                 // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecomputeTangents;                                // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMikkTSpace;                                    // 0x00FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bComputeWeightedNormals;                           // 0x00FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionTangentBasis;                     // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFullPrecisionUVs;                              // 0x00FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBackwardsCompatibleF16TruncUVs;                // 0x00FE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveDegenerates;                                // 0x00FF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericCommonMeshesProperties">();
	}
	static class UInterchangeGenericCommonMeshesProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericCommonMeshesProperties>();
	}
};
static_assert(alignof(UInterchangeGenericCommonMeshesProperties) == 0x000008, "Wrong alignment on UInterchangeGenericCommonMeshesProperties");
static_assert(sizeof(UInterchangeGenericCommonMeshesProperties) == 0x000100, "Wrong size on UInterchangeGenericCommonMeshesProperties");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, ForceAllMeshAsType) == 0x0000F0, "Member 'UInterchangeGenericCommonMeshesProperties::ForceAllMeshAsType' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bImportLods) == 0x0000F1, "Member 'UInterchangeGenericCommonMeshesProperties::bImportLods' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bBakeMeshes) == 0x0000F2, "Member 'UInterchangeGenericCommonMeshesProperties::bBakeMeshes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, VertexColorImportOption) == 0x0000F3, "Member 'UInterchangeGenericCommonMeshesProperties::VertexColorImportOption' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, VertexOverrideColor) == 0x0000F4, "Member 'UInterchangeGenericCommonMeshesProperties::VertexOverrideColor' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bRecomputeNormals) == 0x0000F8, "Member 'UInterchangeGenericCommonMeshesProperties::bRecomputeNormals' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bRecomputeTangents) == 0x0000F9, "Member 'UInterchangeGenericCommonMeshesProperties::bRecomputeTangents' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bUseMikkTSpace) == 0x0000FA, "Member 'UInterchangeGenericCommonMeshesProperties::bUseMikkTSpace' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bComputeWeightedNormals) == 0x0000FB, "Member 'UInterchangeGenericCommonMeshesProperties::bComputeWeightedNormals' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bUseHighPrecisionTangentBasis) == 0x0000FC, "Member 'UInterchangeGenericCommonMeshesProperties::bUseHighPrecisionTangentBasis' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bUseFullPrecisionUVs) == 0x0000FD, "Member 'UInterchangeGenericCommonMeshesProperties::bUseFullPrecisionUVs' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bUseBackwardsCompatibleF16TruncUVs) == 0x0000FE, "Member 'UInterchangeGenericCommonMeshesProperties::bUseBackwardsCompatibleF16TruncUVs' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonMeshesProperties, bRemoveDegenerates) == 0x0000FF, "Member 'UInterchangeGenericCommonMeshesProperties::bRemoveDegenerates' has a wrong offset!");

// Class InterchangePipelines.InterchangeGenericCommonSkeletalMeshesAndAnimationsProperties
// 0x0010 (0x0100 - 0x00F0)
class UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties final : public UInterchangePipelineBase
{
public:
	bool                                          bImportOnlyAnimations;                             // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USkeleton>               Skeleton;                                          // 0x00F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportMeshesInBoneHierarchy;                      // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseT0AsRefPose;                                   // 0x00FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericCommonSkeletalMeshesAndAnimationsProperties">();
	}
	static class UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties>();
	}
};
static_assert(alignof(UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties) == 0x000008, "Wrong alignment on UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties");
static_assert(sizeof(UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties) == 0x000100, "Wrong size on UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties");
static_assert(offsetof(UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties, bImportOnlyAnimations) == 0x0000F0, "Member 'UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties::bImportOnlyAnimations' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties, Skeleton) == 0x0000F4, "Member 'UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties::Skeleton' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties, bImportMeshesInBoneHierarchy) == 0x0000FC, "Member 'UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties::bImportMeshesInBoneHierarchy' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties, bUseT0AsRefPose) == 0x0000FD, "Member 'UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties::bUseT0AsRefPose' has a wrong offset!");

// Class InterchangePipelines.InterchangeGenericAnimationPipeline
// 0x0060 (0x0150 - 0x00F0)
class UInterchangeGenericAnimationPipeline final : public UInterchangePipelineBase
{
public:
	TWeakObjectPtr<class UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties> CommonSkeletalMeshesAndAnimationsProperties;       // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportAnimations;                                 // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportBoneTracks;                                 // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationRange                    AnimationRange;                                    // 0x00FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInt32Interval                         FrameImportRange;                                  // 0x00FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUse30HzToBakeBoneAnimation;                       // 0x0104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustomBoneAnimationSampleRate;                     // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToClosestFrameBoundary;                       // 0x010C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportCustomAttribute;                            // 0x010D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetMaterialDriveParameterOnCustomAttribute;       // 0x010E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MaterialCurveSuffixes;                             // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRemoveCurveRedundantKeys;                         // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoNotImportCurveWithZero;                         // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteExistingNonCurveCustomAttributes;           // 0x0122(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteExistingCustomAttributeCurves;              // 0x0123(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteExistingMorphTargetCurves;                  // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SourceAnimationName;                               // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x18];                                     // 0x0138(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericAnimationPipeline">();
	}
	static class UInterchangeGenericAnimationPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericAnimationPipeline>();
	}
};
static_assert(alignof(UInterchangeGenericAnimationPipeline) == 0x000008, "Wrong alignment on UInterchangeGenericAnimationPipeline");
static_assert(sizeof(UInterchangeGenericAnimationPipeline) == 0x000150, "Wrong size on UInterchangeGenericAnimationPipeline");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, CommonSkeletalMeshesAndAnimationsProperties) == 0x0000F0, "Member 'UInterchangeGenericAnimationPipeline::CommonSkeletalMeshesAndAnimationsProperties' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bImportAnimations) == 0x0000F8, "Member 'UInterchangeGenericAnimationPipeline::bImportAnimations' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bImportBoneTracks) == 0x0000F9, "Member 'UInterchangeGenericAnimationPipeline::bImportBoneTracks' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, AnimationRange) == 0x0000FA, "Member 'UInterchangeGenericAnimationPipeline::AnimationRange' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, FrameImportRange) == 0x0000FC, "Member 'UInterchangeGenericAnimationPipeline::FrameImportRange' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bUse30HzToBakeBoneAnimation) == 0x000104, "Member 'UInterchangeGenericAnimationPipeline::bUse30HzToBakeBoneAnimation' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, CustomBoneAnimationSampleRate) == 0x000108, "Member 'UInterchangeGenericAnimationPipeline::CustomBoneAnimationSampleRate' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bSnapToClosestFrameBoundary) == 0x00010C, "Member 'UInterchangeGenericAnimationPipeline::bSnapToClosestFrameBoundary' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bImportCustomAttribute) == 0x00010D, "Member 'UInterchangeGenericAnimationPipeline::bImportCustomAttribute' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bSetMaterialDriveParameterOnCustomAttribute) == 0x00010E, "Member 'UInterchangeGenericAnimationPipeline::bSetMaterialDriveParameterOnCustomAttribute' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, MaterialCurveSuffixes) == 0x000110, "Member 'UInterchangeGenericAnimationPipeline::MaterialCurveSuffixes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bRemoveCurveRedundantKeys) == 0x000120, "Member 'UInterchangeGenericAnimationPipeline::bRemoveCurveRedundantKeys' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bDoNotImportCurveWithZero) == 0x000121, "Member 'UInterchangeGenericAnimationPipeline::bDoNotImportCurveWithZero' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bDeleteExistingNonCurveCustomAttributes) == 0x000122, "Member 'UInterchangeGenericAnimationPipeline::bDeleteExistingNonCurveCustomAttributes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bDeleteExistingCustomAttributeCurves) == 0x000123, "Member 'UInterchangeGenericAnimationPipeline::bDeleteExistingCustomAttributeCurves' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, bDeleteExistingMorphTargetCurves) == 0x000124, "Member 'UInterchangeGenericAnimationPipeline::bDeleteExistingMorphTargetCurves' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAnimationPipeline, SourceAnimationName) == 0x000128, "Member 'UInterchangeGenericAnimationPipeline::SourceAnimationName' has a wrong offset!");

// Class InterchangePipelines.InterchangeGenericAssetsPipeline
// 0x0090 (0x0180 - 0x00F0)
class UInterchangeGenericAssetsPipeline final : public UInterchangePipelineBase
{
public:
	EReimportStrategyFlags                        ReimportStrategy;                                  // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSourceNameForAsset;                            // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetName;                                         // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImportOffsetTranslation;                           // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ImportOffsetRotation;                              // 0x0120(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ImportOffsetUniformScale;                          // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInterchangeGenericCommonMeshesProperties* CommonMeshesProperties;                            // 0x0140(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties* CommonSkeletalMeshesAndAnimationsProperties;       // 0x0148(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeGenericMeshPipeline*        MeshPipeline;                                      // 0x0150(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeGenericAnimationPipeline*   AnimationPipeline;                                 // 0x0158(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeGenericMaterialPipeline*    MaterialPipeline;                                  // 0x0160(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x18];                                     // 0x0168(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericAssetsPipeline">();
	}
	static class UInterchangeGenericAssetsPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericAssetsPipeline>();
	}
};
static_assert(alignof(UInterchangeGenericAssetsPipeline) == 0x000008, "Wrong alignment on UInterchangeGenericAssetsPipeline");
static_assert(sizeof(UInterchangeGenericAssetsPipeline) == 0x000180, "Wrong size on UInterchangeGenericAssetsPipeline");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, ReimportStrategy) == 0x0000F0, "Member 'UInterchangeGenericAssetsPipeline::ReimportStrategy' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, bUseSourceNameForAsset) == 0x0000F1, "Member 'UInterchangeGenericAssetsPipeline::bUseSourceNameForAsset' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, AssetName) == 0x0000F8, "Member 'UInterchangeGenericAssetsPipeline::AssetName' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, ImportOffsetTranslation) == 0x000108, "Member 'UInterchangeGenericAssetsPipeline::ImportOffsetTranslation' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, ImportOffsetRotation) == 0x000120, "Member 'UInterchangeGenericAssetsPipeline::ImportOffsetRotation' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, ImportOffsetUniformScale) == 0x000138, "Member 'UInterchangeGenericAssetsPipeline::ImportOffsetUniformScale' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, CommonMeshesProperties) == 0x000140, "Member 'UInterchangeGenericAssetsPipeline::CommonMeshesProperties' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, CommonSkeletalMeshesAndAnimationsProperties) == 0x000148, "Member 'UInterchangeGenericAssetsPipeline::CommonSkeletalMeshesAndAnimationsProperties' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, MeshPipeline) == 0x000150, "Member 'UInterchangeGenericAssetsPipeline::MeshPipeline' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, AnimationPipeline) == 0x000158, "Member 'UInterchangeGenericAssetsPipeline::AnimationPipeline' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericAssetsPipeline, MaterialPipeline) == 0x000160, "Member 'UInterchangeGenericAssetsPipeline::MaterialPipeline' has a wrong offset!");

// Class InterchangePipelines.InterchangeGenericMaterialPipeline
// 0x00D8 (0x01C8 - 0x00F0)
class UInterchangeGenericMaterialPipeline final : public UInterchangePipelineBase
{
public:
	bool                                          bImportMaterials;                                  // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeMaterialImportOption              MaterialImport;                                    // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        ParentMaterial;                                    // 0x00F8(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeGenericTexturePipeline*     TexturePipeline;                                   // 0x0120(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMaterialXPipelineSettings             MaterialXSettings;                                 // 0x0128(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0178(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x48];                                     // 0x0180(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericMaterialPipeline">();
	}
	static class UInterchangeGenericMaterialPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericMaterialPipeline>();
	}
};
static_assert(alignof(UInterchangeGenericMaterialPipeline) == 0x000008, "Wrong alignment on UInterchangeGenericMaterialPipeline");
static_assert(sizeof(UInterchangeGenericMaterialPipeline) == 0x0001C8, "Wrong size on UInterchangeGenericMaterialPipeline");
static_assert(offsetof(UInterchangeGenericMaterialPipeline, bImportMaterials) == 0x0000F0, "Member 'UInterchangeGenericMaterialPipeline::bImportMaterials' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMaterialPipeline, MaterialImport) == 0x0000F1, "Member 'UInterchangeGenericMaterialPipeline::MaterialImport' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMaterialPipeline, ParentMaterial) == 0x0000F8, "Member 'UInterchangeGenericMaterialPipeline::ParentMaterial' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMaterialPipeline, TexturePipeline) == 0x000120, "Member 'UInterchangeGenericMaterialPipeline::TexturePipeline' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMaterialPipeline, MaterialXSettings) == 0x000128, "Member 'UInterchangeGenericMaterialPipeline::MaterialXSettings' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMaterialPipeline, BaseNodeContainer) == 0x000178, "Member 'UInterchangeGenericMaterialPipeline::BaseNodeContainer' has a wrong offset!");

// Class InterchangePipelines.InterchangeGenericMeshPipeline
// 0x00C8 (0x01B8 - 0x00F0)
class UInterchangeGenericMeshPipeline final : public UInterchangePipelineBase
{
public:
	TWeakObjectPtr<class UInterchangeGenericCommonMeshesProperties> CommonMeshesProperties;                            // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UInterchangeGenericCommonSkeletalMeshesAndAnimationsProperties> CommonSkeletalMeshesAndAnimationsProperties;       // 0x00F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportStaticMeshes;                               // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCombineStaticMeshes;                              // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportCollisionAccordingToMeshName;               // 0x0102(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOneConvexHullPerUCX;                              // 0x0103(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildNanite;                                      // 0x0104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildReversedIndexBuffer;                         // 0x0105(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateLightmapUVs;                              // 0x0106(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateDistanceFieldAsIfTwoSided;                // 0x0107(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportFaceRemap;                                 // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinLightmapResolution;                             // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SrcLightmapIndex;                                  // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DstLightmapIndex;                                  // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BuildScale3D;                                      // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceFieldResolutionScale;                      // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UStaticMesh>             DistanceFieldReplacementMesh;                      // 0x0134(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLumenMeshCards;                                 // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportSkeletalMeshes;                             // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeSkeletalMeshContentType           SkeletalMeshImportContentType;                     // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeSkeletalMeshContentType           LastSkeletalMeshImportContentType;                 // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCombineSkeletalMeshes;                            // 0x0143(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportMorphTargets;                               // 0x0144(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateSkeletonReferencePose;                      // 0x0145(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreatePhysicsAsset;                               // 0x0146(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UPhysicsAsset>           PhysicsAsset;                                      // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionSkinWeights;                      // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThresholdPosition;                                 // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThresholdTangentNormal;                            // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThresholdUV;                                       // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MorphThresholdPosition;                            // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneInfluenceLimit;                                // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x50];                                     // 0x0168(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericMeshPipeline">();
	}
	static class UInterchangeGenericMeshPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericMeshPipeline>();
	}
};
static_assert(alignof(UInterchangeGenericMeshPipeline) == 0x000008, "Wrong alignment on UInterchangeGenericMeshPipeline");
static_assert(sizeof(UInterchangeGenericMeshPipeline) == 0x0001B8, "Wrong size on UInterchangeGenericMeshPipeline");
static_assert(offsetof(UInterchangeGenericMeshPipeline, CommonMeshesProperties) == 0x0000F0, "Member 'UInterchangeGenericMeshPipeline::CommonMeshesProperties' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, CommonSkeletalMeshesAndAnimationsProperties) == 0x0000F8, "Member 'UInterchangeGenericMeshPipeline::CommonSkeletalMeshesAndAnimationsProperties' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bImportStaticMeshes) == 0x000100, "Member 'UInterchangeGenericMeshPipeline::bImportStaticMeshes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bCombineStaticMeshes) == 0x000101, "Member 'UInterchangeGenericMeshPipeline::bCombineStaticMeshes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bImportCollisionAccordingToMeshName) == 0x000102, "Member 'UInterchangeGenericMeshPipeline::bImportCollisionAccordingToMeshName' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bOneConvexHullPerUCX) == 0x000103, "Member 'UInterchangeGenericMeshPipeline::bOneConvexHullPerUCX' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bBuildNanite) == 0x000104, "Member 'UInterchangeGenericMeshPipeline::bBuildNanite' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bBuildReversedIndexBuffer) == 0x000105, "Member 'UInterchangeGenericMeshPipeline::bBuildReversedIndexBuffer' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bGenerateLightmapUVs) == 0x000106, "Member 'UInterchangeGenericMeshPipeline::bGenerateLightmapUVs' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bGenerateDistanceFieldAsIfTwoSided) == 0x000107, "Member 'UInterchangeGenericMeshPipeline::bGenerateDistanceFieldAsIfTwoSided' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bSupportFaceRemap) == 0x000108, "Member 'UInterchangeGenericMeshPipeline::bSupportFaceRemap' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, MinLightmapResolution) == 0x00010C, "Member 'UInterchangeGenericMeshPipeline::MinLightmapResolution' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, SrcLightmapIndex) == 0x000110, "Member 'UInterchangeGenericMeshPipeline::SrcLightmapIndex' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, DstLightmapIndex) == 0x000114, "Member 'UInterchangeGenericMeshPipeline::DstLightmapIndex' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, BuildScale3D) == 0x000118, "Member 'UInterchangeGenericMeshPipeline::BuildScale3D' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, DistanceFieldResolutionScale) == 0x000130, "Member 'UInterchangeGenericMeshPipeline::DistanceFieldResolutionScale' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, DistanceFieldReplacementMesh) == 0x000134, "Member 'UInterchangeGenericMeshPipeline::DistanceFieldReplacementMesh' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, MaxLumenMeshCards) == 0x00013C, "Member 'UInterchangeGenericMeshPipeline::MaxLumenMeshCards' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bImportSkeletalMeshes) == 0x000140, "Member 'UInterchangeGenericMeshPipeline::bImportSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, SkeletalMeshImportContentType) == 0x000141, "Member 'UInterchangeGenericMeshPipeline::SkeletalMeshImportContentType' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, LastSkeletalMeshImportContentType) == 0x000142, "Member 'UInterchangeGenericMeshPipeline::LastSkeletalMeshImportContentType' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bCombineSkeletalMeshes) == 0x000143, "Member 'UInterchangeGenericMeshPipeline::bCombineSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bImportMorphTargets) == 0x000144, "Member 'UInterchangeGenericMeshPipeline::bImportMorphTargets' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bUpdateSkeletonReferencePose) == 0x000145, "Member 'UInterchangeGenericMeshPipeline::bUpdateSkeletonReferencePose' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bCreatePhysicsAsset) == 0x000146, "Member 'UInterchangeGenericMeshPipeline::bCreatePhysicsAsset' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, PhysicsAsset) == 0x000148, "Member 'UInterchangeGenericMeshPipeline::PhysicsAsset' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, bUseHighPrecisionSkinWeights) == 0x000150, "Member 'UInterchangeGenericMeshPipeline::bUseHighPrecisionSkinWeights' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, ThresholdPosition) == 0x000154, "Member 'UInterchangeGenericMeshPipeline::ThresholdPosition' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, ThresholdTangentNormal) == 0x000158, "Member 'UInterchangeGenericMeshPipeline::ThresholdTangentNormal' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, ThresholdUV) == 0x00015C, "Member 'UInterchangeGenericMeshPipeline::ThresholdUV' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, MorphThresholdPosition) == 0x000160, "Member 'UInterchangeGenericMeshPipeline::MorphThresholdPosition' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericMeshPipeline, BoneInfluenceLimit) == 0x000164, "Member 'UInterchangeGenericMeshPipeline::BoneInfluenceLimit' has a wrong offset!");

// Class InterchangePipelines.InterchangeGenericLevelPipeline
// 0x0008 (0x00F8 - 0x00F0)
class UInterchangeGenericLevelPipeline final : public UInterchangePipelineBase
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericLevelPipeline">();
	}
	static class UInterchangeGenericLevelPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericLevelPipeline>();
	}
};
static_assert(alignof(UInterchangeGenericLevelPipeline) == 0x000008, "Wrong alignment on UInterchangeGenericLevelPipeline");
static_assert(sizeof(UInterchangeGenericLevelPipeline) == 0x0000F8, "Wrong size on UInterchangeGenericLevelPipeline");

// Class InterchangePipelines.InterchangeGenericTexturePipeline
// 0x0040 (0x0130 - 0x00F0)
class UInterchangeGenericTexturePipeline final : public UInterchangePipelineBase
{
public:
	bool                                          bImportTextures;                                   // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowNonPowerOfTwo;                               // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x30];                                     // 0x0100(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGenericTexturePipeline">();
	}
	static class UInterchangeGenericTexturePipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGenericTexturePipeline>();
	}
};
static_assert(alignof(UInterchangeGenericTexturePipeline) == 0x000008, "Wrong alignment on UInterchangeGenericTexturePipeline");
static_assert(sizeof(UInterchangeGenericTexturePipeline) == 0x000130, "Wrong size on UInterchangeGenericTexturePipeline");
static_assert(offsetof(UInterchangeGenericTexturePipeline, bImportTextures) == 0x0000F0, "Member 'UInterchangeGenericTexturePipeline::bImportTextures' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericTexturePipeline, bAllowNonPowerOfTwo) == 0x0000F1, "Member 'UInterchangeGenericTexturePipeline::bAllowNonPowerOfTwo' has a wrong offset!");
static_assert(offsetof(UInterchangeGenericTexturePipeline, BaseNodeContainer) == 0x0000F8, "Member 'UInterchangeGenericTexturePipeline::BaseNodeContainer' has a wrong offset!");

// Class InterchangePipelines.InterchangePipelineMeshesUtilities
// 0x00F0 (0x0120 - 0x0030)
class UInterchangePipelineMeshesUtilities final : public UObject
{
public:
	uint8                                         Pad_30[0xF0];                                      // 0x0030(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInterchangePipelineMeshesUtilities* CreateInterchangePipelineMeshesUtilities(class UInterchangeBaseNodeContainer* BaseNodeContainer);

	void GetAllMeshGeometry(TArray<class FString>* MeshGeometryUids) const;
	void GetAllMeshGeometryNotInstanced(TArray<class FString>* MeshGeometryUids) const;
	void GetAllMeshInstanceUids(TArray<class FString>* MeshInstanceUids) const;
	void GetAllMeshInstanceUidsUsingMeshGeometryUid(const class FString& MeshGeometryUid, TArray<class FString>* MeshInstanceUids) const;
	void GetAllSkinnedMeshGeometry(TArray<class FString>* MeshGeometryUids) const;
	void GetAllSkinnedMeshInstance(TArray<class FString>* MeshInstanceUids, const bool bConvertStaticMeshToSkeletalMesh) const;
	void GetAllStaticMeshGeometry(TArray<class FString>* MeshGeometryUids, const bool bConvertSkeletalMeshToStaticMesh) const;
