#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemEfficiencyProficiency

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemEfficiencyProficiency.ItemEfficiencyProficiency_C.GetValue
// 0x0020 (0x0020 - 0x0000)
struct ItemEfficiencyProficiency_C_GetValue final
{
public:
	const class UChargeableInteractionDefinition* ChargeableInteraction;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class ADBDPlayer*                       Player;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetItemEfficiencyModifier_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemEfficiencyProficiency_C_GetValue) == 0x000008, "Wrong alignment on ItemEfficiencyProficiency_C_GetValue");
static_assert(sizeof(ItemEfficiencyProficiency_C_GetValue) == 0x000020, "Wrong size on ItemEfficiencyProficiency_C_GetValue");
static_assert(offsetof(ItemEfficiencyProficiency_C_GetValue, ChargeableInteraction) == 0x000000, "Member 'ItemEfficiencyProficiency_C_GetValue::ChargeableInteraction' has a wrong offset!");
static_assert(offsetof(ItemEfficiencyProficiency_C_GetValue, Player) == 0x000008, "Member 'ItemEfficiencyProficiency_C_GetValue::Player' has a wrong offset!");
static_assert(offsetof(ItemEfficiencyProficiency_C_GetValue, ReturnValue) == 0x000010, "Member 'ItemEfficiencyProficiency_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemEfficiencyProficiency_C_GetValue, CallFunc_GetItemEfficiencyModifier_ReturnValue) == 0x000014, "Member 'ItemEfficiencyProficiency_C_GetValue::CallFunc_GetItemEfficiencyModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemEfficiencyProficiency_C_GetValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'ItemEfficiencyProficiency_C_GetValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

