#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelCrowMeshComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function LevelCrowMeshComponent.LevelCrowMeshComponent_C.ExecuteUbergraph_LevelCrowMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimSequenceLength_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimSequenceLength_ReturnValue_1;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimSequenceLength_ReturnValue_2;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent) == 0x000004, "Wrong alignment on LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent");
static_assert(sizeof(LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent) == 0x000010, "Wrong size on LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent");
static_assert(offsetof(LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent, EntryPoint) == 0x000000, "Member 'LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent, CallFunc_GetAnimSequenceLength_ReturnValue) == 0x000004, "Member 'LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent::CallFunc_GetAnimSequenceLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent, CallFunc_GetAnimSequenceLength_ReturnValue_1) == 0x000008, "Member 'LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent::CallFunc_GetAnimSequenceLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent, CallFunc_GetAnimSequenceLength_ReturnValue_2) == 0x00000C, "Member 'LevelCrowMeshComponent_C_ExecuteUbergraph_LevelCrowMeshComponent::CallFunc_GetAnimSequenceLength_ReturnValue_2' has a wrong offset!");

// Function LevelCrowMeshComponent.LevelCrowMeshComponent_C.GetRunawayMustTickDuration
// 0x0018 (0x0018 - 0x0000)
struct LevelCrowMeshComponent_C_GetRunawayMustTickDuration final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimSequenceLength_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelCrowMeshComponent_C_GetRunawayMustTickDuration) == 0x000008, "Wrong alignment on LevelCrowMeshComponent_C_GetRunawayMustTickDuration");
static_assert(sizeof(LevelCrowMeshComponent_C_GetRunawayMustTickDuration) == 0x000018, "Wrong size on LevelCrowMeshComponent_C_GetRunawayMustTickDuration");
static_assert(offsetof(LevelCrowMeshComponent_C_GetRunawayMustTickDuration, ReturnValue) == 0x000000, "Member 'LevelCrowMeshComponent_C_GetRunawayMustTickDuration::ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_GetRunawayMustTickDuration, CallFunc_GetAnimSequenceLength_ReturnValue) == 0x000008, "Member 'LevelCrowMeshComponent_C_GetRunawayMustTickDuration::CallFunc_GetAnimSequenceLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_GetRunawayMustTickDuration, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000010, "Member 'LevelCrowMeshComponent_C_GetRunawayMustTickDuration::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function LevelCrowMeshComponent.LevelCrowMeshComponent_C.GetReturnMustTickDuration
// 0x0018 (0x0018 - 0x0000)
struct LevelCrowMeshComponent_C_GetReturnMustTickDuration final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimSequenceLength_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelCrowMeshComponent_C_GetReturnMustTickDuration) == 0x000008, "Wrong alignment on LevelCrowMeshComponent_C_GetReturnMustTickDuration");
static_assert(sizeof(LevelCrowMeshComponent_C_GetReturnMustTickDuration) == 0x000018, "Wrong size on LevelCrowMeshComponent_C_GetReturnMustTickDuration");
static_assert(offsetof(LevelCrowMeshComponent_C_GetReturnMustTickDuration, ReturnValue) == 0x000000, "Member 'LevelCrowMeshComponent_C_GetReturnMustTickDuration::ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_GetReturnMustTickDuration, CallFunc_GetAnimSequenceLength_ReturnValue) == 0x000008, "Member 'LevelCrowMeshComponent_C_GetReturnMustTickDuration::CallFunc_GetAnimSequenceLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelCrowMeshComponent_C_GetReturnMustTickDuration, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000010, "Member 'LevelCrowMeshComponent_C_GetReturnMustTickDuration::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

}

