#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LockerSearchPlayerBlindImmunityStatusEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function LockerSearchPlayerBlindImmunityStatusEffect.LockerSearchPlayerBlindImmunityStatusEffect_C.ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect
// 0x0050 (0x0050 - 0x0000)
struct LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConditionReceiver>    CallFunc_And_conditionReceiver_CastInput;          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAndModifierCondition*                  CallFunc_And_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEventDrivenModifierCondition*          CallFunc_CreateAndReceiveConditionForBP_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEventDrivenModifierCondition*          CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect) == 0x000008, "Wrong alignment on LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect");
static_assert(sizeof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect) == 0x000050, "Wrong size on LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, EntryPoint) == 0x000000, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, CallFunc_And_conditionReceiver_CastInput) == 0x000008, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::CallFunc_And_conditionReceiver_CastInput' has a wrong offset!");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, CallFunc_And_ReturnValue) == 0x000018, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::CallFunc_And_ReturnValue' has a wrong offset!");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput) == 0x000020, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput' has a wrong offset!");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, CallFunc_CreateAndReceiveConditionForBP_ReturnValue) == 0x000030, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::CallFunc_CreateAndReceiveConditionForBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1) == 0x000038, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1' has a wrong offset!");
static_assert(offsetof(LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect, CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1) == 0x000048, "Member 'LockerSearchPlayerBlindImmunityStatusEffect_C_ExecuteUbergraph_LockerSearchPlayerBlindImmunityStatusEffect::CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1' has a wrong offset!");

}

