#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lunar2023

#include "Basic.hpp"

#include "DataTableUtilities_structs.hpp"
#include "Lunar2022_classes.hpp"
#include "SpecialEventUtilities_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class Lunar2023.Lunar2023EventComponent
// 0x0068 (0x0218 - 0x01B0)
class ULunar2023EventComponent final : public ULunar2022EventComponent
{
public:
	struct FDBDTunableRowHandle                   _paperLanternSwitchTimerMin;                       // 0x01B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _paperLanternSwitchTimerMax;                       // 0x01D8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UTimedInteractionRespawnableTrigger*    _timedInteractionRespawnableTrigger;               // 0x0200(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_208[0x10];                                     // 0x0208(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Lunar2023EventComponent">();
	}
	static class ULunar2023EventComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULunar2023EventComponent>();
	}
};
static_assert(alignof(ULunar2023EventComponent) == 0x000008, "Wrong alignment on ULunar2023EventComponent");
static_assert(sizeof(ULunar2023EventComponent) == 0x000218, "Wrong size on ULunar2023EventComponent");
static_assert(offsetof(ULunar2023EventComponent, _paperLanternSwitchTimerMin) == 0x0001B0, "Member 'ULunar2023EventComponent::_paperLanternSwitchTimerMin' has a wrong offset!");
static_assert(offsetof(ULunar2023EventComponent, _paperLanternSwitchTimerMax) == 0x0001D8, "Member 'ULunar2023EventComponent::_paperLanternSwitchTimerMax' has a wrong offset!");
static_assert(offsetof(ULunar2023EventComponent, _timedInteractionRespawnableTrigger) == 0x000200, "Member 'ULunar2023EventComponent::_timedInteractionRespawnableTrigger' has a wrong offset!");

// Class Lunar2023.PaperLantern
// 0x0128 (0x04F8 - 0x03D0)
class APaperLantern final : public ARespawnableInteractable
{
public:
	class UPaperLanternInteraction*               _paperLanternInteractionSurvivor;                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperLanternInteraction*               _paperLanternInteractionKiller;                    // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _paperLanternInteractionChargeableSurvivor;        // 0x03E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _paperLanternInteractionChargeableKiller;          // 0x03E8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _paperLanternInteractor;                           // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _paperLanternInteractionZone;                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _paperLanternStaticMesh;                           // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _paperLanternInteractionSecondsToChargeSurvivor;   // 0x0410(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _paperLanternInteractionSecondsToChargeKiller;     // 0x0438(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _paperLanternSpeedBoost;                           // 0x0460(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _paperLanternVaultSpeedBoost;                      // 0x0488(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _paperLanternBuffDuration;                         // 0x04B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _auraColorWhileInteracting;                        // 0x04D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _paperLanternSpeedEffect;                          // 0x04E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _paperLanternVaultSpeedEffect;                     // 0x04F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Cosmetic_OnInteractionCancelled(class ADBDPlayer* InteractingPlayer);
	void Cosmetic_OnInteractionCompleted(class ADBDPlayer* InteractingPlayer);
	void Cosmetic_OnStartedInteracting(class ADBDPlayer* InteractingPlayer, float InteractionDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperLantern">();
	}
	static class APaperLantern* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperLantern>();
	}
};
static_assert(alignof(APaperLantern) == 0x000008, "Wrong alignment on APaperLantern");
static_assert(sizeof(APaperLantern) == 0x0004F8, "Wrong size on APaperLantern");
static_assert(offsetof(APaperLantern, _paperLanternInteractionSurvivor) == 0x0003D0, "Member 'APaperLantern::_paperLanternInteractionSurvivor' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractionKiller) == 0x0003D8, "Member 'APaperLantern::_paperLanternInteractionKiller' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractionChargeableSurvivor) == 0x0003E0, "Member 'APaperLantern::_paperLanternInteractionChargeableSurvivor' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractionChargeableKiller) == 0x0003E8, "Member 'APaperLantern::_paperLanternInteractionChargeableKiller' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractor) == 0x0003F0, "Member 'APaperLantern::_paperLanternInteractor' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractionZone) == 0x0003F8, "Member 'APaperLantern::_paperLanternInteractionZone' has a wrong offset!");
static_assert(offsetof(APaperLantern, _outlineComponent) == 0x000400, "Member 'APaperLantern::_outlineComponent' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternStaticMesh) == 0x000408, "Member 'APaperLantern::_paperLanternStaticMesh' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractionSecondsToChargeSurvivor) == 0x000410, "Member 'APaperLantern::_paperLanternInteractionSecondsToChargeSurvivor' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternInteractionSecondsToChargeKiller) == 0x000438, "Member 'APaperLantern::_paperLanternInteractionSecondsToChargeKiller' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternSpeedBoost) == 0x000460, "Member 'APaperLantern::_paperLanternSpeedBoost' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternVaultSpeedBoost) == 0x000488, "Member 'APaperLantern::_paperLanternVaultSpeedBoost' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternBuffDuration) == 0x0004B0, "Member 'APaperLantern::_paperLanternBuffDuration' has a wrong offset!");
static_assert(offsetof(APaperLantern, _auraColorWhileInteracting) == 0x0004D8, "Member 'APaperLantern::_auraColorWhileInteracting' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternSpeedEffect) == 0x0004E8, "Member 'APaperLantern::_paperLanternSpeedEffect' has a wrong offset!");
static_assert(offsetof(APaperLantern, _paperLanternVaultSpeedEffect) == 0x0004F0, "Member 'APaperLantern::_paperLanternVaultSpeedEffect' has a wrong offset!");

// Class Lunar2023.PaperLanternInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UPaperLanternInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x10];                                     // 0x08C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperLanternInteraction">();
	}
	static class UPaperLanternInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperLanternInteraction>();
	}
};
static_assert(alignof(UPaperLanternInteraction) == 0x000010, "Wrong alignment on UPaperLanternInteraction");
static_assert(sizeof(UPaperLanternInteraction) == 0x0008D0, "Wrong size on UPaperLanternInteraction");

}

