#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lunar2023

#include "Basic.hpp"


namespace SDK::Params
{

// Function Lunar2023.PaperLantern.Cosmetic_OnInteractionCancelled
// 0x0008 (0x0008 - 0x0000)
struct PaperLantern_Cosmetic_OnInteractionCancelled final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperLantern_Cosmetic_OnInteractionCancelled) == 0x000008, "Wrong alignment on PaperLantern_Cosmetic_OnInteractionCancelled");
static_assert(sizeof(PaperLantern_Cosmetic_OnInteractionCancelled) == 0x000008, "Wrong size on PaperLantern_Cosmetic_OnInteractionCancelled");
static_assert(offsetof(PaperLantern_Cosmetic_OnInteractionCancelled, InteractingPlayer) == 0x000000, "Member 'PaperLantern_Cosmetic_OnInteractionCancelled::InteractingPlayer' has a wrong offset!");

// Function Lunar2023.PaperLantern.Cosmetic_OnInteractionCompleted
// 0x0008 (0x0008 - 0x0000)
struct PaperLantern_Cosmetic_OnInteractionCompleted final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperLantern_Cosmetic_OnInteractionCompleted) == 0x000008, "Wrong alignment on PaperLantern_Cosmetic_OnInteractionCompleted");
static_assert(sizeof(PaperLantern_Cosmetic_OnInteractionCompleted) == 0x000008, "Wrong size on PaperLantern_Cosmetic_OnInteractionCompleted");
static_assert(offsetof(PaperLantern_Cosmetic_OnInteractionCompleted, InteractingPlayer) == 0x000000, "Member 'PaperLantern_Cosmetic_OnInteractionCompleted::InteractingPlayer' has a wrong offset!");

// Function Lunar2023.PaperLantern.Cosmetic_OnStartedInteracting
// 0x0010 (0x0010 - 0x0000)
struct PaperLantern_Cosmetic_OnStartedInteracting final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractionDuration;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLantern_Cosmetic_OnStartedInteracting) == 0x000008, "Wrong alignment on PaperLantern_Cosmetic_OnStartedInteracting");
static_assert(sizeof(PaperLantern_Cosmetic_OnStartedInteracting) == 0x000010, "Wrong size on PaperLantern_Cosmetic_OnStartedInteracting");
static_assert(offsetof(PaperLantern_Cosmetic_OnStartedInteracting, InteractingPlayer) == 0x000000, "Member 'PaperLantern_Cosmetic_OnStartedInteracting::InteractingPlayer' has a wrong offset!");
static_assert(offsetof(PaperLantern_Cosmetic_OnStartedInteracting, InteractionDuration) == 0x000008, "Member 'PaperLantern_Cosmetic_OnStartedInteracting::InteractionDuration' has a wrong offset!");

}

