#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lunar2022

#include "Basic.hpp"


namespace SDK
{

// Enum Lunar2022.ERedEnvelopeState
// NumValues: 0x0004
enum class ERedEnvelopeState : uint32
{
	AuraVisibleToOwner                       = 0,
	AuraVisibleToNonOwners                   = 1,
	Disappeared                              = 2,
	ERedEnvelopeState_MAX                    = 3,
};

// ScriptStruct Lunar2022.RedEnvelopeData
// 0x0018 (0x0018 - 0x0000)
struct FRedEnvelopeData final
{
public:
	ERedEnvelopeState                             RedEnvelopeState;                                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             LastInteractingPlayer;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsJackpot;                                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRedEnvelopeData) == 0x000008, "Wrong alignment on FRedEnvelopeData");
static_assert(sizeof(FRedEnvelopeData) == 0x000018, "Wrong size on FRedEnvelopeData");
static_assert(offsetof(FRedEnvelopeData, RedEnvelopeState) == 0x000000, "Member 'FRedEnvelopeData::RedEnvelopeState' has a wrong offset!");
static_assert(offsetof(FRedEnvelopeData, LastInteractingPlayer) == 0x000008, "Member 'FRedEnvelopeData::LastInteractingPlayer' has a wrong offset!");
static_assert(offsetof(FRedEnvelopeData, IsJackpot) == 0x000010, "Member 'FRedEnvelopeData::IsJackpot' has a wrong offset!");

}

