#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MangledEffect

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function MangledEffect.MangledEffect_C.OnHealed
// 0x0018 (0x0018 - 0x0000)
struct MangledEffect_C_OnHealed final
{
public:
	struct FCamperHealResult                      HealResult;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MangledEffect_C_OnHealed) == 0x000008, "Wrong alignment on MangledEffect_C_OnHealed");
static_assert(sizeof(MangledEffect_C_OnHealed) == 0x000018, "Wrong size on MangledEffect_C_OnHealed");
static_assert(offsetof(MangledEffect_C_OnHealed, HealResult) == 0x000000, "Member 'MangledEffect_C_OnHealed::HealResult' has a wrong offset!");

// Function MangledEffect.MangledEffect_C.ExecuteUbergraph_MangledEffect
// 0x0098 (0x0098 - 0x0000)
struct MangledEffect_C_ExecuteUbergraph_MangledEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCamperHealResult                      K2Node_CustomEvent_healResult;                     // 0x0008(0x0018)(ConstParm)
	class ADBDPlayer*                             CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECamperDamageState                            CallFunc_GetDamageState_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FCamperHealResult& HealResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_Or_conditionReceiver_CastInput;           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UOrModifierCondition*                   CallFunc_Or_ReturnValue;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEventDrivenModifierCondition*          CallFunc_CreateAndReceiveConditionForBP_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IConditionReceiver>    CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEventDrivenModifierCondition*          CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MangledEffect_C_ExecuteUbergraph_MangledEffect) == 0x000008, "Wrong alignment on MangledEffect_C_ExecuteUbergraph_MangledEffect");
static_assert(sizeof(MangledEffect_C_ExecuteUbergraph_MangledEffect) == 0x000098, "Wrong size on MangledEffect_C_ExecuteUbergraph_MangledEffect");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, EntryPoint) == 0x000000, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_GetTunableValue_ReturnValue) == 0x000004, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, K2Node_CustomEvent_healResult) == 0x000008, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::K2Node_CustomEvent_healResult' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_GetHealthComponent_ReturnValue) == 0x000028, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, K2Node_DynamicCast_AsCamper_Player) == 0x000030, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_GetDamageState_ReturnValue) == 0x000039, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_GetDamageState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_Or_conditionReceiver_CastInput) == 0x000050, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_Or_conditionReceiver_CastInput' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_Or_ReturnValue) == 0x000060, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_Or_ReturnValue' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput) == 0x000068, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_CreateAndReceiveConditionForBP_ReturnValue) == 0x000078, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_CreateAndReceiveConditionForBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1) == 0x000080, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_CreateAndReceiveConditionForBP_conditionReceiver_CastInput_1' has a wrong offset!");
static_assert(offsetof(MangledEffect_C_ExecuteUbergraph_MangledEffect, CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1) == 0x000090, "Member 'MangledEffect_C_ExecuteUbergraph_MangledEffect::CallFunc_CreateAndReceiveConditionForBP_ReturnValue_1' has a wrong offset!");

// Function MangledEffect.MangledEffect_C.IsStatusViewActive
// 0x0001 (0x0001 - 0x0000)
struct MangledEffect_C_IsStatusViewActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MangledEffect_C_IsStatusViewActive) == 0x000001, "Wrong alignment on MangledEffect_C_IsStatusViewActive");
static_assert(sizeof(MangledEffect_C_IsStatusViewActive) == 0x000001, "Wrong size on MangledEffect_C_IsStatusViewActive");
static_assert(offsetof(MangledEffect_C_IsStatusViewActive, ReturnValue) == 0x000000, "Member 'MangledEffect_C_IsStatusViewActive::ReturnValue' has a wrong offset!");

// Function MangledEffect.MangledEffect_C.GetShouldDisplay
// 0x0001 (0x0001 - 0x0000)
struct MangledEffect_C_GetShouldDisplay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MangledEffect_C_GetShouldDisplay) == 0x000001, "Wrong alignment on MangledEffect_C_GetShouldDisplay");
static_assert(sizeof(MangledEffect_C_GetShouldDisplay) == 0x000001, "Wrong size on MangledEffect_C_GetShouldDisplay");
static_assert(offsetof(MangledEffect_C_GetShouldDisplay, ReturnValue) == 0x000000, "Member 'MangledEffect_C_GetShouldDisplay::ReturnValue' has a wrong offset!");

}

