#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MendSelf

#include "Basic.hpp"


namespace SDK::Params
{

// Function MendSelf.MendSelf_C.ExecuteUbergraph_MendSelf
// 0x0010 (0x0010 - 0x0000)
struct MendSelf_C_ExecuteUbergraph_MendSelf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendSelf_C_ExecuteUbergraph_MendSelf) == 0x000004, "Wrong alignment on MendSelf_C_ExecuteUbergraph_MendSelf");
static_assert(sizeof(MendSelf_C_ExecuteUbergraph_MendSelf) == 0x000010, "Wrong size on MendSelf_C_ExecuteUbergraph_MendSelf");
static_assert(offsetof(MendSelf_C_ExecuteUbergraph_MendSelf, EntryPoint) == 0x000000, "Member 'MendSelf_C_ExecuteUbergraph_MendSelf::EntryPoint' has a wrong offset!");
static_assert(offsetof(MendSelf_C_ExecuteUbergraph_MendSelf, CallFunc_GetTunableValue_ReturnValue) == 0x000004, "Member 'MendSelf_C_ExecuteUbergraph_MendSelf::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendSelf_C_ExecuteUbergraph_MendSelf, CallFunc_GetTunableValue_ReturnValue_1) == 0x000008, "Member 'MendSelf_C_ExecuteUbergraph_MendSelf::CallFunc_GetTunableValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendSelf_C_ExecuteUbergraph_MendSelf, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'MendSelf_C_ExecuteUbergraph_MendSelf::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

