#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MendBase

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function MendBase.MendBase_C.ExecuteUbergraph_MendBase
// 0x0070 (0x0070 - 0x0000)
struct MendBase_C_ExecuteUbergraph_MendBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_deltaTime;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetMendTargetCamper_Camper;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCamperSlashableComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetMendTargetCamper_Camper_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCamperSlashableComponent*              CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_ExecuteUbergraph_MendBase) == 0x000008, "Wrong alignment on MendBase_C_ExecuteUbergraph_MendBase");
static_assert(sizeof(MendBase_C_ExecuteUbergraph_MendBase) == 0x000070, "Wrong size on MendBase_C_ExecuteUbergraph_MendBase");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, EntryPoint) == 0x000000, "Member 'MendBase_C_ExecuteUbergraph_MendBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, K2Node_Event_player) == 0x000008, "Member 'MendBase_C_ExecuteUbergraph_MendBase::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, K2Node_Event_hasInteractionStarted) == 0x000010, "Member 'MendBase_C_ExecuteUbergraph_MendBase::K2Node_Event_hasInteractionStarted' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, K2Node_Event_player_2) == 0x000018, "Member 'MendBase_C_ExecuteUbergraph_MendBase::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, K2Node_Event_deltaTime) == 0x000020, "Member 'MendBase_C_ExecuteUbergraph_MendBase::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_GetMendTargetCamper_Camper) == 0x000028, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_GetMendTargetCamper_Camper' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_GetMendTargetCamper_Camper_1) == 0x000048, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_GetMendTargetCamper_Camper_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, K2Node_Event_player_1) == 0x000050, "Member 'MendBase_C_ExecuteUbergraph_MendBase::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, K2Node_Event_actualSnapTime) == 0x000058, "Member 'MendBase_C_ExecuteUbergraph_MendBase::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_IsValid_ReturnValue_2) == 0x00005C, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000060, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_ExecuteUbergraph_MendBase, CallFunc_IsValid_ReturnValue_3) == 0x000068, "Member 'MendBase_C_ExecuteUbergraph_MendBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function MendBase.MendBase_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct MendBase_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on MendBase_C_OnInteractionEnterStart");
static_assert(sizeof(MendBase_C_OnInteractionEnterStart) == 0x000010, "Wrong size on MendBase_C_OnInteractionEnterStart");
static_assert(offsetof(MendBase_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'MendBase_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'MendBase_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function MendBase.MendBase_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct MendBase_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_OnInteractionFinished) == 0x000008, "Wrong alignment on MendBase_C_OnInteractionFinished");
static_assert(sizeof(MendBase_C_OnInteractionFinished) == 0x000010, "Wrong size on MendBase_C_OnInteractionFinished");
static_assert(offsetof(MendBase_C_OnInteractionFinished, Player) == 0x000000, "Member 'MendBase_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'MendBase_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function MendBase.MendBase_C.OnInteractionUpdateTick
// 0x0010 (0x0010 - 0x0000)
struct MendBase_C_OnInteractionUpdateTick final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_OnInteractionUpdateTick) == 0x000008, "Wrong alignment on MendBase_C_OnInteractionUpdateTick");
static_assert(sizeof(MendBase_C_OnInteractionUpdateTick) == 0x000010, "Wrong size on MendBase_C_OnInteractionUpdateTick");
static_assert(offsetof(MendBase_C_OnInteractionUpdateTick, Player) == 0x000000, "Member 'MendBase_C_OnInteractionUpdateTick::Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_OnInteractionUpdateTick, DeltaTime) == 0x000008, "Member 'MendBase_C_OnInteractionUpdateTick::DeltaTime' has a wrong offset!");

// Function MendBase.MendBase_C.CanBeMended
// 0x0028 (0x0028 - 0x0000)
struct MendBase_C_CanBeMended final
{
public:
	class ACamperPlayer*                          CamperPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_CanBeMended;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGuidedState                                  CallFunc_GetGuidedAction_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInInjuredBleedout_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsImmobilized_ReturnValue;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInteracting_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_CanBeMended) == 0x000008, "Wrong alignment on MendBase_C_CanBeMended");
static_assert(sizeof(MendBase_C_CanBeMended) == 0x000028, "Wrong size on MendBase_C_CanBeMended");
static_assert(offsetof(MendBase_C_CanBeMended, CamperPlayer) == 0x000000, "Member 'MendBase_C_CanBeMended::CamperPlayer' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, Param_CanBeMended) == 0x000008, "Member 'MendBase_C_CanBeMended::Param_CanBeMended' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_GetGuidedAction_ReturnValue) == 0x000009, "Member 'MendBase_C_CanBeMended::CallFunc_GetGuidedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_GetHealthComponent_ReturnValue) == 0x000010, "Member 'MendBase_C_CanBeMended::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'MendBase_C_CanBeMended::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_IsInInjuredBleedout_ReturnValue) == 0x000019, "Member 'MendBase_C_CanBeMended::CallFunc_IsInInjuredBleedout_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001A, "Member 'MendBase_C_CanBeMended::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_IsImmobilized_ReturnValue) == 0x00001B, "Member 'MendBase_C_CanBeMended::CallFunc_IsImmobilized_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'MendBase_C_CanBeMended::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'MendBase_C_CanBeMended::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'MendBase_C_CanBeMended::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_HasPerkFlag_ReturnValue) == 0x00001F, "Member 'MendBase_C_CanBeMended::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_GetIsInteracting_ReturnValue) == 0x000020, "Member 'MendBase_C_CanBeMended::CallFunc_GetIsInteracting_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_Not_PreBool_ReturnValue_1) == 0x000021, "Member 'MendBase_C_CanBeMended::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_Not_PreBool_ReturnValue_2) == 0x000022, "Member 'MendBase_C_CanBeMended::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_BooleanAND_ReturnValue_1) == 0x000023, "Member 'MendBase_C_CanBeMended::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_BooleanAND_ReturnValue_2) == 0x000024, "Member 'MendBase_C_CanBeMended::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanBeMended, CallFunc_BooleanAND_ReturnValue_3) == 0x000025, "Member 'MendBase_C_CanBeMended::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function MendBase.MendBase_C.CanMend
// 0x0030 (0x0030 - 0x0000)
struct MendBase_C_CanMend final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_CanMend;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrawling_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsImmobilized_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTotallyInsane_ReturnValue;              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_CanMend) == 0x000008, "Wrong alignment on MendBase_C_CanMend");
static_assert(sizeof(MendBase_C_CanMend) == 0x000030, "Wrong size on MendBase_C_CanMend");
static_assert(offsetof(MendBase_C_CanMend, Player) == 0x000000, "Member 'MendBase_C_CanMend::Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, Param_CanMend) == 0x000008, "Member 'MendBase_C_CanMend::Param_CanMend' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, K2Node_DynamicCast_AsCamper_Player) == 0x000010, "Member 'MendBase_C_CanMend::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MendBase_C_CanMend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_IsCrawling_ReturnValue) == 0x000019, "Member 'MendBase_C_CanMend::CallFunc_IsCrawling_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_GetHealthComponent_ReturnValue) == 0x000020, "Member 'MendBase_C_CanMend::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_IsImmobilized_ReturnValue) == 0x000028, "Member 'MendBase_C_CanMend::CallFunc_IsImmobilized_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_IsDead_ReturnValue) == 0x000029, "Member 'MendBase_C_CanMend::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'MendBase_C_CanMend::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_IsTotallyInsane_ReturnValue) == 0x00002B, "Member 'MendBase_C_CanMend::CallFunc_IsTotallyInsane_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_BooleanOR_ReturnValue_1) == 0x00002C, "Member 'MendBase_C_CanMend::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_BooleanOR_ReturnValue_2) == 0x00002D, "Member 'MendBase_C_CanMend::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MendBase_C_CanMend, CallFunc_Not_PreBool_ReturnValue) == 0x00002E, "Member 'MendBase_C_CanMend::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function MendBase.MendBase_C.GetMendTargetCamper
// 0x0010 (0x0010 - 0x0000)
struct MendBase_C_GetMendTargetCamper final
{
public:
	class ACamperPlayer*                          Camper;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          CallFunc_GetCamperOwner_Camper;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_GetMendTargetCamper) == 0x000008, "Wrong alignment on MendBase_C_GetMendTargetCamper");
static_assert(sizeof(MendBase_C_GetMendTargetCamper) == 0x000010, "Wrong size on MendBase_C_GetMendTargetCamper");
static_assert(offsetof(MendBase_C_GetMendTargetCamper, Camper) == 0x000000, "Member 'MendBase_C_GetMendTargetCamper::Camper' has a wrong offset!");
static_assert(offsetof(MendBase_C_GetMendTargetCamper, CallFunc_GetCamperOwner_Camper) == 0x000008, "Member 'MendBase_C_GetMendTargetCamper::CallFunc_GetCamperOwner_Camper' has a wrong offset!");

// Function MendBase.MendBase_C.IsInteractionDone
// 0x0028 (0x0028 - 0x0000)
struct MendBase_C_IsInteractionDone final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetMendTargetCamper_Camper;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCamperHealthComponent*                 CallFunc_GetHealthComponent_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInInjuredBleedout_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_IsInteractionDone) == 0x000008, "Wrong alignment on MendBase_C_IsInteractionDone");
static_assert(sizeof(MendBase_C_IsInteractionDone) == 0x000028, "Wrong size on MendBase_C_IsInteractionDone");
static_assert(offsetof(MendBase_C_IsInteractionDone, Player) == 0x000000, "Member 'MendBase_C_IsInteractionDone::Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionDone, InteractionType) == 0x000008, "Member 'MendBase_C_IsInteractionDone::InteractionType' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionDone, ReturnValue) == 0x000009, "Member 'MendBase_C_IsInteractionDone::ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionDone, CallFunc_GetMendTargetCamper_Camper) == 0x000010, "Member 'MendBase_C_IsInteractionDone::CallFunc_GetMendTargetCamper_Camper' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionDone, CallFunc_GetHealthComponent_ReturnValue) == 0x000018, "Member 'MendBase_C_IsInteractionDone::CallFunc_GetHealthComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionDone, CallFunc_IsInInjuredBleedout_ReturnValue) == 0x000020, "Member 'MendBase_C_IsInteractionDone::CallFunc_IsInInjuredBleedout_ReturnValue' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionDone, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'MendBase_C_IsInteractionDone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function MendBase.MendBase_C.IsInteractionPossibleBP
// 0x0020 (0x0020 - 0x0000)
struct MendBase_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanMend_CanMend;                          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetMendTargetCamper_Camper;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeMended_CanBeMended;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MendBase_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on MendBase_C_IsInteractionPossibleBP");
static_assert(sizeof(MendBase_C_IsInteractionPossibleBP) == 0x000020, "Wrong size on MendBase_C_IsInteractionPossibleBP");
static_assert(offsetof(MendBase_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'MendBase_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'MendBase_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(MendBase_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'MendBase_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
