#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mutators

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mutators.MutatorCosmeticStatusEffect.Cosmetic_OnDisabled
// 0x0008 (0x0008 - 0x0000)
struct MutatorCosmeticStatusEffect_Cosmetic_OnDisabled final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MutatorCosmeticStatusEffect_Cosmetic_OnDisabled) == 0x000008, "Wrong alignment on MutatorCosmeticStatusEffect_Cosmetic_OnDisabled");
static_assert(sizeof(MutatorCosmeticStatusEffect_Cosmetic_OnDisabled) == 0x000008, "Wrong size on MutatorCosmeticStatusEffect_Cosmetic_OnDisabled");
static_assert(offsetof(MutatorCosmeticStatusEffect_Cosmetic_OnDisabled, Player) == 0x000000, "Member 'MutatorCosmeticStatusEffect_Cosmetic_OnDisabled::Player' has a wrong offset!");

// Function Mutators.MutatorCosmeticStatusEffect.Cosmetic_OnEnabled
// 0x0008 (0x0008 - 0x0000)
struct MutatorCosmeticStatusEffect_Cosmetic_OnEnabled final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MutatorCosmeticStatusEffect_Cosmetic_OnEnabled) == 0x000008, "Wrong alignment on MutatorCosmeticStatusEffect_Cosmetic_OnEnabled");
static_assert(sizeof(MutatorCosmeticStatusEffect_Cosmetic_OnEnabled) == 0x000008, "Wrong size on MutatorCosmeticStatusEffect_Cosmetic_OnEnabled");
static_assert(offsetof(MutatorCosmeticStatusEffect_Cosmetic_OnEnabled, Player) == 0x000000, "Member 'MutatorCosmeticStatusEffect_Cosmetic_OnEnabled::Player' has a wrong offset!");

// Function Mutators.MutatorCosmeticStatusEffect.Cosmetic_OnInitialized
// 0x0008 (0x0008 - 0x0000)
struct MutatorCosmeticStatusEffect_Cosmetic_OnInitialized final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MutatorCosmeticStatusEffect_Cosmetic_OnInitialized) == 0x000008, "Wrong alignment on MutatorCosmeticStatusEffect_Cosmetic_OnInitialized");
static_assert(sizeof(MutatorCosmeticStatusEffect_Cosmetic_OnInitialized) == 0x000008, "Wrong size on MutatorCosmeticStatusEffect_Cosmetic_OnInitialized");
static_assert(offsetof(MutatorCosmeticStatusEffect_Cosmetic_OnInitialized, Player) == 0x000000, "Member 'MutatorCosmeticStatusEffect_Cosmetic_OnInitialized::Player' has a wrong offset!");

// Function Mutators.MutatorCosmeticStatusEffect.Cosmetic_OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged final
{
public:
	class AActor*                                 ViewTarget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged) == 0x000008, "Wrong alignment on MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged");
static_assert(sizeof(MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged) == 0x000008, "Wrong size on MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged");
static_assert(offsetof(MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged, ViewTarget) == 0x000000, "Member 'MutatorCosmeticStatusEffect_Cosmetic_OnViewTargetChanged::ViewTarget' has a wrong offset!");

// Function Mutators.MutatorCosmeticStatusEffect.DBD_ShowCosmeticMutators
// 0x0018 (0x0018 - 0x0000)
struct MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalPlayerId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators) == 0x000008, "Wrong alignment on MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators");
static_assert(sizeof(MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators) == 0x000018, "Wrong size on MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators");
static_assert(offsetof(MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators, IsVisible) == 0x000000, "Member 'MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators::IsVisible' has a wrong offset!");
static_assert(offsetof(MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators, LocalPlayerId) == 0x000008, "Member 'MutatorCosmeticStatusEffect_DBD_ShowCosmeticMutators::LocalPlayerId' has a wrong offset!");

// Function Mutators.PlayerMutator.OnSurvivorAdded
// 0x0008 (0x0008 - 0x0000)
struct PlayerMutator_OnSurvivorAdded final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerMutator_OnSurvivorAdded) == 0x000008, "Wrong alignment on PlayerMutator_OnSurvivorAdded");
static_assert(sizeof(PlayerMutator_OnSurvivorAdded) == 0x000008, "Wrong size on PlayerMutator_OnSurvivorAdded");
static_assert(offsetof(PlayerMutator_OnSurvivorAdded, Survivor) == 0x000000, "Member 'PlayerMutator_OnSurvivorAdded::Survivor' has a wrong offset!");

}

