#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mutators

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "Mutators_structs.hpp"


namespace SDK
{

// Class Mutators.AddGeneratorProgressionMutator
// 0x0008 (0x0048 - 0x0040)
class UAddGeneratorProgressionMutator final : public UMutator
{
public:
	float                                         _progressionToAdd;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddGeneratorProgressionMutator">();
	}
	static class UAddGeneratorProgressionMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddGeneratorProgressionMutator>();
	}
};
static_assert(alignof(UAddGeneratorProgressionMutator) == 0x000008, "Wrong alignment on UAddGeneratorProgressionMutator");
static_assert(sizeof(UAddGeneratorProgressionMutator) == 0x000048, "Wrong size on UAddGeneratorProgressionMutator");
static_assert(offsetof(UAddGeneratorProgressionMutator, _progressionToAdd) == 0x000040, "Member 'UAddGeneratorProgressionMutator::_progressionToAdd' has a wrong offset!");

// Class Mutators.MutatorCosmeticStatusEffect
// 0x0008 (0x0388 - 0x0380)
class UMutatorCosmeticStatusEffect : public UStatusEffect
{
public:
	bool                                          _isEnabled;                                        // 0x0380(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnDisabled(class ADBDPlayer* Player);
	void Cosmetic_OnEnabled(class ADBDPlayer* Player);
	void Cosmetic_OnInitialized(class ADBDPlayer* Player);
	void Cosmetic_OnViewTargetChanged(class AActor* ViewTarget);
	void DBD_ShowCosmeticMutators(const bool IsVisible, const class FString& LocalPlayerId);
	void OnLocallyObservedChanged();
	void OnRep_IsEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MutatorCosmeticStatusEffect">();
	}
	static class UMutatorCosmeticStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMutatorCosmeticStatusEffect>();
	}
};
static_assert(alignof(UMutatorCosmeticStatusEffect) == 0x000008, "Wrong alignment on UMutatorCosmeticStatusEffect");
static_assert(sizeof(UMutatorCosmeticStatusEffect) == 0x000388, "Wrong size on UMutatorCosmeticStatusEffect");
static_assert(offsetof(UMutatorCosmeticStatusEffect, _isEnabled) == 0x000380, "Member 'UMutatorCosmeticStatusEffect::_isEnabled' has a wrong offset!");

// Class Mutators.PlayerMutator
// 0x0018 (0x0058 - 0x0040)
class UPlayerMutator : public UMutator
{
public:
	bool                                          _applyToSurvivors;                                 // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _applyToKiller;                                    // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42[0x16];                                      // 0x0042(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurvivorAdded(class ACamperPlayer* Survivor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerMutator">();
	}
	static class UPlayerMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMutator>();
	}
};
static_assert(alignof(UPlayerMutator) == 0x000008, "Wrong alignment on UPlayerMutator");
static_assert(sizeof(UPlayerMutator) == 0x000058, "Wrong size on UPlayerMutator");
static_assert(offsetof(UPlayerMutator, _applyToSurvivors) == 0x000040, "Member 'UPlayerMutator::_applyToSurvivors' has a wrong offset!");
static_assert(offsetof(UPlayerMutator, _applyToKiller) == 0x000041, "Member 'UPlayerMutator::_applyToKiller' has a wrong offset!");

// Class Mutators.AddAnimMappingToPlayerMutator
// 0x0010 (0x0068 - 0x0058)
class UAddAnimMappingToPlayerMutator final : public UPlayerMutator
{
public:
	TArray<struct FContextualAnimationMapping>    _animMapping;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddAnimMappingToPlayerMutator">();
	}
	static class UAddAnimMappingToPlayerMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddAnimMappingToPlayerMutator>();
	}
};
static_assert(alignof(UAddAnimMappingToPlayerMutator) == 0x000008, "Wrong alignment on UAddAnimMappingToPlayerMutator");
static_assert(sizeof(UAddAnimMappingToPlayerMutator) == 0x000068, "Wrong size on UAddAnimMappingToPlayerMutator");
static_assert(offsetof(UAddAnimMappingToPlayerMutator, _animMapping) == 0x000058, "Member 'UAddAnimMappingToPlayerMutator::_animMapping' has a wrong offset!");

// Class Mutators.AddComponentToGeneratorsMutator
// 0x0008 (0x0048 - 0x0040)
class UAddComponentToGeneratorsMutator final : public UMutator
{
public:
	TSubclassOf<class UActorComponent>            _componentToAdd;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddComponentToGeneratorsMutator">();
	}
	static class UAddComponentToGeneratorsMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddComponentToGeneratorsMutator>();
	}
};
static_assert(alignof(UAddComponentToGeneratorsMutator) == 0x000008, "Wrong alignment on UAddComponentToGeneratorsMutator");
static_assert(sizeof(UAddComponentToGeneratorsMutator) == 0x000048, "Wrong size on UAddComponentToGeneratorsMutator");
static_assert(offsetof(UAddComponentToGeneratorsMutator, _componentToAdd) == 0x000040, "Member 'UAddComponentToGeneratorsMutator::_componentToAdd' has a wrong offset!");

// Class Mutators.AddCustomMoriMutator
// 0x0008 (0x0060 - 0x0058)
class UAddCustomMoriMutator final : public UPlayerMutator
{
public:
	TSubclassOf<class UInteractionDefinition>     _customMori;                                       // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddCustomMoriMutator">();
	}
	static class UAddCustomMoriMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddCustomMoriMutator>();
	}
};
static_assert(alignof(UAddCustomMoriMutator) == 0x000008, "Wrong alignment on UAddCustomMoriMutator");
static_assert(sizeof(UAddCustomMoriMutator) == 0x000060, "Wrong size on UAddCustomMoriMutator");
static_assert(offsetof(UAddCustomMoriMutator, _customMori) == 0x000058, "Member 'UAddCustomMoriMutator::_customMori' has a wrong offset!");

// Class Mutators.AddGeneratorRegressionModifierMutator
// 0x0058 (0x0098 - 0x0040)
class UAddGeneratorRegressionModifierMutator final : public UMutator
{
public:
	float                                         _regressionModifier;                               // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AGenerator*, uint64>               _gameplayModifierHandles;                          // 0x0048(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddGeneratorRegressionModifierMutator">();
	}
	static class UAddGeneratorRegressionModifierMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddGeneratorRegressionModifierMutator>();
	}
};
static_assert(alignof(UAddGeneratorRegressionModifierMutator) == 0x000008, "Wrong alignment on UAddGeneratorRegressionModifierMutator");
static_assert(sizeof(UAddGeneratorRegressionModifierMutator) == 0x000098, "Wrong size on UAddGeneratorRegressionModifierMutator");
static_assert(offsetof(UAddGeneratorRegressionModifierMutator, _regressionModifier) == 0x000040, "Member 'UAddGeneratorRegressionModifierMutator::_regressionModifier' has a wrong offset!");
static_assert(offsetof(UAddGeneratorRegressionModifierMutator, _gameplayModifierHandles) == 0x000048, "Member 'UAddGeneratorRegressionModifierMutator::_gameplayModifierHandles' has a wrong offset!");

// Class Mutators.AddSkillOnPlayer
// 0x0010 (0x0068 - 0x0058)
class UAddSkillOnPlayer final : public UPlayerMutator
{
public:
	TArray<class FName>                           _skills;                                           // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddSkillOnPlayer">();
	}
	static class UAddSkillOnPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddSkillOnPlayer>();
	}
};
static_assert(alignof(UAddSkillOnPlayer) == 0x000008, "Wrong alignment on UAddSkillOnPlayer");
static_assert(sizeof(UAddSkillOnPlayer) == 0x000068, "Wrong size on UAddSkillOnPlayer");
static_assert(offsetof(UAddSkillOnPlayer, _skills) == 0x000058, "Member 'UAddSkillOnPlayer::_skills' has a wrong offset!");

// Class Mutators.AddSkillsOnDrainStageChangedMutator
// 0x0040 (0x0080 - 0x0040)
class UAddSkillsOnDrainStageChangedMutator final : public UMutator
{
public:
	struct FDrainingStageSkillData                _skillPerStageIDs[0x4];                            // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddSkillsOnDrainStageChangedMutator">();
	}
	static class UAddSkillsOnDrainStageChangedMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddSkillsOnDrainStageChangedMutator>();
	}
};
static_assert(alignof(UAddSkillsOnDrainStageChangedMutator) == 0x000008, "Wrong alignment on UAddSkillsOnDrainStageChangedMutator");
static_assert(sizeof(UAddSkillsOnDrainStageChangedMutator) == 0x000080, "Wrong size on UAddSkillsOnDrainStageChangedMutator");
static_assert(offsetof(UAddSkillsOnDrainStageChangedMutator, _skillPerStageIDs) == 0x000040, "Member 'UAddSkillsOnDrainStageChangedMutator::_skillPerStageIDs' has a wrong offset!");

// Class Mutators.AddSkillsOnUnhookedMutator
// 0x0020 (0x0060 - 0x0040)
class UAddSkillsOnUnhookedMutator final : public UMutator
{
public:
	TArray<class FName>                           _firstUnhookSkillIDs;                              // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class FName>                           _secondUnhookSkillIDs;                             // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddSkillsOnUnhookedMutator">();
	}
	static class UAddSkillsOnUnhookedMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddSkillsOnUnhookedMutator>();
	}
};
static_assert(alignof(UAddSkillsOnUnhookedMutator) == 0x000008, "Wrong alignment on UAddSkillsOnUnhookedMutator");
static_assert(sizeof(UAddSkillsOnUnhookedMutator) == 0x000060, "Wrong size on UAddSkillsOnUnhookedMutator");
static_assert(offsetof(UAddSkillsOnUnhookedMutator, _firstUnhookSkillIDs) == 0x000040, "Member 'UAddSkillsOnUnhookedMutator::_firstUnhookSkillIDs' has a wrong offset!");
static_assert(offsetof(UAddSkillsOnUnhookedMutator, _secondUnhookSkillIDs) == 0x000050, "Member 'UAddSkillsOnUnhookedMutator::_secondUnhookSkillIDs' has a wrong offset!");

// Class Mutators.ApplyCharacterClassMutator
// 0x0060 (0x00B8 - 0x0058)
class UApplyCharacterClassMutator final : public UPlayerMutator
{
public:
	struct FGameplayTag                           _eventToUnlockSurvivorSkill;                       // 0x0058(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x54];                                      // 0x0064(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ApplyCharacterClassMutator">();
	}
	static class UApplyCharacterClassMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApplyCharacterClassMutator>();
	}
};
static_assert(alignof(UApplyCharacterClassMutator) == 0x000008, "Wrong alignment on UApplyCharacterClassMutator");
static_assert(sizeof(UApplyCharacterClassMutator) == 0x0000B8, "Wrong size on UApplyCharacterClassMutator");
static_assert(offsetof(UApplyCharacterClassMutator, _eventToUnlockSurvivorSkill) == 0x000058, "Member 'UApplyCharacterClassMutator::_eventToUnlockSurvivorSkill' has a wrong offset!");

// Class Mutators.CageHookMutator
// 0x00A8 (0x00E8 - 0x0040)
class UCageHookMutator final : public UMutator
{
public:
	TSubclassOf<class AActor>                     _cageClass;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayElementType                          _spawnPointElementType;                            // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _sendToCageDelay;                                  // 0x0050(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UInteractionDefinition>     _sendToCageInteractionClass;                       // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractionAttacherComponent*          _interactionAttacherComponent;                     // 0x0080(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x60];                                      // 0x0088(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CageHookMutator">();
	}
	static class UCageHookMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCageHookMutator>();
	}
};
static_assert(alignof(UCageHookMutator) == 0x000008, "Wrong alignment on UCageHookMutator");
static_assert(sizeof(UCageHookMutator) == 0x0000E8, "Wrong size on UCageHookMutator");
static_assert(offsetof(UCageHookMutator, _cageClass) == 0x000040, "Member 'UCageHookMutator::_cageClass' has a wrong offset!");
static_assert(offsetof(UCageHookMutator, _spawnPointElementType) == 0x000048, "Member 'UCageHookMutator::_spawnPointElementType' has a wrong offset!");
static_assert(offsetof(UCageHookMutator, _sendToCageDelay) == 0x000050, "Member 'UCageHookMutator::_sendToCageDelay' has a wrong offset!");
static_assert(offsetof(UCageHookMutator, _sendToCageInteractionClass) == 0x000078, "Member 'UCageHookMutator::_sendToCageInteractionClass' has a wrong offset!");
static_assert(offsetof(UCageHookMutator, _interactionAttacherComponent) == 0x000080, "Member 'UCageHookMutator::_interactionAttacherComponent' has a wrong offset!");

// Class Mutators.DisableTerrorRadiusAudioStatusEffect
// 0x0028 (0x03A8 - 0x0380)
class UDisableTerrorRadiusAudioStatusEffect final : public UStatusEffect
{
public:
	uint8                                         Pad_380[0x28];                                     // 0x0380(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisableTerrorRadiusAudioStatusEffect">();
	}
	static class UDisableTerrorRadiusAudioStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisableTerrorRadiusAudioStatusEffect>();
	}
};
static_assert(alignof(UDisableTerrorRadiusAudioStatusEffect) == 0x000008, "Wrong alignment on UDisableTerrorRadiusAudioStatusEffect");
static_assert(sizeof(UDisableTerrorRadiusAudioStatusEffect) == 0x0003A8, "Wrong size on UDisableTerrorRadiusAudioStatusEffect");

// Class Mutators.ForceDropOnSurvivorPickup
// 0x0000 (0x0040 - 0x0040)
class UForceDropOnSurvivorPickup final : public UMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ForceDropOnSurvivorPickup">();
	}
	static class UForceDropOnSurvivorPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForceDropOnSurvivorPickup>();
	}
};
static_assert(alignof(UForceDropOnSurvivorPickup) == 0x000008, "Wrong alignment on UForceDropOnSurvivorPickup");
static_assert(sizeof(UForceDropOnSurvivorPickup) == 0x000040, "Wrong size on UForceDropOnSurvivorPickup");

// Class Mutators.ForceHookStageMutator
// 0x0008 (0x0060 - 0x0058)
class UForceHookStageMutator final : public UPlayerMutator
{
public:
	int32                                         _hookStage;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ForceHookStageMutator">();
	}
	static class UForceHookStageMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForceHookStageMutator>();
	}
};
static_assert(alignof(UForceHookStageMutator) == 0x000008, "Wrong alignment on UForceHookStageMutator");
static_assert(sizeof(UForceHookStageMutator) == 0x000060, "Wrong size on UForceHookStageMutator");
static_assert(offsetof(UForceHookStageMutator, _hookStage) == 0x000058, "Member 'UForceHookStageMutator::_hookStage' has a wrong offset!");

// Class Mutators.ForceItemDropOnBasicAttackHitMutator
// 0x0000 (0x0040 - 0x0040)
class UForceItemDropOnBasicAttackHitMutator final : public UMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ForceItemDropOnBasicAttackHitMutator">();
	}
	static class UForceItemDropOnBasicAttackHitMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForceItemDropOnBasicAttackHitMutator>();
	}
};
static_assert(alignof(UForceItemDropOnBasicAttackHitMutator) == 0x000008, "Wrong alignment on UForceItemDropOnBasicAttackHitMutator");
static_assert(sizeof(UForceItemDropOnBasicAttackHitMutator) == 0x000040, "Wrong size on UForceItemDropOnBasicAttackHitMutator");

// Class Mutators.ForceItemDropOnDyingMutator
// 0x0010 (0x0050 - 0x0040)
class UForceItemDropOnDyingMutator final : public UMutator
{
public:
	class FName                                   _itemToDropID;                                     // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ForceItemDropOnDyingMutator">();
	}
	static class UForceItemDropOnDyingMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForceItemDropOnDyingMutator>();
	}
};
static_assert(alignof(UForceItemDropOnDyingMutator) == 0x000008, "Wrong alignment on UForceItemDropOnDyingMutator");
static_assert(sizeof(UForceItemDropOnDyingMutator) == 0x000050, "Wrong size on UForceItemDropOnDyingMutator");
static_assert(offsetof(UForceItemDropOnDyingMutator, _itemToDropID) == 0x000040, "Member 'UForceItemDropOnDyingMutator::_itemToDropID' has a wrong offset!");

// Class Mutators.HideHUDMutator
// 0x0000 (0x0040 - 0x0040)
class UHideHUDMutator final : public UMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HideHUDMutator">();
	}
	static class UHideHUDMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHideHUDMutator>();
	}
};
static_assert(alignof(UHideHUDMutator) == 0x000008, "Wrong alignment on UHideHUDMutator");
static_assert(sizeof(UHideHUDMutator) == 0x000040, "Wrong size on UHideHUDMutator");

// Class Mutators.ModifyHookSacrificeTime
// 0x0008 (0x0060 - 0x0058)
class UModifyHookSacrificeTime final : public UPlayerMutator
{
public:
	float                                         _overridenSacrificeTime;                           // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModifyHookSacrificeTime">();
	}
	static class UModifyHookSacrificeTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModifyHookSacrificeTime>();
	}
};
static_assert(alignof(UModifyHookSacrificeTime) == 0x000008, "Wrong alignment on UModifyHookSacrificeTime");
static_assert(sizeof(UModifyHookSacrificeTime) == 0x000060, "Wrong size on UModifyHookSacrificeTime");
static_assert(offsetof(UModifyHookSacrificeTime, _overridenSacrificeTime) == 0x000058, "Member 'UModifyHookSacrificeTime::_overridenSacrificeTime' has a wrong offset!");

// Class Mutators.ModifyPlayerScaleMutator
// 0x0018 (0x0070 - 0x0058)
class UModifyPlayerScaleMutator final : public UPlayerMutator
{
public:
	TSubclassOf<class UStatusEffect>              _modifyLocomotionRateEffectClass;                  // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scale;                                            // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _locomotionSpeedRatio;                             // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModifyPlayerScaleMutator">();
	}
	static class UModifyPlayerScaleMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModifyPlayerScaleMutator>();
	}
};
static_assert(alignof(UModifyPlayerScaleMutator) == 0x000008, "Wrong alignment on UModifyPlayerScaleMutator");
static_assert(sizeof(UModifyPlayerScaleMutator) == 0x000070, "Wrong size on UModifyPlayerScaleMutator");
static_assert(offsetof(UModifyPlayerScaleMutator, _modifyLocomotionRateEffectClass) == 0x000058, "Member 'UModifyPlayerScaleMutator::_modifyLocomotionRateEffectClass' has a wrong offset!");
static_assert(offsetof(UModifyPlayerScaleMutator, _scale) == 0x000060, "Member 'UModifyPlayerScaleMutator::_scale' has a wrong offset!");
static_assert(offsetof(UModifyPlayerScaleMutator, _locomotionSpeedRatio) == 0x000064, "Member 'UModifyPlayerScaleMutator::_locomotionSpeedRatio' has a wrong offset!");

// Class Mutators.OpenEscapeDoorOnGeneratorCompletionMutator
// 0x0010 (0x0050 - 0x0040)
class UOpenEscapeDoorOnGeneratorCompletionMutator final : public UMutator
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpenEscapeDoorOnGeneratorCompletionMutator">();
	}
	static class UOpenEscapeDoorOnGeneratorCompletionMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenEscapeDoorOnGeneratorCompletionMutator>();
	}
};
static_assert(alignof(UOpenEscapeDoorOnGeneratorCompletionMutator) == 0x000008, "Wrong alignment on UOpenEscapeDoorOnGeneratorCompletionMutator");
static_assert(sizeof(UOpenEscapeDoorOnGeneratorCompletionMutator) == 0x000050, "Wrong size on UOpenEscapeDoorOnGeneratorCompletionMutator");

// Class Mutators.OverrideClosedHatchesRequiredMutator
// 0x0008 (0x0048 - 0x0040)
class UOverrideClosedHatchesRequiredMutator final : public UMutator
{
public:
	int32                                         _requiredClosedHatchCount;                         // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverrideClosedHatchesRequiredMutator">();
	}
	static class UOverrideClosedHatchesRequiredMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverrideClosedHatchesRequiredMutator>();
	}
};
static_assert(alignof(UOverrideClosedHatchesRequiredMutator) == 0x000008, "Wrong alignment on UOverrideClosedHatchesRequiredMutator");
static_assert(sizeof(UOverrideClosedHatchesRequiredMutator) == 0x000048, "Wrong size on UOverrideClosedHatchesRequiredMutator");
static_assert(offsetof(UOverrideClosedHatchesRequiredMutator, _requiredClosedHatchCount) == 0x000040, "Member 'UOverrideClosedHatchesRequiredMutator::_requiredClosedHatchCount' has a wrong offset!");

// Class Mutators.OverrideGameObjectivesMutator
// 0x0010 (0x0050 - 0x0040)
class UOverrideGameObjectivesMutator final : public UMutator
{
public:
	TArray<TSubclassOf<class AGameObjectiveBase>> _gameObjectiveClasses;                             // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverrideGameObjectivesMutator">();
	}
	static class UOverrideGameObjectivesMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverrideGameObjectivesMutator>();
	}
};
static_assert(alignof(UOverrideGameObjectivesMutator) == 0x000008, "Wrong alignment on UOverrideGameObjectivesMutator");
static_assert(sizeof(UOverrideGameObjectivesMutator) == 0x000050, "Wrong size on UOverrideGameObjectivesMutator");
static_assert(offsetof(UOverrideGameObjectivesMutator, _gameObjectiveClasses) == 0x000040, "Member 'UOverrideGameObjectivesMutator::_gameObjectiveClasses' has a wrong offset!");

// Class Mutators.OverrideGeneratorMaxChargeMutator
// 0x0008 (0x0048 - 0x0040)
class UOverrideGeneratorMaxChargeMutator final : public UMutator
{
public:
	float                                         _secondsToCharge;                                  // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverrideGeneratorMaxChargeMutator">();
	}
	static class UOverrideGeneratorMaxChargeMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverrideGeneratorMaxChargeMutator>();
	}
};
static_assert(alignof(UOverrideGeneratorMaxChargeMutator) == 0x000008, "Wrong alignment on UOverrideGeneratorMaxChargeMutator");
static_assert(sizeof(UOverrideGeneratorMaxChargeMutator) == 0x000048, "Wrong size on UOverrideGeneratorMaxChargeMutator");
static_assert(offsetof(UOverrideGeneratorMaxChargeMutator, _secondsToCharge) == 0x000040, "Member 'UOverrideGeneratorMaxChargeMutator::_secondsToCharge' has a wrong offset!");

// Class Mutators.OverrideGeneratorOutlineStrategySettingsMutator
// 0x0008 (0x0048 - 0x0040)
class UOverrideGeneratorOutlineStrategySettingsMutator final : public UMutator
{
public:
	struct FKillerOutlineRevealSettings           _settingsOverride;                                 // 0x0040(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverrideGeneratorOutlineStrategySettingsMutator">();
	}
	static class UOverrideGeneratorOutlineStrategySettingsMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverrideGeneratorOutlineStrategySettingsMutator>();
	}
};
static_assert(alignof(UOverrideGeneratorOutlineStrategySettingsMutator) == 0x000008, "Wrong alignment on UOverrideGeneratorOutlineStrategySettingsMutator");
static_assert(sizeof(UOverrideGeneratorOutlineStrategySettingsMutator) == 0x000048, "Wrong size on UOverrideGeneratorOutlineStrategySettingsMutator");
static_assert(offsetof(UOverrideGeneratorOutlineStrategySettingsMutator, _settingsOverride) == 0x000040, "Member 'UOverrideGeneratorOutlineStrategySettingsMutator::_settingsOverride' has a wrong offset!");

// Class Mutators.OverrideHatchVisibleSurvivorThresholdMutator
// 0x0008 (0x0048 - 0x0040)
class UOverrideHatchVisibleSurvivorThresholdMutator final : public UMutator
{
public:
	int32                                         _hatchVisibleSurvivorThreshold;                    // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverrideHatchVisibleSurvivorThresholdMutator">();
	}
	static class UOverrideHatchVisibleSurvivorThresholdMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverrideHatchVisibleSurvivorThresholdMutator>();
	}
};
static_assert(alignof(UOverrideHatchVisibleSurvivorThresholdMutator) == 0x000008, "Wrong alignment on UOverrideHatchVisibleSurvivorThresholdMutator");
static_assert(sizeof(UOverrideHatchVisibleSurvivorThresholdMutator) == 0x000048, "Wrong size on UOverrideHatchVisibleSurvivorThresholdMutator");
static_assert(offsetof(UOverrideHatchVisibleSurvivorThresholdMutator, _hatchVisibleSurvivorThreshold) == 0x000040, "Member 'UOverrideHatchVisibleSurvivorThresholdMutator::_hatchVisibleSurvivorThreshold' has a wrong offset!");

// Class Mutators.RevealSurvivorsOnGeneratorKickedMutator
// 0x0060 (0x00A0 - 0x0040)
class URevealSurvivorsOnGeneratorKickedMutator final : public UMutator
{
public:
	TSubclassOf<class UStatusEffect>              _activatableRevealToKillerEffectClass;             // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _revealRange;                                      // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _revealDuration;                                   // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TWeakObjectPtr<class ADBDPlayer>, class UStatusEffect*> _revealAuraToKillerPerSurvivor;                    // 0x0050(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RevealSurvivorsOnGeneratorKickedMutator">();
	}
	static class URevealSurvivorsOnGeneratorKickedMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URevealSurvivorsOnGeneratorKickedMutator>();
	}
};
static_assert(alignof(URevealSurvivorsOnGeneratorKickedMutator) == 0x000008, "Wrong alignment on URevealSurvivorsOnGeneratorKickedMutator");
static_assert(sizeof(URevealSurvivorsOnGeneratorKickedMutator) == 0x0000A0, "Wrong size on URevealSurvivorsOnGeneratorKickedMutator");
static_assert(offsetof(URevealSurvivorsOnGeneratorKickedMutator, _activatableRevealToKillerEffectClass) == 0x000040, "Member 'URevealSurvivorsOnGeneratorKickedMutator::_activatableRevealToKillerEffectClass' has a wrong offset!");
static_assert(offsetof(URevealSurvivorsOnGeneratorKickedMutator, _revealRange) == 0x000048, "Member 'URevealSurvivorsOnGeneratorKickedMutator::_revealRange' has a wrong offset!");
static_assert(offsetof(URevealSurvivorsOnGeneratorKickedMutator, _revealDuration) == 0x00004C, "Member 'URevealSurvivorsOnGeneratorKickedMutator::_revealDuration' has a wrong offset!");
static_assert(offsetof(URevealSurvivorsOnGeneratorKickedMutator, _revealAuraToKillerPerSurvivor) == 0x000050, "Member 'URevealSurvivorsOnGeneratorKickedMutator::_revealAuraToKillerPerSurvivor' has a wrong offset!");

// Class Mutators.SpawnEffectOnPlayerMutator
// 0x0018 (0x0070 - 0x0058)
class USpawnEffectOnPlayerMutator final : public UPlayerMutator
{
public:
	TSubclassOf<class UStatusEffect>              _statusEffectClass;                                // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _customParam;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _shouldDisplay;                                    // 0x0064(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _lifetime;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpawnEffectOnPlayerMutator">();
	}
	static class USpawnEffectOnPlayerMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEffectOnPlayerMutator>();
	}
};
static_assert(alignof(USpawnEffectOnPlayerMutator) == 0x000008, "Wrong alignment on USpawnEffectOnPlayerMutator");
static_assert(sizeof(USpawnEffectOnPlayerMutator) == 0x000070, "Wrong size on USpawnEffectOnPlayerMutator");
static_assert(offsetof(USpawnEffectOnPlayerMutator, _statusEffectClass) == 0x000058, "Member 'USpawnEffectOnPlayerMutator::_statusEffectClass' has a wrong offset!");
static_assert(offsetof(USpawnEffectOnPlayerMutator, _customParam) == 0x000060, "Member 'USpawnEffectOnPlayerMutator::_customParam' has a wrong offset!");
