#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenEscape

#include "Basic.hpp"


namespace SDK::Params
{

// Function OpenEscape.OpenEscape_C.UpdateSwitchAnim
// 0x0018 (0x0018 - 0x0000)
struct OpenEscape_C_UpdateSwitchAnim final
{
public:
	bool                                          CallFunc_GetIsOpen_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetDoorSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenEscape_C_UpdateSwitchAnim) == 0x000008, "Wrong alignment on OpenEscape_C_UpdateSwitchAnim");
static_assert(sizeof(OpenEscape_C_UpdateSwitchAnim) == 0x000018, "Wrong size on OpenEscape_C_UpdateSwitchAnim");
static_assert(offsetof(OpenEscape_C_UpdateSwitchAnim, CallFunc_GetIsOpen_ReturnValue) == 0x000000, "Member 'OpenEscape_C_UpdateSwitchAnim::CallFunc_GetIsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_UpdateSwitchAnim, CallFunc_GetDoorSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'OpenEscape_C_UpdateSwitchAnim::CallFunc_GetDoorSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_UpdateSwitchAnim, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'OpenEscape_C_UpdateSwitchAnim::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function OpenEscape.OpenEscape_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct OpenEscape_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenEscape_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on OpenEscape_C_OnInteractionUpdateStart");
static_assert(sizeof(OpenEscape_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on OpenEscape_C_OnInteractionUpdateStart");
static_assert(offsetof(OpenEscape_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'OpenEscape_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function OpenEscape.OpenEscape_C.OnInteractionInterruptStarted
// 0x0018 (0x0018 - 0x0000)
struct OpenEscape_C_OnInteractionInterruptStarted final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInterruptionDefinition*                CurrentInterruption;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             InterruptingPlayer;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenEscape_C_OnInteractionInterruptStarted) == 0x000008, "Wrong alignment on OpenEscape_C_OnInteractionInterruptStarted");
static_assert(sizeof(OpenEscape_C_OnInteractionInterruptStarted) == 0x000018, "Wrong size on OpenEscape_C_OnInteractionInterruptStarted");
static_assert(offsetof(OpenEscape_C_OnInteractionInterruptStarted, Player) == 0x000000, "Member 'OpenEscape_C_OnInteractionInterruptStarted::Player' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_OnInteractionInterruptStarted, CurrentInterruption) == 0x000008, "Member 'OpenEscape_C_OnInteractionInterruptStarted::CurrentInterruption' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_OnInteractionInterruptStarted, InterruptingPlayer) == 0x000010, "Member 'OpenEscape_C_OnInteractionInterruptStarted::InterruptingPlayer' has a wrong offset!");

// Function OpenEscape.OpenEscape_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct OpenEscape_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenEscape_C_OnInteractionFinished) == 0x000008, "Wrong alignment on OpenEscape_C_OnInteractionFinished");
static_assert(sizeof(OpenEscape_C_OnInteractionFinished) == 0x000010, "Wrong size on OpenEscape_C_OnInteractionFinished");
static_assert(offsetof(OpenEscape_C_OnInteractionFinished, Player) == 0x000000, "Member 'OpenEscape_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'OpenEscape_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function OpenEscape.OpenEscape_C.Flip Switch Off
// 0x0020 (0x0020 - 0x0000)
struct OpenEscape_C_Flip_Switch_Off final
{
public:
	class USkeletalMeshComponent*                 CallFunc_GetDoorSkeletalMeshComponent_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Montage_GetCurrentSection_ReturnValue;    // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenEscape_C_Flip_Switch_Off) == 0x000008, "Wrong alignment on OpenEscape_C_Flip_Switch_Off");
static_assert(sizeof(OpenEscape_C_Flip_Switch_Off) == 0x000020, "Wrong size on OpenEscape_C_Flip_Switch_Off");
static_assert(offsetof(OpenEscape_C_Flip_Switch_Off, CallFunc_GetDoorSkeletalMeshComponent_ReturnValue) == 0x000000, "Member 'OpenEscape_C_Flip_Switch_Off::CallFunc_GetDoorSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_Flip_Switch_Off, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'OpenEscape_C_Flip_Switch_Off::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_Flip_Switch_Off, CallFunc_Montage_GetCurrentSection_ReturnValue) == 0x000010, "Member 'OpenEscape_C_Flip_Switch_Off::CallFunc_Montage_GetCurrentSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_Flip_Switch_Off, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00001C, "Member 'OpenEscape_C_Flip_Switch_Off::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function OpenEscape.OpenEscape_C.ExecuteUbergraph_OpenEscape
// 0x0048 (0x0048 - 0x0000)
struct OpenEscape_C_ExecuteUbergraph_OpenEscape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInterruptionDefinition*                K2Node_Event_currentInterruption;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_interruptingPlayer;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetDoorSkeletalMeshComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenEscape_C_ExecuteUbergraph_OpenEscape) == 0x000008, "Wrong alignment on OpenEscape_C_ExecuteUbergraph_OpenEscape");
static_assert(sizeof(OpenEscape_C_ExecuteUbergraph_OpenEscape) == 0x000048, "Wrong size on OpenEscape_C_ExecuteUbergraph_OpenEscape");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, EntryPoint) == 0x000000, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::EntryPoint' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, K2Node_Event_player_2) == 0x000008, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, K2Node_Event_currentInterruption) == 0x000010, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::K2Node_Event_currentInterruption' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, K2Node_Event_interruptingPlayer) == 0x000018, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::K2Node_Event_interruptingPlayer' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, CallFunc_GetDoorSkeletalMeshComponent_ReturnValue) == 0x000020, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::CallFunc_GetDoorSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, K2Node_Event_player_1) == 0x000028, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, K2Node_Event_player) == 0x000038, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, K2Node_Event_hasInteractionStarted) == 0x000040, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::K2Node_Event_hasInteractionStarted' has a wrong offset!");
static_assert(offsetof(OpenEscape_C_ExecuteUbergraph_OpenEscape, CallFunc_Montage_Play_ReturnValue) == 0x000044, "Member 'OpenEscape_C_ExecuteUbergraph_OpenEscape::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

}

