#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Pickup.Pickup_C.GetFocalPointPosition
// 0x0080 (0x0080 - 0x0000)
struct Pickup_C_GetFocalPointPosition final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFocalPointPosition_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_B_ImplicitCast;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_A_ImplicitCast;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_C_GetFocalPointPosition) == 0x000008, "Wrong alignment on Pickup_C_GetFocalPointPosition");
static_assert(sizeof(Pickup_C_GetFocalPointPosition) == 0x000080, "Wrong size on Pickup_C_GetFocalPointPosition");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, Player) == 0x000000, "Member 'Pickup_C_GetFocalPointPosition::Player' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, ReturnValue) == 0x000008, "Member 'Pickup_C_GetFocalPointPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_GetFocalPointPosition_ReturnValue) == 0x000020, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_GetFocalPointPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_BreakVector_X) == 0x000038, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_BreakVector_Y) == 0x000040, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_BreakVector_Z) == 0x000048, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_Add_FloatFloat_B_ImplicitCast) == 0x000070, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_Add_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_Add_FloatFloat_A_ImplicitCast) == 0x000074, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_Add_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetFocalPointPosition, CallFunc_MakeVector_Z_ImplicitCast) == 0x000078, "Member 'Pickup_C_GetFocalPointPosition::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function Pickup.Pickup_C.GetRotationToSnapPoint
// 0x0060 (0x0060 - 0x0000)
struct Pickup_C_GetRotationToSnapPoint final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_C_GetRotationToSnapPoint) == 0x000008, "Wrong alignment on Pickup_C_GetRotationToSnapPoint");
static_assert(sizeof(Pickup_C_GetRotationToSnapPoint) == 0x000060, "Wrong size on Pickup_C_GetRotationToSnapPoint");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, Player) == 0x000000, "Member 'Pickup_C_GetRotationToSnapPoint::Player' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, ReturnValue) == 0x000008, "Member 'Pickup_C_GetRotationToSnapPoint::ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, CallFunc_GetControlRotation_ReturnValue) == 0x000020, "Member 'Pickup_C_GetRotationToSnapPoint::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'Pickup_C_GetRotationToSnapPoint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'Pickup_C_GetRotationToSnapPoint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'Pickup_C_GetRotationToSnapPoint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Pickup_C_GetRotationToSnapPoint, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'Pickup_C_GetRotationToSnapPoint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

}

