#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PounceAttackOpenSubstateCosmetic_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.OnLungeAttackStartCosmetic
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackStartCosmetic::Killer' has a wrong offset!");

// Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.OnLungeAttackEndCosmetic
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_OnLungeAttackEndCosmetic::Killer' has a wrong offset!");

// Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.OnLocallyObservedChangedCosmetic
// 0x0008 (0x0008 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic final
{
public:
	class ADBDPlayer*                             Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic) == 0x000008, "Wrong size on PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic, Killer) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_OnLocallyObservedChangedCosmetic::Killer' has a wrong offset!");

// Function PounceAttackOpenSubstateCosmetic_BP.PounceAttackOpenSubstateCosmetic_BP_C.ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP
// 0x0070 (0x0070 - 0x0000)
struct PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_Killer_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_Killer_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General;           // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_1;         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue_1;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_Killer;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLungeAttackAugmented_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_2;         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue_2;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP) == 0x000008, "Wrong alignment on PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP");
static_assert(sizeof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP) == 0x000070, "Wrong size on PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, EntryPoint) == 0x000000, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_Event_Killer_2) == 0x000008, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_Event_Killer_2' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_Event_Killer_1) == 0x000010, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_Event_Killer_1' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_DynamicCast_AsBPI_Effect_General) == 0x000018, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_DynamicCast_AsBPI_Effect_General' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_DynamicCast_AsBPI_Effect_General_1) == 0x000030, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_DynamicCast_AsBPI_Effect_General_1' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, CallFunc_IsLocallyObserved_ReturnValue) == 0x000041, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::CallFunc_IsLocallyObserved_ReturnValue' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, CallFunc_IsLocallyObserved_ReturnValue_1) == 0x000042, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::CallFunc_IsLocallyObserved_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_Event_Killer) == 0x000048, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_Event_Killer' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, CallFunc_IsLungeAttackAugmented_ReturnValue) == 0x000050, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::CallFunc_IsLungeAttackAugmented_ReturnValue' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_DynamicCast_AsBPI_Effect_General_2) == 0x000058, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_DynamicCast_AsBPI_Effect_General_2' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, CallFunc_IsLocallyObserved_ReturnValue_2) == 0x000069, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::CallFunc_IsLocallyObserved_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'PounceAttackOpenSubstateCosmetic_BP_C_ExecuteUbergraph_PounceAttackOpenSubstateCosmetic_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

