#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PounceAttackOpenSubstate_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function PounceAttackOpenSubstate_BP.PounceAttackOpenSubstate_BP_C.IsLungeAttackAugmented
// 0x0020 (0x0020 - 0x0000)
struct PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented final
{
public:
	class ADBDPlayer*                             Slasher_Player;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsLungeAttackAugmented;                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerkModifier_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerkModifier_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented) == 0x000008, "Wrong alignment on PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented");
static_assert(sizeof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented) == 0x000020, "Wrong size on PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, Slasher_Player) == 0x000000, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::Slasher_Player' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, Param_IsLungeAttackAugmented) == 0x000008, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::Param_IsLungeAttackAugmented' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, CallFunc_GetPerkModifier_ReturnValue) == 0x00000C, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::CallFunc_GetPerkModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000011, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, CallFunc_GetPerkModifier_ReturnValue_1) == 0x000014, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::CallFunc_GetPerkModifier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000018, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'PounceAttackOpenSubstate_BP_C_IsLungeAttackAugmented::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

