#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PreviewScene

#include "Basic.hpp"

#include "PreviewScene_structs.hpp"


namespace SDK::Params
{

// Function PreviewScene.PreviewSceneHandleLibrary.GetPreviewSceneActorsOfClassFromHandle
// 0x0050 (0x0050 - 0x0000)
struct PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0030(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActors;                                         // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle");
static_assert(sizeof(PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle) == 0x000050, "Wrong size on PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle, ActorClass) == 0x000030, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle::ActorClass' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle, OutActors) == 0x000038, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle::OutActors' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle, ReturnValue) == 0x000048, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneActorsOfClassFromHandle::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.GetPreviewSceneCaptureActorFromHandle
// 0x0038 (0x0038 - 0x0000)
struct PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ASceneCapture2D*                        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle");
static_assert(sizeof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle) == 0x000038, "Wrong size on PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle, ReturnValue) == 0x000030, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneCaptureActorFromHandle::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.GetPreviewSceneCaptureComponentFromHandle
// 0x0038 (0x0038 - 0x0000)
struct PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class USceneCaptureComponent2D*               ReturnValue;                                       // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle");
static_assert(sizeof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle) == 0x000038, "Wrong size on PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle, ReturnValue) == 0x000030, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneCaptureComponentFromHandle::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.GetPreviewSceneFirstActorOfClassFromHandle
// 0x0040 (0x0040 - 0x0000)
struct PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0030(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle");
static_assert(sizeof(PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle) == 0x000040, "Wrong size on PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle, ActorClass) == 0x000030, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle::ActorClass' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle, ReturnValue) == 0x000038, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneFirstActorOfClassFromHandle::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.GetPreviewSceneFromHandle
// 0x0058 (0x0058 - 0x0000)
struct PreviewSceneHandleLibrary_GetPreviewSceneFromHandle final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPreviewRenderScene                    ReturnValue;                                       // 0x0030(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreviewSceneHandleLibrary_GetPreviewSceneFromHandle) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_GetPreviewSceneFromHandle");
static_assert(sizeof(PreviewSceneHandleLibrary_GetPreviewSceneFromHandle) == 0x000058, "Wrong size on PreviewSceneHandleLibrary_GetPreviewSceneFromHandle");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneFromHandle, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneFromHandle::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneFromHandle, ReturnValue) == 0x000030, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneFromHandle::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.GetPreviewSceneNameFromHandle
// 0x0040 (0x0040 - 0x0000)
struct PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle");
static_assert(sizeof(PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle) == 0x000040, "Wrong size on PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle, ReturnValue) == 0x000030, "Member 'PreviewSceneHandleLibrary_GetPreviewSceneNameFromHandle::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.IsPreviewSceneHandleValid
// 0x0038 (0x0038 - 0x0000)
struct PreviewSceneHandleLibrary_IsPreviewSceneHandleValid final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValid) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_IsPreviewSceneHandleValid");
static_assert(sizeof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValid) == 0x000038, "Wrong size on PreviewSceneHandleLibrary_IsPreviewSceneHandleValid");
static_assert(offsetof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValid, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_IsPreviewSceneHandleValid::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValid, ReturnValue) == 0x000030, "Member 'PreviewSceneHandleLibrary_IsPreviewSceneHandleValid::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneHandleLibrary.IsPreviewSceneHandleValidExec
// 0x0038 (0x0038 - 0x0000)
struct PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec final
{
public:
	struct FPreviewSceneHandle                    Handle;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec) == 0x000008, "Wrong alignment on PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec");
static_assert(sizeof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec) == 0x000038, "Wrong size on PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec");
static_assert(offsetof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec, Handle) == 0x000000, "Member 'PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec::Handle' has a wrong offset!");
static_assert(offsetof(PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec, ReturnValue) == 0x000030, "Member 'PreviewSceneHandleLibrary_IsPreviewSceneHandleValidExec::ReturnValue' has a wrong offset!");

// Function PreviewScene.PreviewSceneProvider.GetScenes
// 0x0050 (0x0050 - 0x0000)
struct PreviewSceneProvider_GetScenes final
{
public:
	TMap<class FName, struct FPreviewSceneList>   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PreviewSceneProvider_GetScenes) == 0x000008, "Wrong alignment on PreviewSceneProvider_GetScenes");
static_assert(sizeof(PreviewSceneProvider_GetScenes) == 0x000050, "Wrong size on PreviewSceneProvider_GetScenes");
static_assert(offsetof(PreviewSceneProvider_GetScenes, ReturnValue) == 0x000000, "Member 'PreviewSceneProvider_GetScenes::ReturnValue' has a wrong offset!");

}

