#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ProceduralLevel.ProceduralLevel_C
// 0x00D8 (0x0380 - 0x02A8)
class AProceduralLevel_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         KillerIntroCameraPanInTimeline_KillerIntroCameraPanInProgress_90DDCDC0413917EC974D058D1C1E7EB7; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            KillerIntroCameraPanInTimeline__Direction_90DDCDC0413917EC974D058D1C1E7EB7; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     KillerIntroCameraPanInTimeline;                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CameraUpdateTimeline_Rotation_8EB8A9204B1A077AD4878D9169A5E619; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CameraUpdateTimeline__Direction_8EB8A9204B1A077AD4878D9169A5E619; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CameraUpdateTimeline;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInTimeline_fade_510A37DA46429F2572AB1DA832B4246A; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeInTimeline__Direction_510A37DA46429F2572AB1DA832B4246A; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeInTimeline;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PlayerPawn;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       PlayerCam;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        OriginalAspectRatio;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKiller;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayerController*                   PlayerController;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpectator;                                       // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraTransformBeforeKillerIntroPanIn;             // 0x0320(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CameraUpdateTimeline__FinishedFunc();
	void CameraUpdateTimeline__UpdateFunc();
	void ExecuteUbergraph_ProceduralLevel(int32 EntryPoint);
	void FadeInTimeline__FinishedFunc();
	void FadeInTimeline__UpdateFunc();
	void FinalizeIntro();
	void GetLocalPlayer(class UCameraComponent** Param_PlayerCam, class ADBDPlayer** Param_PlayerPawn, class ADBDPlayerController** Param_PlayerController, class APlayerCameraManager** Param_PlayerCameraManager);
	bool IsLevelReady();
	void KillerIntroCameraPanInTimeline__FinishedFunc();
	void KillerIntroCameraPanInTimeline__UpdateFunc();
	void OnLocalPlayerGameStateChanged(class ADBDPlayerState* PlayerState, EGameState NewGameState);
	void OnLocalPlayerStateChanged(const class APlayerState* PlayerState);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetupIntro();
	bool ShouldUpdateCameraPanInTimeline();
	void UpdateCamera(double Yaw);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProceduralLevel_C">();
	}
	static class AProceduralLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProceduralLevel_C>();
	}
};
static_assert(alignof(AProceduralLevel_C) == 0x000010, "Wrong alignment on AProceduralLevel_C");
static_assert(sizeof(AProceduralLevel_C) == 0x000380, "Wrong size on AProceduralLevel_C");
static_assert(offsetof(AProceduralLevel_C, UberGraphFrame) == 0x0002A8, "Member 'AProceduralLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, KillerIntroCameraPanInTimeline_KillerIntroCameraPanInProgress_90DDCDC0413917EC974D058D1C1E7EB7) == 0x0002B0, "Member 'AProceduralLevel_C::KillerIntroCameraPanInTimeline_KillerIntroCameraPanInProgress_90DDCDC0413917EC974D058D1C1E7EB7' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, KillerIntroCameraPanInTimeline__Direction_90DDCDC0413917EC974D058D1C1E7EB7) == 0x0002B4, "Member 'AProceduralLevel_C::KillerIntroCameraPanInTimeline__Direction_90DDCDC0413917EC974D058D1C1E7EB7' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, KillerIntroCameraPanInTimeline) == 0x0002B8, "Member 'AProceduralLevel_C::KillerIntroCameraPanInTimeline' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, CameraUpdateTimeline_Rotation_8EB8A9204B1A077AD4878D9169A5E619) == 0x0002C0, "Member 'AProceduralLevel_C::CameraUpdateTimeline_Rotation_8EB8A9204B1A077AD4878D9169A5E619' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, CameraUpdateTimeline__Direction_8EB8A9204B1A077AD4878D9169A5E619) == 0x0002C4, "Member 'AProceduralLevel_C::CameraUpdateTimeline__Direction_8EB8A9204B1A077AD4878D9169A5E619' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, CameraUpdateTimeline) == 0x0002C8, "Member 'AProceduralLevel_C::CameraUpdateTimeline' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, FadeInTimeline_fade_510A37DA46429F2572AB1DA832B4246A) == 0x0002D0, "Member 'AProceduralLevel_C::FadeInTimeline_fade_510A37DA46429F2572AB1DA832B4246A' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, FadeInTimeline__Direction_510A37DA46429F2572AB1DA832B4246A) == 0x0002D4, "Member 'AProceduralLevel_C::FadeInTimeline__Direction_510A37DA46429F2572AB1DA832B4246A' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, FadeInTimeline) == 0x0002D8, "Member 'AProceduralLevel_C::FadeInTimeline' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, PlayerPawn) == 0x0002E0, "Member 'AProceduralLevel_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, PlayerCam) == 0x0002E8, "Member 'AProceduralLevel_C::PlayerCam' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, OriginalAspectRatio) == 0x0002F0, "Member 'AProceduralLevel_C::OriginalAspectRatio' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, IsKiller) == 0x0002F8, "Member 'AProceduralLevel_C::IsKiller' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, PlayerController) == 0x000300, "Member 'AProceduralLevel_C::PlayerController' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, IsSpectator) == 0x000308, "Member 'AProceduralLevel_C::IsSpectator' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, PlayerCameraManager) == 0x000310, "Member 'AProceduralLevel_C::PlayerCameraManager' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, Initialized) == 0x000318, "Member 'AProceduralLevel_C::Initialized' has a wrong offset!");
static_assert(offsetof(AProceduralLevel_C, CameraTransformBeforeKillerIntroPanIn) == 0x000320, "Member 'AProceduralLevel_C::CameraTransformBeforeKillerIntroPanIn' has a wrong offset!");

}

