#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PullDownsAnimBP

#include "Basic.hpp"

#include "PullDownsAnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PullDownsAnimBP.PullDownsAnimBP_C
// 0x05A0 (0x0930 - 0x0390)
class UPullDownsAnimBP_C final : public UPalletAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct PullDownsAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0398(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x03D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x04C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0560(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0588(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x05D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x05F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0638(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0658(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x06A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x06C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0708(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0728(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0770(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0790(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x07D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x07F8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x08C0(0x0050)()
	FMulticastInlineDelegateProperty_             OnFallen;                                          // 0x0910(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPulledUp;                                        // 0x0920(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnPulledUp__DelegateSignature();
	void OnFallen__DelegateSignature();
	void ExecuteUbergraph_PullDownsAnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PullDownsAnimBP_AnimGraphNode_TransitionResult_F37B68F44B9935A16B73FE9E64960ACE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PullDownsAnimBP_AnimGraphNode_TransitionResult_39F5DE904A9EAA3C8715B0A2E0EA0FC1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PullDownsAnimBP_AnimGraphNode_TransitionResult_24D000304C7645E7BAC195B94C8D722D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PullDownsAnimBP_AnimGraphNode_TransitionResult_01E76F8A4BD97F85FF81DFB113BD462C();
	void AnimNotify_PullUp_Complete();
	void AnimNotify_OnFallen();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PullDownsAnimBP_C">();
	}
	static class UPullDownsAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPullDownsAnimBP_C>();
	}
};
static_assert(alignof(UPullDownsAnimBP_C) == 0x000010, "Wrong alignment on UPullDownsAnimBP_C");
static_assert(sizeof(UPullDownsAnimBP_C) == 0x000930, "Wrong size on UPullDownsAnimBP_C");
static_assert(offsetof(UPullDownsAnimBP_C, UberGraphFrame) == 0x000390, "Member 'UPullDownsAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, __AnimBlueprintMutables) == 0x000398, "Member 'UPullDownsAnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A0, "Member 'UPullDownsAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimBlueprintExtension_Base) == 0x0003A8, "Member 'UPullDownsAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_Root) == 0x0003B0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_10) == 0x0003D0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_9) == 0x0003F8, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000420, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000448, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000470, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000498, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0004C0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0004E8, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000510, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000538, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_TransitionResult) == 0x000560, "Member 'UPullDownsAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000588, "Member 'UPullDownsAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateResult_5) == 0x0005D0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0005F0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateResult_4) == 0x000638, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000658, "Member 'UPullDownsAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateResult_3) == 0x0006A0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0006C0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateResult_2) == 0x000708, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000728, "Member 'UPullDownsAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateResult_1) == 0x000770, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000790, "Member 'UPullDownsAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateResult) == 0x0007D8, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_StateMachine) == 0x0007F8, "Member 'UPullDownsAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, AnimGraphNode_Slot) == 0x0008C0, "Member 'UPullDownsAnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, OnFallen) == 0x000910, "Member 'UPullDownsAnimBP_C::OnFallen' has a wrong offset!");
static_assert(offsetof(UPullDownsAnimBP_C, OnPulledUp) == 0x000920, "Member 'UPullDownsAnimBP_C::OnPulledUp' has a wrong offset!");

}

