#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PulldownDefinition

#include "Basic.hpp"


namespace SDK::Params
{

// Function PulldownDefinition.PulldownDefinition_C.GetPulldown
// 0x0020 (0x0020 - 0x0000)
struct PulldownDefinition_C_GetPulldown final
{
public:
	class APallet*                                AsPallet;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APallet*                                K2Node_DynamicCast_AsPallet;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownDefinition_C_GetPulldown) == 0x000008, "Wrong alignment on PulldownDefinition_C_GetPulldown");
static_assert(sizeof(PulldownDefinition_C_GetPulldown) == 0x000020, "Wrong size on PulldownDefinition_C_GetPulldown");
static_assert(offsetof(PulldownDefinition_C_GetPulldown, AsPallet) == 0x000000, "Member 'PulldownDefinition_C_GetPulldown::AsPallet' has a wrong offset!");
static_assert(offsetof(PulldownDefinition_C_GetPulldown, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'PulldownDefinition_C_GetPulldown::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownDefinition_C_GetPulldown, K2Node_DynamicCast_AsPallet) == 0x000010, "Member 'PulldownDefinition_C_GetPulldown::K2Node_DynamicCast_AsPallet' has a wrong offset!");
static_assert(offsetof(PulldownDefinition_C_GetPulldown, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PulldownDefinition_C_GetPulldown::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

