#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PulldownWhileCarriedByKiller

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.ExecuteUbergraph_PulldownWhileCarriedByKiller
// 0x0010 (0x0010 - 0x0000)
struct PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller) == 0x000010, "Wrong size on PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller, EntryPoint) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller::EntryPoint' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller, K2Node_Event_player) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_ExecuteUbergraph_PulldownWhileCarriedByKiller::K2Node_Event_player' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.IsPulldownInteractionPossible
// 0x0010 (0x0010 - 0x0000)
struct PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwningCamperCarriedByKiller_IsCamperCarriedByKiller; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible) == 0x000010, "Wrong size on PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible, Player) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible::Player' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible, ReturnValue) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible, CallFunc_IsOwningCamperCarriedByKiller_IsCamperCarriedByKiller) == 0x000009, "Member 'PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible::CallFunc_IsOwningCamperCarriedByKiller_IsCamperCarriedByKiller' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible, CallFunc_HasPerkFlag_ReturnValue) == 0x00000A, "Member 'PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'PulldownWhileCarriedByKiller_C_IsPulldownInteractionPossible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.IsOwningCamperCarriedByKiller
// 0x0020 (0x0020 - 0x0000)
struct PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCamperCarriedByKiller;                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetOwiningCamper_AsCamperPlayer;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingCarried_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller) == 0x000020, "Wrong size on PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller, Player) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller::Player' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller, IsCamperCarriedByKiller) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller::IsCamperCarriedByKiller' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller, CallFunc_GetOwiningCamper_AsCamperPlayer) == 0x000010, "Member 'PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller::CallFunc_GetOwiningCamper_AsCamperPlayer' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller, CallFunc_IsBeingCarried_ReturnValue) == 0x000018, "Member 'PulldownWhileCarriedByKiller_C_IsOwningCamperCarriedByKiller::CallFunc_IsBeingCarried_ReturnValue' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.IsInteractionPossibleClient
// 0x0010 (0x0010 - 0x0000)
struct PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPulldownInteractionPossible_ReturnValue; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionPossibleClient_ReturnValue;  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient) == 0x000010, "Wrong size on PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient, Player) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient::Player' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient, InteractionType) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient::InteractionType' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient, ReturnValue) == 0x000009, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient, CallFunc_IsPulldownInteractionPossible_ReturnValue) == 0x00000A, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient::CallFunc_IsPulldownInteractionPossible_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient, CallFunc_IsInteractionPossibleClient_ReturnValue) == 0x00000B, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient::CallFunc_IsInteractionPossibleClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleClient::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.IsInteractionPossibleBP
// 0x0010 (0x0010 - 0x0000)
struct PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPulldownInteractionPossible_ReturnValue; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionPossibleBP_ReturnValue;      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP) == 0x000010, "Wrong size on PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP, CallFunc_IsPulldownInteractionPossible_ReturnValue) == 0x00000A, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP::CallFunc_IsPulldownInteractionPossible_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP, CallFunc_IsInteractionPossibleBP_ReturnValue) == 0x00000B, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP::CallFunc_IsInteractionPossibleBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'PulldownWhileCarriedByKiller_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.GetOwiningCamper
// 0x0020 (0x0020 - 0x0000)
struct PulldownWhileCarriedByKiller_C_GetOwiningCamper final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          AsCamperPlayer;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_GetOwiningCamper) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_GetOwiningCamper");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_GetOwiningCamper) == 0x000020, "Wrong size on PulldownWhileCarriedByKiller_C_GetOwiningCamper");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_GetOwiningCamper, Player) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_GetOwiningCamper::Player' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_GetOwiningCamper, AsCamperPlayer) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_GetOwiningCamper::AsCamperPlayer' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_GetOwiningCamper, K2Node_DynamicCast_AsCamper_Player) == 0x000010, "Member 'PulldownWhileCarriedByKiller_C_GetOwiningCamper::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_GetOwiningCamper, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PulldownWhileCarriedByKiller_C_GetOwiningCamper::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PulldownWhileCarriedByKiller.PulldownWhileCarriedByKiller_C.CanOverrideInteraction
// 0x0010 (0x0010 - 0x0000)
struct PulldownWhileCarriedByKiller_C_CanOverrideInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOverrideInteraction_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction) == 0x000008, "Wrong alignment on PulldownWhileCarriedByKiller_C_CanOverrideInteraction");
static_assert(sizeof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction) == 0x000010, "Wrong size on PulldownWhileCarriedByKiller_C_CanOverrideInteraction");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction, Interaction) == 0x000000, "Member 'PulldownWhileCarriedByKiller_C_CanOverrideInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction, ReturnValue) == 0x000008, "Member 'PulldownWhileCarriedByKiller_C_CanOverrideInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction, CallFunc_CanOverrideInteraction_ReturnValue) == 0x000009, "Member 'PulldownWhileCarriedByKiller_C_CanOverrideInteraction::CallFunc_CanOverrideInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00000A, "Member 'PulldownWhileCarriedByKiller_C_CanOverrideInteraction::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownWhileCarriedByKiller_C_CanOverrideInteraction, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'PulldownWhileCarriedByKiller_C_CanOverrideInteraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

