#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PullDownsAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PullDownsAnimBP.PullDownsAnimBP_C.ExecuteUbergraph_PullDownsAnimBP
// 0x0018 (0x0018 - 0x0000)
struct PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP) == 0x000004, "Wrong alignment on PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP");
static_assert(sizeof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP) == 0x000018, "Wrong size on PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, EntryPoint) == 0x000000, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000004, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000A, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000C, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00000D, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1) == 0x000010, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000014, "Member 'PullDownsAnimBP_C_ExecuteUbergraph_PullDownsAnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function PullDownsAnimBP.PullDownsAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PullDownsAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PullDownsAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on PullDownsAnimBP_C_AnimGraph");
static_assert(sizeof(PullDownsAnimBP_C_AnimGraph) == 0x000010, "Wrong size on PullDownsAnimBP_C_AnimGraph");
static_assert(offsetof(PullDownsAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'PullDownsAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

