#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PulldownAcrossDefinition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.OnInteractionUpdateTick
// 0x0010 (0x0010 - 0x0000)
struct PulldownAcrossDefinition_C_OnInteractionUpdateTick final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_OnInteractionUpdateTick) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_OnInteractionUpdateTick");
static_assert(sizeof(PulldownAcrossDefinition_C_OnInteractionUpdateTick) == 0x000010, "Wrong size on PulldownAcrossDefinition_C_OnInteractionUpdateTick");
static_assert(offsetof(PulldownAcrossDefinition_C_OnInteractionUpdateTick, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_OnInteractionUpdateTick::Player' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_OnInteractionUpdateTick, DeltaTime) == 0x000008, "Member 'PulldownAcrossDefinition_C_OnInteractionUpdateTick::DeltaTime' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.OnInteractionUpdateStart
// 0x0008 (0x0008 - 0x0000)
struct PulldownAcrossDefinition_C_OnInteractionUpdateStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_OnInteractionUpdateStart) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_OnInteractionUpdateStart");
static_assert(sizeof(PulldownAcrossDefinition_C_OnInteractionUpdateStart) == 0x000008, "Wrong size on PulldownAcrossDefinition_C_OnInteractionUpdateStart");
static_assert(offsetof(PulldownAcrossDefinition_C_OnInteractionUpdateStart, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_OnInteractionUpdateStart::Player' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.OnInteractionUpdateEnd
// 0x0008 (0x0008 - 0x0000)
struct PulldownAcrossDefinition_C_OnInteractionUpdateEnd final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_OnInteractionUpdateEnd) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_OnInteractionUpdateEnd");
static_assert(sizeof(PulldownAcrossDefinition_C_OnInteractionUpdateEnd) == 0x000008, "Wrong size on PulldownAcrossDefinition_C_OnInteractionUpdateEnd");
static_assert(offsetof(PulldownAcrossDefinition_C_OnInteractionUpdateEnd, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_OnInteractionUpdateEnd::Player' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct PulldownAcrossDefinition_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_OnInteractionEnterStart");
static_assert(sizeof(PulldownAcrossDefinition_C_OnInteractionEnterStart) == 0x000010, "Wrong size on PulldownAcrossDefinition_C_OnInteractionEnterStart");
static_assert(offsetof(PulldownAcrossDefinition_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'PulldownAcrossDefinition_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.ExecuteUbergraph_PulldownAcrossDefinition
// 0x00B8 (0x00B8 - 0x0000)
struct PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APallet*                                CallFunc_GetPulldown_Pulldown;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_2;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_deltaTime;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDone_ReturnValue;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APallet*                                CallFunc_GetPulldown_Pulldown_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFallDuration_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APallet*                                CallFunc_GetPulldown_Pulldown_2;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_3;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APallet*                                CallFunc_GetPulldown_Pulldown_3;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScoreEventData                        K2Node_MakeStruct_ScoreEventData;                  // 0x0080(0x0018)(NoDestructor)
	struct FPalletPushSettings                    Temp_struct_Variable;                              // 0x0098(0x0002)(ConstParm, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChaseComponent*                        CallFunc_GetChaseComponent_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInChase_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition");
static_assert(sizeof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition) == 0x0000B8, "Wrong size on PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, EntryPoint) == 0x000000, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::EntryPoint' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetPulldown_Pulldown) == 0x000008, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetPulldown_Pulldown' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_Event_player_2) == 0x000010, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_Event_deltaTime) == 0x000018, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_IsDone_ReturnValue) == 0x00001C, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_IsDone_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetPulldown_Pulldown_1) == 0x000020, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetPulldown_Pulldown_1' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_Event_player_1) == 0x000028, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetFallDuration_ReturnValue) == 0x000030, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetFallDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetPulldown_Pulldown_2) == 0x000038, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetPulldown_Pulldown_2' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_Event_player_3) == 0x000040, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_Event_actualSnapTime) == 0x000048, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetPulldown_Pulldown_3) == 0x000050, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetPulldown_Pulldown_3' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetTunableValue_ReturnValue) == 0x000058, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_MakeStruct_ScoreEventData) == 0x000080, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_MakeStruct_ScoreEventData' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, Temp_struct_Variable) == 0x000098, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, K2Node_Event_player) == 0x0000A0, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_GetChaseComponent_ReturnValue) == 0x0000A8, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_GetChaseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_IsInChase_ReturnValue) == 0x0000B0, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_IsInChase_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_HasAuthority_ReturnValue) == 0x0000B1, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'PulldownAcrossDefinition_C_ExecuteUbergraph_PulldownAcrossDefinition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.IsInteractionPossibleClient
// 0x0040 (0x0040 - 0x0000)
struct PulldownAcrossDefinition_C_IsInteractionPossibleClient final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsInteractionPossible;                       // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APallet*                                CallFunc_GetPulldown_Pulldown;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlag_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPulldown_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_IsInteractionPossibleClient) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_IsInteractionPossibleClient");
static_assert(sizeof(PulldownAcrossDefinition_C_IsInteractionPossibleClient) == 0x000040, "Wrong size on PulldownAcrossDefinition_C_IsInteractionPossibleClient");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::Player' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, InteractionType) == 0x000008, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::InteractionType' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, ReturnValue) == 0x000009, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, Param_IsInteractionPossible) == 0x00000A, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::Param_IsInteractionPossible' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_GetPulldown_Pulldown) == 0x000010, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_GetPulldown_Pulldown' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_GetPerkManager_ReturnValue) == 0x000018, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_HasPerkFlag_ReturnValue) == 0x000038, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_HasPerkFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_CanPulldown_ReturnValue) == 0x000039, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_CanPulldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleClient, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleClient::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.IsInteractionPossibleBP
// 0x0028 (0x0028 - 0x0000)
struct PulldownAcrossDefinition_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsInteractionPossible;                       // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractable*                          CallFunc_GetInteractable_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APallet*                                K2Node_DynamicCast_AsPallet;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPulledDown_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_IsInteractionPossibleBP");
static_assert(sizeof(PulldownAcrossDefinition_C_IsInteractionPossibleBP) == 0x000028, "Wrong size on PulldownAcrossDefinition_C_IsInteractionPossibleBP");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, Param_IsInteractionPossible) == 0x00000A, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::Param_IsInteractionPossible' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, CallFunc_GetInteractable_ReturnValue) == 0x000010, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::CallFunc_GetInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, K2Node_DynamicCast_AsPallet) == 0x000018, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::K2Node_DynamicCast_AsPallet' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, CallFunc_GetIsPulledDown_ReturnValue) == 0x000021, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::CallFunc_GetIsPulledDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_IsInteractionPossibleBP, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'PulldownAcrossDefinition_C_IsInteractionPossibleBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.GetSnapTime
// 0x00C0 (0x00C0 - 0x0000)
struct PulldownAcrossDefinition_C_GetSnapTime final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SnapSpeed;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSnapPointPosition_ReturnValue;         // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCamperMovementComponent*               K2Node_DynamicCast_AsCamper_Movement_Component;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SnapSpeed_ImplicitCast;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_SnapSpeed_ImplicitCast_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_A_ImplicitCast;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_SnapSpeed_ImplicitCast_2;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_GetSnapTime) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_GetSnapTime");
static_assert(sizeof(PulldownAcrossDefinition_C_GetSnapTime) == 0x0000C0, "Wrong size on PulldownAcrossDefinition_C_GetSnapTime");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, Player) == 0x000000, "Member 'PulldownAcrossDefinition_C_GetSnapTime::Player' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, ReturnValue) == 0x000008, "Member 'PulldownAcrossDefinition_C_GetSnapTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, SnapSpeed) == 0x000010, "Member 'PulldownAcrossDefinition_C_GetSnapTime::SnapSpeed' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_GetSnapPointPosition_ReturnValue) == 0x000038, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_GetSnapPointPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, K2Node_DynamicCast_AsCamper_Movement_Component) == 0x000068, "Member 'PulldownAcrossDefinition_C_GetSnapTime::K2Node_DynamicCast_AsCamper_Movement_Component' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'PulldownAcrossDefinition_C_GetSnapTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_VSize_ReturnValue) == 0x000078, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_FMax_ReturnValue_1) == 0x000080, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000088, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_GetTunableValue_ReturnValue) == 0x00008C, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_Divide_FloatFloat_B_ImplicitCast) == 0x000094, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_Divide_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, K2Node_VariableSet_SnapSpeed_ImplicitCast) == 0x000098, "Member 'PulldownAcrossDefinition_C_GetSnapTime::K2Node_VariableSet_SnapSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_Divide_FloatFloat_A_ImplicitCast) == 0x0000A0, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_Divide_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, K2Node_VariableSet_SnapSpeed_ImplicitCast_1) == 0x0000A8, "Member 'PulldownAcrossDefinition_C_GetSnapTime::K2Node_VariableSet_SnapSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, CallFunc_Add_FloatFloat_A_ImplicitCast) == 0x0000B0, "Member 'PulldownAcrossDefinition_C_GetSnapTime::CallFunc_Add_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetSnapTime, K2Node_VariableSet_SnapSpeed_ImplicitCast_2) == 0x0000B8, "Member 'PulldownAcrossDefinition_C_GetSnapTime::K2Node_VariableSet_SnapSpeed_ImplicitCast_2' has a wrong offset!");

// Function PulldownAcrossDefinition.PulldownAcrossDefinition_C.GetPulldown
// 0x0020 (0x0020 - 0x0000)
struct PulldownAcrossDefinition_C_GetPulldown final
{
public:
	class APallet*                                PullDown;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APallet*                                K2Node_DynamicCast_AsPallet;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PulldownAcrossDefinition_C_GetPulldown) == 0x000008, "Wrong alignment on PulldownAcrossDefinition_C_GetPulldown");
static_assert(sizeof(PulldownAcrossDefinition_C_GetPulldown) == 0x000020, "Wrong size on PulldownAcrossDefinition_C_GetPulldown");
static_assert(offsetof(PulldownAcrossDefinition_C_GetPulldown, PullDown) == 0x000000, "Member 'PulldownAcrossDefinition_C_GetPulldown::PullDown' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetPulldown, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'PulldownAcrossDefinition_C_GetPulldown::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PulldownAcrossDefinition_C_GetPulldown, K2Node_DynamicCast_AsPallet) == 0x000010, "Member 'PulldownAcrossDefinition_C_GetPulldown::K2Node_DynamicCast_AsPallet' has a wrong offset!");
