#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PulldownDestroyWithPowerAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PulldownDestroyWithPowerAttack.PulldownDestroyWithPowerAttack_C
// 0x0040 (0x07C0 - 0x0780)
class UPulldownDestroyWithPowerAttack_C final : public UInteractionDefinition
{
public:
	uint8                                         Pad_778[0x8];                                      // 0x0778(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADBDPlayer*                             DamageTarget;                                      // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EDetectionZone                                DetectionZoneToUseForDamage;                       // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDamageSurvivors;                                // 0x0791(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_792[0x6];                                      // 0x0792(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   DemogorgonPowerRecoveryTime;                       // 0x0798(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnInteractionUpdateStart(class ADBDPlayer* Player);
	void OnInteractionFinished(class ADBDPlayer* Player, bool HasInteractionStarted);
	void OnInteractionEnterTick(class ADBDPlayer* Player, float DeltaTime);
	void OnInteractionEnterStart(class ADBDPlayer* Player, float ActualSnapTime);
	void LocalUpdateDamageTarget(class ADBDPlayer* InteractingPlayer);
	void ExecuteUbergraph_PulldownDestroyWithPowerAttack(int32 EntryPoint);
	void CustomizePropertiesForKiller(class ADBDPlayer* Player);
	void Authority_DamageTarget(class ADBDPlayer* InteractingPlayer, class ADBDPlayer* Param_DamageTarget);

	bool ShouldDealDoubleDamage(class ADBDPlayer* Player) const;
	bool IsInteractionPossibleBP(const class ADBDPlayer* Player, EInputInteractionType InteractionType) const;
	void GetPulldown(class APallet** AsPallet) const;
	bool CanOverrideInteraction(const class UInteractionDefinition* Interaction) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PulldownDestroyWithPowerAttack_C">();
	}
	static class UPulldownDestroyWithPowerAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPulldownDestroyWithPowerAttack_C>();
	}
};
static_assert(alignof(UPulldownDestroyWithPowerAttack_C) == 0x000010, "Wrong alignment on UPulldownDestroyWithPowerAttack_C");
static_assert(sizeof(UPulldownDestroyWithPowerAttack_C) == 0x0007C0, "Wrong size on UPulldownDestroyWithPowerAttack_C");
static_assert(offsetof(UPulldownDestroyWithPowerAttack_C, UberGraphFrame) == 0x000780, "Member 'UPulldownDestroyWithPowerAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPulldownDestroyWithPowerAttack_C, DamageTarget) == 0x000788, "Member 'UPulldownDestroyWithPowerAttack_C::DamageTarget' has a wrong offset!");
static_assert(offsetof(UPulldownDestroyWithPowerAttack_C, DetectionZoneToUseForDamage) == 0x000790, "Member 'UPulldownDestroyWithPowerAttack_C::DetectionZoneToUseForDamage' has a wrong offset!");
static_assert(offsetof(UPulldownDestroyWithPowerAttack_C, CanDamageSurvivors) == 0x000791, "Member 'UPulldownDestroyWithPowerAttack_C::CanDamageSurvivors' has a wrong offset!");
static_assert(offsetof(UPulldownDestroyWithPowerAttack_C, DemogorgonPowerRecoveryTime) == 0x000798, "Member 'UPulldownDestroyWithPowerAttack_C::DemogorgonPowerRecoveryTime' has a wrong offset!");

}

