#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QueryService

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct QueryService.ActorPairQueryHeightRange
// 0x0008 (0x0008 - 0x0000)
struct FActorPairQueryHeightRange final
{
public:
	float                                         _lower;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _upper;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FActorPairQueryHeightRange) == 0x000004, "Wrong alignment on FActorPairQueryHeightRange");
static_assert(sizeof(FActorPairQueryHeightRange) == 0x000008, "Wrong size on FActorPairQueryHeightRange");
static_assert(offsetof(FActorPairQueryHeightRange, _lower) == 0x000000, "Member 'FActorPairQueryHeightRange::_lower' has a wrong offset!");
static_assert(offsetof(FActorPairQueryHeightRange, _upper) == 0x000004, "Member 'FActorPairQueryHeightRange::_upper' has a wrong offset!");

// ScriptStruct QueryService.DistanceTrackerCase
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FDistanceTrackerCase final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _distanceToTrackSquared;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FActorPairQueryHeightRange             _heightRange;                                      // 0x001C(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          _inRange;                                          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDistanceTrackerCase) == 0x000008, "Wrong alignment on FDistanceTrackerCase");
static_assert(sizeof(FDistanceTrackerCase) == 0x000028, "Wrong size on FDistanceTrackerCase");
static_assert(offsetof(FDistanceTrackerCase, _distanceToTrackSquared) == 0x000018, "Member 'FDistanceTrackerCase::_distanceToTrackSquared' has a wrong offset!");
static_assert(offsetof(FDistanceTrackerCase, _heightRange) == 0x00001C, "Member 'FDistanceTrackerCase::_heightRange' has a wrong offset!");
static_assert(offsetof(FDistanceTrackerCase, _inRange) == 0x000024, "Member 'FDistanceTrackerCase::_inRange' has a wrong offset!");

// ScriptStruct QueryService.ActorPairQuery
// 0x0068 (0x0068 - 0x0000)
struct FActorPairQuery final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, struct FDistanceTrackerCase>     _distanceTrackerCases;                             // 0x0010(0x0050)(NativeAccessSpecifierPrivate)
	uint32                                        _caseIndex;                                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _usePlanarDistance;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isHeightRangeLimited;                             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FActorPairQuery) == 0x000008, "Wrong alignment on FActorPairQuery");
static_assert(sizeof(FActorPairQuery) == 0x000068, "Wrong size on FActorPairQuery");
static_assert(offsetof(FActorPairQuery, _distanceTrackerCases) == 0x000010, "Member 'FActorPairQuery::_distanceTrackerCases' has a wrong offset!");
static_assert(offsetof(FActorPairQuery, _caseIndex) == 0x000060, "Member 'FActorPairQuery::_caseIndex' has a wrong offset!");
static_assert(offsetof(FActorPairQuery, _usePlanarDistance) == 0x000064, "Member 'FActorPairQuery::_usePlanarDistance' has a wrong offset!");
static_assert(offsetof(FActorPairQuery, _isHeightRangeLimited) == 0x000065, "Member 'FActorPairQuery::_isHeightRangeLimited' has a wrong offset!");

}

