#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Recover

#include "Basic.hpp"


namespace SDK::Params
{

// Function Recover.Recover_C.GetCamperInteractable
// 0x0020 (0x0020 - 0x0000)
struct Recover_C_GetCamperInteractable final
{
public:
	class ACamperInteractable*                    CamperInteractable;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACamperInteractable*                    K2Node_DynamicCast_AsCamper_Interactable;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Recover_C_GetCamperInteractable) == 0x000008, "Wrong alignment on Recover_C_GetCamperInteractable");
static_assert(sizeof(Recover_C_GetCamperInteractable) == 0x000020, "Wrong size on Recover_C_GetCamperInteractable");
static_assert(offsetof(Recover_C_GetCamperInteractable, CamperInteractable) == 0x000000, "Member 'Recover_C_GetCamperInteractable::CamperInteractable' has a wrong offset!");
static_assert(offsetof(Recover_C_GetCamperInteractable, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Recover_C_GetCamperInteractable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Recover_C_GetCamperInteractable, K2Node_DynamicCast_AsCamper_Interactable) == 0x000010, "Member 'Recover_C_GetCamperInteractable::K2Node_DynamicCast_AsCamper_Interactable' has a wrong offset!");
static_assert(offsetof(Recover_C_GetCamperInteractable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Recover_C_GetCamperInteractable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Recover.Recover_C.IsKillerInteracting
// 0x0020 (0x0020 - 0x0000)
struct Recover_C_IsKillerInteracting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperInteractable*                    CallFunc_GetCamperInteractable_CamperInteractable; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractor*                            CallFunc_GetSlasherInteractor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteracting_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Recover_C_IsKillerInteracting) == 0x000008, "Wrong alignment on Recover_C_IsKillerInteracting");
static_assert(sizeof(Recover_C_IsKillerInteracting) == 0x000020, "Wrong size on Recover_C_IsKillerInteracting");
static_assert(offsetof(Recover_C_IsKillerInteracting, ReturnValue) == 0x000000, "Member 'Recover_C_IsKillerInteracting::ReturnValue' has a wrong offset!");
static_assert(offsetof(Recover_C_IsKillerInteracting, CallFunc_GetCamperInteractable_CamperInteractable) == 0x000008, "Member 'Recover_C_IsKillerInteracting::CallFunc_GetCamperInteractable_CamperInteractable' has a wrong offset!");
static_assert(offsetof(Recover_C_IsKillerInteracting, CallFunc_GetSlasherInteractor_ReturnValue) == 0x000010, "Member 'Recover_C_IsKillerInteracting::CallFunc_GetSlasherInteractor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Recover_C_IsKillerInteracting, CallFunc_IsInteracting_ReturnValue) == 0x000018, "Member 'Recover_C_IsKillerInteracting::CallFunc_IsInteracting_ReturnValue' has a wrong offset!");

}

