#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReduceGeneratorSkillCheckReward

#include "Basic.hpp"


namespace SDK::Params
{

// Function ReduceGeneratorSkillCheckReward.ReduceGeneratorSkillCheckReward_C.ExecuteUbergraph_ReduceGeneratorSkillCheckReward
// 0x0008 (0x0008 - 0x0000)
struct ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward) == 0x000004, "Wrong alignment on ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward");
static_assert(sizeof(ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward) == 0x000008, "Wrong size on ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward");
static_assert(offsetof(ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward, EntryPoint) == 0x000000, "Member 'ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'ReduceGeneratorSkillCheckReward_C_ExecuteUbergraph_ReduceGeneratorSkillCheckReward::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function ReduceGeneratorSkillCheckReward.ReduceGeneratorSkillCheckReward_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ReduceGeneratorSkillCheckReward_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReduceGeneratorSkillCheckReward_C_ReceiveTick) == 0x000004, "Wrong alignment on ReduceGeneratorSkillCheckReward_C_ReceiveTick");
static_assert(sizeof(ReduceGeneratorSkillCheckReward_C_ReceiveTick) == 0x000004, "Wrong size on ReduceGeneratorSkillCheckReward_C_ReceiveTick");
static_assert(offsetof(ReduceGeneratorSkillCheckReward_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ReduceGeneratorSkillCheckReward_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

