#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteContentCache

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RemoteContentCache.TestObject
// 0x0010 (0x0040 - 0x0030)
class UTestObject final : public UObject
{
public:
	TArray<uint8>                                 TestBytes;                                         // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestObject">();
	}
	static class UTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestObject>();
	}
};
static_assert(alignof(UTestObject) == 0x000008, "Wrong alignment on UTestObject");
static_assert(sizeof(UTestObject) == 0x000040, "Wrong size on UTestObject");
static_assert(offsetof(UTestObject, TestBytes) == 0x000030, "Member 'UTestObject::TestBytes' has a wrong offset!");

// Class RemoteContentCache.RemoteContentCacheSubsystem
// 0x00A8 (0x00E0 - 0x0038)
class URemoteContentCacheSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_38[0xA8];                                      // 0x0038(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteContentCacheSubsystem">();
	}
	static class URemoteContentCacheSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteContentCacheSubsystem>();
	}
};
static_assert(alignof(URemoteContentCacheSubsystem) == 0x000008, "Wrong alignment on URemoteContentCacheSubsystem");
static_assert(sizeof(URemoteContentCacheSubsystem) == 0x0000E0, "Wrong size on URemoteContentCacheSubsystem");

// Class RemoteContentCache.RemoteTextEncodeString
// 0x0010 (0x0040 - 0x0030)
class URemoteTextEncodeString final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteTextEncodeString">();
	}
	static class URemoteTextEncodeString* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteTextEncodeString>();
	}
};
static_assert(alignof(URemoteTextEncodeString) == 0x000008, "Wrong alignment on URemoteTextEncodeString");
static_assert(sizeof(URemoteTextEncodeString) == 0x000040, "Wrong size on URemoteTextEncodeString");

// Class RemoteContentCache.AsyncLoadSoftPtrAsTexture2DNode
// 0x0098 (0x00D0 - 0x0038)
class UAsyncLoadSoftPtrAsTexture2DNode final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             Loaded;                                            // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             LoadFailed;                                        // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x78];                                      // 0x0058(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncLoadSoftPtrAsTexture2DNode* LoadAsTexture2D(class UObject* WorldContextObject, const struct FSoftRemoteContentCacheObjectPtr& PtrToLoad);

	void SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature(class UTexture2D* LoadedTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncLoadSoftPtrAsTexture2DNode">();
	}
	static class UAsyncLoadSoftPtrAsTexture2DNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncLoadSoftPtrAsTexture2DNode>();
	}
};
static_assert(alignof(UAsyncLoadSoftPtrAsTexture2DNode) == 0x000008, "Wrong alignment on UAsyncLoadSoftPtrAsTexture2DNode");
static_assert(sizeof(UAsyncLoadSoftPtrAsTexture2DNode) == 0x0000D0, "Wrong size on UAsyncLoadSoftPtrAsTexture2DNode");
static_assert(offsetof(UAsyncLoadSoftPtrAsTexture2DNode, Loaded) == 0x000038, "Member 'UAsyncLoadSoftPtrAsTexture2DNode::Loaded' has a wrong offset!");
static_assert(offsetof(UAsyncLoadSoftPtrAsTexture2DNode, LoadFailed) == 0x000048, "Member 'UAsyncLoadSoftPtrAsTexture2DNode::LoadFailed' has a wrong offset!");

// Class RemoteContentCache.SoftRemoteContentCacheObjectPtrLibrary
// 0x0000 (0x0030 - 0x0030)
class USoftRemoteContentCacheObjectPtrLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BindToImage(class UObject* WorldContextObject, const struct FSoftRemoteContentCacheObjectPtr& PtrToBind, class UImage* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoftRemoteContentCacheObjectPtrLibrary">();
	}
	static class USoftRemoteContentCacheObjectPtrLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoftRemoteContentCacheObjectPtrLibrary>();
	}
};
static_assert(alignof(USoftRemoteContentCacheObjectPtrLibrary) == 0x000008, "Wrong alignment on USoftRemoteContentCacheObjectPtrLibrary");
static_assert(sizeof(USoftRemoteContentCacheObjectPtrLibrary) == 0x000030, "Wrong size on USoftRemoteContentCacheObjectPtrLibrary");

}

