#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteContentCache

#include "Basic.hpp"

#include "RemoteContentCache_structs.hpp"


namespace SDK::Params
{

// Function RemoteContentCache.AsyncLoadSoftPtrAsTexture2DNode.LoadAsTexture2D
// 0x0080 (0x0080 - 0x0000)
struct AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftRemoteContentCacheObjectPtr       PtrToLoad;                                         // 0x0008(0x0070)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncLoadSoftPtrAsTexture2DNode*       ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D) == 0x000008, "Wrong alignment on AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D");
static_assert(sizeof(AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D) == 0x000080, "Wrong size on AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D");
static_assert(offsetof(AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D, WorldContextObject) == 0x000000, "Member 'AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D, PtrToLoad) == 0x000008, "Member 'AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D::PtrToLoad' has a wrong offset!");
static_assert(offsetof(AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D, ReturnValue) == 0x000078, "Member 'AsyncLoadSoftPtrAsTexture2DNode_LoadAsTexture2D::ReturnValue' has a wrong offset!");

// DelegateFunction RemoteContentCache.AsyncLoadSoftPtrAsTexture2DNode.SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature final
{
public:
	class UTexture2D*                             LoadedTexture;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature) == 0x000008, "Wrong alignment on AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature");
static_assert(sizeof(AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature) == 0x000008, "Wrong size on AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature");
static_assert(offsetof(AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature, LoadedTexture) == 0x000000, "Member 'AsyncLoadSoftPtrAsTexture2DNode_SoftPtrAsyncLoadAsTexture2DCompleted__DelegateSignature::LoadedTexture' has a wrong offset!");

// Function RemoteContentCache.SoftRemoteContentCacheObjectPtrLibrary.BindToImage
// 0x0080 (0x0080 - 0x0000)
struct SoftRemoteContentCacheObjectPtrLibrary_BindToImage final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftRemoteContentCacheObjectPtr       PtrToBind;                                         // 0x0008(0x0070)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Target;                                            // 0x0078(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SoftRemoteContentCacheObjectPtrLibrary_BindToImage) == 0x000008, "Wrong alignment on SoftRemoteContentCacheObjectPtrLibrary_BindToImage");
static_assert(sizeof(SoftRemoteContentCacheObjectPtrLibrary_BindToImage) == 0x000080, "Wrong size on SoftRemoteContentCacheObjectPtrLibrary_BindToImage");
static_assert(offsetof(SoftRemoteContentCacheObjectPtrLibrary_BindToImage, WorldContextObject) == 0x000000, "Member 'SoftRemoteContentCacheObjectPtrLibrary_BindToImage::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SoftRemoteContentCacheObjectPtrLibrary_BindToImage, PtrToBind) == 0x000008, "Member 'SoftRemoteContentCacheObjectPtrLibrary_BindToImage::PtrToBind' has a wrong offset!");
static_assert(offsetof(SoftRemoteContentCacheObjectPtrLibrary_BindToImage, Target) == 0x000078, "Member 'SoftRemoteContentCacheObjectPtrLibrary_BindToImage::Target' has a wrong offset!");

}

