#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReverseBearTrapTriggerZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReverseBearTrapTriggerZone.ReverseBearTrapTriggerZone_C
// 0x0030 (0x02D0 - 0x02A0)
class AReverseBearTrapTriggerZone_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          OuterBox;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InnerBox;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ACamperPlayer*>                  OverlappingPlayers;                                // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ReverseBearTrapTriggerZone(int32 EntryPoint);
	void BndEvt__OuterBox_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReverseBearTrapTriggerZone_C">();
	}
	static class AReverseBearTrapTriggerZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReverseBearTrapTriggerZone_C>();
	}
};
static_assert(alignof(AReverseBearTrapTriggerZone_C) == 0x000008, "Wrong alignment on AReverseBearTrapTriggerZone_C");
static_assert(sizeof(AReverseBearTrapTriggerZone_C) == 0x0002D0, "Wrong size on AReverseBearTrapTriggerZone_C");
static_assert(offsetof(AReverseBearTrapTriggerZone_C, UberGraphFrame) == 0x0002A0, "Member 'AReverseBearTrapTriggerZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AReverseBearTrapTriggerZone_C, OuterBox) == 0x0002A8, "Member 'AReverseBearTrapTriggerZone_C::OuterBox' has a wrong offset!");
static_assert(offsetof(AReverseBearTrapTriggerZone_C, InnerBox) == 0x0002B0, "Member 'AReverseBearTrapTriggerZone_C::InnerBox' has a wrong offset!");
static_assert(offsetof(AReverseBearTrapTriggerZone_C, DefaultSceneRoot) == 0x0002B8, "Member 'AReverseBearTrapTriggerZone_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AReverseBearTrapTriggerZone_C, OverlappingPlayers) == 0x0002C0, "Member 'AReverseBearTrapTriggerZone_C::OverlappingPlayers' has a wrong offset!");

}

