#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReverseBearTrapWarningZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReverseBearTrapWarningZone.ReverseBearTrapWarningZone_C
// 0x0018 (0x02B8 - 0x02A0)
class AReverseBearTrapWarningZone_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReverseBearTrapWarningZone(int32 EntryPoint);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReverseBearTrapWarningZone_C">();
	}
	static class AReverseBearTrapWarningZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReverseBearTrapWarningZone_C>();
	}
};
static_assert(alignof(AReverseBearTrapWarningZone_C) == 0x000008, "Wrong alignment on AReverseBearTrapWarningZone_C");
static_assert(sizeof(AReverseBearTrapWarningZone_C) == 0x0002B8, "Wrong size on AReverseBearTrapWarningZone_C");
static_assert(offsetof(AReverseBearTrapWarningZone_C, UberGraphFrame) == 0x0002A0, "Member 'AReverseBearTrapWarningZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AReverseBearTrapWarningZone_C, Box) == 0x0002A8, "Member 'AReverseBearTrapWarningZone_C::Box' has a wrong offset!");
static_assert(offsetof(AReverseBearTrapWarningZone_C, DefaultSceneRoot) == 0x0002B0, "Member 'AReverseBearTrapWarningZone_C::DefaultSceneRoot' has a wrong offset!");

}

