#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SabotageMeathook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseSabotageMeathook_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SabotageMeathook.SabotageMeathook_C
// 0x0020 (0x0900 - 0x08E0)
class USabotageMeathook_C final : public UBaseSabotageMeathook_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SabotageMeathook_C;                 // 0x08D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   SabotageNoToolBoxText;                             // 0x08E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasChangedFromToolboxToPerk;                       // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnInteractionFinished(class ADBDPlayer* Player, bool HasInteractionStarted);
	void ExecuteUbergraph_SabotageMeathook(int32 EntryPoint);
	void CanCharge(bool* Can_Charge);
	void ApplyCharge(double DeltaTime, class ADBDPlayer* Character);
	void GetScoreEventForSabotage(struct FGameplayTag* GameplayTag);

	bool IsInteractionPossibleBP(const class ADBDPlayer* Player, EInputInteractionType InteractionType) const;
	class FString GetInteractionText(const class ADBDPlayer* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SabotageMeathook_C">();
	}
	static class USabotageMeathook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USabotageMeathook_C>();
	}
};
static_assert(alignof(USabotageMeathook_C) == 0x000010, "Wrong alignment on USabotageMeathook_C");
static_assert(sizeof(USabotageMeathook_C) == 0x000900, "Wrong size on USabotageMeathook_C");
static_assert(offsetof(USabotageMeathook_C, UberGraphFrame_SabotageMeathook_C) == 0x0008D8, "Member 'USabotageMeathook_C::UberGraphFrame_SabotageMeathook_C' has a wrong offset!");
static_assert(offsetof(USabotageMeathook_C, SabotageNoToolBoxText) == 0x0008E0, "Member 'USabotageMeathook_C::SabotageNoToolBoxText' has a wrong offset!");
static_assert(offsetof(USabotageMeathook_C, HasChangedFromToolboxToPerk) == 0x0008F8, "Member 'USabotageMeathook_C::HasChangedFromToolboxToPerk' has a wrong offset!");

}

