#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SabotageMeathookNoToolbox

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function SabotageMeathookNoToolbox.SabotageMeathookNoToolbox_C.OnInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct SabotageMeathookNoToolbox_C_OnInteractionFinished final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SabotageMeathookNoToolbox_C_OnInteractionFinished) == 0x000008, "Wrong alignment on SabotageMeathookNoToolbox_C_OnInteractionFinished");
static_assert(sizeof(SabotageMeathookNoToolbox_C_OnInteractionFinished) == 0x000010, "Wrong size on SabotageMeathookNoToolbox_C_OnInteractionFinished");
static_assert(offsetof(SabotageMeathookNoToolbox_C_OnInteractionFinished, Player) == 0x000000, "Member 'SabotageMeathookNoToolbox_C_OnInteractionFinished::Player' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_OnInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'SabotageMeathookNoToolbox_C_OnInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function SabotageMeathookNoToolbox.SabotageMeathookNoToolbox_C.ExecuteUbergraph_SabotageMeathookNoToolbox
// 0x0020 (0x0020 - 0x0000)
struct SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMeatHook*                              CallFunc_GetMeatHook_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasInteractionStarted;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox) == 0x000008, "Wrong alignment on SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox");
static_assert(sizeof(SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox) == 0x000020, "Wrong size on SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox");
static_assert(offsetof(SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox, EntryPoint) == 0x000000, "Member 'SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox, CallFunc_GetMeatHook_ReturnValue) == 0x000008, "Member 'SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox::CallFunc_GetMeatHook_ReturnValue' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox, K2Node_Event_player) == 0x000010, "Member 'SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox, K2Node_Event_hasInteractionStarted) == 0x000018, "Member 'SabotageMeathookNoToolbox_C_ExecuteUbergraph_SabotageMeathookNoToolbox::K2Node_Event_hasInteractionStarted' has a wrong offset!");

// Function SabotageMeathookNoToolbox.SabotageMeathookNoToolbox_C.IsInteractionPossibleBP
// 0x0020 (0x0020 - 0x0000)
struct SabotageMeathookNoToolbox_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkManager*                           CallFunc_GetPerkManager_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionPossibleBP_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerkFlagFromSource_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on SabotageMeathookNoToolbox_C_IsInteractionPossibleBP");
static_assert(sizeof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP) == 0x000020, "Wrong size on SabotageMeathookNoToolbox_C_IsInteractionPossibleBP");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, CallFunc_GetPerkManager_ReturnValue) == 0x000010, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::CallFunc_GetPerkManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, CallFunc_IsInteractionPossibleBP_ReturnValue) == 0x000018, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::CallFunc_IsInteractionPossibleBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, CallFunc_HasPerkFlagFromSource_ReturnValue) == 0x000019, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::CallFunc_HasPerkFlagFromSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(SabotageMeathookNoToolbox_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'SabotageMeathookNoToolbox_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

