#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SacrificeCam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseCinematicCam_classes.hpp"
#include "TheClown_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SacrificeCam.SacrificeCam_C
// 0x0030 (0x09F0 - 0x09C0)
class ASacrificeCam_C final : public ABaseCinematicCam_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FrameRate_NewTrack_0_AAAD371A4C34D73E5336989A7074BF16; // 0x09C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FrameRate__Direction_AAAD371A4C34D73E5336989A7074BF16; // 0x09C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C5[0x3];                                      // 0x09C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FrameRate;                                         // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FadeIn_NewTrack_0_7B20C53E48FC9A9B29FD849C1B5D19FC; // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_7B20C53E48FC9A9B29FD849C1B5D19FC; // 0x09D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D5[0x3];                                      // 0x09D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PP_BloodVignette_Gesture;                          // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateAttemptEscapeVFX();
	void ActivateEndGameVignette(bool IsActive);
	void ActivateKnockoutVFX();
	void ActivateLocalPlayerExposedVFX();
	void ActivatePlayerExposedVFX();
	void ActivatePlayerGlitchVFX(const class UMaterialInstanceDynamic*& GlitchFX, const bool Face, bool Madness, bool Killer);
	void ActivatePlayerLightningVFX(const class UMaterialInstanceDynamic*& LightningFX, bool Intense);
	void ActivatePounceStateVFX();
	void ActivateSacrificeCamBlood();
	void ActivateVignetteOnWallCollision();
	void AddBloodDrippingGKMoriMale();
	void AnimateLiquidSyringe();
	void Boon_Unbound();
	void Camper_AntidoteBoostVignette_End();
	void Camper_AntidoteBoostVignette_Start();
	void DeactivateKnockoutVFX();
	void Destroy_Blood_Orb();
	void DisableDemonMode();
	void ExecuteUbergraph_SacrificeCam(int32 EntryPoint);
	void FadeIn__FinishedFunc();
	void FadeIn__UpdateFunc();
	void FrameRate__FinishedFunc();
	void FrameRate__UpdateFunc();
	void Hide_Oni_Katana();
	void Hide_Oni_Katana_TPV();
	void HideDemonCosmetic();
	void HideGunBullet();
	void HideSyringe();
	void HideSyringeOnStun();
	void K04_InvisibleOff();
	void K04_InvisibleOn();
	void K04_TelekinesisOff();
	void K04_TelekinesisOn();
	void K05_BloodDrops();
	void K05_SetTrap();
	void K05_TrapImpact();
	void K05_TrapImpactOff();
	void K12_GetAntidoteVignette();
	void K12_GetToxinVignette(EBombType Bomb_Type);
	void K12_Killer_AntidoteBegin();
	void K12_Killer_AntidoteEnd();
	void K12_Killer_BombSmokeColor();
	void K12_Killer_PlaceVignette();
	void K12_Killer_RemoveVignette();
	void K22_AttachedToSurvivor_VFX();
	void K22_BabyBloodDissolve();
	void K22_BabyRespawn();
	void K22_BrotherDissolveLocker();
	void K22_DetachedFromSurvivor_VFX();
	void K22_DormantAttachedSlasher();
	void K22_HighlightDormant(bool IsDormant_);
	void K22_HighlightDormantMain(bool IsDormantMain_);
	void K22_HighlightMissJump();
	void K22_HighlightMissJump_Stop();
	void K22_HighlightSuccessfulAttack();
	void K22_HighlightSuccessfulAttackStop();
	void K22_IsAttachedLocker(bool IsAttachedLocker);
	void K22_Jump_Active();
	void K22_Jump_Inactive();
	void K22_JumpTrail_Activate();
	void K22_JumpTrail_Deactivate();
	void K22_MembraneDelete();
	void K22_MembraneRecovery();
	void K22_QuickDissolveBrother();
	void K22_ReleaseBrother();
	void K22_SpawnWipeVFX();
	void K22_WrongLanding(bool Wrong_Landing);
	void K22_WrongLandingVignette(bool WrongLanding);
	void Killer_LungeAttack_End();
	void Killer_LungeAttack_Start();
	void On_Execution();
	void ReturnOniToNormal();
	void ReturnToDemonMode();
	void SetHighlightedVFX();
	void SetPlayerExposedVFX();
	void Show_Oni_Katana();
	void ShowDemonCosmetic();
	void ShowGunBullet();
	void ShowSyringe();
	void SpawnFakeBullet();
	void SpawnFullScreenBlood();
	void Start_Pounce_VFX();
	void Start_Saliva_VFX();
	void Start_Travelling_Dissolve();
	void Start_Travelling_PP();
	void StartDeathBedDissolve();
	void StartDeathBedRelocateVignette();
	void Stop_Pounce_VFX();
	void Stop_Saliva_VFX();
	void Stop_Travelling_Dissolve();
	void Stop_Travelling_PP();
	void Survivor_BoonRadius_Enter();
	void Survivor_BoonRadius_Exit();
	void Switch_Kanobo_To_Demon_Mode();
	void Switch_Kanobo_to_Normal_Mode();
	void Switch_Oni_Weapons_To_Normal();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SacrificeCam_C">();
	}
	static class ASacrificeCam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASacrificeCam_C>();
	}
};
static_assert(alignof(ASacrificeCam_C) == 0x000010, "Wrong alignment on ASacrificeCam_C");
static_assert(sizeof(ASacrificeCam_C) == 0x0009F0, "Wrong size on ASacrificeCam_C");
static_assert(offsetof(ASacrificeCam_C, UberGraphFrame) == 0x0009B8, "Member 'ASacrificeCam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, FrameRate_NewTrack_0_AAAD371A4C34D73E5336989A7074BF16) == 0x0009C0, "Member 'ASacrificeCam_C::FrameRate_NewTrack_0_AAAD371A4C34D73E5336989A7074BF16' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, FrameRate__Direction_AAAD371A4C34D73E5336989A7074BF16) == 0x0009C4, "Member 'ASacrificeCam_C::FrameRate__Direction_AAAD371A4C34D73E5336989A7074BF16' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, FrameRate) == 0x0009C8, "Member 'ASacrificeCam_C::FrameRate' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, FadeIn_NewTrack_0_7B20C53E48FC9A9B29FD849C1B5D19FC) == 0x0009D0, "Member 'ASacrificeCam_C::FadeIn_NewTrack_0_7B20C53E48FC9A9B29FD849C1B5D19FC' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, FadeIn__Direction_7B20C53E48FC9A9B29FD849C1B5D19FC) == 0x0009D4, "Member 'ASacrificeCam_C::FadeIn__Direction_7B20C53E48FC9A9B29FD849C1B5D19FC' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, FadeIn) == 0x0009D8, "Member 'ASacrificeCam_C::FadeIn' has a wrong offset!");
static_assert(offsetof(ASacrificeCam_C, PP_BloodVignette_Gesture) == 0x0009E0, "Member 'ASacrificeCam_C::PP_BloodVignette_Gesture' has a wrong offset!");

}

