#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScaleformUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ScaleformUI.EGFxAlign
// NumValues: 0x000A
enum class EGFxAlign : uint8
{
	Center                                   = 0,
	TopCenter                                = 1,
	BottomCenter                             = 2,
	CenterLeft                               = 3,
	CenterRight                              = 4,
	TopLeft                                  = 5,
	TopRight                                 = 6,
	BottomLeft                               = 7,
	BottomRight                              = 8,
	EGFxAlign_MAX                            = 9,
};

// Enum ScaleformUI.EGFxScaleMode
// NumValues: 0x0005
enum class EGFxScaleMode : uint8
{
	NoScale                                  = 0,
	ShowAll                                  = 1,
	ExactFit                                 = 2,
	NoBorder                                 = 3,
	EGFxScaleMode_MAX                        = 4,
};

// Enum ScaleformUI.EGFxRenderTextureMode
// NumValues: 0x0004
enum class EGFxRenderTextureMode : uint8
{
	Opaque                                   = 0,
	Alpha                                    = 1,
	AlphaComposite                           = 2,
	EGFxRenderTextureMode_MAX                = 3,
};

// Enum ScaleformUI.EGFxTimingMode
// NumValues: 0x0003
enum class EGFxTimingMode : uint8
{
	Game                                     = 0,
	Real                                     = 1,
	EGFxTimingMode_MAX                       = 2,
};

// Enum ScaleformUI.GFxHitTestType
// NumValues: 0x0005
enum class EGFxHitTestType : uint8
{
	HitTest_Bounds                           = 0,
	HitTest_Shapes                           = 1,
	HitTest_ButtonEvents                     = 2,
	HitTest_ShapesNoInvisible                = 3,
	HitTest_MAX                              = 4,
};

// Enum ScaleformUI.EASType
// NumValues: 0x000A
enum class EASType : uint8
{
	Undefined                                = 0,
	Null                                     = 1,
	Boolean                                  = 2,
	Int                                      = 3,
	Number                                   = 4,
	String                                   = 5,
	StringW                                  = 6,
	Object                                   = 7,
	DisplayObject                            = 8,
	EASType_MAX                              = 9,
};

// Enum ScaleformUI.FlashTextureRescale
// NumValues: 0x0006
enum class EFlashTextureRescale : uint8
{
	FlashTextureScale_High                   = 0,
	FlashTextureScale_Low                    = 1,
	FlashTextureScale_NextLow                = 2,
	FlashTextureScale_Mult4                  = 3,
	FlashTextureScale_None                   = 4,
	FlashTextureScale_MAX                    = 5,
};

// ScriptStruct ScaleformUI.ExternalTexture
// 0x0018 (0x0018 - 0x0000)
struct FExternalTexture final
{
public:
	class FString                                 Resource;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExternalTexture) == 0x000008, "Wrong alignment on FExternalTexture");
static_assert(sizeof(FExternalTexture) == 0x000018, "Wrong size on FExternalTexture");
static_assert(offsetof(FExternalTexture, Resource) == 0x000000, "Member 'FExternalTexture::Resource' has a wrong offset!");
static_assert(offsetof(FExternalTexture, Texture) == 0x000010, "Member 'FExternalTexture::Texture' has a wrong offset!");

// ScriptStruct ScaleformUI.GCReference
// 0x0010 (0x0010 - 0x0000)
struct FGCReference final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RefCount;                                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGCReference) == 0x000008, "Wrong alignment on FGCReference");
static_assert(sizeof(FGCReference) == 0x000010, "Wrong size on FGCReference");
static_assert(offsetof(FGCReference, Object) == 0x000000, "Member 'FGCReference::Object' has a wrong offset!");
static_assert(offsetof(FGCReference, RefCount) == 0x000008, "Member 'FGCReference::RefCount' has a wrong offset!");

// ScriptStruct ScaleformUI.GFxWidgetBinding
// 0x0018 (0x0018 - 0x0000)
struct FGFxWidgetBinding final
{
public:
	class FName                                   WidgetName;                                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    WidgetClass;                                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGFxWidgetBinding) == 0x000008, "Wrong alignment on FGFxWidgetBinding");
static_assert(sizeof(FGFxWidgetBinding) == 0x000018, "Wrong size on FGFxWidgetBinding");
static_assert(offsetof(FGFxWidgetBinding, WidgetName) == 0x000000, "Member 'FGFxWidgetBinding::WidgetName' has a wrong offset!");
static_assert(offsetof(FGFxWidgetBinding, WidgetClass) == 0x000010, "Member 'FGFxWidgetBinding::WidgetClass' has a wrong offset!");

// ScriptStruct ScaleformUI.ASValue
// 0x0038 (0x0038 - 0x0000)
struct FASValue final
{
public:
	EASType                                       ASType;                                            // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ASBoolean;                                         // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ASInt;                                             // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ASNumber;                                          // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ASString;                                          // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGFxObject*                             ASObject;                                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FASValue) == 0x000008, "Wrong alignment on FASValue");
static_assert(sizeof(FASValue) == 0x000038, "Wrong size on FASValue");
static_assert(offsetof(FASValue, ASType) == 0x000000, "Member 'FASValue::ASType' has a wrong offset!");
static_assert(offsetof(FASValue, ASBoolean) == 0x000001, "Member 'FASValue::ASBoolean' has a wrong offset!");
static_assert(offsetof(FASValue, ASInt) == 0x000004, "Member 'FASValue::ASInt' has a wrong offset!");
static_assert(offsetof(FASValue, ASNumber) == 0x000008, "Member 'FASValue::ASNumber' has a wrong offset!");
static_assert(offsetof(FASValue, ASString) == 0x000010, "Member 'FASValue::ASString' has a wrong offset!");
static_assert(offsetof(FASValue, ASObject) == 0x000030, "Member 'FASValue::ASObject' has a wrong offset!");

// ScriptStruct ScaleformUI.ASDisplayInfo
// 0x0048 (0x0048 - 0x0000)
struct FASDisplayInfo final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0018(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XRotation;                                         // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YRotation;                                         // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Visible;                                           // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FASDisplayInfo) == 0x000008, "Wrong alignment on FASDisplayInfo");
static_assert(sizeof(FASDisplayInfo) == 0x000048, "Wrong size on FASDisplayInfo");
static_assert(offsetof(FASDisplayInfo, Position) == 0x000000, "Member 'FASDisplayInfo::Position' has a wrong offset!");
static_assert(offsetof(FASDisplayInfo, Scale) == 0x000018, "Member 'FASDisplayInfo::Scale' has a wrong offset!");
static_assert(offsetof(FASDisplayInfo, Rotation) == 0x000030, "Member 'FASDisplayInfo::Rotation' has a wrong offset!");
static_assert(offsetof(FASDisplayInfo, XRotation) == 0x000034, "Member 'FASDisplayInfo::XRotation' has a wrong offset!");
static_assert(offsetof(FASDisplayInfo, YRotation) == 0x000038, "Member 'FASDisplayInfo::YRotation' has a wrong offset!");
static_assert(offsetof(FASDisplayInfo, Alpha) == 0x00003C, "Member 'FASDisplayInfo::Alpha' has a wrong offset!");
static_assert(offsetof(FASDisplayInfo, Visible) == 0x000040, "Member 'FASDisplayInfo::Visible' has a wrong offset!");

// ScriptStruct ScaleformUI.ASColorTransform
// 0x0020 (0x0020 - 0x0000)
struct FASColorTransform final
{
public:
	struct FLinearColor                           Multiply;                                          // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Add;                                               // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FASColorTransform) == 0x000004, "Wrong alignment on FASColorTransform");
static_assert(sizeof(FASColorTransform) == 0x000020, "Wrong size on FASColorTransform");
static_assert(offsetof(FASColorTransform, Multiply) == 0x000000, "Member 'FASColorTransform::Multiply' has a wrong offset!");
static_assert(offsetof(FASColorTransform, Add) == 0x000010, "Member 'FASColorTransform::Add' has a wrong offset!");

// ScriptStruct ScaleformUI.ASPerspectiveTransform
// 0x0080 (0x0080 - 0x0000)
struct FASPerspectiveTransform final
{
public:
	struct FVector4                               Row0;                                              // 0x0000(0x0020)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Row1;                                              // 0x0020(0x0020)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Row2;                                              // 0x0040(0x0020)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Row3;                                              // 0x0060(0x0020)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FASPerspectiveTransform) == 0x000010, "Wrong alignment on FASPerspectiveTransform");
static_assert(sizeof(FASPerspectiveTransform) == 0x000080, "Wrong size on FASPerspectiveTransform");
static_assert(offsetof(FASPerspectiveTransform, Row0) == 0x000000, "Member 'FASPerspectiveTransform::Row0' has a wrong offset!");
static_assert(offsetof(FASPerspectiveTransform, Row1) == 0x000020, "Member 'FASPerspectiveTransform::Row1' has a wrong offset!");
static_assert(offsetof(FASPerspectiveTransform, Row2) == 0x000040, "Member 'FASPerspectiveTransform::Row2' has a wrong offset!");
static_assert(offsetof(FASPerspectiveTransform, Row3) == 0x000060, "Member 'FASPerspectiveTransform::Row3' has a wrong offset!");

}

