#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SendSurvivorToDeathBedScreamNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SendSurvivorToDeathBedScreamNotify.SendSurvivorToDeathBedScreamNotify_C.Received_Notify
// 0x0050 (0x0050 - 0x0000)
struct SendSurvivorToDeathBedScreamNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CallFunc_GetOwningSurvivor_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerScreamEventsIfPossible_ReturnValue; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify) == 0x000008, "Wrong alignment on SendSurvivorToDeathBedScreamNotify_C_Received_Notify");
static_assert(sizeof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify) == 0x000050, "Wrong size on SendSurvivorToDeathBedScreamNotify_C_Received_Notify");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, Animation) == 0x000008, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, EventReference) == 0x000010, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, ReturnValue) == 0x000038, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, CallFunc_GetOwningSurvivor_ReturnValue) == 0x000040, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::CallFunc_GetOwningSurvivor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendSurvivorToDeathBedScreamNotify_C_Received_Notify, CallFunc_TriggerScreamEventsIfPossible_ReturnValue) == 0x000049, "Member 'SendSurvivorToDeathBedScreamNotify_C_Received_Notify::CallFunc_TriggerScreamEventsIfPossible_ReturnValue' has a wrong offset!");

}

