#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SentryIo

#include "Basic.hpp"

#include "Sentry_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SentryIo.BhvrBeforeSendHandler
// 0x0000 (0x0030 - 0x0030)
class UBhvrBeforeSendHandler final : public USentryBeforeSendHandler
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BhvrBeforeSendHandler">();
	}
	static class UBhvrBeforeSendHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBhvrBeforeSendHandler>();
	}
};
static_assert(alignof(UBhvrBeforeSendHandler) == 0x000008, "Wrong alignment on UBhvrBeforeSendHandler");
static_assert(sizeof(UBhvrBeforeSendHandler) == 0x000030, "Wrong size on UBhvrBeforeSendHandler");

// Class SentryIo.SentryIoBaseSubsystem
// 0x0000 (0x0038 - 0x0038)
class USentryIoBaseSubsystem : public UEngineSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SentryIoBaseSubsystem">();
	}
	static class USentryIoBaseSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryIoBaseSubsystem>();
	}
};
static_assert(alignof(USentryIoBaseSubsystem) == 0x000008, "Wrong alignment on USentryIoBaseSubsystem");
static_assert(sizeof(USentryIoBaseSubsystem) == 0x000038, "Wrong size on USentryIoBaseSubsystem");

// Class SentryIo.SentryIoLinuxSubsystem
// 0x00A8 (0x00E0 - 0x0038)
class USentryIoLinuxSubsystem final : public USentryIoBaseSubsystem
{
public:
	uint8                                         Pad_38[0xA8];                                      // 0x0038(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SentryIoLinuxSubsystem">();
	}
	static class USentryIoLinuxSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryIoLinuxSubsystem>();
	}
};
static_assert(alignof(USentryIoLinuxSubsystem) == 0x000008, "Wrong alignment on USentryIoLinuxSubsystem");
static_assert(sizeof(USentryIoLinuxSubsystem) == 0x0000E0, "Wrong size on USentryIoLinuxSubsystem");

// Class SentryIo.SentryIoSubsystem
// 0x0010 (0x0048 - 0x0038)
class USentryIoSubsystem final : public USentryIoBaseSubsystem
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SentryIoSubsystem">();
	}
	static class USentryIoSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryIoSubsystem>();
	}
};
static_assert(alignof(USentryIoSubsystem) == 0x000008, "Wrong alignment on USentryIoSubsystem");
static_assert(sizeof(USentryIoSubsystem) == 0x000048, "Wrong size on USentryIoSubsystem");

}

