#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignificanceUtilities

#include "Basic.hpp"


namespace SDK::Params
{

// Function SignificanceUtilities.DistanceBasedTickDisabler.RegisterComponent
// 0x0008 (0x0008 - 0x0000)
struct DistanceBasedTickDisabler_RegisterComponent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DistanceBasedTickDisabler_RegisterComponent) == 0x000008, "Wrong alignment on DistanceBasedTickDisabler_RegisterComponent");
static_assert(sizeof(DistanceBasedTickDisabler_RegisterComponent) == 0x000008, "Wrong size on DistanceBasedTickDisabler_RegisterComponent");
static_assert(offsetof(DistanceBasedTickDisabler_RegisterComponent, Component) == 0x000000, "Member 'DistanceBasedTickDisabler_RegisterComponent::Component' has a wrong offset!");

// Function SignificanceUtilities.DistanceBasedTickDisabler.UnregisterComponent
// 0x0008 (0x0008 - 0x0000)
struct DistanceBasedTickDisabler_UnregisterComponent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DistanceBasedTickDisabler_UnregisterComponent) == 0x000008, "Wrong alignment on DistanceBasedTickDisabler_UnregisterComponent");
static_assert(sizeof(DistanceBasedTickDisabler_UnregisterComponent) == 0x000008, "Wrong size on DistanceBasedTickDisabler_UnregisterComponent");
static_assert(offsetof(DistanceBasedTickDisabler_UnregisterComponent, Component) == 0x000000, "Member 'DistanceBasedTickDisabler_UnregisterComponent::Component' has a wrong offset!");

}

