#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignificanceUtilities

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SignificanceUtilities.SignificanceStrategy
// 0x0000 (0x0030 - 0x0030)
class USignificanceStrategy : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignificanceStrategy">();
	}
	static class USignificanceStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignificanceStrategy>();
	}
};
static_assert(alignof(USignificanceStrategy) == 0x000008, "Wrong alignment on USignificanceStrategy");
static_assert(sizeof(USignificanceStrategy) == 0x000030, "Wrong size on USignificanceStrategy");

// Class SignificanceUtilities.LinearSignificanceStrategy
// 0x00A8 (0x00D8 - 0x0030)
class ULinearSignificanceStrategy final : public USignificanceStrategy
{
public:
	struct FBHVRPerDetailModeFloat                _maxDistance;                                      // 0x0030(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          _updateEvenIfNotRendered;                          // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LinearSignificanceStrategy">();
	}
	static class ULinearSignificanceStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinearSignificanceStrategy>();
	}
};
static_assert(alignof(ULinearSignificanceStrategy) == 0x000008, "Wrong alignment on ULinearSignificanceStrategy");
static_assert(sizeof(ULinearSignificanceStrategy) == 0x0000D8, "Wrong size on ULinearSignificanceStrategy");
static_assert(offsetof(ULinearSignificanceStrategy, _maxDistance) == 0x000030, "Member 'ULinearSignificanceStrategy::_maxDistance' has a wrong offset!");
static_assert(offsetof(ULinearSignificanceStrategy, _updateEvenIfNotRendered) == 0x0000D0, "Member 'ULinearSignificanceStrategy::_updateEvenIfNotRendered' has a wrong offset!");

// Class SignificanceUtilities.DistanceBasedTickDisabler
// 0x00C8 (0x0170 - 0x00A8)
class UDistanceBasedTickDisabler final : public UActorComponent
{
public:
	bool                                          _autoRegisterOwner;                                // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _autoRegisterTimelines;                            // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBHVRPerDetailModeFloat                _tickDisableDistance;                              // 0x00B0(0x00A0)(Edit, NativeAccessSpecifierPrivate)
	bool                                          _insignificantWhenBehindTheCamera;                 // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                _components;                                       // 0x0158(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterComponent(class UActorComponent* Component);
	void UnregisterComponent(class UActorComponent* Component);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistanceBasedTickDisabler">();
	}
	static class UDistanceBasedTickDisabler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistanceBasedTickDisabler>();
	}
};
static_assert(alignof(UDistanceBasedTickDisabler) == 0x000008, "Wrong alignment on UDistanceBasedTickDisabler");
static_assert(sizeof(UDistanceBasedTickDisabler) == 0x000170, "Wrong size on UDistanceBasedTickDisabler");
static_assert(offsetof(UDistanceBasedTickDisabler, _autoRegisterOwner) == 0x0000A8, "Member 'UDistanceBasedTickDisabler::_autoRegisterOwner' has a wrong offset!");
static_assert(offsetof(UDistanceBasedTickDisabler, _autoRegisterTimelines) == 0x0000A9, "Member 'UDistanceBasedTickDisabler::_autoRegisterTimelines' has a wrong offset!");
static_assert(offsetof(UDistanceBasedTickDisabler, _tickDisableDistance) == 0x0000B0, "Member 'UDistanceBasedTickDisabler::_tickDisableDistance' has a wrong offset!");
static_assert(offsetof(UDistanceBasedTickDisabler, _insignificantWhenBehindTheCamera) == 0x000150, "Member 'UDistanceBasedTickDisabler::_insignificantWhenBehindTheCamera' has a wrong offset!");
static_assert(offsetof(UDistanceBasedTickDisabler, _components) == 0x000158, "Member 'UDistanceBasedTickDisabler::_components' has a wrong offset!");

// Class SignificanceUtilities.SignificanceManagerComponent
// 0x0038 (0x00E0 - 0x00A8)
class USignificanceManagerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USignificanceStrategy*                  _significanceStrategy;                             // 0x00C0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         _dependentActorsToCheckSignficance;                // 0x00C8(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SignificanceManagerComponent">();
	}
	static class USignificanceManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignificanceManagerComponent>();
	}
};
static_assert(alignof(USignificanceManagerComponent) == 0x000008, "Wrong alignment on USignificanceManagerComponent");
static_assert(sizeof(USignificanceManagerComponent) == 0x0000E0, "Wrong size on USignificanceManagerComponent");
static_assert(offsetof(USignificanceManagerComponent, _significanceStrategy) == 0x0000C0, "Member 'USignificanceManagerComponent::_significanceStrategy' has a wrong offset!");
static_assert(offsetof(USignificanceManagerComponent, _dependentActorsToCheckSignficance) == 0x0000C8, "Member 'USignificanceManagerComponent::_dependentActorsToCheckSignficance' has a wrong offset!");

}

