#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimplygonUObjects

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SimplygonUObjects.ESeparateOverlappingChartsMode
// NumValues: 0x0004
enum class ESeparateOverlappingChartsMode : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Auto                                     = 2,
	ESeparateOverlappingChartsMode_MAX       = 3,
};

// Enum SimplygonUObjects.EReductionPerformanceMode
// NumValues: 0x0003
enum class EReductionPerformanceMode : uint8
{
	AllFeatures                              = 0,
	HighPerformance                          = 1,
	EReductionPerformanceMode_MAX            = 2,
};

// Enum SimplygonUObjects.EReductionTargetStopCondition
// NumValues: 0x0003
enum class EReductionTargetStopCondition : uint8
{
	Any                                      = 0,
	All                                      = 1,
	EReductionTargetStopCondition_MAX        = 2,
};

// Enum SimplygonUObjects.EReductionHeuristics
// NumValues: 0x0003
enum class EReductionHeuristics : uint8
{
	Fast                                     = 0,
	Consistent                               = 1,
	EReductionHeuristics_MAX                 = 2,
};

// Enum SimplygonUObjects.ESymmetryAxis
// NumValues: 0x0004
enum class ESymmetryAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	ESymmetryAxis_MAX                        = 3,
};

// Enum SimplygonUObjects.EDataCreationPreferences
// NumValues: 0x0004
enum class EDataCreationPreferences : uint8
{
	OnlyUseOriginalData                      = 0,
	PreferOriginalData                       = 1,
	PreferOptimizedResult                    = 2,
	EDataCreationPreferences_MAX             = 3,
};

// Enum SimplygonUObjects.EComputeVisibilityMode
// NumValues: 0x0003
enum class EComputeVisibilityMode : uint8
{
	DirectX                                  = 0,
	Software                                 = 1,
	EComputeVisibilityMode_MAX               = 2,
};

// Enum SimplygonUObjects.EBoneReductionTargetStopCondition
// NumValues: 0x0003
enum class EBoneReductionTargetStopCondition : uint8
{
	Any                                      = 0,
	All                                      = 1,
	EBoneReductionTargetStopCondition_MAX    = 2,
};

// Enum SimplygonUObjects.EWeightsFromColorComponent
// NumValues: 0x0005
enum class EWeightsFromColorComponent : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	EWeightsFromColorComponent_MAX           = 4,
};

// Enum SimplygonUObjects.EWeightsFromColorMode
// NumValues: 0x0004
enum class EWeightsFromColorMode : uint8
{
	Standard                                 = 0,
	High                                     = 1,
	Low                                      = 2,
	EWeightsFromColorMode_MAX                = 3,
};

// Enum SimplygonUObjects.EAttributeTessellationDensityMode
// NumValues: 0x0007
enum class EAttributeTessellationDensityMode : uint8
{
	RelativeArea                             = 0,
	AbsoluteArea                             = 1,
	RelativeLength                           = 2,
	AbsoluteLength                           = 3,
	UserDefined                              = 4,
	OnScreenSize                             = 5,
	EAttributeTessellationDensityMode_MAX    = 6,
};

// Enum SimplygonUObjects.ETransformationSpace
// NumValues: 0x0005
enum class ETransformationSpace : uint8
{
	Global                                   = 0,
	Local                                    = 1,
	Tangent                                  = 2,
	View                                     = 3,
	ETransformationSpace_MAX                 = 4,
};

// Enum SimplygonUObjects.ETexCoordGeneratorType
// NumValues: 0x0003
enum class ETexCoordGeneratorType : uint8
{
	Parameterizer                            = 0,
	ChartAggregator                          = 1,
	ETexCoordGeneratorType_MAX               = 2,
};

// Enum SimplygonUObjects.EChartAggregatorMode
// NumValues: 0x0005
enum class EChartAggregatorMode : uint8
{
	TextureSizeProportions                   = 0,
	SurfaceArea                              = 1,
	OriginalPixelDensity                     = 2,
	UVSizeProportions                        = 3,
	EChartAggregatorMode_MAX                 = 4,
};

// Enum SimplygonUObjects.ESurfaceAreaScale
// NumValues: 0x0004
enum class ESurfaceAreaScale : uint8
{
	LargestInstance                          = 0,
	SmallestInstance                         = 1,
	Average                                  = 2,
	ESurfaceAreaScale_MAX                    = 3,
};

// Enum SimplygonUObjects.EHoleFilling
// NumValues: 0x0005
enum class EHoleFilling : uint8
{
	Disabled                                 = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	EHoleFilling_MAX                         = 4,
};

// Enum SimplygonUObjects.ERemeshingMode
// NumValues: 0x0004
enum class ERemeshingMode : uint8
{
	Outside                                  = 0,
	Inside                                   = 1,
	Manual                                   = 2,
	ERemeshingMode_MAX                       = 3,
};

// Enum SimplygonUObjects.ESurfaceTransferMode
// NumValues: 0x0003
enum class ESurfaceTransferMode : uint8
{
	Fast                                     = 0,
	Accurate                                 = 1,
	ESurfaceTransferMode_MAX                 = 2,
};

// Enum SimplygonUObjects.EBillboardMode
// NumValues: 0x0003
enum class EBillboardMode : uint8
{
	OuterShell                               = 0,
	Foliage                                  = 1,
	EBillboardMode_MAX                       = 2,
};

// Enum SimplygonUObjects.EStopCondition
// NumValues: 0x0003
enum class EStopCondition : uint8
{
	Any                                      = 0,
	All                                      = 1,
	EStopCondition_MAX                       = 2,
};

// Enum SimplygonUObjects.EOpacityChannelComponent
// NumValues: 0x0005
enum class EOpacityChannelComponent : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	EOpacityChannelComponent_MAX             = 4,
};

// Enum SimplygonUObjects.EDitherType
// NumValues: 0x0005
enum class EDitherType : uint8
{
	NoDither                                 = 0,
	FloydSteinberg                           = 1,
	JarvisJudiceNinke                        = 2,
	Sierra                                   = 3,
	EDitherType_MAX                          = 4,
};

// Enum SimplygonUObjects.EFillMode
// NumValues: 0x0004
enum class EFillMode : uint8
{
	Interpolate                              = 0,
	NearestNeighbor                          = 1,
	NoFill                                   = 2,
	EFillMode_MAX                            = 3,
};

// Enum SimplygonUObjects.EOutputPixelFormat
// NumValues: 0x0008
enum class EOutputPixelFormat : uint8
{
	R8G8B8A8                                 = 0,
	R8G8B8                                   = 1,
	R8                                       = 2,
	R16G16B16A16                             = 3,
	R16G16B16                                = 4,
	R16                                      = 5,
	R32G32B32A32F                            = 6,
	EOutputPixelFormat_MAX                   = 7,
};

// Enum SimplygonUObjects.EOutputImageFileFormat
// NumValues: 0x0008
enum class EOutputImageFileFormat : uint8
{
	BMP                                      = 0,
	DDS                                      = 1,
	JPEG                                     = 2,
	PNG                                      = 3,
	TGA                                      = 4,
	TIFF                                     = 5,
	EXR                                      = 8,
	EOutputImageFileFormat_MAX               = 9,
};

// Enum SimplygonUObjects.EOutputDDSCompressionType
// NumValues: 0x0007
enum class EOutputDDSCompressionType : uint8
{
	NoCompression                            = 255,
	BC1                                      = 0,
	BC2                                      = 1,
	BC3                                      = 2,
	BC4                                      = 3,
	BC5                                      = 4,
	EOutputDDSCompressionType_MAX            = 256,
};

// Enum SimplygonUObjects.EOutputOpacityType
// NumValues: 0x0003
enum class EOutputOpacityType : uint8
{
	Opacity                                  = 0,
	Transparency                             = 1,
	EOutputOpacityType_MAX                   = 2,
};

// Enum SimplygonUObjects.EFlipBackfacingMode
// NumValues: 0x0003
enum class EFlipBackfacingMode : uint8
{
	PixelNormal                              = 0,
	FaceNormal                               = 1,
	EFlipBackfacingMode_MAX                  = 2,
};

// Enum SimplygonUObjects.EGeometryDataFieldType
// NumValues: 0x000E
enum class EGeometryDataFieldType : uint8
{
	Coords                                   = 0,
	TexCoords                                = 1,
	Normals                                  = 2,
	Tangents                                 = 3,
	Bitangents                               = 4,
	Colors                                   = 5,
	TriangleIds                              = 6,
	MaterialIds                              = 7,
	VertexIds                                = 8,
	UserVertexField                          = 9,
	UserCornerField                          = 10,
	UserTriangleField                        = 11,
	CustomField                              = 12,
	EGeometryDataFieldType_MAX               = 13,
};

// Enum SimplygonUObjects.EOutputColorSpace
// NumValues: 0x0004
enum class EOutputColorSpace : uint8
{
	Undefined                                = 0,
	Linear                                   = 1,
	SRGB                                     = 2,
	EOutputColorSpace_MAX                    = 3,
};

// ScriptStruct SimplygonUObjects.MaterialOutputSettings
// 0x0038 (0x0038 - 0x0000)
struct FMaterialOutputSettings final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ParentMaterialOverride;                            // 0x0000(0x0038)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMaterialOutputSettings) == 0x000008, "Wrong alignment on FMaterialOutputSettings");
static_assert(sizeof(FMaterialOutputSettings) == 0x000038, "Wrong size on FMaterialOutputSettings");
static_assert(offsetof(FMaterialOutputSettings, ParentMaterialOverride) == 0x000000, "Member 'FMaterialOutputSettings::ParentMaterialOverride' has a wrong offset!");

// ScriptStruct SimplygonUObjects.SimplygonPipelineSettings
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSimplygonPipelineSettings
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSimplygonPipelineSettings) == 0x000008, "Wrong alignment on FSimplygonPipelineSettings");
static_assert(sizeof(FSimplygonPipelineSettings) == 0x000008, "Wrong size on FSimplygonPipelineSettings");

// ScriptStruct SimplygonUObjects.ReductionSettings
// 0x0080 (0x0080 - 0x0000)
struct FReductionSettings final
{
public:
	uint8                                         ReductionTargetTriangleRatioEnabled : 1;           // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReductionTargetTriangleRatio;                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReductionTargetTriangleCountEnabled : 1;           // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReductionTargetTriangleCount;                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReductionTargetMaxDeviationEnabled : 1;            // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReductionTargetMaxDeviation;                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReductionTargetOnScreenSizeEnabled : 1;            // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReductionTargetOnScreenSize;                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReductionPerformanceMode                     ReductionPerformanceMode;                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReductionTargetStopCondition                 ReductionTargetStopCondition;                      // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReductionHeuristics                          ReductionHeuristics;                               // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GeometryImportance;                                // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaterialImportance;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextureImportance;                                 // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadingImportance;                                 // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroupImportance;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VertexColorImportance;                             // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EdgeSetImportance;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkinningImportance;                                // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutwardMoveMultiplier;                             // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InwardMoveMultiplier;                              // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxEdgeLength;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         KeepSymmetry : 1;                                  // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         UseSymmetryQuadRetriangulator : 1;                 // 0x0050(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         UseAutomaticSymmetryDetection : 1;                 // 0x0050(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SymmetryDetectionTolerance;                        // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESymmetryAxis                                 SymmetryAxis;                                      // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SymmetryOffset;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CreateGeomorphGeometry : 1;                        // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         GenerateGeomorphData : 1;                          // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EDataCreationPreferences                      DataCreationPreferences;                           // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseHighQualityNormalCalculation : 1;               // 0x0062(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         LockGeometricBorder : 1;                           // 0x0062(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         MergeGeometries : 1;                               // 0x0062(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         AllowDegenerateTexCoords : 1;                      // 0x0062(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ProcessSelectionSetID;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProcessSelectionSetName;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         KeepUnprocessedSceneMeshes : 1;                    // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         PreserveQuadFlags : 1;                             // 0x0078(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FReductionSettings) == 0x000008, "Wrong alignment on FReductionSettings");
static_assert(sizeof(FReductionSettings) == 0x000080, "Wrong size on FReductionSettings");
static_assert(offsetof(FReductionSettings, ReductionTargetTriangleRatio) == 0x000004, "Member 'FReductionSettings::ReductionTargetTriangleRatio' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ReductionTargetTriangleCount) == 0x00000C, "Member 'FReductionSettings::ReductionTargetTriangleCount' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ReductionTargetMaxDeviation) == 0x000014, "Member 'FReductionSettings::ReductionTargetMaxDeviation' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ReductionTargetOnScreenSize) == 0x00001C, "Member 'FReductionSettings::ReductionTargetOnScreenSize' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ReductionPerformanceMode) == 0x000020, "Member 'FReductionSettings::ReductionPerformanceMode' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ReductionTargetStopCondition) == 0x000021, "Member 'FReductionSettings::ReductionTargetStopCondition' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ReductionHeuristics) == 0x000022, "Member 'FReductionSettings::ReductionHeuristics' has a wrong offset!");
static_assert(offsetof(FReductionSettings, GeometryImportance) == 0x000024, "Member 'FReductionSettings::GeometryImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, MaterialImportance) == 0x000028, "Member 'FReductionSettings::MaterialImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, TextureImportance) == 0x00002C, "Member 'FReductionSettings::TextureImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ShadingImportance) == 0x000030, "Member 'FReductionSettings::ShadingImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, GroupImportance) == 0x000034, "Member 'FReductionSettings::GroupImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, VertexColorImportance) == 0x000038, "Member 'FReductionSettings::VertexColorImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, EdgeSetImportance) == 0x00003C, "Member 'FReductionSettings::EdgeSetImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, SkinningImportance) == 0x000040, "Member 'FReductionSettings::SkinningImportance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, OutwardMoveMultiplier) == 0x000044, "Member 'FReductionSettings::OutwardMoveMultiplier' has a wrong offset!");
static_assert(offsetof(FReductionSettings, InwardMoveMultiplier) == 0x000048, "Member 'FReductionSettings::InwardMoveMultiplier' has a wrong offset!");
static_assert(offsetof(FReductionSettings, MaxEdgeLength) == 0x00004C, "Member 'FReductionSettings::MaxEdgeLength' has a wrong offset!");
static_assert(offsetof(FReductionSettings, SymmetryDetectionTolerance) == 0x000054, "Member 'FReductionSettings::SymmetryDetectionTolerance' has a wrong offset!");
static_assert(offsetof(FReductionSettings, SymmetryAxis) == 0x000058, "Member 'FReductionSettings::SymmetryAxis' has a wrong offset!");
static_assert(offsetof(FReductionSettings, SymmetryOffset) == 0x00005C, "Member 'FReductionSettings::SymmetryOffset' has a wrong offset!");
static_assert(offsetof(FReductionSettings, DataCreationPreferences) == 0x000061, "Member 'FReductionSettings::DataCreationPreferences' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ProcessSelectionSetID) == 0x000064, "Member 'FReductionSettings::ProcessSelectionSetID' has a wrong offset!");
static_assert(offsetof(FReductionSettings, ProcessSelectionSetName) == 0x000068, "Member 'FReductionSettings::ProcessSelectionSetName' has a wrong offset!");

// ScriptStruct SimplygonUObjects.RepairSettings
// 0x0014 (0x0014 - 0x0000)
struct FRepairSettings final
{
public:
	uint8                                         UseTJunctionRemover : 1;                           // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TJuncDist;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseWelding : 1;                                    // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         WeldOnlyBorderVertices : 1;                        // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         WeldOnlyWithinMaterial : 1;                        // 0x0008(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         WeldOnlyWithinSceneNode : 1;                       // 0x0008(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         WeldOnlyBetweenSceneNodes : 1;                     // 0x0008(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeldDist;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProgressivePasses;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRepairSettings) == 0x000004, "Wrong alignment on FRepairSettings");
static_assert(sizeof(FRepairSettings) == 0x000014, "Wrong size on FRepairSettings");
static_assert(offsetof(FRepairSettings, TJuncDist) == 0x000004, "Member 'FRepairSettings::TJuncDist' has a wrong offset!");
static_assert(offsetof(FRepairSettings, WeldDist) == 0x00000C, "Member 'FRepairSettings::WeldDist' has a wrong offset!");
static_assert(offsetof(FRepairSettings, ProgressivePasses) == 0x000010, "Member 'FRepairSettings::ProgressivePasses' has a wrong offset!");

// ScriptStruct SimplygonUObjects.NormalCalculationSettings
// 0x000C (0x000C - 0x0000)
struct FNormalCalculationSettings final
{
public:
	uint8                                         ReplaceNormals : 1;                                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         RepairInvalidNormals : 1;                          // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HardEdgeAngle;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReplaceTangents : 1;                               // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ReorthogonalizeTangentSpace : 1;                   // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ScaleByArea : 1;                                   // 0x0008(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ScaleByAngle : 1;                                  // 0x0008(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         SnapNormalsToFlatSurfaces : 1;                     // 0x0008(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNormalCalculationSettings) == 0x000004, "Wrong alignment on FNormalCalculationSettings");
static_assert(sizeof(FNormalCalculationSettings) == 0x00000C, "Wrong size on FNormalCalculationSettings");
static_assert(offsetof(FNormalCalculationSettings, HardEdgeAngle) == 0x000004, "Member 'FNormalCalculationSettings::HardEdgeAngle' has a wrong offset!");

// ScriptStruct SimplygonUObjects.VisibilitySettings
// 0x0040 (0x0040 - 0x0000)
struct FVisibilitySettings final
{
public:
	uint8                                         UseVisibilityWeightsInReducer : 1;                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         UseVisibilityWeightsInTexcoordGenerator : 1;       // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VisibilityWeightsPower;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CullOccludedGeometry : 1;                          // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ForceVisibilityCalculation : 1;                    // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         UseBackfaceCulling : 1;                            // 0x0008(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CameraSelectionSetID;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CameraSelectionSetName;                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OccluderSelectionSetID;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OccluderSelectionSetName;                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FillNonVisibleAreaThreshold;                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RemoveTrianglesNotOccludingOtherTriangles : 1;     // 0x003C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ConservativeMode : 1;                              // 0x003C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EComputeVisibilityMode                        ComputeVisibilityMode;                             // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVisibilitySettings) == 0x000008, "Wrong alignment on FVisibilitySettings");
static_assert(sizeof(FVisibilitySettings) == 0x000040, "Wrong size on FVisibilitySettings");
static_assert(offsetof(FVisibilitySettings, VisibilityWeightsPower) == 0x000004, "Member 'FVisibilitySettings::VisibilityWeightsPower' has a wrong offset!");
static_assert(offsetof(FVisibilitySettings, CameraSelectionSetID) == 0x00000C, "Member 'FVisibilitySettings::CameraSelectionSetID' has a wrong offset!");
static_assert(offsetof(FVisibilitySettings, CameraSelectionSetName) == 0x000010, "Member 'FVisibilitySettings::CameraSelectionSetName' has a wrong offset!");
static_assert(offsetof(FVisibilitySettings, OccluderSelectionSetID) == 0x000020, "Member 'FVisibilitySettings::OccluderSelectionSetID' has a wrong offset!");
static_assert(offsetof(FVisibilitySettings, OccluderSelectionSetName) == 0x000028, "Member 'FVisibilitySettings::OccluderSelectionSetName' has a wrong offset!");
static_assert(offsetof(FVisibilitySettings, FillNonVisibleAreaThreshold) == 0x000038, "Member 'FVisibilitySettings::FillNonVisibleAreaThreshold' has a wrong offset!");
static_assert(offsetof(FVisibilitySettings, ComputeVisibilityMode) == 0x00003D, "Member 'FVisibilitySettings::ComputeVisibilityMode' has a wrong offset!");

// ScriptStruct SimplygonUObjects.BoneSettings
// 0x0058 (0x0058 - 0x0000)
struct FBoneSettings final
{
public:
	uint8                                         UseBoneReducer : 1;                                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         RemoveUnusedBones : 1;                             // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         LimitBonesPerVertex : 1;                           // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBonePerVertex;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BoneReductionTargetBoneRatioEnabled : 1;           // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoneReductionTargetBoneRatio;                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BoneReductionTargetBoneCountEnabled : 1;           // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BoneReductionTargetBoneCount;                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BoneReductionTargetMaxDeviationEnabled : 1;        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoneReductionTargetMaxDeviation;                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BoneReductionTargetOnScreenSizeEnabled : 1;        // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BoneReductionTargetOnScreenSize;                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneReductionTargetStopCondition             BoneReductionTargetStopCondition;                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LockBoneSelectionSetID;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LockBoneSelectionSetName;                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemoveBoneSelectionSetID;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RemoveBoneSelectionSetName;                        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBoneSettings) == 0x000008, "Wrong alignment on FBoneSettings");
static_assert(sizeof(FBoneSettings) == 0x000058, "Wrong size on FBoneSettings");
static_assert(offsetof(FBoneSettings, MaxBonePerVertex) == 0x000004, "Member 'FBoneSettings::MaxBonePerVertex' has a wrong offset!");
static_assert(offsetof(FBoneSettings, BoneReductionTargetBoneRatio) == 0x00000C, "Member 'FBoneSettings::BoneReductionTargetBoneRatio' has a wrong offset!");
static_assert(offsetof(FBoneSettings, BoneReductionTargetBoneCount) == 0x000014, "Member 'FBoneSettings::BoneReductionTargetBoneCount' has a wrong offset!");
static_assert(offsetof(FBoneSettings, BoneReductionTargetMaxDeviation) == 0x00001C, "Member 'FBoneSettings::BoneReductionTargetMaxDeviation' has a wrong offset!");
static_assert(offsetof(FBoneSettings, BoneReductionTargetOnScreenSize) == 0x000024, "Member 'FBoneSettings::BoneReductionTargetOnScreenSize' has a wrong offset!");
static_assert(offsetof(FBoneSettings, BoneReductionTargetStopCondition) == 0x000028, "Member 'FBoneSettings::BoneReductionTargetStopCondition' has a wrong offset!");
static_assert(offsetof(FBoneSettings, LockBoneSelectionSetID) == 0x00002C, "Member 'FBoneSettings::LockBoneSelectionSetID' has a wrong offset!");
static_assert(offsetof(FBoneSettings, LockBoneSelectionSetName) == 0x000030, "Member 'FBoneSettings::LockBoneSelectionSetName' has a wrong offset!");
static_assert(offsetof(FBoneSettings, RemoveBoneSelectionSetID) == 0x000040, "Member 'FBoneSettings::RemoveBoneSelectionSetID' has a wrong offset!");
static_assert(offsetof(FBoneSettings, RemoveBoneSelectionSetName) == 0x000048, "Member 'FBoneSettings::RemoveBoneSelectionSetName' has a wrong offset!");

// ScriptStruct SimplygonUObjects.VertexWeightSettings
// 0x0028 (0x0028 - 0x0000)
struct FVertexWeightSettings final
{
public:
	uint8                                         UseVertexWeightsInReducer : 1;                     // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         UseVertexWeightsInTexcoordGenerator : 1;           // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeightsFromColorLevel;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeightsFromColorName;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeightsFromColorComponent                    WeightsFromColorComponent;                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeightsFromColorMultiplier;                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeightsFromColorMode                         WeightsFromColorMode;                              // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVertexWeightSettings) == 0x000008, "Wrong alignment on FVertexWeightSettings");
static_assert(sizeof(FVertexWeightSettings) == 0x000028, "Wrong size on FVertexWeightSettings");
static_assert(offsetof(FVertexWeightSettings, WeightsFromColorLevel) == 0x000004, "Member 'FVertexWeightSettings::WeightsFromColorLevel' has a wrong offset!");
static_assert(offsetof(FVertexWeightSettings, WeightsFromColorName) == 0x000008, "Member 'FVertexWeightSettings::WeightsFromColorName' has a wrong offset!");
static_assert(offsetof(FVertexWeightSettings, WeightsFromColorComponent) == 0x000018, "Member 'FVertexWeightSettings::WeightsFromColorComponent' has a wrong offset!");
static_assert(offsetof(FVertexWeightSettings, WeightsFromColorMultiplier) == 0x00001C, "Member 'FVertexWeightSettings::WeightsFromColorMultiplier' has a wrong offset!");
static_assert(offsetof(FVertexWeightSettings, WeightsFromColorMode) == 0x000020, "Member 'FVertexWeightSettings::WeightsFromColorMode' has a wrong offset!");

// ScriptStruct SimplygonUObjects.AttributeTessellationSettings
// 0x0020 (0x0020 - 0x0000)
struct FAttributeTessellationSettings final
{
public:
	uint8                                         EnableAttributeTessellation : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EAttributeTessellationDensityMode             AttributeTessellationDensityMode;                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETransformationSpace                          TransformationSpace;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAreaOfTessellatedValue;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLengthOfTessellatedValue;                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OnScreenSize;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         OnlyAllowOneLevelOfDifference : 1;                 // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinTessellationLevel;                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTessellationLevel;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTotalValuesCount;                               // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAttributeTessellationSettings) == 0x000004, "Wrong alignment on FAttributeTessellationSettings");
static_assert(sizeof(FAttributeTessellationSettings) == 0x000020, "Wrong size on FAttributeTessellationSettings");
static_assert(offsetof(FAttributeTessellationSettings, AttributeTessellationDensityMode) == 0x000001, "Member 'FAttributeTessellationSettings::AttributeTessellationDensityMode' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, TransformationSpace) == 0x000002, "Member 'FAttributeTessellationSettings::TransformationSpace' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, MaxAreaOfTessellatedValue) == 0x000004, "Member 'FAttributeTessellationSettings::MaxAreaOfTessellatedValue' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, MaxLengthOfTessellatedValue) == 0x000008, "Member 'FAttributeTessellationSettings::MaxLengthOfTessellatedValue' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, OnScreenSize) == 0x00000C, "Member 'FAttributeTessellationSettings::OnScreenSize' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, MinTessellationLevel) == 0x000014, "Member 'FAttributeTessellationSettings::MinTessellationLevel' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, MaxTessellationLevel) == 0x000018, "Member 'FAttributeTessellationSettings::MaxTessellationLevel' has a wrong offset!");
static_assert(offsetof(FAttributeTessellationSettings, MaxTotalValuesCount) == 0x00001C, "Member 'FAttributeTessellationSettings::MaxTotalValuesCount' has a wrong offset!");

// ScriptStruct SimplygonUObjects.ChartAggregatorSettings
// 0x0038 (0x0038 - 0x0000)
struct FChartAggregatorSettings final
{
public:
	EChartAggregatorMode                          ChartAggregatorMode;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESurfaceAreaScale                             SurfaceAreaScale;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OriginalTexCoordLevel;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OriginalTexCoordName;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SeparateOverlappingCharts : 1;                     // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OriginalChartProportionsChannel;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         LockUVRotation : 1;                                // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChartAggregatorSettings) == 0x000008, "Wrong alignment on FChartAggregatorSettings");
static_assert(sizeof(FChartAggregatorSettings) == 0x000038, "Wrong size on FChartAggregatorSettings");
static_assert(offsetof(FChartAggregatorSettings, ChartAggregatorMode) == 0x000000, "Member 'FChartAggregatorSettings::ChartAggregatorMode' has a wrong offset!");
static_assert(offsetof(FChartAggregatorSettings, SurfaceAreaScale) == 0x000001, "Member 'FChartAggregatorSettings::SurfaceAreaScale' has a wrong offset!");
static_assert(offsetof(FChartAggregatorSettings, OriginalTexCoordLevel) == 0x000004, "Member 'FChartAggregatorSettings::OriginalTexCoordLevel' has a wrong offset!");
static_assert(offsetof(FChartAggregatorSettings, OriginalTexCoordName) == 0x000008, "Member 'FChartAggregatorSettings::OriginalTexCoordName' has a wrong offset!");
static_assert(offsetof(FChartAggregatorSettings, OriginalChartProportionsChannel) == 0x000020, "Member 'FChartAggregatorSettings::OriginalChartProportionsChannel' has a wrong offset!");

// ScriptStruct SimplygonUObjects.ParameterizerSettings
// 0x0008 (0x0008 - 0x0000)
struct FParameterizerSettings final
{
public:
	float                                         MaxStretch;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LargeChartsImportance;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FParameterizerSettings) == 0x000004, "Wrong alignment on FParameterizerSettings");
static_assert(sizeof(FParameterizerSettings) == 0x000008, "Wrong size on FParameterizerSettings");
static_assert(offsetof(FParameterizerSettings, MaxStretch) == 0x000000, "Member 'FParameterizerSettings::MaxStretch' has a wrong offset!");
static_assert(offsetof(FParameterizerSettings, LargeChartsImportance) == 0x000004, "Member 'FParameterizerSettings::LargeChartsImportance' has a wrong offset!");

// ScriptStruct SimplygonUObjects.InputMaterialSettings
// 0x0004 (0x0004 - 0x0000)
struct FInputMaterialSettings final
{
public:
	int32                                         MaterialMapping;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInputMaterialSettings) == 0x000004, "Wrong alignment on FInputMaterialSettings");
static_assert(sizeof(FInputMaterialSettings) == 0x000004, "Wrong size on FInputMaterialSettings");
static_assert(offsetof(FInputMaterialSettings, MaterialMapping) == 0x000000, "Member 'FInputMaterialSettings::MaterialMapping' has a wrong offset!");

// ScriptStruct SimplygonUObjects.OutputMaterialSettings
// 0x0010 (0x0010 - 0x0000)
struct FOutputMaterialSettings final
{
public:
	int32                                         TextureWidth;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TextureHeight;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MultisamplingLevel;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GutterSpace;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOutputMaterialSettings) == 0x000004, "Wrong alignment on FOutputMaterialSettings");
static_assert(sizeof(FOutputMaterialSettings) == 0x000010, "Wrong size on FOutputMaterialSettings");
static_assert(offsetof(FOutputMaterialSettings, TextureWidth) == 0x000000, "Member 'FOutputMaterialSettings::TextureWidth' has a wrong offset!");
static_assert(offsetof(FOutputMaterialSettings, TextureHeight) == 0x000004, "Member 'FOutputMaterialSettings::TextureHeight' has a wrong offset!");
static_assert(offsetof(FOutputMaterialSettings, MultisamplingLevel) == 0x000008, "Member 'FOutputMaterialSettings::MultisamplingLevel' has a wrong offset!");
static_assert(offsetof(FOutputMaterialSettings, GutterSpace) == 0x00000C, "Member 'FOutputMaterialSettings::GutterSpace' has a wrong offset!");

// ScriptStruct SimplygonUObjects.MappingImageSettings
// 0x0098 (0x0098 - 0x0000)
struct FMappingImageSettings final
{
public:
	uint8                                         GenerateMappingImage : 1;                          // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         GenerateTexCoords : 1;                             // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         GenerateTangents : 1;                              // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ReplaceMappingImages : 1;                          // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
