#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillCheckProbabilityProficiency

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function SkillCheckProbabilityProficiency.SkillCheckProbabilityProficiency_C.GetIsActive
// 0x0018 (0x0018 - 0x0000)
struct SkillCheckProbabilityProficiency_C_GetIsActive final
{
public:
	const class UChargeableInteractionDefinition* ChargeableInteraction;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class ADBDPlayer*                       Player;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSkillCheckHappened_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillCheckProbabilityProficiency_C_GetIsActive) == 0x000008, "Wrong alignment on SkillCheckProbabilityProficiency_C_GetIsActive");
static_assert(sizeof(SkillCheckProbabilityProficiency_C_GetIsActive) == 0x000018, "Wrong size on SkillCheckProbabilityProficiency_C_GetIsActive");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetIsActive, ChargeableInteraction) == 0x000000, "Member 'SkillCheckProbabilityProficiency_C_GetIsActive::ChargeableInteraction' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetIsActive, Player) == 0x000008, "Member 'SkillCheckProbabilityProficiency_C_GetIsActive::Player' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetIsActive, ReturnValue) == 0x000010, "Member 'SkillCheckProbabilityProficiency_C_GetIsActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetIsActive, CallFunc_HasSkillCheckHappened_ReturnValue) == 0x000011, "Member 'SkillCheckProbabilityProficiency_C_GetIsActive::CallFunc_HasSkillCheckHappened_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetIsActive, CallFunc_GetIsActive_ReturnValue) == 0x000012, "Member 'SkillCheckProbabilityProficiency_C_GetIsActive::CallFunc_GetIsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetIsActive, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'SkillCheckProbabilityProficiency_C_GetIsActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SkillCheckProbabilityProficiency.SkillCheckProbabilityProficiency_C.GetType
// 0x0008 (0x0008 - 0x0000)
struct SkillCheckProbabilityProficiency_C_GetType final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectType                             ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillCheckProbabilityProficiency_C_GetType) == 0x000004, "Wrong alignment on SkillCheckProbabilityProficiency_C_GetType");
static_assert(sizeof(SkillCheckProbabilityProficiency_C_GetType) == 0x000008, "Wrong size on SkillCheckProbabilityProficiency_C_GetType");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetType, Value) == 0x000000, "Member 'SkillCheckProbabilityProficiency_C_GetType::Value' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetType, ReturnValue) == 0x000004, "Member 'SkillCheckProbabilityProficiency_C_GetType::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetType, CallFunc_Less_FloatFloat_ReturnValue) == 0x000005, "Member 'SkillCheckProbabilityProficiency_C_GetType::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetType, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000006, "Member 'SkillCheckProbabilityProficiency_C_GetType::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function SkillCheckProbabilityProficiency.SkillCheckProbabilityProficiency_C.GetValue
// 0x0050 (0x0050 - 0x0000)
struct SkillCheckProbabilityProficiency_C_GetValue final
{
public:
	const class UChargeableInteractionDefinition* ChargeableInteraction;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class ADBDPlayer*                       Player;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSkillCheckProbability_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInteractionHandler*              CallFunc_GetPlayerInteractionHandler_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdditiveSkillCheckProbabilityModifier_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMultiplicativeSkillCheckProbabilityModifier_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MathExpression_baseValue_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_additiveBonus_ImplicitCast;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MathExpression_multiplicativeBonus_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillCheckProbabilityProficiency_C_GetValue) == 0x000008, "Wrong alignment on SkillCheckProbabilityProficiency_C_GetValue");
static_assert(sizeof(SkillCheckProbabilityProficiency_C_GetValue) == 0x000050, "Wrong size on SkillCheckProbabilityProficiency_C_GetValue");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, ChargeableInteraction) == 0x000000, "Member 'SkillCheckProbabilityProficiency_C_GetValue::ChargeableInteraction' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, Player) == 0x000008, "Member 'SkillCheckProbabilityProficiency_C_GetValue::Player' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, ReturnValue) == 0x000010, "Member 'SkillCheckProbabilityProficiency_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'SkillCheckProbabilityProficiency_C_GetValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, CallFunc_GetSkillCheckProbability_ReturnValue) == 0x000018, "Member 'SkillCheckProbabilityProficiency_C_GetValue::CallFunc_GetSkillCheckProbability_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, CallFunc_GetPlayerInteractionHandler_ReturnValue) == 0x000020, "Member 'SkillCheckProbabilityProficiency_C_GetValue::CallFunc_GetPlayerInteractionHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, CallFunc_GetAdditiveSkillCheckProbabilityModifier_ReturnValue) == 0x000028, "Member 'SkillCheckProbabilityProficiency_C_GetValue::CallFunc_GetAdditiveSkillCheckProbabilityModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, CallFunc_GetMultiplicativeSkillCheckProbabilityModifier_ReturnValue) == 0x00002C, "Member 'SkillCheckProbabilityProficiency_C_GetValue::CallFunc_GetMultiplicativeSkillCheckProbabilityModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, K2Node_MathExpression_ReturnValue) == 0x000030, "Member 'SkillCheckProbabilityProficiency_C_GetValue::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, K2Node_MathExpression_baseValue_ImplicitCast) == 0x000038, "Member 'SkillCheckProbabilityProficiency_C_GetValue::K2Node_MathExpression_baseValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, K2Node_MathExpression_additiveBonus_ImplicitCast) == 0x000040, "Member 'SkillCheckProbabilityProficiency_C_GetValue::K2Node_MathExpression_additiveBonus_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SkillCheckProbabilityProficiency_C_GetValue, K2Node_MathExpression_multiplicativeBonus_ImplicitCast) == 0x000048, "Member 'SkillCheckProbabilityProficiency_C_GetValue::K2Node_MathExpression_multiplicativeBonus_ImplicitCast' has a wrong offset!");

}

