#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlasherVaultDefinition

#include "Basic.hpp"

#include "AnimationUtilities_structs.hpp"


namespace SDK::Params
{

// Function SlasherVaultDefinition.SlasherVaultDefinition_C.GetUpdateMontage
// 0x00B0 (0x00B0 - 0x0000)
struct SlasherVaultDefinition_C_GetUpdateMontage final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimationMontageDescriptor            ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            CallFunc_GetUpdateMontage_ReturnValue;             // 0x0030(0x0020)()
	struct FAnimationMontageDescriptor            K2Node_MakeStruct_AnimationMontageDescriptor;      // 0x0050(0x0020)()
	struct FAnimationMontageDescriptor            K2Node_Select_Default;                             // 0x0070(0x0020)()
	struct FAnimationMontageDescriptor            K2Node_MakeStruct_AnimationMontageDescriptor_1;    // 0x0090(0x0020)()
};
static_assert(alignof(SlasherVaultDefinition_C_GetUpdateMontage) == 0x000008, "Wrong alignment on SlasherVaultDefinition_C_GetUpdateMontage");
static_assert(sizeof(SlasherVaultDefinition_C_GetUpdateMontage) == 0x0000B0, "Wrong size on SlasherVaultDefinition_C_GetUpdateMontage");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, Player) == 0x000000, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::Player' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, ReturnValue) == 0x000008, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, Temp_bool_Variable) == 0x000028, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, CallFunc_IsCrouching_ReturnValue) == 0x000029, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, CallFunc_GetUpdateMontage_ReturnValue) == 0x000030, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::CallFunc_GetUpdateMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, K2Node_MakeStruct_AnimationMontageDescriptor) == 0x000050, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::K2Node_MakeStruct_AnimationMontageDescriptor' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, K2Node_Select_Default) == 0x000070, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetUpdateMontage, K2Node_MakeStruct_AnimationMontageDescriptor_1) == 0x000090, "Member 'SlasherVaultDefinition_C_GetUpdateMontage::K2Node_MakeStruct_AnimationMontageDescriptor_1' has a wrong offset!");

// Function SlasherVaultDefinition.SlasherVaultDefinition_C.GetInteractionTimeMultiplier
// 0x0068 (0x0068 - 0x0000)
struct SlasherVaultDefinition_C_GetInteractionTimeMultiplier final
{
public:
	const class ADBDPlayer*                       Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpeedModifier;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         K2Node_DynamicCast_AsSlasher_Player;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEvilWithinComponent*                   CallFunc_GetFirstComponentByClass_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentTier_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue_2;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_SpeedModifier_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SpeedModifier_ImplicitCast_1;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SpeedModifier_ImplicitCast_2;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier) == 0x000008, "Wrong alignment on SlasherVaultDefinition_C_GetInteractionTimeMultiplier");
static_assert(sizeof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier) == 0x000068, "Wrong size on SlasherVaultDefinition_C_GetInteractionTimeMultiplier");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, Character) == 0x000000, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::Character' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, ReturnValue) == 0x000008, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, SpeedModifier) == 0x000010, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::SpeedModifier' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_DynamicCast_AsSlasher_Player) == 0x000018, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_DynamicCast_AsSlasher_Player' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, CallFunc_GetFirstComponentByClass_ReturnValue) == 0x000028, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::CallFunc_GetFirstComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, CallFunc_GetCurrentTier_ReturnValue) == 0x000034, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::CallFunc_GetCurrentTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, CallFunc_GetTunableValue_ReturnValue) == 0x00003C, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, CallFunc_GetTunableValue_ReturnValue_1) == 0x000040, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::CallFunc_GetTunableValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, CallFunc_GetTunableValue_ReturnValue_2) == 0x000044, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::CallFunc_GetTunableValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000048, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_VariableSet_SpeedModifier_ImplicitCast) == 0x000050, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_VariableSet_SpeedModifier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_VariableSet_SpeedModifier_ImplicitCast_1) == 0x000058, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_VariableSet_SpeedModifier_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SlasherVaultDefinition_C_GetInteractionTimeMultiplier, K2Node_VariableSet_SpeedModifier_ImplicitCast_2) == 0x000060, "Member 'SlasherVaultDefinition_C_GetInteractionTimeMultiplier::K2Node_VariableSet_SpeedModifier_ImplicitCast_2' has a wrong offset!");

}

