#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlasherInteractable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SlasherInteractable.SlasherInteractable_C
// 0x0050 (0x0438 - 0x03E8)
class ASlasherInteractable_C final : public ASlasherInteractable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGeneratorTrapStun_C*                   GeneratorTrapStun;                                 // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPalletStun_C*                          PalletStun;                                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClosetStun_C*                          ClosetStun;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStunBySkillCheck_C*                    StunBySkillCheck;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGenericStun_C*                         GenericStun;                                       // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGenericStun_C*                         KickStun;                                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGenericStun_C*                         EvilWithinStun;                                    // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractor*                            GenericStunInteractor;                             // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void InitInteractable(class ADBDPlayer* Player);
	void GetSlasher(class ASlasherPlayer** Slasher);
	void ExecuteUbergraph_SlasherInteractable(int32 EntryPoint);

	bool IsInteractionPossibleInternal(class ADBDPlayer* Player, const class UInteractor* Interactor, const class UInteractionDefinition* Definition, EInputInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SlasherInteractable_C">();
	}
	static class ASlasherInteractable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASlasherInteractable_C>();
	}
};
static_assert(alignof(ASlasherInteractable_C) == 0x000008, "Wrong alignment on ASlasherInteractable_C");
static_assert(sizeof(ASlasherInteractable_C) == 0x000438, "Wrong size on ASlasherInteractable_C");
static_assert(offsetof(ASlasherInteractable_C, UberGraphFrame) == 0x0003E8, "Member 'ASlasherInteractable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, GeneratorTrapStun) == 0x0003F0, "Member 'ASlasherInteractable_C::GeneratorTrapStun' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, PalletStun) == 0x0003F8, "Member 'ASlasherInteractable_C::PalletStun' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, ClosetStun) == 0x000400, "Member 'ASlasherInteractable_C::ClosetStun' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, StunBySkillCheck) == 0x000408, "Member 'ASlasherInteractable_C::StunBySkillCheck' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, GenericStun) == 0x000410, "Member 'ASlasherInteractable_C::GenericStun' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, KickStun) == 0x000418, "Member 'ASlasherInteractable_C::KickStun' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, EvilWithinStun) == 0x000420, "Member 'ASlasherInteractable_C::EvilWithinStun' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, GenericStunInteractor) == 0x000428, "Member 'ASlasherInteractable_C::GenericStunInteractor' has a wrong offset!");
static_assert(offsetof(ASlasherInteractable_C, Root) == 0x000430, "Member 'ASlasherInteractable_C::Root' has a wrong offset!");

}

