#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartupInitializer

#include "Basic.hpp"


namespace SDK::Params
{

// Function StartupInitializer.ClientStartupInitializer.CheckForCustomIconsComplete
// 0x0001 (0x0001 - 0x0000)
struct ClientStartupInitializer_CheckForCustomIconsComplete final
{
public:
	bool                                          FoundCustomIcons;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientStartupInitializer_CheckForCustomIconsComplete) == 0x000001, "Wrong alignment on ClientStartupInitializer_CheckForCustomIconsComplete");
static_assert(sizeof(ClientStartupInitializer_CheckForCustomIconsComplete) == 0x000001, "Wrong size on ClientStartupInitializer_CheckForCustomIconsComplete");
static_assert(offsetof(ClientStartupInitializer_CheckForCustomIconsComplete, FoundCustomIcons) == 0x000000, "Member 'ClientStartupInitializer_CheckForCustomIconsComplete::FoundCustomIcons' has a wrong offset!");

// Function StartupInitializer.ClientStartupInitializer.OnDynamicContentLoaded
// 0x0001 (0x0001 - 0x0000)
struct ClientStartupInitializer_OnDynamicContentLoaded final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientStartupInitializer_OnDynamicContentLoaded) == 0x000001, "Wrong alignment on ClientStartupInitializer_OnDynamicContentLoaded");
static_assert(sizeof(ClientStartupInitializer_OnDynamicContentLoaded) == 0x000001, "Wrong size on ClientStartupInitializer_OnDynamicContentLoaded");
static_assert(offsetof(ClientStartupInitializer_OnDynamicContentLoaded, Success) == 0x000000, "Member 'ClientStartupInitializer_OnDynamicContentLoaded::Success' has a wrong offset!");

// Function StartupInitializer.ClientStartupInitializer.OnMysteryBoxStatusLoaded
// 0x0001 (0x0001 - 0x0000)
struct ClientStartupInitializer_OnMysteryBoxStatusLoaded final
{
public:
	bool                                          Succeeded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientStartupInitializer_OnMysteryBoxStatusLoaded) == 0x000001, "Wrong alignment on ClientStartupInitializer_OnMysteryBoxStatusLoaded");
static_assert(sizeof(ClientStartupInitializer_OnMysteryBoxStatusLoaded) == 0x000001, "Wrong size on ClientStartupInitializer_OnMysteryBoxStatusLoaded");
static_assert(offsetof(ClientStartupInitializer_OnMysteryBoxStatusLoaded, Succeeded) == 0x000000, "Member 'ClientStartupInitializer_OnMysteryBoxStatusLoaded::Succeeded' has a wrong offset!");

}

