#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextureUtilitiesCommon

#include "Basic.hpp"

#include "TextureUtilitiesCommon_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class TextureUtilitiesCommon.TextureImportSettings
// 0x0008 (0x0050 - 0x0048)
class UTextureImportSettings final : public UDeveloperSettings
{
public:
	int32                                         AutoVTSize;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalizeNormals;                           // 0x004C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFastMipFilter;                              // 0x004D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportFloatingPointFormat             CompressedFormatForFloatTextures;                  // 0x004E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureImportSettings">();
	}
	static class UTextureImportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureImportSettings>();
	}
};
static_assert(alignof(UTextureImportSettings) == 0x000008, "Wrong alignment on UTextureImportSettings");
static_assert(sizeof(UTextureImportSettings) == 0x000050, "Wrong size on UTextureImportSettings");
static_assert(offsetof(UTextureImportSettings, AutoVTSize) == 0x000048, "Member 'UTextureImportSettings::AutoVTSize' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, bEnableNormalizeNormals) == 0x00004C, "Member 'UTextureImportSettings::bEnableNormalizeNormals' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, bEnableFastMipFilter) == 0x00004D, "Member 'UTextureImportSettings::bEnableFastMipFilter' has a wrong offset!");
static_assert(offsetof(UTextureImportSettings, CompressedFormatForFloatTextures) == 0x00004E, "Member 'UTextureImportSettings::CompressedFormatForFloatTextures' has a wrong offset!");

}

