#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheDemogorgon

#include "Basic.hpp"

#include "DBDAnimation_classes.hpp"
#include "DBDAttack_classes.hpp"
#include "Engine_classes.hpp"
#include "TheDemogorgon_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class TheDemogorgon.DemogorgonPortalPlacerStateComponent
// 0x0098 (0x0140 - 0x00A8)
class UDemogorgonPortalPlacerStateComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnTeleportCooldownComplete;                        // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0xC];                                       // 0x00B8(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _remainingPortals;                                 // 0x00C4(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x48];                                      // 0x00C8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADemogorgonPortal*>              _placedPortals;                                    // 0x0110(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FPortalRestrictedLocation>      _restrictedPortalLocations;                        // 0x0120(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitializeTunableValues(class ASlasherPlayer* Killer);
	void OnDemogorgonTeleportCooldownComplete__DelegateSignature();
	void OnLevelReadyToPlay();
	void UpdateRemainingPortalCount();

	int32 GetRemainingPortalCount() const;
	float GetTeleportDuration() const;
	bool IsUsePortalCooldownDone() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPortalPlacerStateComponent">();
	}
	static class UDemogorgonPortalPlacerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPortalPlacerStateComponent>();
	}
};
static_assert(alignof(UDemogorgonPortalPlacerStateComponent) == 0x000008, "Wrong alignment on UDemogorgonPortalPlacerStateComponent");
static_assert(sizeof(UDemogorgonPortalPlacerStateComponent) == 0x000140, "Wrong size on UDemogorgonPortalPlacerStateComponent");
static_assert(offsetof(UDemogorgonPortalPlacerStateComponent, OnTeleportCooldownComplete) == 0x0000A8, "Member 'UDemogorgonPortalPlacerStateComponent::OnTeleportCooldownComplete' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacerStateComponent, _remainingPortals) == 0x0000C4, "Member 'UDemogorgonPortalPlacerStateComponent::_remainingPortals' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacerStateComponent, _placedPortals) == 0x000110, "Member 'UDemogorgonPortalPlacerStateComponent::_placedPortals' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacerStateComponent, _restrictedPortalLocations) == 0x000120, "Member 'UDemogorgonPortalPlacerStateComponent::_restrictedPortalLocations' has a wrong offset!");

// Class TheDemogorgon.DemogorgonAnimInstance
// 0x0030 (0x0750 - 0x0720)
class UDemogorgonAnimInstance final : public UKillerAnimInstance
{
public:
	float                                         _leftArmPushback;                                  // 0x0720(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _rightArmPushback;                                 // 0x0724(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDemogorgonCharging;                             // 0x0728(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _demogorgonChargingPercent;                        // 0x072C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_730[0x20];                                     // 0x0730(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonAnimInstance">();
	}
	static class UDemogorgonAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonAnimInstance>();
	}
};
static_assert(alignof(UDemogorgonAnimInstance) == 0x000010, "Wrong alignment on UDemogorgonAnimInstance");
static_assert(sizeof(UDemogorgonAnimInstance) == 0x000750, "Wrong size on UDemogorgonAnimInstance");
static_assert(offsetof(UDemogorgonAnimInstance, _leftArmPushback) == 0x000720, "Member 'UDemogorgonAnimInstance::_leftArmPushback' has a wrong offset!");
static_assert(offsetof(UDemogorgonAnimInstance, _rightArmPushback) == 0x000724, "Member 'UDemogorgonAnimInstance::_rightArmPushback' has a wrong offset!");
static_assert(offsetof(UDemogorgonAnimInstance, _isDemogorgonCharging) == 0x000728, "Member 'UDemogorgonAnimInstance::_isDemogorgonCharging' has a wrong offset!");
static_assert(offsetof(UDemogorgonAnimInstance, _demogorgonChargingPercent) == 0x00072C, "Member 'UDemogorgonAnimInstance::_demogorgonChargingPercent' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPortalRadiusDetectorComponent
// 0x0060 (0x0108 - 0x00A8)
class UDemogorgonPortalRadiusDetectorComponent final : public UActorComponent
{
public:
	TArray<class ADemogorgonPortal*>              Portals;                                           // 0x00A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class ADBDPlayer*>                     _playersInsideRadius;                              // 0x00B8(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x30];                                      // 0x00C8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _portalContactEffect;                              // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _portalProximityHuntingCamperEffect;               // 0x0100(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_CallOnPortalEffectsApplied(TDelegate<void()> Callback);
	void Authority_OnLevelReadyToPlay();
	void OnPortalEffectsAppliedMultiDelegate__DelegateSignature();
	void OnRep_PlayersInsideRadius();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPortalRadiusDetectorComponent">();
	}
	static class UDemogorgonPortalRadiusDetectorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPortalRadiusDetectorComponent>();
	}
};
static_assert(alignof(UDemogorgonPortalRadiusDetectorComponent) == 0x000008, "Wrong alignment on UDemogorgonPortalRadiusDetectorComponent");
static_assert(sizeof(UDemogorgonPortalRadiusDetectorComponent) == 0x000108, "Wrong size on UDemogorgonPortalRadiusDetectorComponent");
static_assert(offsetof(UDemogorgonPortalRadiusDetectorComponent, Portals) == 0x0000A8, "Member 'UDemogorgonPortalRadiusDetectorComponent::Portals' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalRadiusDetectorComponent, _playersInsideRadius) == 0x0000B8, "Member 'UDemogorgonPortalRadiusDetectorComponent::_playersInsideRadius' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalRadiusDetectorComponent, _portalContactEffect) == 0x0000F8, "Member 'UDemogorgonPortalRadiusDetectorComponent::_portalContactEffect' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalRadiusDetectorComponent, _portalProximityHuntingCamperEffect) == 0x000100, "Member 'UDemogorgonPortalRadiusDetectorComponent::_portalProximityHuntingCamperEffect' has a wrong offset!");

// Class TheDemogorgon.DemogorgonAnimProxyComponent
// 0x0020 (0x00C8 - 0x00A8)
class UDemogorgonAnimProxyComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonAnimProxyComponent">();
	}
	static class UDemogorgonAnimProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonAnimProxyComponent>();
	}
};
static_assert(alignof(UDemogorgonAnimProxyComponent) == 0x000008, "Wrong alignment on UDemogorgonAnimProxyComponent");
static_assert(sizeof(UDemogorgonAnimProxyComponent) == 0x0000C8, "Wrong size on UDemogorgonAnimProxyComponent");

// Class TheDemogorgon.DemogorgonHuskAnimInstance
// 0x0080 (0x03D0 - 0x0350)
class UDemogorgonHuskAnimInstance final : public UAnimInstance
{
public:
	class APawn*                                  _owningPawn;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _teleportDuration;                                 // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _teleportExitPlayRate;                             // 0x035C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSlowerExit;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isTeleporting;                                    // 0x0361(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          _huskPortalSlowerExit;                             // 0x0368(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _huskPortalExit;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           _demogorgonPortalExit;                             // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           _demogorgonPortalEntry;                            // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDemogorgonPortalPlacerStateComponent> _demogorgonPortalPlacerState;                      // 0x0388(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0x40];                                     // 0x0390(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillerSet(class ASlasherPlayer* Killer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonHuskAnimInstance">();
	}
	static class UDemogorgonHuskAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonHuskAnimInstance>();
	}
};
static_assert(alignof(UDemogorgonHuskAnimInstance) == 0x000010, "Wrong alignment on UDemogorgonHuskAnimInstance");
static_assert(sizeof(UDemogorgonHuskAnimInstance) == 0x0003D0, "Wrong size on UDemogorgonHuskAnimInstance");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _owningPawn) == 0x000350, "Member 'UDemogorgonHuskAnimInstance::_owningPawn' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _teleportDuration) == 0x000358, "Member 'UDemogorgonHuskAnimInstance::_teleportDuration' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _teleportExitPlayRate) == 0x00035C, "Member 'UDemogorgonHuskAnimInstance::_teleportExitPlayRate' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _isSlowerExit) == 0x000360, "Member 'UDemogorgonHuskAnimInstance::_isSlowerExit' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _isTeleporting) == 0x000361, "Member 'UDemogorgonHuskAnimInstance::_isTeleporting' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _huskPortalSlowerExit) == 0x000368, "Member 'UDemogorgonHuskAnimInstance::_huskPortalSlowerExit' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _huskPortalExit) == 0x000370, "Member 'UDemogorgonHuskAnimInstance::_huskPortalExit' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _demogorgonPortalExit) == 0x000378, "Member 'UDemogorgonHuskAnimInstance::_demogorgonPortalExit' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _demogorgonPortalEntry) == 0x000380, "Member 'UDemogorgonHuskAnimInstance::_demogorgonPortalEntry' has a wrong offset!");
static_assert(offsetof(UDemogorgonHuskAnimInstance, _demogorgonPortalPlacerState) == 0x000388, "Member 'UDemogorgonHuskAnimInstance::_demogorgonPortalPlacerState' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPortal
// 0x00C0 (0x0468 - 0x03A8)
class ADemogorgonPortal final : public AInteractable
{
public:
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    _portalAreaCollider;                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _destroyChargeable;                                // 0x03C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _teleportChargeable;                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDemogorgonPortalState                        _portalState;                                      // 0x03D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          _portalIdleSound;                                  // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          _portalDestroyingStart;                            // 0x03E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          _portalTeleportingSound;                           // 0x03E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                        _destroyParticleSystem;                            // 0x03F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _destroyDuration;                                  // 0x03F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3FC[0x24];                                     // 0x03FC(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADBDPlayer*>                     _destroyingPlayers;                                // 0x0420(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x30];                                     // 0x0430(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIPerceptionStimuliSourceComponent*    _perceptionStimuliComponent;                       // 0x0460(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnDestroyChargePercentChanged(class UChargeableComponent* ChargeableComponent, float PercentCompletionChange, float TotalPercentComplete);
	void Authority_OnTeleportChargePercentChanged(class UChargeableComponent* ChargeableComponent, float PercentCompletionChange, float TotalPercentComplete);
	void Authority_StopDestroyingPlayers();
	void MakePortalDisappearVFX();
	void OnBeginOverlapPortalArea(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndOverlapPortalArea(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnPortalDestroyed(class ADBDPlayer* Player);
	void OnPortalStateChanged(EDemogorgonPortalState State);
	void OnTargetedChanged();
	void OnTeleportAbilityCooldownChangedVFX(bool IsOnCooldown);
	void PlaySoundFromPortal(class UAkAudioEvent* SoundEvent);
	void RemovePortalActiveVFX();
	void RemovePortalTeleportInteractionStartVFX();
	void ShowPortalActiveVFX();
	void ShowPortalTeleportInteractionStartVFX();
	void TriggerDirtExplosion();

	float GetDestroyDuration() const;
	bool IsTargeted() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPortal">();
	}
	static class ADemogorgonPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADemogorgonPortal>();
	}
};
static_assert(alignof(ADemogorgonPortal) == 0x000008, "Wrong alignment on ADemogorgonPortal");
static_assert(sizeof(ADemogorgonPortal) == 0x000468, "Wrong size on ADemogorgonPortal");
static_assert(offsetof(ADemogorgonPortal, _portalAreaCollider) == 0x0003B8, "Member 'ADemogorgonPortal::_portalAreaCollider' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _destroyChargeable) == 0x0003C0, "Member 'ADemogorgonPortal::_destroyChargeable' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _teleportChargeable) == 0x0003C8, "Member 'ADemogorgonPortal::_teleportChargeable' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _portalState) == 0x0003D0, "Member 'ADemogorgonPortal::_portalState' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _portalIdleSound) == 0x0003D8, "Member 'ADemogorgonPortal::_portalIdleSound' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _portalDestroyingStart) == 0x0003E0, "Member 'ADemogorgonPortal::_portalDestroyingStart' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _portalTeleportingSound) == 0x0003E8, "Member 'ADemogorgonPortal::_portalTeleportingSound' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _destroyParticleSystem) == 0x0003F0, "Member 'ADemogorgonPortal::_destroyParticleSystem' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _destroyDuration) == 0x0003F8, "Member 'ADemogorgonPortal::_destroyDuration' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _destroyingPlayers) == 0x000420, "Member 'ADemogorgonPortal::_destroyingPlayers' has a wrong offset!");
static_assert(offsetof(ADemogorgonPortal, _perceptionStimuliComponent) == 0x000460, "Member 'ADemogorgonPortal::_perceptionStimuliComponent' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPortalOutlineUpdateStrategy
// 0x0030 (0x0100 - 0x00D0)
class UDemogorgonPortalOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _survivorAuraColor;                                // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _killerHiddenAuraColor;                            // 0x00E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _killerExposedAuraColor;                           // 0x00F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPortalOutlineUpdateStrategy">();
	}
	static class UDemogorgonPortalOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPortalOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UDemogorgonPortalOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UDemogorgonPortalOutlineUpdateStrategy");
static_assert(sizeof(UDemogorgonPortalOutlineUpdateStrategy) == 0x000100, "Wrong size on UDemogorgonPortalOutlineUpdateStrategy");
static_assert(offsetof(UDemogorgonPortalOutlineUpdateStrategy, _survivorAuraColor) == 0x0000D0, "Member 'UDemogorgonPortalOutlineUpdateStrategy::_survivorAuraColor' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalOutlineUpdateStrategy, _killerHiddenAuraColor) == 0x0000E0, "Member 'UDemogorgonPortalOutlineUpdateStrategy::_killerHiddenAuraColor' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalOutlineUpdateStrategy, _killerExposedAuraColor) == 0x0000F0, "Member 'UDemogorgonPortalOutlineUpdateStrategy::_killerExposedAuraColor' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPortalPlacementValidationStrategy
// 0x0020 (0x0118 - 0x00F8)
class UDemogorgonPortalPlacementValidationStrategy final : public UDefaultObjectPlacementValidationStrategy
{
public:
	class UDemogorgonPortalPlacerStateComponent*  _portalPlacerState;                                // 0x00F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargedAttackStateComponent*           _chargedAttackState;                               // 0x0100(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceForWorldCollisionDetection;               // 0x0108(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _numberOfGroundTest;                               // 0x010C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _portalEdgeTestRadius;                             // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxElevationDifferentialOnPortalEdge;             // 0x0114(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPortalPlacementValidationStrategy">();
	}
	static class UDemogorgonPortalPlacementValidationStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPortalPlacementValidationStrategy>();
	}
};
static_assert(alignof(UDemogorgonPortalPlacementValidationStrategy) == 0x000008, "Wrong alignment on UDemogorgonPortalPlacementValidationStrategy");
static_assert(sizeof(UDemogorgonPortalPlacementValidationStrategy) == 0x000118, "Wrong size on UDemogorgonPortalPlacementValidationStrategy");
static_assert(offsetof(UDemogorgonPortalPlacementValidationStrategy, _portalPlacerState) == 0x0000F8, "Member 'UDemogorgonPortalPlacementValidationStrategy::_portalPlacerState' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacementValidationStrategy, _chargedAttackState) == 0x000100, "Member 'UDemogorgonPortalPlacementValidationStrategy::_chargedAttackState' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacementValidationStrategy, _distanceForWorldCollisionDetection) == 0x000108, "Member 'UDemogorgonPortalPlacementValidationStrategy::_distanceForWorldCollisionDetection' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacementValidationStrategy, _numberOfGroundTest) == 0x00010C, "Member 'UDemogorgonPortalPlacementValidationStrategy::_numberOfGroundTest' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacementValidationStrategy, _portalEdgeTestRadius) == 0x000110, "Member 'UDemogorgonPortalPlacementValidationStrategy::_portalEdgeTestRadius' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalPlacementValidationStrategy, _maxElevationDifferentialOnPortalEdge) == 0x000114, "Member 'UDemogorgonPortalPlacementValidationStrategy::_maxElevationDifferentialOnPortalEdge' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPortalTargetingComponent
// 0x0050 (0x00F8 - 0x00A8)
class UDemogorgonPortalTargetingComponent final : public UActorComponent
{
public:
	class ADemogorgonPortal*                      _targetedPortal;                                   // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDemogorgonPortalPlacerStateComponent*  _portalPlacerState;                                // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x40];                                      // 0x00B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ADemogorgonPortal* GetTargetedPortal();
	void Multicast_SetTargetedPortal(class ADemogorgonPortal* TargetedPortal);
	void Server_SetTargetedPortal(class ADemogorgonPortal* TargetedPortal);
	void SetIsPorting(bool IsPorting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPortalTargetingComponent">();
	}
	static class UDemogorgonPortalTargetingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPortalTargetingComponent>();
	}
};
static_assert(alignof(UDemogorgonPortalTargetingComponent) == 0x000008, "Wrong alignment on UDemogorgonPortalTargetingComponent");
static_assert(sizeof(UDemogorgonPortalTargetingComponent) == 0x0000F8, "Wrong size on UDemogorgonPortalTargetingComponent");
static_assert(offsetof(UDemogorgonPortalTargetingComponent, _targetedPortal) == 0x0000A8, "Member 'UDemogorgonPortalTargetingComponent::_targetedPortal' has a wrong offset!");
static_assert(offsetof(UDemogorgonPortalTargetingComponent, _portalPlacerState) == 0x0000B0, "Member 'UDemogorgonPortalTargetingComponent::_portalPlacerState' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPounceAttack
// 0x00A0 (0x04C0 - 0x0420)
class UDemogorgonPounceAttack final : public UPounceAttack
{
public:
	uint8                                         Pad_420[0xA0];                                     // 0x0420(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPounceAttack">();
	}
	static class UDemogorgonPounceAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPounceAttack>();
	}
};
static_assert(alignof(UDemogorgonPounceAttack) == 0x000010, "Wrong alignment on UDemogorgonPounceAttack");
static_assert(sizeof(UDemogorgonPounceAttack) == 0x0004C0, "Wrong size on UDemogorgonPounceAttack");

// Class TheDemogorgon.DemogorgonPounceAttackOpenSubstate
// 0x0000 (0x0130 - 0x0130)
class UDemogorgonPounceAttackOpenSubstate final : public UPounceAttackOpenSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPounceAttackOpenSubstate">();
	}
	static class UDemogorgonPounceAttackOpenSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPounceAttackOpenSubstate>();
	}
};
static_assert(alignof(UDemogorgonPounceAttackOpenSubstate) == 0x000008, "Wrong alignment on UDemogorgonPounceAttackOpenSubstate");
static_assert(sizeof(UDemogorgonPounceAttackOpenSubstate) == 0x000130, "Wrong size on UDemogorgonPounceAttackOpenSubstate");

// Class TheDemogorgon.DemogorgonPounceAttackSuccessSubstate
// 0x0000 (0x0118 - 0x0118)
class UDemogorgonPounceAttackSuccessSubstate final : public UPounceAttackSuccessSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPounceAttackSuccessSubstate">();
	}
	static class UDemogorgonPounceAttackSuccessSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPounceAttackSuccessSubstate>();
	}
};
static_assert(alignof(UDemogorgonPounceAttackSuccessSubstate) == 0x000008, "Wrong alignment on UDemogorgonPounceAttackSuccessSubstate");
static_assert(sizeof(UDemogorgonPounceAttackSuccessSubstate) == 0x000118, "Wrong size on UDemogorgonPounceAttackSuccessSubstate");

// Class TheDemogorgon.DemogorgonPounceAttackMissSubstate
// 0x0000 (0x0120 - 0x0120)
class UDemogorgonPounceAttackMissSubstate final : public UPounceAttackMissSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPounceAttackMissSubstate">();
	}
	static class UDemogorgonPounceAttackMissSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPounceAttackMissSubstate>();
	}
};
static_assert(alignof(UDemogorgonPounceAttackMissSubstate) == 0x000008, "Wrong alignment on UDemogorgonPounceAttackMissSubstate");
static_assert(sizeof(UDemogorgonPounceAttackMissSubstate) == 0x000120, "Wrong size on UDemogorgonPounceAttackMissSubstate");

// Class TheDemogorgon.DemogorgonPounceAttackObstructSubstate
// 0x0000 (0x0128 - 0x0128)
class UDemogorgonPounceAttackObstructSubstate final : public UPounceAttackObstructSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPounceAttackObstructSubstate">();
	}
	static class UDemogorgonPounceAttackObstructSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPounceAttackObstructSubstate>();
	}
};
static_assert(alignof(UDemogorgonPounceAttackObstructSubstate) == 0x000008, "Wrong alignment on UDemogorgonPounceAttackObstructSubstate");
static_assert(sizeof(UDemogorgonPounceAttackObstructSubstate) == 0x000128, "Wrong size on UDemogorgonPounceAttackObstructSubstate");

// Class TheDemogorgon.DemogorgonPounceInteraction
// 0x00F0 (0x09B0 - 0x08C0)
class UDemogorgonPounceInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0xA0];                                     // 0x08C0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _demogorgonPounceFOVStatusEffectClass;             // 0x0960(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargedAttackStateComponent*           _chargedAttackState;                               // 0x0968(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASlasherPlayer*                         _owningSlasher;                                    // 0x0970(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_978[0x38];                                     // 0x0978(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCancelCooldownComplete();
	void OnChargedAttackReadyChanged(bool Ready);
	void TriggerChargeCancelAudioEvent();
	void TriggerHuntingAudioEvent(bool IsHunting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPounceInteraction">();
	}
	static class UDemogorgonPounceInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPounceInteraction>();
	}
};
static_assert(alignof(UDemogorgonPounceInteraction) == 0x000010, "Wrong alignment on UDemogorgonPounceInteraction");
static_assert(sizeof(UDemogorgonPounceInteraction) == 0x0009B0, "Wrong size on UDemogorgonPounceInteraction");
static_assert(offsetof(UDemogorgonPounceInteraction, _demogorgonPounceFOVStatusEffectClass) == 0x000960, "Member 'UDemogorgonPounceInteraction::_demogorgonPounceFOVStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UDemogorgonPounceInteraction, _chargedAttackState) == 0x000968, "Member 'UDemogorgonPounceInteraction::_chargedAttackState' has a wrong offset!");
static_assert(offsetof(UDemogorgonPounceInteraction, _owningSlasher) == 0x000970, "Member 'UDemogorgonPounceInteraction::_owningSlasher' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPower
// 0x0010 (0x0560 - 0x0550)
class ADemogorgonPower final : public ACollectable
{
public:
	TSubclassOf<class AActor>                     _demogorgonHuskClass;                              // 0x0550(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 _demogorgonHusk;                                   // 0x0558(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPower">();
	}
	static class ADemogorgonPower* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADemogorgonPower>();
	}
};
static_assert(alignof(ADemogorgonPower) == 0x000008, "Wrong alignment on ADemogorgonPower");
static_assert(sizeof(ADemogorgonPower) == 0x000560, "Wrong size on ADemogorgonPower");
static_assert(offsetof(ADemogorgonPower, _demogorgonHuskClass) == 0x000550, "Member 'ADemogorgonPower::_demogorgonHuskClass' has a wrong offset!");
static_assert(offsetof(ADemogorgonPower, _demogorgonHusk) == 0x000558, "Member 'ADemogorgonPower::_demogorgonHusk' has a wrong offset!");

// Class TheDemogorgon.DemogorgonPowerItemProgressComponent
// 0x0008 (0x00B8 - 0x00B0)
class UDemogorgonPowerItemProgressComponent final : public UPresentationItemProgressComponent
{
public:
	class UDemogorgonPortalPlacerStateComponent*  _portalPlacerState;                                // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonPowerItemProgressComponent">();
	}
	static class UDemogorgonPowerItemProgressComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonPowerItemProgressComponent>();
	}
};
static_assert(alignof(UDemogorgonPowerItemProgressComponent) == 0x000008, "Wrong alignment on UDemogorgonPowerItemProgressComponent");
static_assert(sizeof(UDemogorgonPowerItemProgressComponent) == 0x0000B8, "Wrong size on UDemogorgonPowerItemProgressComponent");
static_assert(offsetof(UDemogorgonPowerItemProgressComponent, _portalPlacerState) == 0x0000B0, "Member 'UDemogorgonPowerItemProgressComponent::_portalPlacerState' has a wrong offset!");

// Class TheDemogorgon.DemogorgonScoreComponent
// 0x0010 (0x00B8 - 0x00A8)
class UDemogorgonScoreComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonScoreComponent">();
	}
	static class UDemogorgonScoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonScoreComponent>();
	}
};
static_assert(alignof(UDemogorgonScoreComponent) == 0x000008, "Wrong alignment on UDemogorgonScoreComponent");
static_assert(sizeof(UDemogorgonScoreComponent) == 0x0000B8, "Wrong size on UDemogorgonScoreComponent");

// Class TheDemogorgon.DemogorgonStealthComponent
// 0x0028 (0x00D0 - 0x00A8)
class UDemogorgonStealthComponent final : public UActorComponent
{
public:
	class UStatusEffect*                          _stealthEffect;                                    // 0x00A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _stealthEffectClass;                               // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DemogorgonStealthComponent">();
	}
	static class UDemogorgonStealthComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemogorgonStealthComponent>();
	}
};
static_assert(alignof(UDemogorgonStealthComponent) == 0x000008, "Wrong alignment on UDemogorgonStealthComponent");
static_assert(sizeof(UDemogorgonStealthComponent) == 0x0000D0, "Wrong size on UDemogorgonStealthComponent");
static_assert(offsetof(UDemogorgonStealthComponent, _stealthEffect) == 0x0000A8, "Member 'UDemogorgonStealthComponent::_stealthEffect' has a wrong offset!");
static_assert(offsetof(UDemogorgonStealthComponent, _stealthEffectClass) == 0x0000B0, "Member 'UDemogorgonStealthComponent::_stealthEffectClass' has a wrong offset!");

// Class TheDemogorgon.DestroyDemogorgonPortalInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UDestroyDemogorgonPortalInteraction final : public UChargeableInteractionDefinition
{
public:
	class ADemogorgonPortal*                      _owningPortal;                                     // 0x08C0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnChargeApplied(float IndividualChargeAmount, float TotalChargeAmount, class AActor* ChargeInstigator, bool WasCoop, float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DestroyDemogorgonPortalInteraction">();
	}
	static class UDestroyDemogorgonPortalInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroyDemogorgonPortalInteraction>();
	}
};
static_assert(alignof(UDestroyDemogorgonPortalInteraction) == 0x000010, "Wrong alignment on UDestroyDemogorgonPortalInteraction");
static_assert(sizeof(UDestroyDemogorgonPortalInteraction) == 0x0008D0, "Wrong size on UDestroyDemogorgonPortalInteraction");
static_assert(offsetof(UDestroyDemogorgonPortalInteraction, _owningPortal) == 0x0008C0, "Member 'UDestroyDemogorgonPortalInteraction::_owningPortal' has a wrong offset!");

// Class TheDemogorgon.ElevensSodaAddon
// 0x0018 (0x0300 - 0x02E8)
class UElevensSodaAddon final : public UItemAddon
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGenerator*>                     _generatorsBeingRepaired;                          // 0x02F0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void Multicast_HighlightGenerator(const class AGenerator* Generator) const;
	void Multicast_UnhighlightGenerator(const class AGenerator* Generator) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ElevensSodaAddon">();
	}
	static class UElevensSodaAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElevensSodaAddon>();
	}
};
static_assert(alignof(UElevensSodaAddon) == 0x000008, "Wrong alignment on UElevensSodaAddon");
static_assert(sizeof(UElevensSodaAddon) == 0x000300, "Wrong size on UElevensSodaAddon");
static_assert(offsetof(UElevensSodaAddon, _generatorsBeingRepaired) == 0x0002F0, "Member 'UElevensSodaAddon::_generatorsBeingRepaired' has a wrong offset!");

// Class TheDemogorgon.LeproseLichenAddon
// 0x0018 (0x0300 - 0x02E8)
class ULeproseLichenAddon final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _timedRevealSurvivorEffectClass;                   // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _revealDuration;                                   // 0x02F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _portalSurvivorRange;                              // 0x02F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _revealSurvivorsWhenTeleportingClass;              // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeproseLichenAddon">();
	}
	static class ULeproseLichenAddon* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeproseLichenAddon>();
	}
};
static_assert(alignof(ULeproseLichenAddon) == 0x000008, "Wrong alignment on ULeproseLichenAddon");
static_assert(sizeof(ULeproseLichenAddon) == 0x000300, "Wrong size on ULeproseLichenAddon");
static_assert(offsetof(ULeproseLichenAddon, _timedRevealSurvivorEffectClass) == 0x0002E8, "Member 'ULeproseLichenAddon::_timedRevealSurvivorEffectClass' has a wrong offset!");
static_assert(offsetof(ULeproseLichenAddon, _revealDuration) == 0x0002F0, "Member 'ULeproseLichenAddon::_revealDuration' has a wrong offset!");
static_assert(offsetof(ULeproseLichenAddon, _portalSurvivorRange) == 0x0002F4, "Member 'ULeproseLichenAddon::_portalSurvivorRange' has a wrong offset!");
static_assert(offsetof(ULeproseLichenAddon, _revealSurvivorsWhenTeleportingClass) == 0x0002F8, "Member 'ULeproseLichenAddon::_revealSurvivorsWhenTeleportingClass' has a wrong offset!");

// Class TheDemogorgon.PortalSurvivorSubAnimInstance
// 0x0040 (0x0620 - 0x05E0)
class UPortalSurvivorSubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_5E0[0x38];                                     // 0x05E0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isDestroyingPortal;                               // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSpooked;                                        // 0x0619(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasSkillCheckFailed;                              // 0x061A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61B[0x5];                                      // 0x061B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PortalSurvivorSubAnimInstance">();
	}
	static class UPortalSurvivorSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPortalSurvivorSubAnimInstance>();
	}
};
static_assert(alignof(UPortalSurvivorSubAnimInstance) == 0x000010, "Wrong alignment on UPortalSurvivorSubAnimInstance");
static_assert(sizeof(UPortalSurvivorSubAnimInstance) == 0x000620, "Wrong size on UPortalSurvivorSubAnimInstance");
static_assert(offsetof(UPortalSurvivorSubAnimInstance, _isDestroyingPortal) == 0x000618, "Member 'UPortalSurvivorSubAnimInstance::_isDestroyingPortal' has a wrong offset!");
static_assert(offsetof(UPortalSurvivorSubAnimInstance, _isSpooked) == 0x000619, "Member 'UPortalSurvivorSubAnimInstance::_isSpooked' has a wrong offset!");
static_assert(offsetof(UPortalSurvivorSubAnimInstance, _hasSkillCheckFailed) == 0x00061A, "Member 'UPortalSurvivorSubAnimInstance::_hasSkillCheckFailed' has a wrong offset!");

// Class TheDemogorgon.SetGroundPortalInteraction
// 0x0020 (0x08E0 - 0x08C0)
class USetGroundPortalInteraction final : public UChargeableInteractionDefinition
{
public:
	class UDemogorgonPortalPlacerStateComponent*  _portalPlacerState;                                // 0x08C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObjectPlacerComponent*                 _trapPlacerComponent;                              // 0x08C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class ADemogorgonPortal>          _portalClassToSpawn;                               // 0x08D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D8[0x8];                                      // 0x08D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SetGroundPortalInteraction">();
	}
	static class USetGroundPortalInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetGroundPortalInteraction>();
	}
};
static_assert(alignof(USetGroundPortalInteraction) == 0x000010, "Wrong alignment on USetGroundPortalInteraction");
static_assert(sizeof(USetGroundPortalInteraction) == 0x0008E0, "Wrong size on USetGroundPortalInteraction");
static_assert(offsetof(USetGroundPortalInteraction, _portalPlacerState) == 0x0008C0, "Member 'USetGroundPortalInteraction::_portalPlacerState' has a wrong offset!");
static_assert(offsetof(USetGroundPortalInteraction, _trapPlacerComponent) == 0x0008C8, "Member 'USetGroundPortalInteraction::_trapPlacerComponent' has a wrong offset!");
static_assert(offsetof(USetGroundPortalInteraction, _portalClassToSpawn) == 0x0008D0, "Member 'USetGroundPortalInteraction::_portalClassToSpawn' has a wrong offset!");

// Class TheDemogorgon.TeleportToDemogorgonPortalInteraction
// 0x00E0 (0x09A0 - 0x08C0)
class UTeleportToDemogorgonPortalInteraction final : public UChargeableInteractionDefinition
{
public:
	float                                         _teleportToPortalSoundRange;                       // 0x08C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _inputReleaseChargePercentAllowance;               // 0x08C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _enterPortalPhaseDuration;                         // 0x08C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _cancelTeleportingPhaseDuration;                   // 0x08CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _redMossStatusEffectClass;                         // 0x08D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDemogorgonPortalTargetingComponent*    _portalTargetingComponent;                         // 0x08D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDemogorgonPortalPlacerStateComponent*  _portalPlacerState;                                // 0x08E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADemogorgonPortal*                      _startingPortal;                                   // 0x08E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADemogorgonPortal*                      _targetedPortal;                                   // 0x08F0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _interactingPlayer;                                // 0x08F8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_900[0xA0];                                     // 0x0900(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLocallyObservedChanged(const bool IsKillerLocallyObserved);
	void OnSlasherSet(class ASlasherPlayer* Killer);
	void OnTeleportInteractionCanceledVFX();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TeleportToDemogorgonPortalInteraction">();
	}
	static class UTeleportToDemogorgonPortalInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeleportToDemogorgonPortalInteraction>();
	}
};
static_assert(alignof(UTeleportToDemogorgonPortalInteraction) == 0x000010, "Wrong alignment on UTeleportToDemogorgonPortalInteraction");
static_assert(sizeof(UTeleportToDemogorgonPortalInteraction) == 0x0009A0, "Wrong size on UTeleportToDemogorgonPortalInteraction");
static_assert(offsetof(UTeleportToDemogorgonPortalInteraction, _teleportToPortalSoundRange) == 0x0008C0, "Member 'UTeleportToDemogorgonPortalInteraction::_teleportToPortalSoundRange' has a wrong offset!");
