#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheDemogorgon

#include "Basic.hpp"

#include "TheDemogorgon_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TheDemogorgon.DemogorgonPortalPlacerStateComponent.InitializeTunableValues
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonPortalPlacerStateComponent_InitializeTunableValues final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalPlacerStateComponent_InitializeTunableValues) == 0x000008, "Wrong alignment on DemogorgonPortalPlacerStateComponent_InitializeTunableValues");
static_assert(sizeof(DemogorgonPortalPlacerStateComponent_InitializeTunableValues) == 0x000008, "Wrong size on DemogorgonPortalPlacerStateComponent_InitializeTunableValues");
static_assert(offsetof(DemogorgonPortalPlacerStateComponent_InitializeTunableValues, Killer) == 0x000000, "Member 'DemogorgonPortalPlacerStateComponent_InitializeTunableValues::Killer' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalPlacerStateComponent.GetRemainingPortalCount
// 0x0004 (0x0004 - 0x0000)
struct DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount) == 0x000004, "Wrong alignment on DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount");
static_assert(sizeof(DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount) == 0x000004, "Wrong size on DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount");
static_assert(offsetof(DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount, ReturnValue) == 0x000000, "Member 'DemogorgonPortalPlacerStateComponent_GetRemainingPortalCount::ReturnValue' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalPlacerStateComponent.GetTeleportDuration
// 0x0004 (0x0004 - 0x0000)
struct DemogorgonPortalPlacerStateComponent_GetTeleportDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalPlacerStateComponent_GetTeleportDuration) == 0x000004, "Wrong alignment on DemogorgonPortalPlacerStateComponent_GetTeleportDuration");
static_assert(sizeof(DemogorgonPortalPlacerStateComponent_GetTeleportDuration) == 0x000004, "Wrong size on DemogorgonPortalPlacerStateComponent_GetTeleportDuration");
static_assert(offsetof(DemogorgonPortalPlacerStateComponent_GetTeleportDuration, ReturnValue) == 0x000000, "Member 'DemogorgonPortalPlacerStateComponent_GetTeleportDuration::ReturnValue' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalPlacerStateComponent.IsUsePortalCooldownDone
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone) == 0x000001, "Wrong alignment on DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone");
static_assert(sizeof(DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone) == 0x000001, "Wrong size on DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone");
static_assert(offsetof(DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone, ReturnValue) == 0x000000, "Member 'DemogorgonPortalPlacerStateComponent_IsUsePortalCooldownDone::ReturnValue' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalRadiusDetectorComponent.Authority_CallOnPortalEffectsApplied
// 0x0014 (0x0014 - 0x0000)
struct DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied) == 0x000004, "Wrong alignment on DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied");
static_assert(sizeof(DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied) == 0x000014, "Wrong size on DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied");
static_assert(offsetof(DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied, Callback) == 0x000000, "Member 'DemogorgonPortalRadiusDetectorComponent_Authority_CallOnPortalEffectsApplied::Callback' has a wrong offset!");

// Function TheDemogorgon.DemogorgonHuskAnimInstance.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonHuskAnimInstance_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonHuskAnimInstance_OnKillerSet) == 0x000008, "Wrong alignment on DemogorgonHuskAnimInstance_OnKillerSet");
static_assert(sizeof(DemogorgonHuskAnimInstance_OnKillerSet) == 0x000008, "Wrong size on DemogorgonHuskAnimInstance_OnKillerSet");
static_assert(offsetof(DemogorgonHuskAnimInstance_OnKillerSet, Killer) == 0x000000, "Member 'DemogorgonHuskAnimInstance_OnKillerSet::Killer' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.Authority_OnDestroyChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct DemogorgonPortal_Authority_OnDestroyChargePercentChanged final
{
public:
	class UChargeableComponent*                   ChargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_Authority_OnDestroyChargePercentChanged) == 0x000008, "Wrong alignment on DemogorgonPortal_Authority_OnDestroyChargePercentChanged");
static_assert(sizeof(DemogorgonPortal_Authority_OnDestroyChargePercentChanged) == 0x000010, "Wrong size on DemogorgonPortal_Authority_OnDestroyChargePercentChanged");
static_assert(offsetof(DemogorgonPortal_Authority_OnDestroyChargePercentChanged, ChargeableComponent) == 0x000000, "Member 'DemogorgonPortal_Authority_OnDestroyChargePercentChanged::ChargeableComponent' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_Authority_OnDestroyChargePercentChanged, PercentCompletionChange) == 0x000008, "Member 'DemogorgonPortal_Authority_OnDestroyChargePercentChanged::PercentCompletionChange' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_Authority_OnDestroyChargePercentChanged, TotalPercentComplete) == 0x00000C, "Member 'DemogorgonPortal_Authority_OnDestroyChargePercentChanged::TotalPercentComplete' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.Authority_OnTeleportChargePercentChanged
// 0x0010 (0x0010 - 0x0000)
struct DemogorgonPortal_Authority_OnTeleportChargePercentChanged final
{
public:
	class UChargeableComponent*                   ChargeableComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentCompletionChange;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalPercentComplete;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_Authority_OnTeleportChargePercentChanged) == 0x000008, "Wrong alignment on DemogorgonPortal_Authority_OnTeleportChargePercentChanged");
static_assert(sizeof(DemogorgonPortal_Authority_OnTeleportChargePercentChanged) == 0x000010, "Wrong size on DemogorgonPortal_Authority_OnTeleportChargePercentChanged");
static_assert(offsetof(DemogorgonPortal_Authority_OnTeleportChargePercentChanged, ChargeableComponent) == 0x000000, "Member 'DemogorgonPortal_Authority_OnTeleportChargePercentChanged::ChargeableComponent' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_Authority_OnTeleportChargePercentChanged, PercentCompletionChange) == 0x000008, "Member 'DemogorgonPortal_Authority_OnTeleportChargePercentChanged::PercentCompletionChange' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_Authority_OnTeleportChargePercentChanged, TotalPercentComplete) == 0x00000C, "Member 'DemogorgonPortal_Authority_OnTeleportChargePercentChanged::TotalPercentComplete' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.OnBeginOverlapPortalArea
// 0x0110 (0x0110 - 0x0000)
struct DemogorgonPortal_OnBeginOverlapPortalArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_OnBeginOverlapPortalArea) == 0x000008, "Wrong alignment on DemogorgonPortal_OnBeginOverlapPortalArea");
static_assert(sizeof(DemogorgonPortal_OnBeginOverlapPortalArea) == 0x000110, "Wrong size on DemogorgonPortal_OnBeginOverlapPortalArea");
static_assert(offsetof(DemogorgonPortal_OnBeginOverlapPortalArea, OverlappedComponent) == 0x000000, "Member 'DemogorgonPortal_OnBeginOverlapPortalArea::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnBeginOverlapPortalArea, OtherActor) == 0x000008, "Member 'DemogorgonPortal_OnBeginOverlapPortalArea::OtherActor' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnBeginOverlapPortalArea, OtherComp) == 0x000010, "Member 'DemogorgonPortal_OnBeginOverlapPortalArea::OtherComp' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnBeginOverlapPortalArea, OtherBodyIndex) == 0x000018, "Member 'DemogorgonPortal_OnBeginOverlapPortalArea::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnBeginOverlapPortalArea, bFromSweep) == 0x00001C, "Member 'DemogorgonPortal_OnBeginOverlapPortalArea::bFromSweep' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnBeginOverlapPortalArea, SweepResult) == 0x000020, "Member 'DemogorgonPortal_OnBeginOverlapPortalArea::SweepResult' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.OnEndOverlapPortalArea
// 0x0020 (0x0020 - 0x0000)
struct DemogorgonPortal_OnEndOverlapPortalArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DemogorgonPortal_OnEndOverlapPortalArea) == 0x000008, "Wrong alignment on DemogorgonPortal_OnEndOverlapPortalArea");
static_assert(sizeof(DemogorgonPortal_OnEndOverlapPortalArea) == 0x000020, "Wrong size on DemogorgonPortal_OnEndOverlapPortalArea");
static_assert(offsetof(DemogorgonPortal_OnEndOverlapPortalArea, OverlappedComponent) == 0x000000, "Member 'DemogorgonPortal_OnEndOverlapPortalArea::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnEndOverlapPortalArea, OtherActor) == 0x000008, "Member 'DemogorgonPortal_OnEndOverlapPortalArea::OtherActor' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnEndOverlapPortalArea, OtherComp) == 0x000010, "Member 'DemogorgonPortal_OnEndOverlapPortalArea::OtherComp' has a wrong offset!");
static_assert(offsetof(DemogorgonPortal_OnEndOverlapPortalArea, OtherBodyIndex) == 0x000018, "Member 'DemogorgonPortal_OnEndOverlapPortalArea::OtherBodyIndex' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.OnPortalDestroyed
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonPortal_OnPortalDestroyed final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_OnPortalDestroyed) == 0x000008, "Wrong alignment on DemogorgonPortal_OnPortalDestroyed");
static_assert(sizeof(DemogorgonPortal_OnPortalDestroyed) == 0x000008, "Wrong size on DemogorgonPortal_OnPortalDestroyed");
static_assert(offsetof(DemogorgonPortal_OnPortalDestroyed, Player) == 0x000000, "Member 'DemogorgonPortal_OnPortalDestroyed::Player' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.OnPortalStateChanged
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPortal_OnPortalStateChanged final
{
public:
	EDemogorgonPortalState                        State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_OnPortalStateChanged) == 0x000001, "Wrong alignment on DemogorgonPortal_OnPortalStateChanged");
static_assert(sizeof(DemogorgonPortal_OnPortalStateChanged) == 0x000001, "Wrong size on DemogorgonPortal_OnPortalStateChanged");
static_assert(offsetof(DemogorgonPortal_OnPortalStateChanged, State) == 0x000000, "Member 'DemogorgonPortal_OnPortalStateChanged::State' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.OnTeleportAbilityCooldownChangedVFX
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX final
{
public:
	bool                                          IsOnCooldown;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX) == 0x000001, "Wrong alignment on DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX");
static_assert(sizeof(DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX) == 0x000001, "Wrong size on DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX");
static_assert(offsetof(DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX, IsOnCooldown) == 0x000000, "Member 'DemogorgonPortal_OnTeleportAbilityCooldownChangedVFX::IsOnCooldown' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.PlaySoundFromPortal
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonPortal_PlaySoundFromPortal final
{
public:
	class UAkAudioEvent*                          SoundEvent;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_PlaySoundFromPortal) == 0x000008, "Wrong alignment on DemogorgonPortal_PlaySoundFromPortal");
static_assert(sizeof(DemogorgonPortal_PlaySoundFromPortal) == 0x000008, "Wrong size on DemogorgonPortal_PlaySoundFromPortal");
static_assert(offsetof(DemogorgonPortal_PlaySoundFromPortal, SoundEvent) == 0x000000, "Member 'DemogorgonPortal_PlaySoundFromPortal::SoundEvent' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.GetDestroyDuration
// 0x0004 (0x0004 - 0x0000)
struct DemogorgonPortal_GetDestroyDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_GetDestroyDuration) == 0x000004, "Wrong alignment on DemogorgonPortal_GetDestroyDuration");
static_assert(sizeof(DemogorgonPortal_GetDestroyDuration) == 0x000004, "Wrong size on DemogorgonPortal_GetDestroyDuration");
static_assert(offsetof(DemogorgonPortal_GetDestroyDuration, ReturnValue) == 0x000000, "Member 'DemogorgonPortal_GetDestroyDuration::ReturnValue' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortal.IsTargeted
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPortal_IsTargeted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortal_IsTargeted) == 0x000001, "Wrong alignment on DemogorgonPortal_IsTargeted");
static_assert(sizeof(DemogorgonPortal_IsTargeted) == 0x000001, "Wrong size on DemogorgonPortal_IsTargeted");
static_assert(offsetof(DemogorgonPortal_IsTargeted, ReturnValue) == 0x000000, "Member 'DemogorgonPortal_IsTargeted::ReturnValue' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalTargetingComponent.GetTargetedPortal
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonPortalTargetingComponent_GetTargetedPortal final
{
public:
	class ADemogorgonPortal*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalTargetingComponent_GetTargetedPortal) == 0x000008, "Wrong alignment on DemogorgonPortalTargetingComponent_GetTargetedPortal");
static_assert(sizeof(DemogorgonPortalTargetingComponent_GetTargetedPortal) == 0x000008, "Wrong size on DemogorgonPortalTargetingComponent_GetTargetedPortal");
static_assert(offsetof(DemogorgonPortalTargetingComponent_GetTargetedPortal, ReturnValue) == 0x000000, "Member 'DemogorgonPortalTargetingComponent_GetTargetedPortal::ReturnValue' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalTargetingComponent.Multicast_SetTargetedPortal
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal final
{
public:
	class ADemogorgonPortal*                      TargetedPortal;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal) == 0x000008, "Wrong alignment on DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal");
static_assert(sizeof(DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal) == 0x000008, "Wrong size on DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal");
static_assert(offsetof(DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal, TargetedPortal) == 0x000000, "Member 'DemogorgonPortalTargetingComponent_Multicast_SetTargetedPortal::TargetedPortal' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalTargetingComponent.Server_SetTargetedPortal
// 0x0008 (0x0008 - 0x0000)
struct DemogorgonPortalTargetingComponent_Server_SetTargetedPortal final
{
public:
	class ADemogorgonPortal*                      TargetedPortal;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalTargetingComponent_Server_SetTargetedPortal) == 0x000008, "Wrong alignment on DemogorgonPortalTargetingComponent_Server_SetTargetedPortal");
static_assert(sizeof(DemogorgonPortalTargetingComponent_Server_SetTargetedPortal) == 0x000008, "Wrong size on DemogorgonPortalTargetingComponent_Server_SetTargetedPortal");
static_assert(offsetof(DemogorgonPortalTargetingComponent_Server_SetTargetedPortal, TargetedPortal) == 0x000000, "Member 'DemogorgonPortalTargetingComponent_Server_SetTargetedPortal::TargetedPortal' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPortalTargetingComponent.SetIsPorting
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPortalTargetingComponent_SetIsPorting final
{
public:
	bool                                          IsPorting;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPortalTargetingComponent_SetIsPorting) == 0x000001, "Wrong alignment on DemogorgonPortalTargetingComponent_SetIsPorting");
static_assert(sizeof(DemogorgonPortalTargetingComponent_SetIsPorting) == 0x000001, "Wrong size on DemogorgonPortalTargetingComponent_SetIsPorting");
static_assert(offsetof(DemogorgonPortalTargetingComponent_SetIsPorting, IsPorting) == 0x000000, "Member 'DemogorgonPortalTargetingComponent_SetIsPorting::IsPorting' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPounceInteraction.OnChargedAttackReadyChanged
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPounceInteraction_OnChargedAttackReadyChanged final
{
public:
	bool                                          Ready;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPounceInteraction_OnChargedAttackReadyChanged) == 0x000001, "Wrong alignment on DemogorgonPounceInteraction_OnChargedAttackReadyChanged");
static_assert(sizeof(DemogorgonPounceInteraction_OnChargedAttackReadyChanged) == 0x000001, "Wrong size on DemogorgonPounceInteraction_OnChargedAttackReadyChanged");
static_assert(offsetof(DemogorgonPounceInteraction_OnChargedAttackReadyChanged, Ready) == 0x000000, "Member 'DemogorgonPounceInteraction_OnChargedAttackReadyChanged::Ready' has a wrong offset!");

// Function TheDemogorgon.DemogorgonPounceInteraction.TriggerHuntingAudioEvent
// 0x0001 (0x0001 - 0x0000)
struct DemogorgonPounceInteraction_TriggerHuntingAudioEvent final
{
public:
	bool                                          IsHunting;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DemogorgonPounceInteraction_TriggerHuntingAudioEvent) == 0x000001, "Wrong alignment on DemogorgonPounceInteraction_TriggerHuntingAudioEvent");
static_assert(sizeof(DemogorgonPounceInteraction_TriggerHuntingAudioEvent) == 0x000001, "Wrong size on DemogorgonPounceInteraction_TriggerHuntingAudioEvent");
static_assert(offsetof(DemogorgonPounceInteraction_TriggerHuntingAudioEvent, IsHunting) == 0x000000, "Member 'DemogorgonPounceInteraction_TriggerHuntingAudioEvent::IsHunting' has a wrong offset!");

// Function TheDemogorgon.DestroyDemogorgonPortalInteraction.Authority_OnChargeApplied
// 0x0018 (0x0018 - 0x0000)
struct DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied final
{
public:
	float                                         IndividualChargeAmount;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalChargeAmount;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ChargeInstigator;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasCoop;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTime;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied) == 0x000008, "Wrong alignment on DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied");
static_assert(sizeof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied) == 0x000018, "Wrong size on DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied");
static_assert(offsetof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied, IndividualChargeAmount) == 0x000000, "Member 'DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied::IndividualChargeAmount' has a wrong offset!");
static_assert(offsetof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied, TotalChargeAmount) == 0x000004, "Member 'DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied::TotalChargeAmount' has a wrong offset!");
static_assert(offsetof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied, ChargeInstigator) == 0x000008, "Member 'DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied::ChargeInstigator' has a wrong offset!");
static_assert(offsetof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied, WasCoop) == 0x000010, "Member 'DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied::WasCoop' has a wrong offset!");
static_assert(offsetof(DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied, DeltaTime) == 0x000014, "Member 'DestroyDemogorgonPortalInteraction_Authority_OnChargeApplied::DeltaTime' has a wrong offset!");

// Function TheDemogorgon.ElevensSodaAddon.Multicast_HighlightGenerator
// 0x0008 (0x0008 - 0x0000)
struct ElevensSodaAddon_Multicast_HighlightGenerator final
{
public:
	const class AGenerator*                       Generator;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ElevensSodaAddon_Multicast_HighlightGenerator) == 0x000008, "Wrong alignment on ElevensSodaAddon_Multicast_HighlightGenerator");
static_assert(sizeof(ElevensSodaAddon_Multicast_HighlightGenerator) == 0x000008, "Wrong size on ElevensSodaAddon_Multicast_HighlightGenerator");
static_assert(offsetof(ElevensSodaAddon_Multicast_HighlightGenerator, Generator) == 0x000000, "Member 'ElevensSodaAddon_Multicast_HighlightGenerator::Generator' has a wrong offset!");

// Function TheDemogorgon.ElevensSodaAddon.Multicast_UnhighlightGenerator
// 0x0008 (0x0008 - 0x0000)
struct ElevensSodaAddon_Multicast_UnhighlightGenerator final
{
public:
	const class AGenerator*                       Generator;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ElevensSodaAddon_Multicast_UnhighlightGenerator) == 0x000008, "Wrong alignment on ElevensSodaAddon_Multicast_UnhighlightGenerator");
static_assert(sizeof(ElevensSodaAddon_Multicast_UnhighlightGenerator) == 0x000008, "Wrong size on ElevensSodaAddon_Multicast_UnhighlightGenerator");
static_assert(offsetof(ElevensSodaAddon_Multicast_UnhighlightGenerator, Generator) == 0x000000, "Member 'ElevensSodaAddon_Multicast_UnhighlightGenerator::Generator' has a wrong offset!");

// Function TheDemogorgon.TeleportToDemogorgonPortalInteraction.OnLocallyObservedChanged
// 0x0001 (0x0001 - 0x0000)
struct TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged final
{
public:
	bool                                          IsKillerLocallyObserved;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged) == 0x000001, "Wrong alignment on TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged");
static_assert(sizeof(TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged) == 0x000001, "Wrong size on TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged");
static_assert(offsetof(TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged, IsKillerLocallyObserved) == 0x000000, "Member 'TeleportToDemogorgonPortalInteraction_OnLocallyObservedChanged::IsKillerLocallyObserved' has a wrong offset!");

// Function TheDemogorgon.TeleportToDemogorgonPortalInteraction.OnSlasherSet
// 0x0008 (0x0008 - 0x0000)
struct TeleportToDemogorgonPortalInteraction_OnSlasherSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TeleportToDemogorgonPortalInteraction_OnSlasherSet) == 0x000008, "Wrong alignment on TeleportToDemogorgonPortalInteraction_OnSlasherSet");
static_assert(sizeof(TeleportToDemogorgonPortalInteraction_OnSlasherSet) == 0x000008, "Wrong size on TeleportToDemogorgonPortalInteraction_OnSlasherSet");
static_assert(offsetof(TeleportToDemogorgonPortalInteraction_OnSlasherSet, Killer) == 0x000000, "Member 'TeleportToDemogorgonPortalInteraction_OnSlasherSet::Killer' has a wrong offset!");

}

