#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheGunslinger

#include "Basic.hpp"

#include "TheGunslinger_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "StatSystem_structs.hpp"
#include "Projectile_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayUtilities_structs.hpp"
#include "GameplayUtilities_classes.hpp"
#include "DBDAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class TheGunslinger.AISkill_Interaction_HarpoonAim
// 0x0708 (0x09B8 - 0x02B0)
class UAISkill_Interaction_HarpoonAim final : public UAISkill_Interaction_KillerPower
{
public:
	struct FAITunableParameter                    MinimumAimRange;                                   // 0x02B0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaximumAimRange;                                   // 0x0310(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinimumFireRange;                                  // 0x0370(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaximumFireRange;                                  // 0x03D0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    StopAimAfterHiddenTime;                            // 0x0430(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimAttemptTimeAtNavlink;                           // 0x0490(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HookTravelSpeed;                                   // 0x04F0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    CameraLerpOverride;                                // 0x0550(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimInaccuracy;                                     // 0x05B0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimStabilityMultiplier;                            // 0x0610(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimStabilityVariance;                              // 0x0670(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimVerticalInaccuracyMultiplier;                   // 0x06D0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimAdjustHeight;                                   // 0x0730(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HighAimAdjustHeight;                               // 0x0790(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    ObstructionAdjustHeight;                           // 0x07F0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    FirePrecisionAngle;                                // 0x0850(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AimRandomMaxTime;                                  // 0x08B0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    RandomFireDelayTime;                               // 0x0910(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_970[0x48];                                     // 0x0970(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_HarpoonAim">();
	}
	static class UAISkill_Interaction_HarpoonAim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_HarpoonAim>();
	}
};
static_assert(alignof(UAISkill_Interaction_HarpoonAim) == 0x000008, "Wrong alignment on UAISkill_Interaction_HarpoonAim");
static_assert(sizeof(UAISkill_Interaction_HarpoonAim) == 0x0009B8, "Wrong size on UAISkill_Interaction_HarpoonAim");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, MinimumAimRange) == 0x0002B0, "Member 'UAISkill_Interaction_HarpoonAim::MinimumAimRange' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, MaximumAimRange) == 0x000310, "Member 'UAISkill_Interaction_HarpoonAim::MaximumAimRange' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, MinimumFireRange) == 0x000370, "Member 'UAISkill_Interaction_HarpoonAim::MinimumFireRange' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, MaximumFireRange) == 0x0003D0, "Member 'UAISkill_Interaction_HarpoonAim::MaximumFireRange' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, StopAimAfterHiddenTime) == 0x000430, "Member 'UAISkill_Interaction_HarpoonAim::StopAimAfterHiddenTime' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimAttemptTimeAtNavlink) == 0x000490, "Member 'UAISkill_Interaction_HarpoonAim::AimAttemptTimeAtNavlink' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, HookTravelSpeed) == 0x0004F0, "Member 'UAISkill_Interaction_HarpoonAim::HookTravelSpeed' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, CameraLerpOverride) == 0x000550, "Member 'UAISkill_Interaction_HarpoonAim::CameraLerpOverride' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimInaccuracy) == 0x0005B0, "Member 'UAISkill_Interaction_HarpoonAim::AimInaccuracy' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimStabilityMultiplier) == 0x000610, "Member 'UAISkill_Interaction_HarpoonAim::AimStabilityMultiplier' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimStabilityVariance) == 0x000670, "Member 'UAISkill_Interaction_HarpoonAim::AimStabilityVariance' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimVerticalInaccuracyMultiplier) == 0x0006D0, "Member 'UAISkill_Interaction_HarpoonAim::AimVerticalInaccuracyMultiplier' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimAdjustHeight) == 0x000730, "Member 'UAISkill_Interaction_HarpoonAim::AimAdjustHeight' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, HighAimAdjustHeight) == 0x000790, "Member 'UAISkill_Interaction_HarpoonAim::HighAimAdjustHeight' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, ObstructionAdjustHeight) == 0x0007F0, "Member 'UAISkill_Interaction_HarpoonAim::ObstructionAdjustHeight' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, FirePrecisionAngle) == 0x000850, "Member 'UAISkill_Interaction_HarpoonAim::FirePrecisionAngle' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, AimRandomMaxTime) == 0x0008B0, "Member 'UAISkill_Interaction_HarpoonAim::AimRandomMaxTime' has a wrong offset!");
static_assert(offsetof(UAISkill_Interaction_HarpoonAim, RandomFireDelayTime) == 0x000910, "Member 'UAISkill_Interaction_HarpoonAim::RandomFireDelayTime' has a wrong offset!");

// Class TheGunslinger.AISkill_Interaction_HarpoonReload
// 0x0060 (0x02E0 - 0x0280)
class UAISkill_Interaction_HarpoonReload final : public UAISkill_Interaction
{
public:
	struct FAITunableParameter                    MinimumPathDistance;                               // 0x0280(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_HarpoonReload">();
	}
	static class UAISkill_Interaction_HarpoonReload* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_HarpoonReload>();
	}
};
static_assert(alignof(UAISkill_Interaction_HarpoonReload) == 0x000008, "Wrong alignment on UAISkill_Interaction_HarpoonReload");
static_assert(sizeof(UAISkill_Interaction_HarpoonReload) == 0x0002E0, "Wrong size on UAISkill_Interaction_HarpoonReload");
static_assert(offsetof(UAISkill_Interaction_HarpoonReload, MinimumPathDistance) == 0x000280, "Member 'UAISkill_Interaction_HarpoonReload::MinimumPathDistance' has a wrong offset!");

// Class TheGunslinger.ChainPlayerMovementStatusEffect
// 0x0058 (0x03D8 - 0x0380)
class UChainPlayerMovementStatusEffect : public UStatusEffect
{
public:
	struct FDBDTunableRowHandle                   _baseMovementSpeedMultiplier;                      // 0x0380(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _collisionMovementSpeedMultiplier;                 // 0x03A8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class ARifleChain*                            _chain;                                            // 0x03D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnIsChainCollidingChanged(bool IsColliding);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainPlayerMovementStatusEffect">();
	}
	static class UChainPlayerMovementStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainPlayerMovementStatusEffect>();
	}
};
static_assert(alignof(UChainPlayerMovementStatusEffect) == 0x000008, "Wrong alignment on UChainPlayerMovementStatusEffect");
static_assert(sizeof(UChainPlayerMovementStatusEffect) == 0x0003D8, "Wrong size on UChainPlayerMovementStatusEffect");
static_assert(offsetof(UChainPlayerMovementStatusEffect, _baseMovementSpeedMultiplier) == 0x000380, "Member 'UChainPlayerMovementStatusEffect::_baseMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UChainPlayerMovementStatusEffect, _collisionMovementSpeedMultiplier) == 0x0003A8, "Member 'UChainPlayerMovementStatusEffect::_collisionMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UChainPlayerMovementStatusEffect, _chain) == 0x0003D0, "Member 'UChainPlayerMovementStatusEffect::_chain' has a wrong offset!");

// Class TheGunslinger.ChainKillerMovementStatusEffect
// 0x0070 (0x0448 - 0x03D8)
class UChainKillerMovementStatusEffect final : public UChainPlayerMovementStatusEffect
{
public:
	struct FDBDTunableRowHandle                   _backwardMovementSpeedMultiplier;                  // 0x03D8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _backwardMovementAngle;                            // 0x0400(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_428[0x20];                                     // 0x0428(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainKillerMovementStatusEffect">();
	}
	static class UChainKillerMovementStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainKillerMovementStatusEffect>();
	}
};
static_assert(alignof(UChainKillerMovementStatusEffect) == 0x000008, "Wrong alignment on UChainKillerMovementStatusEffect");
static_assert(sizeof(UChainKillerMovementStatusEffect) == 0x000448, "Wrong size on UChainKillerMovementStatusEffect");
static_assert(offsetof(UChainKillerMovementStatusEffect, _backwardMovementSpeedMultiplier) == 0x0003D8, "Member 'UChainKillerMovementStatusEffect::_backwardMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UChainKillerMovementStatusEffect, _backwardMovementAngle) == 0x000400, "Member 'UChainKillerMovementStatusEffect::_backwardMovementAngle' has a wrong offset!");

// Class TheGunslinger.ChainLinkableComponent
// 0x0110 (0x01B8 - 0x00A8)
class UChainLinkableComponent : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBaseCameraTargetingStrategy> _cameraTargetingStrategyClass;                     // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerReelInputAccelerationConstraintStrategy* _inputAccelerationStrategy;                        // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASlasherPlayer*                         _owningKiller;                                     // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URiflePlayerLinker*                     _chainLink;                                        // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _movementStatusEffectClass;                        // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _linkedStatusEffectClass;                          // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x48];                                      // 0x00F8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _isLinkedLingering;                                // 0x0140(0x0048)(Net, NativeAccessSpecifierPrivate)
	class UChainPlayerMovementStatusEffect*       _movementStatusEffect;                             // 0x0188(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseCameraTargetingStrategy*           _cameraStrategy;                                   // 0x0198(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x18];                                     // 0x01A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillerSet(class ASlasherPlayer* Killer);
	void OnRep_OwningKiller();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainLinkableComponent">();
	}
	static class UChainLinkableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainLinkableComponent>();
	}
};
static_assert(alignof(UChainLinkableComponent) == 0x000008, "Wrong alignment on UChainLinkableComponent");
static_assert(sizeof(UChainLinkableComponent) == 0x0001B8, "Wrong size on UChainLinkableComponent");
static_assert(offsetof(UChainLinkableComponent, _cameraTargetingStrategyClass) == 0x0000C8, "Member 'UChainLinkableComponent::_cameraTargetingStrategyClass' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _inputAccelerationStrategy) == 0x0000D0, "Member 'UChainLinkableComponent::_inputAccelerationStrategy' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _owningKiller) == 0x0000D8, "Member 'UChainLinkableComponent::_owningKiller' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _chainLink) == 0x0000E0, "Member 'UChainLinkableComponent::_chainLink' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _movementStatusEffectClass) == 0x0000E8, "Member 'UChainLinkableComponent::_movementStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _linkedStatusEffectClass) == 0x0000F0, "Member 'UChainLinkableComponent::_linkedStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _isLinkedLingering) == 0x000140, "Member 'UChainLinkableComponent::_isLinkedLingering' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _movementStatusEffect) == 0x000188, "Member 'UChainLinkableComponent::_movementStatusEffect' has a wrong offset!");
static_assert(offsetof(UChainLinkableComponent, _cameraStrategy) == 0x000198, "Member 'UChainLinkableComponent::_cameraStrategy' has a wrong offset!");

// Class TheGunslinger.DeadMansSwitch
// 0x0028 (0x0448 - 0x0420)
class UDeadMansSwitch final : public UPerk
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _generatorBlockingDuration[0x3];                   // 0x0428(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGenerator*                             _blockedGenerator;                                 // 0x0438(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isActivated;                                      // 0x0440(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_BlockedGenerator(class AGenerator* PreviouslyBlockedGenerator);

	float GetActivationDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeadMansSwitch">();
	}
	static class UDeadMansSwitch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadMansSwitch>();
	}
};
static_assert(alignof(UDeadMansSwitch) == 0x000008, "Wrong alignment on UDeadMansSwitch");
static_assert(sizeof(UDeadMansSwitch) == 0x000448, "Wrong size on UDeadMansSwitch");
static_assert(offsetof(UDeadMansSwitch, _generatorBlockingDuration) == 0x000428, "Member 'UDeadMansSwitch::_generatorBlockingDuration' has a wrong offset!");
static_assert(offsetof(UDeadMansSwitch, _blockedGenerator) == 0x000438, "Member 'UDeadMansSwitch::_blockedGenerator' has a wrong offset!");
static_assert(offsetof(UDeadMansSwitch, _isActivated) == 0x000440, "Member 'UDeadMansSwitch::_isActivated' has a wrong offset!");

// Class TheGunslinger.FireHarpoonRifleInteraction
// 0x0500 (0x0C80 - 0x0780)
class UFireHarpoonRifleInteraction final : public UInteractionDefinition
{
public:
	FMulticastInlineDelegateProperty_             OnFireHarpoon;                                     // 0x0778(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnHitPlayer;                                       // 0x0788(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_798[0x1];                                      // 0x0798(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EFireHarpoonRifleAimingInteractionSubState    _aimingSubState;                                   // 0x0799(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHarpoonProjectile*                     _harpoon;                                          // 0x07A0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _collector;                                        // 0x07A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightDuration;                             // 0x07B0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightZoom;                                 // 0x07D8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightMousePitchScaleMultiplier;            // 0x0800(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightMouseYawScaleMultiplier;              // 0x0828(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightGamepadPitchScaleMultiplier;          // 0x0850(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightGamepadYawScaleMultiplier;            // 0x0878(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _aimDownSightGamepadPitchCurve;                    // 0x08A0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _aimDownSightGamepadYawCurve;                      // 0x08A8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _aimDownSightRotationScaleAdjustmentTime;          // 0x08B0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _aimDownSightMovementSpeedMultiplier;              // 0x08D8(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireDuration;                                     // 0x0958(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireRotationScaleMultiplier;                      // 0x0980(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireRotationScaleAdjustmentTime;                  // 0x09A8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _fireMovementSpeedMultiplier;                      // 0x09D0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _longRangeShotMinDistance;                         // 0x09F8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A20[0x8];                                      // 0x0A20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _successMovementSpeedMultiplier;                   // 0x0A28(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _missMovementSpeedMultiplier;                      // 0x0A50(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _missShotCooldownDuration;                         // 0x0A78(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nearMissShotMaxDistance;                          // 0x0AF8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _successShotDuration;                              // 0x0B20(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B48[0x138];                                    // 0x0B48(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFireHarpoon__DelegateSignature();
	void OnHitPlayer__DelegateSignature();
	void Server_HandleMissShotScores(const TArray<class ADBDPlayer*>& NearMissedPlayers);
	void Server_SetAimingSubstate(EFireHarpoonRifleAimingInteractionSubState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FireHarpoonRifleInteraction">();
	}
	static class UFireHarpoonRifleInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFireHarpoonRifleInteraction>();
	}
};
static_assert(alignof(UFireHarpoonRifleInteraction) == 0x000010, "Wrong alignment on UFireHarpoonRifleInteraction");
static_assert(sizeof(UFireHarpoonRifleInteraction) == 0x000C80, "Wrong size on UFireHarpoonRifleInteraction");
static_assert(offsetof(UFireHarpoonRifleInteraction, OnFireHarpoon) == 0x000778, "Member 'UFireHarpoonRifleInteraction::OnFireHarpoon' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, OnHitPlayer) == 0x000788, "Member 'UFireHarpoonRifleInteraction::OnHitPlayer' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimingSubState) == 0x000799, "Member 'UFireHarpoonRifleInteraction::_aimingSubState' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _harpoon) == 0x0007A0, "Member 'UFireHarpoonRifleInteraction::_harpoon' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _collector) == 0x0007A8, "Member 'UFireHarpoonRifleInteraction::_collector' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightDuration) == 0x0007B0, "Member 'UFireHarpoonRifleInteraction::_aimDownSightDuration' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightZoom) == 0x0007D8, "Member 'UFireHarpoonRifleInteraction::_aimDownSightZoom' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightMousePitchScaleMultiplier) == 0x000800, "Member 'UFireHarpoonRifleInteraction::_aimDownSightMousePitchScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightMouseYawScaleMultiplier) == 0x000828, "Member 'UFireHarpoonRifleInteraction::_aimDownSightMouseYawScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadPitchScaleMultiplier) == 0x000850, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadPitchScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadYawScaleMultiplier) == 0x000878, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadYawScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadPitchCurve) == 0x0008A0, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadPitchCurve' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightGamepadYawCurve) == 0x0008A8, "Member 'UFireHarpoonRifleInteraction::_aimDownSightGamepadYawCurve' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightRotationScaleAdjustmentTime) == 0x0008B0, "Member 'UFireHarpoonRifleInteraction::_aimDownSightRotationScaleAdjustmentTime' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _aimDownSightMovementSpeedMultiplier) == 0x0008D8, "Member 'UFireHarpoonRifleInteraction::_aimDownSightMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireDuration) == 0x000958, "Member 'UFireHarpoonRifleInteraction::_fireDuration' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireRotationScaleMultiplier) == 0x000980, "Member 'UFireHarpoonRifleInteraction::_fireRotationScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireRotationScaleAdjustmentTime) == 0x0009A8, "Member 'UFireHarpoonRifleInteraction::_fireRotationScaleAdjustmentTime' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _fireMovementSpeedMultiplier) == 0x0009D0, "Member 'UFireHarpoonRifleInteraction::_fireMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _longRangeShotMinDistance) == 0x0009F8, "Member 'UFireHarpoonRifleInteraction::_longRangeShotMinDistance' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _successMovementSpeedMultiplier) == 0x000A28, "Member 'UFireHarpoonRifleInteraction::_successMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _missMovementSpeedMultiplier) == 0x000A50, "Member 'UFireHarpoonRifleInteraction::_missMovementSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _missShotCooldownDuration) == 0x000A78, "Member 'UFireHarpoonRifleInteraction::_missShotCooldownDuration' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _nearMissShotMaxDistance) == 0x000AF8, "Member 'UFireHarpoonRifleInteraction::_nearMissShotMaxDistance' has a wrong offset!");
static_assert(offsetof(UFireHarpoonRifleInteraction, _successShotDuration) == 0x000B20, "Member 'UFireHarpoonRifleInteraction::_successShotDuration' has a wrong offset!");

// Class TheGunslinger.Gearhead
// 0x0020 (0x0440 - 0x0420)
class UGearhead final : public UPerk
{
public:
	TSubclassOf<class UStatusEffect>              _timedRevealToKillerEffect;                        // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _surviorAuraDurations[0x3];                        // 0x0428(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _perkDuration;                                     // 0x0434(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESkillCheckType                               _skillCheckType;                                   // 0x0438(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _basicAttack;                                      // 0x0439(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnCamperHealthStateChange(ECamperDamageState OldDamageState, ECamperDamageState NewDamageState);
	void Authority_OnCamperRemoved(class ACamperPlayer* RemovedPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Gearhead">();
	}
	static class UGearhead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGearhead>();
	}
};
static_assert(alignof(UGearhead) == 0x000008, "Wrong alignment on UGearhead");
static_assert(sizeof(UGearhead) == 0x000440, "Wrong size on UGearhead");
static_assert(offsetof(UGearhead, _timedRevealToKillerEffect) == 0x000420, "Member 'UGearhead::_timedRevealToKillerEffect' has a wrong offset!");
static_assert(offsetof(UGearhead, _surviorAuraDurations) == 0x000428, "Member 'UGearhead::_surviorAuraDurations' has a wrong offset!");
static_assert(offsetof(UGearhead, _perkDuration) == 0x000434, "Member 'UGearhead::_perkDuration' has a wrong offset!");
static_assert(offsetof(UGearhead, _skillCheckType) == 0x000438, "Member 'UGearhead::_skillCheckType' has a wrong offset!");
static_assert(offsetof(UGearhead, _basicAttack) == 0x000439, "Member 'UGearhead::_basicAttack' has a wrong offset!");

// Class TheGunslinger.GunslingerAnimInstance
// 0x0210 (0x0930 - 0x0720)
class UGunslingerAnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isAiming;                                         // 0x0720(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAimingWarmup;                                   // 0x0721(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAimingCooldown;                                 // 0x0722(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAimingReadyToShoot;                             // 0x0723(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFiring;                                         // 0x0724(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInMissShotCooldown;                             // 0x0725(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInSuccessShot;                                  // 0x0726(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isLinked;                                         // 0x0727(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isReeling;                                        // 0x0728(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInGunState;                                     // 0x0729(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72A[0x2];                                      // 0x072A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _idleToAimAnimPlayrate;                            // 0x072C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _aimToIdleAnimPlayrate;                            // 0x0730(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _fireAnimPlayRate;                                 // 0x0734(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _missShotCooldownAnimPlayRate;                     // 0x0738(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _successShotAnimPlayRate;                          // 0x073C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _idleToAimAnim;                                    // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _aimToIdleAnim;                                    // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _fireAnim;                                         // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _missShotCooldownAnim;                             // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          _successShotAnim;                                  // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _idleToAimAnimDuration;                            // 0x0768(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _aimToIdleAnimDuration;                            // 0x0790(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _fireAnimDuration;                                 // 0x07B8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FTunableStat                           _missShotCooldownAnimDuration;                     // 0x07E0(0x0080)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _successShotAnimDuration;                          // 0x0860(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_888[0xA8];                                     // 0x0888(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerAnimInstance">();
	}
	static class UGunslingerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerAnimInstance>();
	}
};
static_assert(alignof(UGunslingerAnimInstance) == 0x000010, "Wrong alignment on UGunslingerAnimInstance");
static_assert(sizeof(UGunslingerAnimInstance) == 0x000930, "Wrong size on UGunslingerAnimInstance");
static_assert(offsetof(UGunslingerAnimInstance, _isAiming) == 0x000720, "Member 'UGunslingerAnimInstance::_isAiming' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isAimingWarmup) == 0x000721, "Member 'UGunslingerAnimInstance::_isAimingWarmup' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isAimingCooldown) == 0x000722, "Member 'UGunslingerAnimInstance::_isAimingCooldown' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isAimingReadyToShoot) == 0x000723, "Member 'UGunslingerAnimInstance::_isAimingReadyToShoot' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isFiring) == 0x000724, "Member 'UGunslingerAnimInstance::_isFiring' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isInMissShotCooldown) == 0x000725, "Member 'UGunslingerAnimInstance::_isInMissShotCooldown' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isInSuccessShot) == 0x000726, "Member 'UGunslingerAnimInstance::_isInSuccessShot' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isLinked) == 0x000727, "Member 'UGunslingerAnimInstance::_isLinked' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isReeling) == 0x000728, "Member 'UGunslingerAnimInstance::_isReeling' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _isInGunState) == 0x000729, "Member 'UGunslingerAnimInstance::_isInGunState' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _idleToAimAnimPlayrate) == 0x00072C, "Member 'UGunslingerAnimInstance::_idleToAimAnimPlayrate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _aimToIdleAnimPlayrate) == 0x000730, "Member 'UGunslingerAnimInstance::_aimToIdleAnimPlayrate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _fireAnimPlayRate) == 0x000734, "Member 'UGunslingerAnimInstance::_fireAnimPlayRate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _missShotCooldownAnimPlayRate) == 0x000738, "Member 'UGunslingerAnimInstance::_missShotCooldownAnimPlayRate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _successShotAnimPlayRate) == 0x00073C, "Member 'UGunslingerAnimInstance::_successShotAnimPlayRate' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _idleToAimAnim) == 0x000740, "Member 'UGunslingerAnimInstance::_idleToAimAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _aimToIdleAnim) == 0x000748, "Member 'UGunslingerAnimInstance::_aimToIdleAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _fireAnim) == 0x000750, "Member 'UGunslingerAnimInstance::_fireAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _missShotCooldownAnim) == 0x000758, "Member 'UGunslingerAnimInstance::_missShotCooldownAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _successShotAnim) == 0x000760, "Member 'UGunslingerAnimInstance::_successShotAnim' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _idleToAimAnimDuration) == 0x000768, "Member 'UGunslingerAnimInstance::_idleToAimAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _aimToIdleAnimDuration) == 0x000790, "Member 'UGunslingerAnimInstance::_aimToIdleAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _fireAnimDuration) == 0x0007B8, "Member 'UGunslingerAnimInstance::_fireAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _missShotCooldownAnimDuration) == 0x0007E0, "Member 'UGunslingerAnimInstance::_missShotCooldownAnimDuration' has a wrong offset!");
static_assert(offsetof(UGunslingerAnimInstance, _successShotAnimDuration) == 0x000860, "Member 'UGunslingerAnimInstance::_successShotAnimDuration' has a wrong offset!");

// Class TheGunslinger.GunslingerCameraTargetingStrategy
// 0x0018 (0x0068 - 0x0050)
class UGunslingerCameraTargetingStrategy final : public UBaseCameraTargetingStrategy
{
public:
	class FName                                   _cameraSocketName;                                 // 0x0050(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _survivorHarpoonSocketName;                        // 0x005C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerCameraTargetingStrategy">();
	}
	static class UGunslingerCameraTargetingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerCameraTargetingStrategy>();
	}
};
static_assert(alignof(UGunslingerCameraTargetingStrategy) == 0x000008, "Wrong alignment on UGunslingerCameraTargetingStrategy");
static_assert(sizeof(UGunslingerCameraTargetingStrategy) == 0x000068, "Wrong size on UGunslingerCameraTargetingStrategy");
static_assert(offsetof(UGunslingerCameraTargetingStrategy, _cameraSocketName) == 0x000050, "Member 'UGunslingerCameraTargetingStrategy::_cameraSocketName' has a wrong offset!");
static_assert(offsetof(UGunslingerCameraTargetingStrategy, _survivorHarpoonSocketName) == 0x00005C, "Member 'UGunslingerCameraTargetingStrategy::_survivorHarpoonSocketName' has a wrong offset!");

// Class TheGunslinger.GunslingerEffectsComponent
// 0x00A0 (0x0148 - 0x00A8)
class UGunslingerEffectsComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnIsAimingChanged;                                 // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             PlayOutOfAmmoSound;                                // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         _minimumTimeBetweenBroadcast;                      // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHarpoonRifle*                          _rifle;                                            // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x70];                                      // 0x00D8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_PlayOutOfAmmoSound();
	void OnIsAimingChanged__DelegateSignature(bool IsAiming);
	void OnItemUsedStateChanged(bool IsPressed);
	void PlayOutOfAmmoSound__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerEffectsComponent">();
	}
	static class UGunslingerEffectsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerEffectsComponent>();
	}
};
static_assert(alignof(UGunslingerEffectsComponent) == 0x000008, "Wrong alignment on UGunslingerEffectsComponent");
static_assert(sizeof(UGunslingerEffectsComponent) == 0x000148, "Wrong size on UGunslingerEffectsComponent");
static_assert(offsetof(UGunslingerEffectsComponent, OnIsAimingChanged) == 0x0000A8, "Member 'UGunslingerEffectsComponent::OnIsAimingChanged' has a wrong offset!");
static_assert(offsetof(UGunslingerEffectsComponent, PlayOutOfAmmoSound) == 0x0000B8, "Member 'UGunslingerEffectsComponent::PlayOutOfAmmoSound' has a wrong offset!");
static_assert(offsetof(UGunslingerEffectsComponent, _minimumTimeBetweenBroadcast) == 0x0000C8, "Member 'UGunslingerEffectsComponent::_minimumTimeBetweenBroadcast' has a wrong offset!");
static_assert(offsetof(UGunslingerEffectsComponent, _rifle) == 0x0000D0, "Member 'UGunslingerEffectsComponent::_rifle' has a wrong offset!");

// Class TheGunslinger.GunslingerUtilities
// 0x0000 (0x0030 - 0x0030)
class UGunslingerUtilities final : public UBlueprintFunctionLibrary
{
public:
	static class AHarpoonRifle* GetHarpoonRifle(class ADBDPlayer* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GunslingerUtilities">();
	}
	static class UGunslingerUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunslingerUtilities>();
	}
};
static_assert(alignof(UGunslingerUtilities) == 0x000008, "Wrong alignment on UGunslingerUtilities");
static_assert(sizeof(UGunslingerUtilities) == 0x000030, "Wrong size on UGunslingerUtilities");

// Class TheGunslinger.HarpoonChainPositioner
// 0x00B0 (0x0158 - 0x00A8)
class UHarpoonChainPositioner final : public UActorComponent
{
public:
	TSubclassOf<class AHarpoonProp>               _harpoonPropClass;                                 // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _survivorAttachSocket;                             // 0x00B0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _animationSocket;                                  // 0x00BC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _reelBackToRifleSpeed;                             // 0x00C8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	float                                         _harpoonMinimumSnapBackDistance;                   // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _harpoonMaximumSnapBackDistance;                   // 0x00F8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class AHarpoonProp*                           _harpoonProp;                                      // 0x0120(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AHarpoonProjectile*                     _harpoonProjectile;                                // 0x0128(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _collector;                                        // 0x0130(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ARifleChain*                            _chain;                                            // 0x0140(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x10];                                     // 0x0148(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AttachToAnimSocket();
	void AttachToRifle();
	void OnCurrentHarpoonChanged(class AActor* CurrentHarpoon);
	void OnHarpoonLoadedOnRifle();
	void OnHarpoonTravelingChanged(bool IsTravelling);
	void OnOwnerCollected(class ADBDPlayer* Collector);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarpoonChainPositioner">();
	}
	static class UHarpoonChainPositioner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarpoonChainPositioner>();
	}
};
static_assert(alignof(UHarpoonChainPositioner) == 0x000008, "Wrong alignment on UHarpoonChainPositioner");
static_assert(sizeof(UHarpoonChainPositioner) == 0x000158, "Wrong size on UHarpoonChainPositioner");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonPropClass) == 0x0000A8, "Member 'UHarpoonChainPositioner::_harpoonPropClass' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _survivorAttachSocket) == 0x0000B0, "Member 'UHarpoonChainPositioner::_survivorAttachSocket' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _animationSocket) == 0x0000BC, "Member 'UHarpoonChainPositioner::_animationSocket' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _reelBackToRifleSpeed) == 0x0000C8, "Member 'UHarpoonChainPositioner::_reelBackToRifleSpeed' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonMinimumSnapBackDistance) == 0x0000F0, "Member 'UHarpoonChainPositioner::_harpoonMinimumSnapBackDistance' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonMaximumSnapBackDistance) == 0x0000F8, "Member 'UHarpoonChainPositioner::_harpoonMaximumSnapBackDistance' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonProp) == 0x000120, "Member 'UHarpoonChainPositioner::_harpoonProp' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _harpoonProjectile) == 0x000128, "Member 'UHarpoonChainPositioner::_harpoonProjectile' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _collector) == 0x000130, "Member 'UHarpoonChainPositioner::_collector' has a wrong offset!");
static_assert(offsetof(UHarpoonChainPositioner, _chain) == 0x000140, "Member 'UHarpoonChainPositioner::_chain' has a wrong offset!");

// Class TheGunslinger.HarpoonedSurvivorSubAnimInstance
// 0x00B0 (0x0690 - 0x05E0)
class UHarpoonedSurvivorSubAnimInstance : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_5E0[0x8];                                      // 0x05E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _linkedMaxSpeed;                                   // 0x05E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _timeBeforeHarpoonHitReset;                        // 0x05EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _hitHarpoonedEnterEvent;                           // 0x05F0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _chainBreakEnterEvent;                             // 0x05FC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChainLinked;                                    // 0x0608(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingReeled;                                    // 0x0609(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasLinkInput;                                     // 0x060A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60B[0x1];                                      // 0x060B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _linkInputX;                                       // 0x060C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _linkInputY;                                       // 0x0610(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _chainBreakTrigger;                                // 0x0614(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _triggerHarpoonHit;                                // 0x0615(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_616[0x2];                                      // 0x0616(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _harpoonHitTurnAnimNormalizedStartTime;            // 0x0618(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _harpoonHitAnimTurnRight;                          // 0x061C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrawling;                                       // 0x061D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x061E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61F[0x1];                                      // 0x061F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _walkAnimSpeed;                                    // 0x0620(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _yaw;                                              // 0x0624(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _pitch;                                            // 0x0628(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62C[0x64];                                     // 0x062C(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarpoonedSurvivorSubAnimInstance">();
	}
	static class UHarpoonedSurvivorSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarpoonedSurvivorSubAnimInstance>();
	}
};
static_assert(alignof(UHarpoonedSurvivorSubAnimInstance) == 0x000010, "Wrong alignment on UHarpoonedSurvivorSubAnimInstance");
static_assert(sizeof(UHarpoonedSurvivorSubAnimInstance) == 0x000690, "Wrong size on UHarpoonedSurvivorSubAnimInstance");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _linkedMaxSpeed) == 0x0005E8, "Member 'UHarpoonedSurvivorSubAnimInstance::_linkedMaxSpeed' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _timeBeforeHarpoonHitReset) == 0x0005EC, "Member 'UHarpoonedSurvivorSubAnimInstance::_timeBeforeHarpoonHitReset' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _hitHarpoonedEnterEvent) == 0x0005F0, "Member 'UHarpoonedSurvivorSubAnimInstance::_hitHarpoonedEnterEvent' has a wrong offset!");
static_assert(offsetof(UHarpoonedSurvivorSubAnimInstance, _chainBreakEnterEvent) == 0x0005FC, "Member 'UHarpoonedSurvivorSubAnimInstance::_chainBreakEnterEvent' has a wrong offset!");
