#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK31

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "TheK31_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TheK31.K31PowerCosmeticHelper.Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent
// 0x0001 (0x0001 - 0x0000)
struct K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent final
{
public:
	bool                                          DoesRadarDetectAnySurvivors;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent) == 0x000001, "Wrong alignment on K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent");
static_assert(sizeof(K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent) == 0x000001, "Wrong size on K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent");
static_assert(offsetof(K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent, DoesRadarDetectAnySurvivors) == 0x000000, "Member 'K31PowerCosmeticHelper_Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent::DoesRadarDetectAnySurvivors' has a wrong offset!");

// Function TheK31.K31PowerCosmeticHelper.Cosmetic_IsOnPowerCooldownUpdatedEvent
// 0x0001 (0x0001 - 0x0000)
struct K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent final
{
public:
	bool                                          IsPowerOnCooldown;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent) == 0x000001, "Wrong alignment on K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent");
static_assert(sizeof(K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent) == 0x000001, "Wrong size on K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent");
static_assert(offsetof(K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent, IsPowerOnCooldown) == 0x000000, "Member 'K31PowerCosmeticHelper_Cosmetic_IsOnPowerCooldownUpdatedEvent::IsPowerOnCooldown' has a wrong offset!");

// Function TheK31.Addon_K31Power_20.Authority_OnGameEventReceived
// 0x0040 (0x0040 - 0x0000)
struct Addon_K31Power_20_Authority_OnGameEventReceived final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Addon_K31Power_20_Authority_OnGameEventReceived) == 0x000008, "Wrong alignment on Addon_K31Power_20_Authority_OnGameEventReceived");
static_assert(sizeof(Addon_K31Power_20_Authority_OnGameEventReceived) == 0x000040, "Wrong size on Addon_K31Power_20_Authority_OnGameEventReceived");
static_assert(offsetof(Addon_K31Power_20_Authority_OnGameEventReceived, GameplayTag) == 0x000000, "Member 'Addon_K31Power_20_Authority_OnGameEventReceived::GameplayTag' has a wrong offset!");
static_assert(offsetof(Addon_K31Power_20_Authority_OnGameEventReceived, GameEventData) == 0x000010, "Member 'Addon_K31Power_20_Authority_OnGameEventReceived::GameEventData' has a wrong offset!");

// Function TheK31.DroneRestrictedPlacementAreaStrategy.OnDroneAcquiredChanged
// 0x0001 (0x0001 - 0x0000)
struct DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged final
{
public:
	bool                                          Acquired;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged) == 0x000001, "Wrong alignment on DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged");
static_assert(sizeof(DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged) == 0x000001, "Wrong size on DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged");
static_assert(offsetof(DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged, Acquired) == 0x000000, "Member 'DroneRestrictedPlacementAreaStrategy_OnDroneAcquiredChanged::Acquired' has a wrong offset!");

// Function TheK31.DroneRestrictedPlacementAreaStrategy.OnDroneEndPlay
// 0x0010 (0x0010 - 0x0000)
struct DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay) == 0x000008, "Wrong alignment on DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay");
static_assert(sizeof(DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay) == 0x000010, "Wrong size on DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay");
static_assert(offsetof(DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay, Actor) == 0x000000, "Member 'DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay, EndPlayReason) == 0x000008, "Member 'DroneRestrictedPlacementAreaStrategy_OnDroneEndPlay::EndPlayReason' has a wrong offset!");

// Function TheK31.InspectK31DroneInteraction.OnChargeCompletedChanged
// 0x0018 (0x0018 - 0x0000)
struct InspectK31DroneInteraction_OnChargeCompletedChanged final
{
public:
	bool                                          COMPLETED;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         InstigatorsForCompletion;                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(InspectK31DroneInteraction_OnChargeCompletedChanged) == 0x000008, "Wrong alignment on InspectK31DroneInteraction_OnChargeCompletedChanged");
static_assert(sizeof(InspectK31DroneInteraction_OnChargeCompletedChanged) == 0x000018, "Wrong size on InspectK31DroneInteraction_OnChargeCompletedChanged");
static_assert(offsetof(InspectK31DroneInteraction_OnChargeCompletedChanged, COMPLETED) == 0x000000, "Member 'InspectK31DroneInteraction_OnChargeCompletedChanged::COMPLETED' has a wrong offset!");
static_assert(offsetof(InspectK31DroneInteraction_OnChargeCompletedChanged, InstigatorsForCompletion) == 0x000008, "Member 'InspectK31DroneInteraction_OnChargeCompletedChanged::InstigatorsForCompletion' has a wrong offset!");

// Function TheK31.InspectK31DroneInteraction.Server_SetIsPressingInput
// 0x0001 (0x0001 - 0x0000)
struct InspectK31DroneInteraction_Server_SetIsPressingInput final
{
public:
	bool                                          IsPressing;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InspectK31DroneInteraction_Server_SetIsPressingInput) == 0x000001, "Wrong alignment on InspectK31DroneInteraction_Server_SetIsPressingInput");
static_assert(sizeof(InspectK31DroneInteraction_Server_SetIsPressingInput) == 0x000001, "Wrong size on InspectK31DroneInteraction_Server_SetIsPressingInput");
static_assert(offsetof(InspectK31DroneInteraction_Server_SetIsPressingInput, IsPressing) == 0x000000, "Member 'InspectK31DroneInteraction_Server_SetIsPressingInput::IsPressing' has a wrong offset!");

// Function TheK31.K31AnimInstance.OnCustomizationAnimationMappingIDChanged
// 0x0004 (0x0004 - 0x0000)
struct K31AnimInstance_OnCustomizationAnimationMappingIDChanged final
{
public:
	int32                                         AnimationMappingIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31AnimInstance_OnCustomizationAnimationMappingIDChanged) == 0x000004, "Wrong alignment on K31AnimInstance_OnCustomizationAnimationMappingIDChanged");
static_assert(sizeof(K31AnimInstance_OnCustomizationAnimationMappingIDChanged) == 0x000004, "Wrong size on K31AnimInstance_OnCustomizationAnimationMappingIDChanged");
static_assert(offsetof(K31AnimInstance_OnCustomizationAnimationMappingIDChanged, AnimationMappingIndex) == 0x000000, "Member 'K31AnimInstance_OnCustomizationAnimationMappingIDChanged::AnimationMappingIndex' has a wrong offset!");

// Function TheK31.K31AnimInstance.OnGameEventReceived
// 0x0040 (0x0040 - 0x0000)
struct K31AnimInstance_OnGameEventReceived final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31AnimInstance_OnGameEventReceived) == 0x000008, "Wrong alignment on K31AnimInstance_OnGameEventReceived");
static_assert(sizeof(K31AnimInstance_OnGameEventReceived) == 0x000040, "Wrong size on K31AnimInstance_OnGameEventReceived");
static_assert(offsetof(K31AnimInstance_OnGameEventReceived, GameplayTag) == 0x000000, "Member 'K31AnimInstance_OnGameEventReceived::GameplayTag' has a wrong offset!");
static_assert(offsetof(K31AnimInstance_OnGameEventReceived, GameEventData) == 0x000010, "Member 'K31AnimInstance_OnGameEventReceived::GameEventData' has a wrong offset!");

// Function TheK31.K31AnimInstance.GetCustoAnimTags
// 0x0010 (0x0010 - 0x0000)
struct K31AnimInstance_GetCustoAnimTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31AnimInstance_GetCustoAnimTags) == 0x000008, "Wrong alignment on K31AnimInstance_GetCustoAnimTags");
static_assert(sizeof(K31AnimInstance_GetCustoAnimTags) == 0x000010, "Wrong size on K31AnimInstance_GetCustoAnimTags");
static_assert(offsetof(K31AnimInstance_GetCustoAnimTags, ReturnValue) == 0x000000, "Member 'K31AnimInstance_GetCustoAnimTags::ReturnValue' has a wrong offset!");

// Function TheK31.K31AnimInstance.GetCustomizationMappingID
// 0x0004 (0x0004 - 0x0000)
struct K31AnimInstance_GetCustomizationMappingID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31AnimInstance_GetCustomizationMappingID) == 0x000004, "Wrong alignment on K31AnimInstance_GetCustomizationMappingID");
static_assert(sizeof(K31AnimInstance_GetCustomizationMappingID) == 0x000004, "Wrong size on K31AnimInstance_GetCustomizationMappingID");
static_assert(offsetof(K31AnimInstance_GetCustomizationMappingID, ReturnValue) == 0x000000, "Member 'K31AnimInstance_GetCustomizationMappingID::ReturnValue' has a wrong offset!");

// Function TheK31.K31ClawTrap.Cosmetic_OnAddedByDrone
// 0x0010 (0x0010 - 0x0000)
struct K31ClawTrap_Cosmetic_OnAddedByDrone final
{
public:
	class AK31Drone*                              OriginatingDrone;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClawTrapCosmeticDelayDuration;                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K31ClawTrap_Cosmetic_OnAddedByDrone) == 0x000008, "Wrong alignment on K31ClawTrap_Cosmetic_OnAddedByDrone");
static_assert(sizeof(K31ClawTrap_Cosmetic_OnAddedByDrone) == 0x000010, "Wrong size on K31ClawTrap_Cosmetic_OnAddedByDrone");
static_assert(offsetof(K31ClawTrap_Cosmetic_OnAddedByDrone, OriginatingDrone) == 0x000000, "Member 'K31ClawTrap_Cosmetic_OnAddedByDrone::OriginatingDrone' has a wrong offset!");
static_assert(offsetof(K31ClawTrap_Cosmetic_OnAddedByDrone, ClawTrapCosmeticDelayDuration) == 0x000008, "Member 'K31ClawTrap_Cosmetic_OnAddedByDrone::ClawTrapCosmeticDelayDuration' has a wrong offset!");

// Function TheK31.K31ClawTrap.Cosmetic_OnBatteryChargeUpdated
// 0x0004 (0x0004 - 0x0000)
struct K31ClawTrap_Cosmetic_OnBatteryChargeUpdated final
{
public:
	float                                         NewCharge;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31ClawTrap_Cosmetic_OnBatteryChargeUpdated) == 0x000004, "Wrong alignment on K31ClawTrap_Cosmetic_OnBatteryChargeUpdated");
static_assert(sizeof(K31ClawTrap_Cosmetic_OnBatteryChargeUpdated) == 0x000004, "Wrong size on K31ClawTrap_Cosmetic_OnBatteryChargeUpdated");
static_assert(offsetof(K31ClawTrap_Cosmetic_OnBatteryChargeUpdated, NewCharge) == 0x000000, "Member 'K31ClawTrap_Cosmetic_OnBatteryChargeUpdated::NewCharge' has a wrong offset!");

// Function TheK31.K31ClawTrap.Cosmetic_OnIsBroadcastingChanged
// 0x0001 (0x0001 - 0x0000)
struct K31ClawTrap_Cosmetic_OnIsBroadcastingChanged final
{
public:
	bool                                          IsBroadcasting;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31ClawTrap_Cosmetic_OnIsBroadcastingChanged) == 0x000001, "Wrong alignment on K31ClawTrap_Cosmetic_OnIsBroadcastingChanged");
static_assert(sizeof(K31ClawTrap_Cosmetic_OnIsBroadcastingChanged) == 0x000001, "Wrong size on K31ClawTrap_Cosmetic_OnIsBroadcastingChanged");
static_assert(offsetof(K31ClawTrap_Cosmetic_OnIsBroadcastingChanged, IsBroadcasting) == 0x000000, "Member 'K31ClawTrap_Cosmetic_OnIsBroadcastingChanged::IsBroadcasting' has a wrong offset!");

// Function TheK31.K31ClawTrap.Cosmetic_OnTrapRemoved
// 0x0001 (0x0001 - 0x0000)
struct K31ClawTrap_Cosmetic_OnTrapRemoved final
{
public:
	bool                                          WasRemovedAutomatically;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31ClawTrap_Cosmetic_OnTrapRemoved) == 0x000001, "Wrong alignment on K31ClawTrap_Cosmetic_OnTrapRemoved");
static_assert(sizeof(K31ClawTrap_Cosmetic_OnTrapRemoved) == 0x000001, "Wrong size on K31ClawTrap_Cosmetic_OnTrapRemoved");
static_assert(offsetof(K31ClawTrap_Cosmetic_OnTrapRemoved, WasRemovedAutomatically) == 0x000000, "Member 'K31ClawTrap_Cosmetic_OnTrapRemoved::WasRemovedAutomatically' has a wrong offset!");

// Function TheK31.K31Drone.Cosmetic_OnIsHackableStateChanged
// 0x0001 (0x0001 - 0x0000)
struct K31Drone_Cosmetic_OnIsHackableStateChanged final
{
public:
	bool                                          IsHackable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31Drone_Cosmetic_OnIsHackableStateChanged) == 0x000001, "Wrong alignment on K31Drone_Cosmetic_OnIsHackableStateChanged");
static_assert(sizeof(K31Drone_Cosmetic_OnIsHackableStateChanged) == 0x000001, "Wrong size on K31Drone_Cosmetic_OnIsHackableStateChanged");
static_assert(offsetof(K31Drone_Cosmetic_OnIsHackableStateChanged, IsHackable) == 0x000000, "Member 'K31Drone_Cosmetic_OnIsHackableStateChanged::IsHackable' has a wrong offset!");

// Function TheK31.K31Drone.Cosmetic_OnRevertToScoutingCurrentChargeChanged
// 0x0004 (0x0004 - 0x0000)
struct K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged final
{
public:
	float                                         ChargePercentage;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged) == 0x000004, "Wrong alignment on K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged");
static_assert(sizeof(K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged) == 0x000004, "Wrong size on K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged");
static_assert(offsetof(K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged, ChargePercentage) == 0x000000, "Member 'K31Drone_Cosmetic_OnRevertToScoutingCurrentChargeChanged::ChargePercentage' has a wrong offset!");

// Function TheK31.K31Drone.OnAcquiredChanged
// 0x0001 (0x0001 - 0x0000)
struct K31Drone_OnAcquiredChanged final
{
public:
	bool                                          Acquired;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31Drone_OnAcquiredChanged) == 0x000001, "Wrong alignment on K31Drone_OnAcquiredChanged");
static_assert(sizeof(K31Drone_OnAcquiredChanged) == 0x000001, "Wrong size on K31Drone_OnAcquiredChanged");
static_assert(offsetof(K31Drone_OnAcquiredChanged, Acquired) == 0x000000, "Member 'K31Drone_OnAcquiredChanged::Acquired' has a wrong offset!");

// Function TheK31.K31DroneActionProcessor.Client_ReceiveActionResponse
// 0x0020 (0x0020 - 0x0000)
struct K31DroneActionProcessor_Client_ReceiveActionResponse final
{
public:
	struct FK31DroneActionResponse                Response;                                          // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneActionProcessor_Client_ReceiveActionResponse) == 0x000008, "Wrong alignment on K31DroneActionProcessor_Client_ReceiveActionResponse");
static_assert(sizeof(K31DroneActionProcessor_Client_ReceiveActionResponse) == 0x000020, "Wrong size on K31DroneActionProcessor_Client_ReceiveActionResponse");
static_assert(offsetof(K31DroneActionProcessor_Client_ReceiveActionResponse, Response) == 0x000000, "Member 'K31DroneActionProcessor_Client_ReceiveActionResponse::Response' has a wrong offset!");

// Function TheK31.K31DroneActionProcessor.Server_RequestAction
// 0x0018 (0x0018 - 0x0000)
struct K31DroneActionProcessor_Server_RequestAction final
{
public:
	struct FK31DroneActionRequest                 Request;                                           // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneActionProcessor_Server_RequestAction) == 0x000008, "Wrong alignment on K31DroneActionProcessor_Server_RequestAction");
static_assert(sizeof(K31DroneActionProcessor_Server_RequestAction) == 0x000018, "Wrong size on K31DroneActionProcessor_Server_RequestAction");
static_assert(offsetof(K31DroneActionProcessor_Server_RequestAction, Request) == 0x000000, "Member 'K31DroneActionProcessor_Server_RequestAction::Request' has a wrong offset!");

// Function TheK31.K31DroneActiveState.GetRevertToScoutingCurrentCharge
// 0x0004 (0x0004 - 0x0000)
struct K31DroneActiveState_GetRevertToScoutingCurrentCharge final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneActiveState_GetRevertToScoutingCurrentCharge) == 0x000004, "Wrong alignment on K31DroneActiveState_GetRevertToScoutingCurrentCharge");
static_assert(sizeof(K31DroneActiveState_GetRevertToScoutingCurrentCharge) == 0x000004, "Wrong size on K31DroneActiveState_GetRevertToScoutingCurrentCharge");
static_assert(offsetof(K31DroneActiveState_GetRevertToScoutingCurrentCharge, ReturnValue) == 0x000000, "Member 'K31DroneActiveState_GetRevertToScoutingCurrentCharge::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneActiveState.GetRevertToScoutingMaxCharge
// 0x0004 (0x0004 - 0x0000)
struct K31DroneActiveState_GetRevertToScoutingMaxCharge final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneActiveState_GetRevertToScoutingMaxCharge) == 0x000004, "Wrong alignment on K31DroneActiveState_GetRevertToScoutingMaxCharge");
static_assert(sizeof(K31DroneActiveState_GetRevertToScoutingMaxCharge) == 0x000004, "Wrong size on K31DroneActiveState_GetRevertToScoutingMaxCharge");
static_assert(offsetof(K31DroneActiveState_GetRevertToScoutingMaxCharge, ReturnValue) == 0x000000, "Member 'K31DroneActiveState_GetRevertToScoutingMaxCharge::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneHackableAvoidanceSensor.Authority_OnKillerCollisionBegin
// 0x0110 (0x0110 - 0x0000)
struct K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin) == 0x000008, "Wrong alignment on K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin");
static_assert(sizeof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin) == 0x000110, "Wrong size on K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin, OverlappedComponent) == 0x000000, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin, OtherActor) == 0x000008, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin, OtherComp) == 0x000010, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin, OtherBodyIndex) == 0x000018, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin, bFromSweep) == 0x00001C, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin, SweepResult) == 0x000020, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionBegin::SweepResult' has a wrong offset!");

// Function TheK31.K31DroneHackableAvoidanceSensor.Authority_OnKillerCollisionEnd
// 0x0020 (0x0020 - 0x0000)
struct K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd) == 0x000008, "Wrong alignment on K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd");
static_assert(sizeof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd) == 0x000020, "Wrong size on K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd, OverlappedComponent) == 0x000000, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd, OtherActor) == 0x000008, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd, OtherComp) == 0x000010, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd, OtherBodyIndex) == 0x000018, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnKillerCollisionEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK31.K31DroneHackableAvoidanceSensor.Authority_OnSurvivorCollisionBegin
// 0x0110 (0x0110 - 0x0000)
struct K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin) == 0x000008, "Wrong alignment on K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin");
static_assert(sizeof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin) == 0x000110, "Wrong size on K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin, OverlappedComponent) == 0x000000, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin, OtherActor) == 0x000008, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin, OtherComp) == 0x000010, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin, OtherBodyIndex) == 0x000018, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin, bFromSweep) == 0x00001C, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin, SweepResult) == 0x000020, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionBegin::SweepResult' has a wrong offset!");

// Function TheK31.K31DroneHackableAvoidanceSensor.Authority_OnSurvivorCollisionEnd
// 0x0020 (0x0020 - 0x0000)
struct K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd) == 0x000008, "Wrong alignment on K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd");
static_assert(sizeof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd) == 0x000020, "Wrong size on K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd, OverlappedComponent) == 0x000000, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd, OtherActor) == 0x000008, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd, OtherComp) == 0x000010, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd, OtherBodyIndex) == 0x000018, "Member 'K31DroneHackableAvoidanceSensor_Authority_OnSurvivorCollisionEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK31.K31DroneHackableAvoidanceSensor.Init
// 0x0010 (0x0010 - 0x0000)
struct K31DroneHackableAvoidanceSensor_Init final
{
public:
	class UPrimitiveComponent*                    KillerPrimitive;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SurvivorPrimitive;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneHackableAvoidanceSensor_Init) == 0x000008, "Wrong alignment on K31DroneHackableAvoidanceSensor_Init");
static_assert(sizeof(K31DroneHackableAvoidanceSensor_Init) == 0x000010, "Wrong size on K31DroneHackableAvoidanceSensor_Init");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Init, KillerPrimitive) == 0x000000, "Member 'K31DroneHackableAvoidanceSensor_Init::KillerPrimitive' has a wrong offset!");
static_assert(offsetof(K31DroneHackableAvoidanceSensor_Init, SurvivorPrimitive) == 0x000008, "Member 'K31DroneHackableAvoidanceSensor_Init::SurvivorPrimitive' has a wrong offset!");

// Function TheK31.K31DroneHackableComponent.IsHackable
// 0x0001 (0x0001 - 0x0000)
struct K31DroneHackableComponent_IsHackable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneHackableComponent_IsHackable) == 0x000001, "Wrong alignment on K31DroneHackableComponent_IsHackable");
static_assert(sizeof(K31DroneHackableComponent_IsHackable) == 0x000001, "Wrong size on K31DroneHackableComponent_IsHackable");
static_assert(offsetof(K31DroneHackableComponent_IsHackable, ReturnValue) == 0x000000, "Member 'K31DroneHackableComponent_IsHackable::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneLaserController.Local_OnCrouchChanged
// 0x0001 (0x0001 - 0x0000)
struct K31DroneLaserController_Local_OnCrouchChanged final
{
public:
	bool                                          IsCrouched;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneLaserController_Local_OnCrouchChanged) == 0x000001, "Wrong alignment on K31DroneLaserController_Local_OnCrouchChanged");
static_assert(sizeof(K31DroneLaserController_Local_OnCrouchChanged) == 0x000001, "Wrong size on K31DroneLaserController_Local_OnCrouchChanged");
static_assert(offsetof(K31DroneLaserController_Local_OnCrouchChanged, IsCrouched) == 0x000000, "Member 'K31DroneLaserController_Local_OnCrouchChanged::IsCrouched' has a wrong offset!");

// Function TheK31.K31DroneLaserController.Local_OnIdleChanged
// 0x0008 (0x0008 - 0x0000)
struct K31DroneLaserController_Local_OnIdleChanged final
{
public:
	bool                                          IsIdle;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleStartTime;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneLaserController_Local_OnIdleChanged) == 0x000004, "Wrong alignment on K31DroneLaserController_Local_OnIdleChanged");
static_assert(sizeof(K31DroneLaserController_Local_OnIdleChanged) == 0x000008, "Wrong size on K31DroneLaserController_Local_OnIdleChanged");
static_assert(offsetof(K31DroneLaserController_Local_OnIdleChanged, IsIdle) == 0x000000, "Member 'K31DroneLaserController_Local_OnIdleChanged::IsIdle' has a wrong offset!");
static_assert(offsetof(K31DroneLaserController_Local_OnIdleChanged, IdleStartTime) == 0x000004, "Member 'K31DroneLaserController_Local_OnIdleChanged::IdleStartTime' has a wrong offset!");

// Function TheK31.K31DroneLaserScanActor.SetLaserVisibility
// 0x0001 (0x0001 - 0x0000)
struct K31DroneLaserScanActor_SetLaserVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneLaserScanActor_SetLaserVisibility) == 0x000001, "Wrong alignment on K31DroneLaserScanActor_SetLaserVisibility");
static_assert(sizeof(K31DroneLaserScanActor_SetLaserVisibility) == 0x000001, "Wrong size on K31DroneLaserScanActor_SetLaserVisibility");
static_assert(offsetof(K31DroneLaserScanActor_SetLaserVisibility, Visible) == 0x000000, "Member 'K31DroneLaserScanActor_SetLaserVisibility::Visible' has a wrong offset!");

// Function TheK31.K31DroneLaserScanActor.UpdateLaserScanMeshMaterial
// 0x0008 (0x0008 - 0x0000)
struct K31DroneLaserScanActor_UpdateLaserScanMeshMaterial final
{
public:
	class UMaterialInstance*                      NewLaserScanMeshMaterial;                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneLaserScanActor_UpdateLaserScanMeshMaterial) == 0x000008, "Wrong alignment on K31DroneLaserScanActor_UpdateLaserScanMeshMaterial");
static_assert(sizeof(K31DroneLaserScanActor_UpdateLaserScanMeshMaterial) == 0x000008, "Wrong size on K31DroneLaserScanActor_UpdateLaserScanMeshMaterial");
static_assert(offsetof(K31DroneLaserScanActor_UpdateLaserScanMeshMaterial, NewLaserScanMeshMaterial) == 0x000000, "Member 'K31DroneLaserScanActor_UpdateLaserScanMeshMaterial::NewLaserScanMeshMaterial' has a wrong offset!");

// DelegateFunction TheK31.K31DroneMovementComponent.OnAccelerationChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature final
{
public:
	struct FVector                                Acceleration;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature");
static_assert(sizeof(K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature) == 0x000018, "Wrong size on K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature");
static_assert(offsetof(K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature, Acceleration) == 0x000000, "Member 'K31DroneMovementComponent_OnAccelerationChangedEvent__DelegateSignature::Acceleration' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.OnRep_DeployDatum
// 0x0048 (0x0048 - 0x0000)
struct K31DroneMovementComponent_OnRep_DeployDatum final
{
public:
	struct FDroneDeployDatum                      OldDeployDatum;                                    // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_OnRep_DeployDatum) == 0x000008, "Wrong alignment on K31DroneMovementComponent_OnRep_DeployDatum");
static_assert(sizeof(K31DroneMovementComponent_OnRep_DeployDatum) == 0x000048, "Wrong size on K31DroneMovementComponent_OnRep_DeployDatum");
static_assert(offsetof(K31DroneMovementComponent_OnRep_DeployDatum, OldDeployDatum) == 0x000000, "Member 'K31DroneMovementComponent_OnRep_DeployDatum::OldDeployDatum' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.OnRep_ReplicatedMovement
// 0x0058 (0x0058 - 0x0000)
struct K31DroneMovementComponent_OnRep_ReplicatedMovement final
{
public:
	struct FDroneRepMovement                      OldRepMovement;                                    // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_OnRep_ReplicatedMovement) == 0x000008, "Wrong alignment on K31DroneMovementComponent_OnRep_ReplicatedMovement");
static_assert(sizeof(K31DroneMovementComponent_OnRep_ReplicatedMovement) == 0x000058, "Wrong size on K31DroneMovementComponent_OnRep_ReplicatedMovement");
static_assert(offsetof(K31DroneMovementComponent_OnRep_ReplicatedMovement, OldRepMovement) == 0x000000, "Member 'K31DroneMovementComponent_OnRep_ReplicatedMovement::OldRepMovement' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.GetDistanceToTarget
// 0x0004 (0x0004 - 0x0000)
struct K31DroneMovementComponent_GetDistanceToTarget final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_GetDistanceToTarget) == 0x000004, "Wrong alignment on K31DroneMovementComponent_GetDistanceToTarget");
static_assert(sizeof(K31DroneMovementComponent_GetDistanceToTarget) == 0x000004, "Wrong size on K31DroneMovementComponent_GetDistanceToTarget");
static_assert(offsetof(K31DroneMovementComponent_GetDistanceToTarget, ReturnValue) == 0x000000, "Member 'K31DroneMovementComponent_GetDistanceToTarget::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.GetMovementMode
// 0x0001 (0x0001 - 0x0000)
struct K31DroneMovementComponent_GetMovementMode final
{
public:
	EK31DroneMovementMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_GetMovementMode) == 0x000001, "Wrong alignment on K31DroneMovementComponent_GetMovementMode");
static_assert(sizeof(K31DroneMovementComponent_GetMovementMode) == 0x000001, "Wrong size on K31DroneMovementComponent_GetMovementMode");
static_assert(offsetof(K31DroneMovementComponent_GetMovementMode, ReturnValue) == 0x000000, "Member 'K31DroneMovementComponent_GetMovementMode::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.GetTargetFlightHeight
// 0x0001 (0x0001 - 0x0000)
struct K31DroneMovementComponent_GetTargetFlightHeight final
{
public:
	EDroneFlyingHeight                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_GetTargetFlightHeight) == 0x000001, "Wrong alignment on K31DroneMovementComponent_GetTargetFlightHeight");
static_assert(sizeof(K31DroneMovementComponent_GetTargetFlightHeight) == 0x000001, "Wrong size on K31DroneMovementComponent_GetTargetFlightHeight");
static_assert(offsetof(K31DroneMovementComponent_GetTargetFlightHeight, ReturnValue) == 0x000000, "Member 'K31DroneMovementComponent_GetTargetFlightHeight::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.HasReachedDeployLocation
// 0x0001 (0x0001 - 0x0000)
struct K31DroneMovementComponent_HasReachedDeployLocation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_HasReachedDeployLocation) == 0x000001, "Wrong alignment on K31DroneMovementComponent_HasReachedDeployLocation");
static_assert(sizeof(K31DroneMovementComponent_HasReachedDeployLocation) == 0x000001, "Wrong size on K31DroneMovementComponent_HasReachedDeployLocation");
static_assert(offsetof(K31DroneMovementComponent_HasReachedDeployLocation, ReturnValue) == 0x000000, "Member 'K31DroneMovementComponent_HasReachedDeployLocation::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneMovementComponent.IsMeshAttachedToCharacterForDeploy
// 0x0001 (0x0001 - 0x0000)
struct K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy) == 0x000001, "Wrong alignment on K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy");
static_assert(sizeof(K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy) == 0x000001, "Wrong size on K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy");
static_assert(offsetof(K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy, ReturnValue) == 0x000000, "Member 'K31DroneMovementComponent_IsMeshAttachedToCharacterForDeploy::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneScoutDetectionComponent.OnLaserActive
// 0x0010 (0x0010 - 0x0000)
struct K31DroneScoutDetectionComponent_OnLaserActive final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Reset;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K31DroneScoutDetectionComponent_OnLaserActive) == 0x000008, "Wrong alignment on K31DroneScoutDetectionComponent_OnLaserActive");
static_assert(sizeof(K31DroneScoutDetectionComponent_OnLaserActive) == 0x000010, "Wrong size on K31DroneScoutDetectionComponent_OnLaserActive");
static_assert(offsetof(K31DroneScoutDetectionComponent_OnLaserActive, Component) == 0x000000, "Member 'K31DroneScoutDetectionComponent_OnLaserActive::Component' has a wrong offset!");
static_assert(offsetof(K31DroneScoutDetectionComponent_OnLaserActive, Reset) == 0x000008, "Member 'K31DroneScoutDetectionComponent_OnLaserActive::Reset' has a wrong offset!");

// Function TheK31.K31DroneScoutDetectionComponent.OnLaserDeactivate
// 0x0008 (0x0008 - 0x0000)
struct K31DroneScoutDetectionComponent_OnLaserDeactivate final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneScoutDetectionComponent_OnLaserDeactivate) == 0x000008, "Wrong alignment on K31DroneScoutDetectionComponent_OnLaserDeactivate");
static_assert(sizeof(K31DroneScoutDetectionComponent_OnLaserDeactivate) == 0x000008, "Wrong size on K31DroneScoutDetectionComponent_OnLaserDeactivate");
static_assert(offsetof(K31DroneScoutDetectionComponent_OnLaserDeactivate, Component) == 0x000000, "Member 'K31DroneScoutDetectionComponent_OnLaserDeactivate::Component' has a wrong offset!");

// DelegateFunction TheK31.K31DroneStateController.OnStateChangedBlueprintEvent__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature final
{
public:
	EK31DroneStateID                              OldState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EK31DroneStateID                              NewState;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature) == 0x000001, "Wrong alignment on K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature");
static_assert(sizeof(K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature) == 0x000002, "Wrong size on K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature");
static_assert(offsetof(K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature, OldState) == 0x000000, "Member 'K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature::OldState' has a wrong offset!");
static_assert(offsetof(K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature, NewState) == 0x000001, "Member 'K31DroneStateController_OnStateChangedBlueprintEvent__DelegateSignature::NewState' has a wrong offset!");

// Function TheK31.K31DroneStateController.GetCurrentStateID
// 0x0001 (0x0001 - 0x0000)
struct K31DroneStateController_GetCurrentStateID final
{
public:
	EK31DroneStateID                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneStateController_GetCurrentStateID) == 0x000001, "Wrong alignment on K31DroneStateController_GetCurrentStateID");
static_assert(sizeof(K31DroneStateController_GetCurrentStateID) == 0x000001, "Wrong size on K31DroneStateController_GetCurrentStateID");
static_assert(offsetof(K31DroneStateController_GetCurrentStateID, ReturnValue) == 0x000000, "Member 'K31DroneStateController_GetCurrentStateID::ReturnValue' has a wrong offset!");

// Function TheK31.K31DroneStateController.GetPreviousStateID
// 0x0001 (0x0001 - 0x0000)
struct K31DroneStateController_GetPreviousStateID final
{
public:
	EK31DroneStateID                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31DroneStateController_GetPreviousStateID) == 0x000001, "Wrong alignment on K31DroneStateController_GetPreviousStateID");
static_assert(sizeof(K31DroneStateController_GetPreviousStateID) == 0x000001, "Wrong size on K31DroneStateController_GetPreviousStateID");
static_assert(offsetof(K31DroneStateController_GetPreviousStateID, ReturnValue) == 0x000000, "Member 'K31DroneStateController_GetPreviousStateID::ReturnValue' has a wrong offset!");

// Function TheK31.K31MenuAnimInstance.OnCustomizationAnimationMappingIDChanged
// 0x0004 (0x0004 - 0x0000)
struct K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged final
{
public:
	int32                                         AnimationMappingIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged) == 0x000004, "Wrong alignment on K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged");
static_assert(sizeof(K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged) == 0x000004, "Wrong size on K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged");
static_assert(offsetof(K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged, AnimationMappingIndex) == 0x000000, "Member 'K31MenuAnimInstance_OnCustomizationAnimationMappingIDChanged::AnimationMappingIndex' has a wrong offset!");

// Function TheK31.K31MenuAnimInstance.GetCustoAnimTags
// 0x0010 (0x0010 - 0x0000)
struct K31MenuAnimInstance_GetCustoAnimTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31MenuAnimInstance_GetCustoAnimTags) == 0x000008, "Wrong alignment on K31MenuAnimInstance_GetCustoAnimTags");
static_assert(sizeof(K31MenuAnimInstance_GetCustoAnimTags) == 0x000010, "Wrong size on K31MenuAnimInstance_GetCustoAnimTags");
static_assert(offsetof(K31MenuAnimInstance_GetCustoAnimTags, ReturnValue) == 0x000000, "Member 'K31MenuAnimInstance_GetCustoAnimTags::ReturnValue' has a wrong offset!");

// Function TheK31.K31MenuAnimInstance.GetCustomizationMappingID
// 0x0004 (0x0004 - 0x0000)
struct K31MenuAnimInstance_GetCustomizationMappingID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31MenuAnimInstance_GetCustomizationMappingID) == 0x000004, "Wrong alignment on K31MenuAnimInstance_GetCustomizationMappingID");
static_assert(sizeof(K31MenuAnimInstance_GetCustomizationMappingID) == 0x000004, "Wrong size on K31MenuAnimInstance_GetCustomizationMappingID");
static_assert(offsetof(K31MenuAnimInstance_GetCustomizationMappingID, ReturnValue) == 0x000000, "Member 'K31MenuAnimInstance_GetCustomizationMappingID::ReturnValue' has a wrong offset!");

// Function TheK31.K31P01.GetHasteEffectDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct K31P01_GetHasteEffectDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31P01_GetHasteEffectDurationAtLevel) == 0x000004, "Wrong alignment on K31P01_GetHasteEffectDurationAtLevel");
static_assert(sizeof(K31P01_GetHasteEffectDurationAtLevel) == 0x000004, "Wrong size on K31P01_GetHasteEffectDurationAtLevel");
static_assert(offsetof(K31P01_GetHasteEffectDurationAtLevel, ReturnValue) == 0x000000, "Member 'K31P01_GetHasteEffectDurationAtLevel::ReturnValue' has a wrong offset!");

// Function TheK31.K31P01.GetHasteEffectMovementSpeedIncrease
// 0x0004 (0x0004 - 0x0000)
struct K31P01_GetHasteEffectMovementSpeedIncrease final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31P01_GetHasteEffectMovementSpeedIncrease) == 0x000004, "Wrong alignment on K31P01_GetHasteEffectMovementSpeedIncrease");
static_assert(sizeof(K31P01_GetHasteEffectMovementSpeedIncrease) == 0x000004, "Wrong size on K31P01_GetHasteEffectMovementSpeedIncrease");
static_assert(offsetof(K31P01_GetHasteEffectMovementSpeedIncrease, ReturnValue) == 0x000000, "Member 'K31P01_GetHasteEffectMovementSpeedIncrease::ReturnValue' has a wrong offset!");

// Function TheK31.K31P02.GetScreamDistance
// 0x0004 (0x0004 - 0x0000)
struct K31P02_GetScreamDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31P02_GetScreamDistance) == 0x000004, "Wrong alignment on K31P02_GetScreamDistance");
static_assert(sizeof(K31P02_GetScreamDistance) == 0x000004, "Wrong size on K31P02_GetScreamDistance");
static_assert(offsetof(K31P02_GetScreamDistance, ReturnValue) == 0x000000, "Member 'K31P02_GetScreamDistance::ReturnValue' has a wrong offset!");

// Function TheK31.K31P02.GetScreamRevealDuration
// 0x0004 (0x0004 - 0x0000)
struct K31P02_GetScreamRevealDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K31P02_GetScreamRevealDuration) == 0x000004, "Wrong alignment on K31P02_GetScreamRevealDuration");
static_assert(sizeof(K31P02_GetScreamRevealDuration) == 0x000004, "Wrong size on K31P02_GetScreamRevealDuration");
static_assert(offsetof(K31P02_GetScreamRevealDuration, ReturnValue) == 0x000000, "Member 'K31P02_GetScreamRevealDuration::ReturnValue' has a wrong offset!");

// Function TheK31.K31P03.GetHealPenaltyAtLevel
// 0x0004 (0x0004 - 0x0000)
struct K31P03_GetHealPenaltyAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
