#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK33

#include "Basic.hpp"

#include "DBDInteraction_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDGameplay_classes.hpp"
#include "TheK33_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "StatSystem_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "DBDCosmetic_classes.hpp"
#include "DBDAttack_classes.hpp"
#include "GameplayUtilities_classes.hpp"
#include "QueryService_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class TheK33.CollectFatherKeyCardInteraction
// 0x0000 (0x07B0 - 0x07B0)
class UCollectFatherKeyCardInteraction final : public UCollectItemInteraction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectFatherKeyCardInteraction">();
	}
	static class UCollectFatherKeyCardInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectFatherKeyCardInteraction>();
	}
};
static_assert(alignof(UCollectFatherKeyCardInteraction) == 0x000010, "Wrong alignment on UCollectFatherKeyCardInteraction");
static_assert(sizeof(UCollectFatherKeyCardInteraction) == 0x0007B0, "Wrong size on UCollectFatherKeyCardInteraction");

// Class TheK33.FatherTerminalHackingInteraction
// 0x00D0 (0x0850 - 0x0780)
class UFatherTerminalHackingInteraction final : public UInteractionDefinition
{
public:
	FMulticastInlineDelegateProperty_             Cosmetic_OnCooldownTimerStartOrDoneEvent;          // 0x0778(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Cosmetic_OnInteractionStarted;                     // 0x0788(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Cosmetic_OnSuccessfullyEndMiniGameAnimationStarted; // 0x0798(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDirectionalMiniGameDefinition         _miniGameDefinition;                               // 0x07A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         _cooldownDurationSeconds;                          // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7CC[0x14];                                     // 0x07CC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isHackingCompleted;                               // 0x07E0(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isCooldownTimerRunning;                           // 0x07E1(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _useSuccessfullyEndMiniGameExit;                   // 0x07E2(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E3[0x5];                                      // 0x07E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            _successfullyEndMiniGameAnimationMontageDescriptor; // 0x07E8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_808[0x48];                                     // 0x0808(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnCooldownTimerDone();
	void Authority_OnMinigameEnd(class ACamperPlayer* Survivor, EDirectionalMinigameResult Result);
	void OnRep_IsCooldownTimerRunning();
	void OnWormholeTerminalHackingCooldownTimerStartOrDone__DelegateSignature(bool IsRunning);
	void OnWormholeTerminalHackingInteractionStarted__DelegateSignature();
	void OnWormholeTerminalSuccessfullyEndMiniGameAnimationStarted__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FatherTerminalHackingInteraction">();
	}
	static class UFatherTerminalHackingInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFatherTerminalHackingInteraction>();
	}
};
static_assert(alignof(UFatherTerminalHackingInteraction) == 0x000010, "Wrong alignment on UFatherTerminalHackingInteraction");
static_assert(sizeof(UFatherTerminalHackingInteraction) == 0x000850, "Wrong size on UFatherTerminalHackingInteraction");
static_assert(offsetof(UFatherTerminalHackingInteraction, Cosmetic_OnCooldownTimerStartOrDoneEvent) == 0x000778, "Member 'UFatherTerminalHackingInteraction::Cosmetic_OnCooldownTimerStartOrDoneEvent' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, Cosmetic_OnInteractionStarted) == 0x000788, "Member 'UFatherTerminalHackingInteraction::Cosmetic_OnInteractionStarted' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, Cosmetic_OnSuccessfullyEndMiniGameAnimationStarted) == 0x000798, "Member 'UFatherTerminalHackingInteraction::Cosmetic_OnSuccessfullyEndMiniGameAnimationStarted' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, _miniGameDefinition) == 0x0007A8, "Member 'UFatherTerminalHackingInteraction::_miniGameDefinition' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, _cooldownDurationSeconds) == 0x0007C8, "Member 'UFatherTerminalHackingInteraction::_cooldownDurationSeconds' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, _isHackingCompleted) == 0x0007E0, "Member 'UFatherTerminalHackingInteraction::_isHackingCompleted' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, _isCooldownTimerRunning) == 0x0007E1, "Member 'UFatherTerminalHackingInteraction::_isCooldownTimerRunning' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, _useSuccessfullyEndMiniGameExit) == 0x0007E2, "Member 'UFatherTerminalHackingInteraction::_useSuccessfullyEndMiniGameExit' has a wrong offset!");
static_assert(offsetof(UFatherTerminalHackingInteraction, _successfullyEndMiniGameAnimationMontageDescriptor) == 0x0007E8, "Member 'UFatherTerminalHackingInteraction::_successfullyEndMiniGameAnimationMontageDescriptor' has a wrong offset!");

// Class TheK33.K33TunnelBlockCosmeticActorSpawner
// 0x0170 (0x0430 - 0x02C0)
class UK33TunnelBlockCosmeticActorSpawner final : public USceneComponent
{
public:
	uint8                                         Pad_2C0[0xE8];                                     // 0x02C0(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FK33CosmeticTunnelBlockSpawnInfo       _cosmeticBlockSpawnInfo;                           // 0x03A8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   _selectedTunnelBlockCosmeticClass;                 // 0x03F0(0x0038)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _editorVariationIndex;                             // 0x0428(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33TunnelBlockCosmeticActorSpawner">();
	}
	static class UK33TunnelBlockCosmeticActorSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33TunnelBlockCosmeticActorSpawner>();
	}
};
static_assert(alignof(UK33TunnelBlockCosmeticActorSpawner) == 0x000010, "Wrong alignment on UK33TunnelBlockCosmeticActorSpawner");
static_assert(sizeof(UK33TunnelBlockCosmeticActorSpawner) == 0x000430, "Wrong size on UK33TunnelBlockCosmeticActorSpawner");
static_assert(offsetof(UK33TunnelBlockCosmeticActorSpawner, _cosmeticBlockSpawnInfo) == 0x0003A8, "Member 'UK33TunnelBlockCosmeticActorSpawner::_cosmeticBlockSpawnInfo' has a wrong offset!");
static_assert(offsetof(UK33TunnelBlockCosmeticActorSpawner, _selectedTunnelBlockCosmeticClass) == 0x0003F0, "Member 'UK33TunnelBlockCosmeticActorSpawner::_selectedTunnelBlockCosmeticClass' has a wrong offset!");
static_assert(offsetof(UK33TunnelBlockCosmeticActorSpawner, _editorVariationIndex) == 0x000428, "Member 'UK33TunnelBlockCosmeticActorSpawner::_editorVariationIndex' has a wrong offset!");

// Class TheK33.IsInRangeOfK33ControlStation
// 0x0000 (0x00F8 - 0x00F8)
class UIsInRangeOfK33ControlStation final : public UAnyActorPairQueryRangeIsTrue
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsInRangeOfK33ControlStation">();
	}
	static class UIsInRangeOfK33ControlStation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsInRangeOfK33ControlStation>();
	}
};
static_assert(alignof(UIsInRangeOfK33ControlStation) == 0x000008, "Wrong alignment on UIsInRangeOfK33ControlStation");
static_assert(sizeof(UIsInRangeOfK33ControlStation) == 0x0000F8, "Wrong size on UIsInRangeOfK33ControlStation");

// Class TheK33.K33TunnelPulse
// 0x0098 (0x0338 - 0x02A0)
class AK33TunnelPulse final : public AActor
{
public:
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _lastPulseForwardOffset;                           // 0x02A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _lastPulseUpOffset;                                // 0x02AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _sideOffsetCurveMultiplier;                        // 0x02B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _firstTunnelBlockSideOffsetCurveMultiplier;        // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _lastTunnelBlockSideOffsetCurveMultiplier;         // 0x02C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _sideOffsetSize;                                   // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x6C];                                     // 0x02CC(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_ActivatePulse(int32 IdInPulseWave);
	void Cosmetic_DeactivatePulse();

	float Cosmetic_GetFadeOutPercentage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33TunnelPulse">();
	}
	static class AK33TunnelPulse* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK33TunnelPulse>();
	}
};
static_assert(alignof(AK33TunnelPulse) == 0x000008, "Wrong alignment on AK33TunnelPulse");
static_assert(sizeof(AK33TunnelPulse) == 0x000338, "Wrong size on AK33TunnelPulse");
static_assert(offsetof(AK33TunnelPulse, _lastPulseForwardOffset) == 0x0002A8, "Member 'AK33TunnelPulse::_lastPulseForwardOffset' has a wrong offset!");
static_assert(offsetof(AK33TunnelPulse, _lastPulseUpOffset) == 0x0002AC, "Member 'AK33TunnelPulse::_lastPulseUpOffset' has a wrong offset!");
static_assert(offsetof(AK33TunnelPulse, _sideOffsetCurveMultiplier) == 0x0002B0, "Member 'AK33TunnelPulse::_sideOffsetCurveMultiplier' has a wrong offset!");
static_assert(offsetof(AK33TunnelPulse, _firstTunnelBlockSideOffsetCurveMultiplier) == 0x0002B8, "Member 'AK33TunnelPulse::_firstTunnelBlockSideOffsetCurveMultiplier' has a wrong offset!");
static_assert(offsetof(AK33TunnelPulse, _lastTunnelBlockSideOffsetCurveMultiplier) == 0x0002C0, "Member 'AK33TunnelPulse::_lastTunnelBlockSideOffsetCurveMultiplier' has a wrong offset!");
static_assert(offsetof(AK33TunnelPulse, _sideOffsetSize) == 0x0002C8, "Member 'AK33TunnelPulse::_sideOffsetSize' has a wrong offset!");

// Class TheK33.K33AnimInstance
// 0x0010 (0x0730 - 0x0720)
class UK33AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isQuadruped;                                      // 0x0720(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInSpecialMode;                                  // 0x0721(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isTailAttacking;                                  // 0x0722(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isTailAttackCharging;                             // 0x0723(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInTunnel;                                       // 0x0724(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _useQuadrupedIK;                                   // 0x0725(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _useBipedIK;                                       // 0x0726(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _useLookAt;                                        // 0x0727(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _usePushBack;                                      // 0x0728(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingHitByTurret;                               // 0x0729(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _pushBackQuadrupedActive;                          // 0x072A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _pushBackBipedActive;                              // 0x072B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33AnimInstance">();
	}
	static class UK33AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33AnimInstance>();
	}
};
static_assert(alignof(UK33AnimInstance) == 0x000010, "Wrong alignment on UK33AnimInstance");
static_assert(sizeof(UK33AnimInstance) == 0x000730, "Wrong size on UK33AnimInstance");
static_assert(offsetof(UK33AnimInstance, _isQuadruped) == 0x000720, "Member 'UK33AnimInstance::_isQuadruped' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _isInSpecialMode) == 0x000721, "Member 'UK33AnimInstance::_isInSpecialMode' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _isTailAttacking) == 0x000722, "Member 'UK33AnimInstance::_isTailAttacking' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _isTailAttackCharging) == 0x000723, "Member 'UK33AnimInstance::_isTailAttackCharging' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _isInTunnel) == 0x000724, "Member 'UK33AnimInstance::_isInTunnel' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _useQuadrupedIK) == 0x000725, "Member 'UK33AnimInstance::_useQuadrupedIK' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _useBipedIK) == 0x000726, "Member 'UK33AnimInstance::_useBipedIK' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _useLookAt) == 0x000727, "Member 'UK33AnimInstance::_useLookAt' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _usePushBack) == 0x000728, "Member 'UK33AnimInstance::_usePushBack' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _isBeingHitByTurret) == 0x000729, "Member 'UK33AnimInstance::_isBeingHitByTurret' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _pushBackQuadrupedActive) == 0x00072A, "Member 'UK33AnimInstance::_pushBackQuadrupedActive' has a wrong offset!");
static_assert(offsetof(UK33AnimInstance, _pushBackBipedActive) == 0x00072B, "Member 'UK33AnimInstance::_pushBackBipedActive' has a wrong offset!");

// Class TheK33.K33CheatComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK33CheatComponent final : public UActorComponent
{
public:
	void DBD_K33DrawTunnelBlockConnections(float SecondsToDisplay);
	void DBD_K33ForceSpecialMode(uint8 Force);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33CheatComponent">();
	}
	static class UK33CheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33CheatComponent>();
	}
};
static_assert(alignof(UK33CheatComponent) == 0x000008, "Wrong alignment on UK33CheatComponent");
static_assert(sizeof(UK33CheatComponent) == 0x0000A8, "Wrong size on UK33CheatComponent");

// Class TheK33.K33TailAttackInteraction
// 0x00B0 (0x0970 - 0x08C0)
class UK33TailAttackInteraction final : public UChargeableInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _interactionViewPitchMax;                          // 0x08C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMin;                          // 0x08E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _cancelAttackMovementSlowdownDuration;             // 0x0910(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _cancelAttackMovementSlowdownCurve;                // 0x0938(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_940[0x30];                                     // 0x0940(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33TailAttackInteraction">();
	}
	static class UK33TailAttackInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33TailAttackInteraction>();
	}
};
static_assert(alignof(UK33TailAttackInteraction) == 0x000010, "Wrong alignment on UK33TailAttackInteraction");
static_assert(sizeof(UK33TailAttackInteraction) == 0x000970, "Wrong size on UK33TailAttackInteraction");
static_assert(offsetof(UK33TailAttackInteraction, _interactionViewPitchMax) == 0x0008C0, "Member 'UK33TailAttackInteraction::_interactionViewPitchMax' has a wrong offset!");
static_assert(offsetof(UK33TailAttackInteraction, _interactionViewPitchMin) == 0x0008E8, "Member 'UK33TailAttackInteraction::_interactionViewPitchMin' has a wrong offset!");
static_assert(offsetof(UK33TailAttackInteraction, _cancelAttackMovementSlowdownDuration) == 0x000910, "Member 'UK33TailAttackInteraction::_cancelAttackMovementSlowdownDuration' has a wrong offset!");
static_assert(offsetof(UK33TailAttackInteraction, _cancelAttackMovementSlowdownCurve) == 0x000938, "Member 'UK33TailAttackInteraction::_cancelAttackMovementSlowdownCurve' has a wrong offset!");

// Class TheK33.K33CollectTurretFromControlStationInteraction
// 0x0070 (0x0990 - 0x0920)
class UK33CollectTurretFromControlStationInteraction final : public UBasicChargeableInteraction
{
public:
	uint8                                         Pad_920[0x50];                                     // 0x0920(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            _cancelMontage;                                    // 0x0970(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33CollectTurretFromControlStationInteraction">();
	}
	static class UK33CollectTurretFromControlStationInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33CollectTurretFromControlStationInteraction>();
	}
};
static_assert(alignof(UK33CollectTurretFromControlStationInteraction) == 0x000010, "Wrong alignment on UK33CollectTurretFromControlStationInteraction");
static_assert(sizeof(UK33CollectTurretFromControlStationInteraction) == 0x000990, "Wrong size on UK33CollectTurretFromControlStationInteraction");
static_assert(offsetof(UK33CollectTurretFromControlStationInteraction, _cancelMontage) == 0x000970, "Member 'UK33CollectTurretFromControlStationInteraction::_cancelMontage' has a wrong offset!");

// Class TheK33.K33ControlStation
// 0x0230 (0x05D8 - 0x03A8)
class AK33ControlStation final : public AInteractable
{
public:
	class UDBDSkeletalMeshComponentBudgeted*      _skeletalMeshComponent_TunnelEntranceSection;      // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDSkeletalMeshComponentBudgeted*      _skeletalMeshComponent_turretSpawnerSection;       // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK33ControlStationTurretSpawnerOutlineUpdateStrategy* _outlineStrategy_TurretSpawnerSection;             // 0x03B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK33ControlStationTunnelEntranceOutlineUpdateStrategy* _outlineStrategy_TunnelEntranceSection;            // 0x03C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent_tunnelEntranceSection;           // 0x03C8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent_turretSpawnerSection;            // 0x03D0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                          _interactionCollisionZone;                         // 0x03D8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _interactor;                                       // 0x03E0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AK33TunnelBlock*                        _linkedTunnelBlock;                                // 0x03E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   _exitTunnelInteractableClass;                      // 0x03F0(0x0038)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AK33ExitTunnelInteractable*             _exitTunnelInteractable;                           // 0x0428(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMontagePlayer*                         _montagePlayer_turretSpawnerSection;               // 0x0430(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMontagePlayer*                         _montagePlayer_tunnelEntranceSection;              // 0x0438(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimationMontageSlave*                 _animationSlave_turretSpawnerSection;              // 0x0440(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimationMontageSlave*                 _animationSlave_tunnelEntranceSection;             // 0x0448(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK33Turret>              _linkedTurret;                                     // 0x0450(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EControlStationState                          _currentState;                                     // 0x0458(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _turretSocketName;                                 // 0x045C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_468[0x30];                                     // 0x0468(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _spawningDuration;                                 // 0x0498(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _turretAvailabilityCooldownDuration;               // 0x04C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E8[0x30];                                     // 0x04E8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _worldTimeAtCooldownStart;                         // 0x0518(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _malfunctionDuration;                              // 0x051C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_520[0x28];                                     // 0x0520(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _blockExitTime;                                    // 0x0548(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_570[0x60];                                     // 0x0570(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isMalfunctioning;                                 // 0x05D0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnControlStationEnteringState(EControlStationState EnteringState);
	void Cosmetic_OnControlStationExitingState(EControlStationState ExitingState);
	void Cosmetic_OnTurretInPoolCountChanged(const int32 TurretCount);
	void Cosmetic_SetTunnelCapVisibility(bool IsVisible);
	void Cosmetic_StartControlStationMalfunctionReaction();
	void Cosmetic_StopControlStationMalfunctionReaction();
	void Cosmetic_UpdateControlStationCooldown(float CooldownElapsedTimePercent);
	void OnRep_CurrentState(EControlStationState OldState);
	void OnRep_ExitTunnelInteractable();
	void OnRep_IsMalfunctioning();

	struct FVector GetKillerExitTunnelEndLocation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33ControlStation">();
	}
	static class AK33ControlStation* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK33ControlStation>();
	}
};
static_assert(alignof(AK33ControlStation) == 0x000008, "Wrong alignment on AK33ControlStation");
static_assert(sizeof(AK33ControlStation) == 0x0005D8, "Wrong size on AK33ControlStation");
static_assert(offsetof(AK33ControlStation, _skeletalMeshComponent_TunnelEntranceSection) == 0x0003A8, "Member 'AK33ControlStation::_skeletalMeshComponent_TunnelEntranceSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _skeletalMeshComponent_turretSpawnerSection) == 0x0003B0, "Member 'AK33ControlStation::_skeletalMeshComponent_turretSpawnerSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _outlineStrategy_TurretSpawnerSection) == 0x0003B8, "Member 'AK33ControlStation::_outlineStrategy_TurretSpawnerSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _outlineStrategy_TunnelEntranceSection) == 0x0003C0, "Member 'AK33ControlStation::_outlineStrategy_TunnelEntranceSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _outlineComponent_tunnelEntranceSection) == 0x0003C8, "Member 'AK33ControlStation::_outlineComponent_tunnelEntranceSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _outlineComponent_turretSpawnerSection) == 0x0003D0, "Member 'AK33ControlStation::_outlineComponent_turretSpawnerSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _interactionCollisionZone) == 0x0003D8, "Member 'AK33ControlStation::_interactionCollisionZone' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _interactor) == 0x0003E0, "Member 'AK33ControlStation::_interactor' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _linkedTunnelBlock) == 0x0003E8, "Member 'AK33ControlStation::_linkedTunnelBlock' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _exitTunnelInteractableClass) == 0x0003F0, "Member 'AK33ControlStation::_exitTunnelInteractableClass' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _exitTunnelInteractable) == 0x000428, "Member 'AK33ControlStation::_exitTunnelInteractable' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _montagePlayer_turretSpawnerSection) == 0x000430, "Member 'AK33ControlStation::_montagePlayer_turretSpawnerSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _montagePlayer_tunnelEntranceSection) == 0x000438, "Member 'AK33ControlStation::_montagePlayer_tunnelEntranceSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _animationSlave_turretSpawnerSection) == 0x000440, "Member 'AK33ControlStation::_animationSlave_turretSpawnerSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _animationSlave_tunnelEntranceSection) == 0x000448, "Member 'AK33ControlStation::_animationSlave_tunnelEntranceSection' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _linkedTurret) == 0x000450, "Member 'AK33ControlStation::_linkedTurret' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _currentState) == 0x000458, "Member 'AK33ControlStation::_currentState' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _turretSocketName) == 0x00045C, "Member 'AK33ControlStation::_turretSocketName' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _spawningDuration) == 0x000498, "Member 'AK33ControlStation::_spawningDuration' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _turretAvailabilityCooldownDuration) == 0x0004C0, "Member 'AK33ControlStation::_turretAvailabilityCooldownDuration' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _worldTimeAtCooldownStart) == 0x000518, "Member 'AK33ControlStation::_worldTimeAtCooldownStart' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _malfunctionDuration) == 0x00051C, "Member 'AK33ControlStation::_malfunctionDuration' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _blockExitTime) == 0x000548, "Member 'AK33ControlStation::_blockExitTime' has a wrong offset!");
static_assert(offsetof(AK33ControlStation, _isMalfunctioning) == 0x0005D0, "Member 'AK33ControlStation::_isMalfunctioning' has a wrong offset!");

// Class TheK33.K33ControlStationAttackableComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK33ControlStationAttackableComponent final : public UAttackableComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33ControlStationAttackableComponent">();
	}
	static class UK33ControlStationAttackableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33ControlStationAttackableComponent>();
	}
};
static_assert(alignof(UK33ControlStationAttackableComponent) == 0x000008, "Wrong alignment on UK33ControlStationAttackableComponent");
static_assert(sizeof(UK33ControlStationAttackableComponent) == 0x0000A8, "Wrong size on UK33ControlStationAttackableComponent");

// Class TheK33.K33ControlStationTunnelConnection
// 0x0028 (0x02C8 - 0x02A0)
class AK33ControlStationTunnelConnection final : public AActor
{
public:
	class UStaticMeshComponent*                   _tunnelConnectionMesh;                             // 0x02A0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x20];                                     // 0x02A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33ControlStationTunnelConnection">();
	}
	static class AK33ControlStationTunnelConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK33ControlStationTunnelConnection>();
	}
};
static_assert(alignof(AK33ControlStationTunnelConnection) == 0x000008, "Wrong alignment on AK33ControlStationTunnelConnection");
static_assert(sizeof(AK33ControlStationTunnelConnection) == 0x0002C8, "Wrong size on AK33ControlStationTunnelConnection");
static_assert(offsetof(AK33ControlStationTunnelConnection, _tunnelConnectionMesh) == 0x0002A0, "Member 'AK33ControlStationTunnelConnection::_tunnelConnectionMesh' has a wrong offset!");

// Class TheK33.K33TunnelMovementInputAccelerationConstraintStrategyComponent
// 0x0010 (0x00B8 - 0x00A8)
class UK33TunnelMovementInputAccelerationConstraintStrategyComponent final : public UBaseInputAccelerationConstraintStrategy
{
public:
	TArray<struct FVector>                        _forcedDirectionalInputs;                          // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33TunnelMovementInputAccelerationConstraintStrategyComponent">();
	}
	static class UK33TunnelMovementInputAccelerationConstraintStrategyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33TunnelMovementInputAccelerationConstraintStrategyComponent>();
	}
};
static_assert(alignof(UK33TunnelMovementInputAccelerationConstraintStrategyComponent) == 0x000008, "Wrong alignment on UK33TunnelMovementInputAccelerationConstraintStrategyComponent");
static_assert(sizeof(UK33TunnelMovementInputAccelerationConstraintStrategyComponent) == 0x0000B8, "Wrong size on UK33TunnelMovementInputAccelerationConstraintStrategyComponent");
static_assert(offsetof(UK33TunnelMovementInputAccelerationConstraintStrategyComponent, _forcedDirectionalInputs) == 0x0000A8, "Member 'UK33TunnelMovementInputAccelerationConstraintStrategyComponent::_forcedDirectionalInputs' has a wrong offset!");

// Class TheK33.K33ControlStationTunnelEntranceOutlineUpdateStrategy
// 0x0020 (0x0168 - 0x0148)
class UK33ControlStationTunnelEntranceOutlineUpdateStrategy final : public USourceBasedOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _controlStationIsFlaggedForTarget;                 // 0x0148(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _controlStationIsSelected;                         // 0x0158(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33ControlStationTunnelEntranceOutlineUpdateStrategy">();
	}
	static class UK33ControlStationTunnelEntranceOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33ControlStationTunnelEntranceOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UK33ControlStationTunnelEntranceOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UK33ControlStationTunnelEntranceOutlineUpdateStrategy");
static_assert(sizeof(UK33ControlStationTunnelEntranceOutlineUpdateStrategy) == 0x000168, "Wrong size on UK33ControlStationTunnelEntranceOutlineUpdateStrategy");
static_assert(offsetof(UK33ControlStationTunnelEntranceOutlineUpdateStrategy, _controlStationIsFlaggedForTarget) == 0x000148, "Member 'UK33ControlStationTunnelEntranceOutlineUpdateStrategy::_controlStationIsFlaggedForTarget' has a wrong offset!");
static_assert(offsetof(UK33ControlStationTunnelEntranceOutlineUpdateStrategy, _controlStationIsSelected) == 0x000158, "Member 'UK33ControlStationTunnelEntranceOutlineUpdateStrategy::_controlStationIsSelected' has a wrong offset!");

// Class TheK33.K33Turret
// 0x0100 (0x0650 - 0x0550)
class AK33Turret final : public ACollectable
{
public:
	class USceneComponent*                        _rootComponent;                                    // 0x0550(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpherePlayerOverlapComponent*          _interactableZone;                                 // 0x0558(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractor*                            _turretInteractor;                                 // 0x0560(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDropItemInteraction*                   _dropInteraction;                                  // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCollectItemInteraction*                _collectInteraction;                               // 0x0570(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x0578(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialHelper*                        _materialHelper;                                   // 0x0580(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK33TurretOutlineUpdateStrategy*        _turretOutlineUpdateStrategy;                      // 0x0588(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChargeableComponent*                   _turretRepairChargeable;                           // 0x0590(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMontagePlayer*                         _montagePlayer;                                    // 0x0598(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationMontageSlave*                 _montageFollower;                                  // 0x05A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          _turretCollision;                                  // 0x05A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          _tailAttackCollision;                              // 0x05B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK33TurretDangerPredictionComponent*    _dangerPredictionComponent;                        // 0x05B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDNavModifierComponent*               _navModifierComponent;                             // 0x05C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        _laserRoot;                                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAuthoritativePoolableActorComponent*   _poolableActorComponent;                           // 0x05D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStateController*                       _turretStateController;                            // 0x05D8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _detectionSocketName;                              // 0x05E0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5EC[0x64];                                     // 0x05EC(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_BipMotionTrackerFX(const float DistanceToKiller);
	void Cosmetic_OnKillerEnteredSpecialModeFXReaction();
	void Cosmetic_OnTurretDetectionRangeChanged(float NewRange);
	void Cosmetic_OnTurretHeatChanged(float HeatAmount);
	void Cosmetic_UpdateLaserLength(const float LaserLength);
	void Cosmetic_UpdateMotionTrackerSoundVolume(const float DistanceToKiller);
	void Cosmetic_UpdateTurretVolumeRTPC(const int32 TurretsInRangeCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33Turret">();
	}
	static class AK33Turret* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK33Turret>();
	}
};
static_assert(alignof(AK33Turret) == 0x000008, "Wrong alignment on AK33Turret");
static_assert(sizeof(AK33Turret) == 0x000650, "Wrong size on AK33Turret");
static_assert(offsetof(AK33Turret, _rootComponent) == 0x000550, "Member 'AK33Turret::_rootComponent' has a wrong offset!");
static_assert(offsetof(AK33Turret, _interactableZone) == 0x000558, "Member 'AK33Turret::_interactableZone' has a wrong offset!");
static_assert(offsetof(AK33Turret, _turretInteractor) == 0x000560, "Member 'AK33Turret::_turretInteractor' has a wrong offset!");
static_assert(offsetof(AK33Turret, _dropInteraction) == 0x000568, "Member 'AK33Turret::_dropInteraction' has a wrong offset!");
static_assert(offsetof(AK33Turret, _collectInteraction) == 0x000570, "Member 'AK33Turret::_collectInteraction' has a wrong offset!");
static_assert(offsetof(AK33Turret, _outlineComponent) == 0x000578, "Member 'AK33Turret::_outlineComponent' has a wrong offset!");
static_assert(offsetof(AK33Turret, _materialHelper) == 0x000580, "Member 'AK33Turret::_materialHelper' has a wrong offset!");
static_assert(offsetof(AK33Turret, _turretOutlineUpdateStrategy) == 0x000588, "Member 'AK33Turret::_turretOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AK33Turret, _turretRepairChargeable) == 0x000590, "Member 'AK33Turret::_turretRepairChargeable' has a wrong offset!");
static_assert(offsetof(AK33Turret, _montagePlayer) == 0x000598, "Member 'AK33Turret::_montagePlayer' has a wrong offset!");
static_assert(offsetof(AK33Turret, _montageFollower) == 0x0005A0, "Member 'AK33Turret::_montageFollower' has a wrong offset!");
static_assert(offsetof(AK33Turret, _turretCollision) == 0x0005A8, "Member 'AK33Turret::_turretCollision' has a wrong offset!");
static_assert(offsetof(AK33Turret, _tailAttackCollision) == 0x0005B0, "Member 'AK33Turret::_tailAttackCollision' has a wrong offset!");
static_assert(offsetof(AK33Turret, _dangerPredictionComponent) == 0x0005B8, "Member 'AK33Turret::_dangerPredictionComponent' has a wrong offset!");
static_assert(offsetof(AK33Turret, _navModifierComponent) == 0x0005C0, "Member 'AK33Turret::_navModifierComponent' has a wrong offset!");
static_assert(offsetof(AK33Turret, _laserRoot) == 0x0005C8, "Member 'AK33Turret::_laserRoot' has a wrong offset!");
static_assert(offsetof(AK33Turret, _poolableActorComponent) == 0x0005D0, "Member 'AK33Turret::_poolableActorComponent' has a wrong offset!");
static_assert(offsetof(AK33Turret, _turretStateController) == 0x0005D8, "Member 'AK33Turret::_turretStateController' has a wrong offset!");
static_assert(offsetof(AK33Turret, _detectionSocketName) == 0x0005E0, "Member 'AK33Turret::_detectionSocketName' has a wrong offset!");

// Class TheK33.K33ControlStationTurretSpawnerAnimInstance
// 0x0020 (0x03A0 - 0x0380)
class UK33ControlStationTurretSpawnerAnimInstance final : public UDBDBaseAnimInstance
{
public:
	bool                                          _isBoxOpening;                                     // 0x0380(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBoxOpened;                                      // 0x0381(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_382[0x2];                                      // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _boxOpeningPlayRate;                               // 0x0384(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          _spawnTurretAnimSequence;                          // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33ControlStationTurretSpawnerAnimInstance">();
	}
	static class UK33ControlStationTurretSpawnerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33ControlStationTurretSpawnerAnimInstance>();
	}
};
static_assert(alignof(UK33ControlStationTurretSpawnerAnimInstance) == 0x000010, "Wrong alignment on UK33ControlStationTurretSpawnerAnimInstance");
static_assert(sizeof(UK33ControlStationTurretSpawnerAnimInstance) == 0x0003A0, "Wrong size on UK33ControlStationTurretSpawnerAnimInstance");
static_assert(offsetof(UK33ControlStationTurretSpawnerAnimInstance, _isBoxOpening) == 0x000380, "Member 'UK33ControlStationTurretSpawnerAnimInstance::_isBoxOpening' has a wrong offset!");
static_assert(offsetof(UK33ControlStationTurretSpawnerAnimInstance, _isBoxOpened) == 0x000381, "Member 'UK33ControlStationTurretSpawnerAnimInstance::_isBoxOpened' has a wrong offset!");
static_assert(offsetof(UK33ControlStationTurretSpawnerAnimInstance, _boxOpeningPlayRate) == 0x000384, "Member 'UK33ControlStationTurretSpawnerAnimInstance::_boxOpeningPlayRate' has a wrong offset!");
static_assert(offsetof(UK33ControlStationTurretSpawnerAnimInstance, _spawnTurretAnimSequence) == 0x000390, "Member 'UK33ControlStationTurretSpawnerAnimInstance::_spawnTurretAnimSequence' has a wrong offset!");

// Class TheK33.K33ControlStationTurretSpawnerOutlineUpdateStrategy
// 0x0028 (0x0118 - 0x00F0)
class UK33ControlStationTurretSpawnerOutlineUpdateStrategy final : public UDefaultOutlineUpdateStrategy
{
public:
	struct FDBDTunableRowHandle                   _maxDistanceToRevealToSurvivor;                    // 0x00F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33ControlStationTurretSpawnerOutlineUpdateStrategy">();
	}
	static class UK33ControlStationTurretSpawnerOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33ControlStationTurretSpawnerOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UK33ControlStationTurretSpawnerOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UK33ControlStationTurretSpawnerOutlineUpdateStrategy");
static_assert(sizeof(UK33ControlStationTurretSpawnerOutlineUpdateStrategy) == 0x000118, "Wrong size on UK33ControlStationTurretSpawnerOutlineUpdateStrategy");
static_assert(offsetof(UK33ControlStationTurretSpawnerOutlineUpdateStrategy, _maxDistanceToRevealToSurvivor) == 0x0000F0, "Member 'UK33ControlStationTurretSpawnerOutlineUpdateStrategy::_maxDistanceToRevealToSurvivor' has a wrong offset!");

// Class TheK33.K33DeployTurretInteraction
// 0x00B0 (0x09D0 - 0x0920)
class UK33DeployTurretInteraction final : public UBasicChargeableInteraction
{
public:
	uint8                                         Pad_920[0x70];                                     // 0x0920(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            _cancelMontage;                                    // 0x0990(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _cancelDeployDuration;                             // 0x09B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _dropOffLocation;                                  // 0x09B8(0x0018)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33DeployTurretInteraction">();
	}
	static class UK33DeployTurretInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33DeployTurretInteraction>();
	}
};
static_assert(alignof(UK33DeployTurretInteraction) == 0x000010, "Wrong alignment on UK33DeployTurretInteraction");
static_assert(sizeof(UK33DeployTurretInteraction) == 0x0009D0, "Wrong size on UK33DeployTurretInteraction");
static_assert(offsetof(UK33DeployTurretInteraction, _cancelMontage) == 0x000990, "Member 'UK33DeployTurretInteraction::_cancelMontage' has a wrong offset!");
static_assert(offsetof(UK33DeployTurretInteraction, _cancelDeployDuration) == 0x0009B0, "Member 'UK33DeployTurretInteraction::_cancelDeployDuration' has a wrong offset!");
static_assert(offsetof(UK33DeployTurretInteraction, _dropOffLocation) == 0x0009B8, "Member 'UK33DeployTurretInteraction::_dropOffLocation' has a wrong offset!");

// Class TheK33.K33TunnelProceduralGenerationComponent
// 0x00D0 (0x0178 - 0x00A8)
class UK33TunnelProceduralGenerationComponent final : public UKillerSpecificGameStateComponent
{
public:
	struct FK33TunnelBlockSpawnData               _blocksSpawnData;                                  // 0x00A8(0x0018)(Net, RepNotify, NativeAccessSpecifierPrivate)
	TMap<EK33TunnelBlockType, TSoftClassPtr<class UClass>> _tunnelBlockAssetsReferences;                      // 0x00C0(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<EK33TunnelBlockType, class UClass*>      _tunnelBlockAssetClasses;                          // 0x0110(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class AK33TunnelBlock*>                _tunnelBlocks;                                     // 0x0160(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	float                                         _blockSize;                                        // 0x0170(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _basementHeightOffset;                             // 0x0174(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_BlockSpawnData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K33TunnelProceduralGenerationComponent">();
	}
	static class UK33TunnelProceduralGenerationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK33TunnelProceduralGenerationComponent>();
	}
};
static_assert(alignof(UK33TunnelProceduralGenerationComponent) == 0x000008, "Wrong alignment on UK33TunnelProceduralGenerationComponent");
static_assert(sizeof(UK33TunnelProceduralGenerationComponent) == 0x000178, "Wrong size on UK33TunnelProceduralGenerationComponent");
static_assert(offsetof(UK33TunnelProceduralGenerationComponent, _blocksSpawnData) == 0x0000A8, "Member 'UK33TunnelProceduralGenerationComponent::_blocksSpawnData' has a wrong offset!");
static_assert(offsetof(UK33TunnelProceduralGenerationComponent, _tunnelBlockAssetsReferences) == 0x0000C0, "Member 'UK33TunnelProceduralGenerationComponent::_tunnelBlockAssetsReferences' has a wrong offset!");
static_assert(offsetof(UK33TunnelProceduralGenerationComponent, _tunnelBlockAssetClasses) == 0x000110, "Member 'UK33TunnelProceduralGenerationComponent::_tunnelBlockAssetClasses' has a wrong offset!");
static_assert(offsetof(UK33TunnelProceduralGenerationComponent, _tunnelBlocks) == 0x000160, "Member 'UK33TunnelProceduralGenerationComponent::_tunnelBlocks' has a wrong offset!");
static_assert(offsetof(UK33TunnelProceduralGenerationComponent, _blockSize) == 0x000170, "Member 'UK33TunnelProceduralGenerationComponent::_blockSize' has a wrong offset!");
static_assert(offsetof(UK33TunnelProceduralGenerationComponent, _basementHeightOffset) == 0x000174, "Member 'UK33TunnelProceduralGenerationComponent::_basementHeightOffset' has a wrong offset!");

// Class TheK33.K33EnterTunnelInteraction
// 0x0110 (0x09D0 - 0x08C0)
class UK33EnterTunnelInteraction final : public UChargeableInteractionDefinition
{
public:
	struct FAnimationMontageDescriptor            _confirmEnterControlStationMontage;                // 0x08C0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _cancelMontage;                                    // 0x08E0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _afterTeleportationMontage;                        // 0x0900(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector                                _cameraTransitionOffset;                           // 0x0920(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _chargeInteractionTime;                            // 0x0938(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
