#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK26

#include "Basic.hpp"

#include "TheK26_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TheK26.K26AttachedCrow.Authority_OnIsWithinOtherSurvivorRangeChanged
// 0x0010 (0x0010 - 0x0000)
struct K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged final
{
public:
	class AActor*                                 SurvivorActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInRange;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged");
static_assert(sizeof(K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged) == 0x000010, "Wrong size on K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged");
static_assert(offsetof(K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged, SurvivorActor) == 0x000000, "Member 'K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged::SurvivorActor' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged, IsInRange) == 0x000008, "Member 'K26AttachedCrow_Authority_OnIsWithinOtherSurvivorRangeChanged::IsInRange' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K26AttachedCrow_Authority_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnKillerSet) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnKillerSet");
static_assert(sizeof(K26AttachedCrow_Authority_OnKillerSet) == 0x000008, "Wrong size on K26AttachedCrow_Authority_OnKillerSet");
static_assert(offsetof(K26AttachedCrow_Authority_OnKillerSet, Killer) == 0x000000, "Member 'K26AttachedCrow_Authority_OnKillerSet::Killer' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnOtherSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            before;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            After;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged");
static_assert(sizeof(K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged) == 0x000002, "Wrong size on K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged");
static_assert(offsetof(K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged, before) == 0x000000, "Member 'K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged::before' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged, After) == 0x000001, "Member 'K26AttachedCrow_Authority_OnOtherSurvivorDamageStateChanged::After' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnOtherSurvivorPerkFlagsChanged
// 0x0010 (0x0010 - 0x0000)
struct K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAdded;                                           // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged) == 0x000004, "Wrong alignment on K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged");
static_assert(sizeof(K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged) == 0x000010, "Wrong size on K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged");
static_assert(offsetof(K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged, GameplayTag) == 0x000000, "Member 'K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged::GameplayTag' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged, IsAdded) == 0x00000C, "Member 'K26AttachedCrow_Authority_OnOtherSurvivorPerkFlagsChanged::IsAdded' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnPlayerLeftGame
// 0x0040 (0x0040 - 0x0000)
struct K26AttachedCrow_Authority_OnPlayerLeftGame final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnPlayerLeftGame) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnPlayerLeftGame");
static_assert(sizeof(K26AttachedCrow_Authority_OnPlayerLeftGame) == 0x000040, "Wrong size on K26AttachedCrow_Authority_OnPlayerLeftGame");
static_assert(offsetof(K26AttachedCrow_Authority_OnPlayerLeftGame, GameEventType) == 0x000000, "Member 'K26AttachedCrow_Authority_OnPlayerLeftGame::GameEventType' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnPlayerLeftGame, GameEventData) == 0x000010, "Member 'K26AttachedCrow_Authority_OnPlayerLeftGame::GameEventData' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnSurvivorAdded
// 0x0008 (0x0008 - 0x0000)
struct K26AttachedCrow_Authority_OnSurvivorAdded final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnSurvivorAdded) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnSurvivorAdded");
static_assert(sizeof(K26AttachedCrow_Authority_OnSurvivorAdded) == 0x000008, "Wrong size on K26AttachedCrow_Authority_OnSurvivorAdded");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorAdded, Survivor) == 0x000000, "Member 'K26AttachedCrow_Authority_OnSurvivorAdded::Survivor' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnSurvivorExitLocker
// 0x0040 (0x0040 - 0x0000)
struct K26AttachedCrow_Authority_OnSurvivorExitLocker final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnSurvivorExitLocker) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnSurvivorExitLocker");
static_assert(sizeof(K26AttachedCrow_Authority_OnSurvivorExitLocker) == 0x000040, "Wrong size on K26AttachedCrow_Authority_OnSurvivorExitLocker");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorExitLocker, GameEventType) == 0x000000, "Member 'K26AttachedCrow_Authority_OnSurvivorExitLocker::GameEventType' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorExitLocker, GameEventData) == 0x000010, "Member 'K26AttachedCrow_Authority_OnSurvivorExitLocker::GameEventData' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnSurvivorStatusIndicatorSet
// 0x0010 (0x0010 - 0x0000)
struct K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK26AttachedCrow*                       AttachedCrow;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet");
static_assert(sizeof(K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet) == 0x000010, "Wrong size on K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet, Survivor) == 0x000000, "Member 'K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet::Survivor' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet, AttachedCrow) == 0x000008, "Member 'K26AttachedCrow_Authority_OnSurvivorStatusIndicatorSet::AttachedCrow' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Authority_OnSurvivorWasUnhooked
// 0x0040 (0x0040 - 0x0000)
struct K26AttachedCrow_Authority_OnSurvivorWasUnhooked final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Authority_OnSurvivorWasUnhooked) == 0x000008, "Wrong alignment on K26AttachedCrow_Authority_OnSurvivorWasUnhooked");
static_assert(sizeof(K26AttachedCrow_Authority_OnSurvivorWasUnhooked) == 0x000040, "Wrong size on K26AttachedCrow_Authority_OnSurvivorWasUnhooked");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorWasUnhooked, GameEventType) == 0x000000, "Member 'K26AttachedCrow_Authority_OnSurvivorWasUnhooked::GameEventType' has a wrong offset!");
static_assert(offsetof(K26AttachedCrow_Authority_OnSurvivorWasUnhooked, GameEventData) == 0x000010, "Member 'K26AttachedCrow_Authority_OnSurvivorWasUnhooked::GameEventData' has a wrong offset!");

// Function TheK26.K26AttachedCrow.Cosmetic_OnAttachedCrowRemoved
// 0x0001 (0x0001 - 0x0000)
struct K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved final
{
public:
	EFK26AttachedCrowRemovalReason                RemovalReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved) == 0x000001, "Wrong alignment on K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved");
static_assert(sizeof(K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved) == 0x000001, "Wrong size on K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved");
static_assert(offsetof(K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved, RemovalReason) == 0x000000, "Member 'K26AttachedCrow_Cosmetic_OnAttachedCrowRemoved::RemovalReason' has a wrong offset!");

// Function TheK26.HinderOnCrowAttachStatusEffect.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct HinderOnCrowAttachStatusEffect_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HinderOnCrowAttachStatusEffect_OnKillerSet) == 0x000008, "Wrong alignment on HinderOnCrowAttachStatusEffect_OnKillerSet");
static_assert(sizeof(HinderOnCrowAttachStatusEffect_OnKillerSet) == 0x000008, "Wrong size on HinderOnCrowAttachStatusEffect_OnKillerSet");
static_assert(offsetof(HinderOnCrowAttachStatusEffect_OnKillerSet, Killer) == 0x000000, "Member 'HinderOnCrowAttachStatusEffect_OnKillerSet::Killer' has a wrong offset!");

// Function TheK26.K26AbilitySubAnimInstance.OnHasProjectileBeenSummoned
// 0x0008 (0x0008 - 0x0000)
struct K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned final
{
public:
	int32                                         RemainingAmmo;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAmmo;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned) == 0x000004, "Wrong alignment on K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned");
static_assert(sizeof(K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned) == 0x000008, "Wrong size on K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned");
static_assert(offsetof(K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned, RemainingAmmo) == 0x000000, "Member 'K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned::RemainingAmmo' has a wrong offset!");
static_assert(offsetof(K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned, MaxAmmo) == 0x000004, "Member 'K26AbilitySubAnimInstance_OnHasProjectileBeenSummoned::MaxAmmo' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.Authority_InitializePoolComponent
// 0x0004 (0x0004 - 0x0000)
struct K26AmmoHandlerComponent_Authority_InitializePoolComponent final
{
public:
	int32                                         MaxAmmo;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_Authority_InitializePoolComponent) == 0x000004, "Wrong alignment on K26AmmoHandlerComponent_Authority_InitializePoolComponent");
static_assert(sizeof(K26AmmoHandlerComponent_Authority_InitializePoolComponent) == 0x000004, "Wrong size on K26AmmoHandlerComponent_Authority_InitializePoolComponent");
static_assert(offsetof(K26AmmoHandlerComponent_Authority_InitializePoolComponent, MaxAmmo) == 0x000000, "Member 'K26AmmoHandlerComponent_Authority_InitializePoolComponent::MaxAmmo' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.Authority_OnAmmoInit
// 0x0008 (0x0008 - 0x0000)
struct K26AmmoHandlerComponent_Authority_OnAmmoInit final
{
public:
	class AActor*                                 InitAmmo;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_Authority_OnAmmoInit) == 0x000008, "Wrong alignment on K26AmmoHandlerComponent_Authority_OnAmmoInit");
static_assert(sizeof(K26AmmoHandlerComponent_Authority_OnAmmoInit) == 0x000008, "Wrong size on K26AmmoHandlerComponent_Authority_OnAmmoInit");
static_assert(offsetof(K26AmmoHandlerComponent_Authority_OnAmmoInit, InitAmmo) == 0x000000, "Member 'K26AmmoHandlerComponent_Authority_OnAmmoInit::InitAmmo' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.CallOnMaxAmmoSet
// 0x0014 (0x0014 - 0x0000)
struct K26AmmoHandlerComponent_CallOnMaxAmmoSet final
{
public:
	TDelegate<void(int32 MaxAmmo)>                Callback;                                          // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_CallOnMaxAmmoSet) == 0x000004, "Wrong alignment on K26AmmoHandlerComponent_CallOnMaxAmmoSet");
static_assert(sizeof(K26AmmoHandlerComponent_CallOnMaxAmmoSet) == 0x000014, "Wrong size on K26AmmoHandlerComponent_CallOnMaxAmmoSet");
static_assert(offsetof(K26AmmoHandlerComponent_CallOnMaxAmmoSet, Callback) == 0x000000, "Member 'K26AmmoHandlerComponent_CallOnMaxAmmoSet::Callback' has a wrong offset!");

// DelegateFunction TheK26.K26AmmoHandlerComponent.OnMaxAmmoSetDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature final
{
public:
	int32                                         MaxAmmo;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature) == 0x000004, "Wrong alignment on K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature");
static_assert(sizeof(K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature) == 0x000004, "Wrong size on K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature");
static_assert(offsetof(K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature, MaxAmmo) == 0x000000, "Member 'K26AmmoHandlerComponent_OnMaxAmmoSetDelegate__DelegateSignature::MaxAmmo' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.Multicast_OnCurrentAmmoStateChanged
// 0x000C (0x000C - 0x0000)
struct K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged final
{
public:
	EK26AmmoState                                 NewState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentAmmo;                                       // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAmmo;                                           // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged) == 0x000004, "Wrong alignment on K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged");
static_assert(sizeof(K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged) == 0x00000C, "Wrong size on K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged");
static_assert(offsetof(K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged, NewState) == 0x000000, "Member 'K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged, CurrentAmmo) == 0x000004, "Member 'K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged::CurrentAmmo' has a wrong offset!");
static_assert(offsetof(K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged, MaxAmmo) == 0x000008, "Member 'K26AmmoHandlerComponent_Multicast_OnCurrentAmmoStateChanged::MaxAmmo' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.Multicast_StartRecharging
// 0x0001 (0x0001 - 0x0000)
struct K26AmmoHandlerComponent_Multicast_StartRecharging final
{
public:
	EK26AmmoCooldownReason                        LastCooldownReason;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_Multicast_StartRecharging) == 0x000001, "Wrong alignment on K26AmmoHandlerComponent_Multicast_StartRecharging");
static_assert(sizeof(K26AmmoHandlerComponent_Multicast_StartRecharging) == 0x000001, "Wrong size on K26AmmoHandlerComponent_Multicast_StartRecharging");
static_assert(offsetof(K26AmmoHandlerComponent_Multicast_StartRecharging, LastCooldownReason) == 0x000000, "Member 'K26AmmoHandlerComponent_Multicast_StartRecharging::LastCooldownReason' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K26AmmoHandlerComponent_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_OnKillerSet) == 0x000008, "Wrong alignment on K26AmmoHandlerComponent_OnKillerSet");
static_assert(sizeof(K26AmmoHandlerComponent_OnKillerSet) == 0x000008, "Wrong size on K26AmmoHandlerComponent_OnKillerSet");
static_assert(offsetof(K26AmmoHandlerComponent_OnKillerSet, Killer) == 0x000000, "Member 'K26AmmoHandlerComponent_OnKillerSet::Killer' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.SetDependencies
// 0x0018 (0x0018 - 0x0000)
struct K26AmmoHandlerComponent_SetDependencies final
{
public:
	class UK26PathHandlerComponent*               PathHandler;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UK26PowerStatusHandlerComponent*        StatusHandler;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuthoritativeActorPoolComponent*       AuthoritativeActorPoolComponent;                   // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_SetDependencies) == 0x000008, "Wrong alignment on K26AmmoHandlerComponent_SetDependencies");
static_assert(sizeof(K26AmmoHandlerComponent_SetDependencies) == 0x000018, "Wrong size on K26AmmoHandlerComponent_SetDependencies");
static_assert(offsetof(K26AmmoHandlerComponent_SetDependencies, PathHandler) == 0x000000, "Member 'K26AmmoHandlerComponent_SetDependencies::PathHandler' has a wrong offset!");
static_assert(offsetof(K26AmmoHandlerComponent_SetDependencies, StatusHandler) == 0x000008, "Member 'K26AmmoHandlerComponent_SetDependencies::StatusHandler' has a wrong offset!");
static_assert(offsetof(K26AmmoHandlerComponent_SetDependencies, AuthoritativeActorPoolComponent) == 0x000010, "Member 'K26AmmoHandlerComponent_SetDependencies::AuthoritativeActorPoolComponent' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.GetCurrentAmmo
// 0x0004 (0x0004 - 0x0000)
struct K26AmmoHandlerComponent_GetCurrentAmmo final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_GetCurrentAmmo) == 0x000004, "Wrong alignment on K26AmmoHandlerComponent_GetCurrentAmmo");
static_assert(sizeof(K26AmmoHandlerComponent_GetCurrentAmmo) == 0x000004, "Wrong size on K26AmmoHandlerComponent_GetCurrentAmmo");
static_assert(offsetof(K26AmmoHandlerComponent_GetCurrentAmmo, ReturnValue) == 0x000000, "Member 'K26AmmoHandlerComponent_GetCurrentAmmo::ReturnValue' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.GetCurrentAmmoState
// 0x0001 (0x0001 - 0x0000)
struct K26AmmoHandlerComponent_GetCurrentAmmoState final
{
public:
	EK26AmmoState                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_GetCurrentAmmoState) == 0x000001, "Wrong alignment on K26AmmoHandlerComponent_GetCurrentAmmoState");
static_assert(sizeof(K26AmmoHandlerComponent_GetCurrentAmmoState) == 0x000001, "Wrong size on K26AmmoHandlerComponent_GetCurrentAmmoState");
static_assert(offsetof(K26AmmoHandlerComponent_GetCurrentAmmoState, ReturnValue) == 0x000000, "Member 'K26AmmoHandlerComponent_GetCurrentAmmoState::ReturnValue' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.GetCurrentCooldownReason
// 0x0001 (0x0001 - 0x0000)
struct K26AmmoHandlerComponent_GetCurrentCooldownReason final
{
public:
	EK26AmmoCooldownReason                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_GetCurrentCooldownReason) == 0x000001, "Wrong alignment on K26AmmoHandlerComponent_GetCurrentCooldownReason");
static_assert(sizeof(K26AmmoHandlerComponent_GetCurrentCooldownReason) == 0x000001, "Wrong size on K26AmmoHandlerComponent_GetCurrentCooldownReason");
static_assert(offsetof(K26AmmoHandlerComponent_GetCurrentCooldownReason, ReturnValue) == 0x000000, "Member 'K26AmmoHandlerComponent_GetCurrentCooldownReason::ReturnValue' has a wrong offset!");

// Function TheK26.K26AmmoHandlerComponent.GetMaxAmmo
// 0x0004 (0x0004 - 0x0000)
struct K26AmmoHandlerComponent_GetMaxAmmo final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26AmmoHandlerComponent_GetMaxAmmo) == 0x000004, "Wrong alignment on K26AmmoHandlerComponent_GetMaxAmmo");
static_assert(sizeof(K26AmmoHandlerComponent_GetMaxAmmo) == 0x000004, "Wrong size on K26AmmoHandlerComponent_GetMaxAmmo");
static_assert(offsetof(K26AmmoHandlerComponent_GetMaxAmmo, ReturnValue) == 0x000000, "Member 'K26AmmoHandlerComponent_GetMaxAmmo::ReturnValue' has a wrong offset!");

// Function TheK26.K26CooldownInteractionDefinition.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K26CooldownInteractionDefinition_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CooldownInteractionDefinition_OnKillerSet) == 0x000008, "Wrong alignment on K26CooldownInteractionDefinition_OnKillerSet");
static_assert(sizeof(K26CooldownInteractionDefinition_OnKillerSet) == 0x000008, "Wrong size on K26CooldownInteractionDefinition_OnKillerSet");
static_assert(offsetof(K26CooldownInteractionDefinition_OnKillerSet, Killer) == 0x000000, "Member 'K26CooldownInteractionDefinition_OnKillerSet::Killer' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Authority_OnCollisionOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K26CrowProjectile_Authority_OnCollisionOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Authority_OnCollisionOverlapBegin) == 0x000008, "Wrong alignment on K26CrowProjectile_Authority_OnCollisionOverlapBegin");
static_assert(sizeof(K26CrowProjectile_Authority_OnCollisionOverlapBegin) == 0x000110, "Wrong size on K26CrowProjectile_Authority_OnCollisionOverlapBegin");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapBegin, OverlappedComp) == 0x000000, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapBegin::OverlappedComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapBegin, OtherActor) == 0x000008, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapBegin, OtherComp) == 0x000010, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapBegin, FromSweep) == 0x00001C, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapBegin::FromSweep' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapBegin, SweepResult) == 0x000020, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Authority_OnCollisionOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct K26CrowProjectile_Authority_OnCollisionOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K26CrowProjectile_Authority_OnCollisionOverlapEnd) == 0x000008, "Wrong alignment on K26CrowProjectile_Authority_OnCollisionOverlapEnd");
static_assert(sizeof(K26CrowProjectile_Authority_OnCollisionOverlapEnd) == 0x000020, "Wrong size on K26CrowProjectile_Authority_OnCollisionOverlapEnd");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapEnd, OverlappedComp) == 0x000000, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapEnd::OverlappedComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapEnd, OtherActor) == 0x000008, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapEnd, OtherComp) == 0x000010, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnCollisionOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'K26CrowProjectile_Authority_OnCollisionOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Authority_OnDestroyAttempt
// 0x0010 (0x0010 - 0x0000)
struct K26CrowProjectile_Authority_OnDestroyAttempt final
{
public:
	TArray<class AActor*>                         InstigatorsForCompletion;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Authority_OnDestroyAttempt) == 0x000008, "Wrong alignment on K26CrowProjectile_Authority_OnDestroyAttempt");
static_assert(sizeof(K26CrowProjectile_Authority_OnDestroyAttempt) == 0x000010, "Wrong size on K26CrowProjectile_Authority_OnDestroyAttempt");
static_assert(offsetof(K26CrowProjectile_Authority_OnDestroyAttempt, InstigatorsForCompletion) == 0x000000, "Member 'K26CrowProjectile_Authority_OnDestroyAttempt::InstigatorsForCompletion' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Authority_OnScoutingOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K26CrowProjectile_Authority_OnScoutingOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Authority_OnScoutingOverlapBegin) == 0x000008, "Wrong alignment on K26CrowProjectile_Authority_OnScoutingOverlapBegin");
static_assert(sizeof(K26CrowProjectile_Authority_OnScoutingOverlapBegin) == 0x000110, "Wrong size on K26CrowProjectile_Authority_OnScoutingOverlapBegin");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapBegin, OverlappedComp) == 0x000000, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapBegin::OverlappedComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapBegin, OtherActor) == 0x000008, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapBegin, OtherComp) == 0x000010, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapBegin, FromSweep) == 0x00001C, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapBegin::FromSweep' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapBegin, SweepResult) == 0x000020, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Authority_OnScoutingOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct K26CrowProjectile_Authority_OnScoutingOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K26CrowProjectile_Authority_OnScoutingOverlapEnd) == 0x000008, "Wrong alignment on K26CrowProjectile_Authority_OnScoutingOverlapEnd");
static_assert(sizeof(K26CrowProjectile_Authority_OnScoutingOverlapEnd) == 0x000020, "Wrong size on K26CrowProjectile_Authority_OnScoutingOverlapEnd");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapEnd, OverlappedComp) == 0x000000, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapEnd::OverlappedComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapEnd, OtherActor) == 0x000008, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapEnd, OtherComp) == 0x000010, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Authority_OnScoutingOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'K26CrowProjectile_Authority_OnScoutingOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Client_LocalKillerStartSummonTimer
// 0x0004 (0x0004 - 0x0000)
struct K26CrowProjectile_Client_LocalKillerStartSummonTimer final
{
public:
	float                                         KillerLocalSummonTime;                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Client_LocalKillerStartSummonTimer) == 0x000004, "Wrong alignment on K26CrowProjectile_Client_LocalKillerStartSummonTimer");
static_assert(sizeof(K26CrowProjectile_Client_LocalKillerStartSummonTimer) == 0x000004, "Wrong size on K26CrowProjectile_Client_LocalKillerStartSummonTimer");
static_assert(offsetof(K26CrowProjectile_Client_LocalKillerStartSummonTimer, KillerLocalSummonTime) == 0x000000, "Member 'K26CrowProjectile_Client_LocalKillerStartSummonTimer::KillerLocalSummonTime' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Cosmetic_OnEnteredNearAudioRangeOfSurvivor
// 0x0008 (0x0008 - 0x0000)
struct K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor) == 0x000008, "Wrong alignment on K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor");
static_assert(sizeof(K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor) == 0x000008, "Wrong size on K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor");
static_assert(offsetof(K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor, Survivor) == 0x000000, "Member 'K26CrowProjectile_Cosmetic_OnEnteredNearAudioRangeOfSurvivor::Survivor' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Local_OnCollisionOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K26CrowProjectile_Local_OnCollisionOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Local_OnCollisionOverlapBegin) == 0x000008, "Wrong alignment on K26CrowProjectile_Local_OnCollisionOverlapBegin");
static_assert(sizeof(K26CrowProjectile_Local_OnCollisionOverlapBegin) == 0x000110, "Wrong size on K26CrowProjectile_Local_OnCollisionOverlapBegin");
static_assert(offsetof(K26CrowProjectile_Local_OnCollisionOverlapBegin, OverlappedComp) == 0x000000, "Member 'K26CrowProjectile_Local_OnCollisionOverlapBegin::OverlappedComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Local_OnCollisionOverlapBegin, OtherActor) == 0x000008, "Member 'K26CrowProjectile_Local_OnCollisionOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Local_OnCollisionOverlapBegin, OtherComp) == 0x000010, "Member 'K26CrowProjectile_Local_OnCollisionOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Local_OnCollisionOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'K26CrowProjectile_Local_OnCollisionOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Local_OnCollisionOverlapBegin, FromSweep) == 0x00001C, "Member 'K26CrowProjectile_Local_OnCollisionOverlapBegin::FromSweep' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Local_OnCollisionOverlapBegin, SweepResult) == 0x000020, "Member 'K26CrowProjectile_Local_OnCollisionOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Multicast_SetStartingPosition
// 0x0030 (0x0030 - 0x0000)
struct K26CrowProjectile_Multicast_SetStartingPosition final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Angle;                                             // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Multicast_SetStartingPosition) == 0x000008, "Wrong alignment on K26CrowProjectile_Multicast_SetStartingPosition");
static_assert(sizeof(K26CrowProjectile_Multicast_SetStartingPosition) == 0x000030, "Wrong size on K26CrowProjectile_Multicast_SetStartingPosition");
static_assert(offsetof(K26CrowProjectile_Multicast_SetStartingPosition, Position) == 0x000000, "Member 'K26CrowProjectile_Multicast_SetStartingPosition::Position' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Multicast_SetStartingPosition, Angle) == 0x000018, "Member 'K26CrowProjectile_Multicast_SetStartingPosition::Angle' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Multicast_SetState
// 0x0008 (0x0008 - 0x0000)
struct K26CrowProjectile_Multicast_SetState final
{
public:
	EK26ProjectileState                           NewState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PooledPathIndex;                                   // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Multicast_SetState) == 0x000004, "Wrong alignment on K26CrowProjectile_Multicast_SetState");
static_assert(sizeof(K26CrowProjectile_Multicast_SetState) == 0x000008, "Wrong size on K26CrowProjectile_Multicast_SetState");
static_assert(offsetof(K26CrowProjectile_Multicast_SetState, NewState) == 0x000000, "Member 'K26CrowProjectile_Multicast_SetState::NewState' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Multicast_SetState, PooledPathIndex) == 0x000004, "Member 'K26CrowProjectile_Multicast_SetState::PooledPathIndex' has a wrong offset!");

// Function TheK26.K26CrowProjectile.OnIsWithinSurvivorRangeChanged
// 0x0010 (0x0010 - 0x0000)
struct K26CrowProjectile_OnIsWithinSurvivorRangeChanged final
{
public:
	class AActor*                                 SurvivorActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInRange;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K26CrowProjectile_OnIsWithinSurvivorRangeChanged) == 0x000008, "Wrong alignment on K26CrowProjectile_OnIsWithinSurvivorRangeChanged");
static_assert(sizeof(K26CrowProjectile_OnIsWithinSurvivorRangeChanged) == 0x000010, "Wrong size on K26CrowProjectile_OnIsWithinSurvivorRangeChanged");
static_assert(offsetof(K26CrowProjectile_OnIsWithinSurvivorRangeChanged, SurvivorActor) == 0x000000, "Member 'K26CrowProjectile_OnIsWithinSurvivorRangeChanged::SurvivorActor' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_OnIsWithinSurvivorRangeChanged, IsInRange) == 0x000008, "Member 'K26CrowProjectile_OnIsWithinSurvivorRangeChanged::IsInRange' has a wrong offset!");

// Function TheK26.K26CrowProjectile.OnSurvivorAdded
// 0x0008 (0x0008 - 0x0000)
struct K26CrowProjectile_OnSurvivorAdded final
{
public:
	class ACamperPlayer*                          SurvivorAdded;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_OnSurvivorAdded) == 0x000008, "Wrong alignment on K26CrowProjectile_OnSurvivorAdded");
static_assert(sizeof(K26CrowProjectile_OnSurvivorAdded) == 0x000008, "Wrong size on K26CrowProjectile_OnSurvivorAdded");
static_assert(offsetof(K26CrowProjectile_OnSurvivorAdded, SurvivorAdded) == 0x000000, "Member 'K26CrowProjectile_OnSurvivorAdded::SurvivorAdded' has a wrong offset!");

// Function TheK26.K26CrowProjectile.Server_OnSurvivorHit
// 0x0010 (0x0010 - 0x0000)
struct K26CrowProjectile_Server_OnSurvivorHit final
{
public:
	EK26ProjectileState                           StateOnHit;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          HitSurvivor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_Server_OnSurvivorHit) == 0x000008, "Wrong alignment on K26CrowProjectile_Server_OnSurvivorHit");
static_assert(sizeof(K26CrowProjectile_Server_OnSurvivorHit) == 0x000010, "Wrong size on K26CrowProjectile_Server_OnSurvivorHit");
static_assert(offsetof(K26CrowProjectile_Server_OnSurvivorHit, StateOnHit) == 0x000000, "Member 'K26CrowProjectile_Server_OnSurvivorHit::StateOnHit' has a wrong offset!");
static_assert(offsetof(K26CrowProjectile_Server_OnSurvivorHit, HitSurvivor) == 0x000008, "Member 'K26CrowProjectile_Server_OnSurvivorHit::HitSurvivor' has a wrong offset!");

// Function TheK26.K26CrowProjectile.GetDistanceFromFirePosition
// 0x0004 (0x0004 - 0x0000)
struct K26CrowProjectile_GetDistanceFromFirePosition final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_GetDistanceFromFirePosition) == 0x000004, "Wrong alignment on K26CrowProjectile_GetDistanceFromFirePosition");
static_assert(sizeof(K26CrowProjectile_GetDistanceFromFirePosition) == 0x000004, "Wrong size on K26CrowProjectile_GetDistanceFromFirePosition");
static_assert(offsetof(K26CrowProjectile_GetDistanceFromFirePosition, ReturnValue) == 0x000000, "Member 'K26CrowProjectile_GetDistanceFromFirePosition::ReturnValue' has a wrong offset!");

// Function TheK26.K26CrowProjectile.IsHitboxBeingShown
// 0x0001 (0x0001 - 0x0000)
struct K26CrowProjectile_IsHitboxBeingShown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26CrowProjectile_IsHitboxBeingShown) == 0x000001, "Wrong alignment on K26CrowProjectile_IsHitboxBeingShown");
static_assert(sizeof(K26CrowProjectile_IsHitboxBeingShown) == 0x000001, "Wrong size on K26CrowProjectile_IsHitboxBeingShown");
static_assert(offsetof(K26CrowProjectile_IsHitboxBeingShown, ReturnValue) == 0x000000, "Member 'K26CrowProjectile_IsHitboxBeingShown::ReturnValue' has a wrong offset!");

// Function TheK26.K26DismissCrowChargeableInteractionDefinition.OnDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged final
{
public:
	ECamperDamageState                            OldDamageState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            CurrentDamageState;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged) == 0x000001, "Wrong alignment on K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged");
static_assert(sizeof(K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged) == 0x000002, "Wrong size on K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged");
static_assert(offsetof(K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged, OldDamageState) == 0x000000, "Member 'K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged::OldDamageState' has a wrong offset!");
static_assert(offsetof(K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged, CurrentDamageState) == 0x000001, "Member 'K26DismissCrowChargeableInteractionDefinition_OnDamageStateChanged::CurrentDamageState' has a wrong offset!");

// Function TheK26.K26DismissCrowChargeableInteractionDefinition.OnKillerSet
// 0x0010 (0x0010 - 0x0000)
struct K26DismissCrowChargeableInteractionDefinition_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChargeableComponent*                   ChargeableComponent;                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26DismissCrowChargeableInteractionDefinition_OnKillerSet) == 0x000008, "Wrong alignment on K26DismissCrowChargeableInteractionDefinition_OnKillerSet");
static_assert(sizeof(K26DismissCrowChargeableInteractionDefinition_OnKillerSet) == 0x000010, "Wrong size on K26DismissCrowChargeableInteractionDefinition_OnKillerSet");
static_assert(offsetof(K26DismissCrowChargeableInteractionDefinition_OnKillerSet, Killer) == 0x000000, "Member 'K26DismissCrowChargeableInteractionDefinition_OnKillerSet::Killer' has a wrong offset!");
static_assert(offsetof(K26DismissCrowChargeableInteractionDefinition_OnKillerSet, ChargeableComponent) == 0x000008, "Member 'K26DismissCrowChargeableInteractionDefinition_OnKillerSet::ChargeableComponent' has a wrong offset!");

// Function TheK26.K26FireCrowProjectileInteractionDefinition.Multicast_OnProjectileFired
// 0x0008 (0x0008 - 0x0000)
struct K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired final
{
public:
	const class ASlasherPlayer*                   Killer;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired) == 0x000008, "Wrong alignment on K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired");
static_assert(sizeof(K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired) == 0x000008, "Wrong size on K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired");
static_assert(offsetof(K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired, Killer) == 0x000000, "Member 'K26FireCrowProjectileInteractionDefinition_Multicast_OnProjectileFired::Killer' has a wrong offset!");

// Function TheK26.K26FireCrowProjectileInteractionDefinition.Server_RequestFireOnAmmo
// 0x0008 (0x0008 - 0x0000)
struct K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo) == 0x000008, "Wrong alignment on K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo");
static_assert(sizeof(K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo) == 0x000008, "Wrong size on K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo");
static_assert(offsetof(K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo, Killer) == 0x000000, "Member 'K26FireCrowProjectileInteractionDefinition_Server_RequestFireOnAmmo::Killer' has a wrong offset!");

// Function TheK26.K26FireCrowProjectileInteractionDefinition.SetDependencies
// 0x0018 (0x0018 - 0x0000)
struct K26FireCrowProjectileInteractionDefinition_SetDependencies final
{
public:
	class UK26AmmoHandlerComponent*               AmmoHandler;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UK26PathHandlerComponent*               PathHandler;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UK26CooldownInteractionDefinition*      CooldownInteraction;                               // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K26FireCrowProjectileInteractionDefinition_SetDependencies) == 0x000008, "Wrong alignment on K26FireCrowProjectileInteractionDefinition_SetDependencies");
static_assert(sizeof(K26FireCrowProjectileInteractionDefinition_SetDependencies) == 0x000018, "Wrong size on K26FireCrowProjectileInteractionDefinition_SetDependencies");
static_assert(offsetof(K26FireCrowProjectileInteractionDefinition_SetDependencies, AmmoHandler) == 0x000000, "Member 'K26FireCrowProjectileInteractionDefinition_SetDependencies::AmmoHandler' has a wrong offset!");
static_assert(offsetof(K26FireCrowProjectileInteractionDefinition_SetDependencies, PathHandler) == 0x000008, "Member 'K26FireCrowProjectileInteractionDefinition_SetDependencies::PathHandler' has a wrong offset!");
