#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK37

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "Competence_classes.hpp"
#include "DBDGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "TheK37_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayUtilities_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DBDCosmetic_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDAttack_classes.hpp"


namespace SDK
{

// Class TheK37.K37WolfAbility
// 0x0328 (0x04D0 - 0x01A8)
class UK37WolfAbility final : public UKillerAbilityComponent
{
public:
	TSubclassOf<class UK37WolfBiteAttack>         _wolfBiteAttackClass;                              // 0x01A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK37ChargeChainedPounceAttackInteraction> _chainedPounceAttackInteractionClass;              // 0x01B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK37AdjustChainedPounceAttackInteraction> _adjustPounceAttackInteractionClass;               // 0x01B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK37SurvivorScentTrailParticleSpawner> _survivorScentTrailParticleSpawnerClass;           // 0x01C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UK37WolfBiteAttackData*>         _chainedWolfBitesData;                             // 0x01C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UK37ChargeChainedPounceAttackInteraction* _chainedPounceAttackInteraction;                   // 0x01D8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37AdjustChainedPounceAttackInteraction* _adjustPounceAttackInteraction;                    // 0x01E0(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37WolfBiteAttack*                     _wolfBiteAttack;                                   // 0x01E8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class ACamperPlayer>>   _trackedSurvivors;                                 // 0x01F0(0x0010)(Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0x2B0];                                    // 0x0200(0x02B0)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _completedConsecutiveChainedBitesCount;            // 0x04B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B4[0x1C];                                     // 0x04B4(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttackSubstateChanged(EAttackSubstate Substate);
	void OnRep_WolfBiteAttack();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37WolfAbility">();
	}
	static class UK37WolfAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37WolfAbility>();
	}
};
static_assert(alignof(UK37WolfAbility) == 0x000008, "Wrong alignment on UK37WolfAbility");
static_assert(sizeof(UK37WolfAbility) == 0x0004D0, "Wrong size on UK37WolfAbility");
static_assert(offsetof(UK37WolfAbility, _wolfBiteAttackClass) == 0x0001A8, "Member 'UK37WolfAbility::_wolfBiteAttackClass' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _chainedPounceAttackInteractionClass) == 0x0001B0, "Member 'UK37WolfAbility::_chainedPounceAttackInteractionClass' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _adjustPounceAttackInteractionClass) == 0x0001B8, "Member 'UK37WolfAbility::_adjustPounceAttackInteractionClass' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _survivorScentTrailParticleSpawnerClass) == 0x0001C0, "Member 'UK37WolfAbility::_survivorScentTrailParticleSpawnerClass' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _chainedWolfBitesData) == 0x0001C8, "Member 'UK37WolfAbility::_chainedWolfBitesData' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _chainedPounceAttackInteraction) == 0x0001D8, "Member 'UK37WolfAbility::_chainedPounceAttackInteraction' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _adjustPounceAttackInteraction) == 0x0001E0, "Member 'UK37WolfAbility::_adjustPounceAttackInteraction' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _wolfBiteAttack) == 0x0001E8, "Member 'UK37WolfAbility::_wolfBiteAttack' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _trackedSurvivors) == 0x0001F0, "Member 'UK37WolfAbility::_trackedSurvivors' has a wrong offset!");
static_assert(offsetof(UK37WolfAbility, _completedConsecutiveChainedBitesCount) == 0x0004B0, "Member 'UK37WolfAbility::_completedConsecutiveChainedBitesCount' has a wrong offset!");

// Class TheK37.FlamePillarExitGateMinigame
// 0x0028 (0x02C8 - 0x02A0)
class AFlamePillarExitGateMinigame final : public AActor
{
public:
	uint8                                         Pad_2A0[0x10];                                     // 0x02A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AEscapeDoor*                            _attachedEscapeDoor;                               // 0x02B0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37VampireAbility*                     _cachedOwningAbility;                              // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37FlamePillarData*                    _flamePillarData;                                  // 0x02C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_SpawnFlamePillarAtLocation(const struct FVector& Location);
	void Authority_StartMinigame();

	class UBoxComponent* GetExitArea() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlamePillarExitGateMinigame">();
	}
	static class AFlamePillarExitGateMinigame* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlamePillarExitGateMinigame>();
	}
};
static_assert(alignof(AFlamePillarExitGateMinigame) == 0x000008, "Wrong alignment on AFlamePillarExitGateMinigame");
static_assert(sizeof(AFlamePillarExitGateMinigame) == 0x0002C8, "Wrong size on AFlamePillarExitGateMinigame");
static_assert(offsetof(AFlamePillarExitGateMinigame, _attachedEscapeDoor) == 0x0002B0, "Member 'AFlamePillarExitGateMinigame::_attachedEscapeDoor' has a wrong offset!");
static_assert(offsetof(AFlamePillarExitGateMinigame, _cachedOwningAbility) == 0x0002B8, "Member 'AFlamePillarExitGateMinigame::_cachedOwningAbility' has a wrong offset!");
static_assert(offsetof(AFlamePillarExitGateMinigame, _flamePillarData) == 0x0002C0, "Member 'AFlamePillarExitGateMinigame::_flamePillarData' has a wrong offset!");

// Class TheK37.K37BatAbilityData
// 0x0040 (0x00A0 - 0x0060)
class UK37BatAbilityData final : public UKillerAbilityData
{
public:
	float                                         _brakingDeceleration;                              // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _friction;                                         // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minimumVelocityToOverrideDecelerationValues;      // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minRangeForTeleport;                              // 0x006C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxRangeForTeleport;                              // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _teleportSpeed;                                    // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onTeleportInteractionStartAkEvent;                // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onTeleportInteractionCancelAkEvent;               // 0x0080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onTeleportNewHighlightedTargetAkEvent;            // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onTeleportStartAkEvent;                           // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onTeleportStopAkEvent;                            // 0x0098(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37BatAbilityData">();
	}
	static class UK37BatAbilityData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37BatAbilityData>();
	}
};
static_assert(alignof(UK37BatAbilityData) == 0x000008, "Wrong alignment on UK37BatAbilityData");
static_assert(sizeof(UK37BatAbilityData) == 0x0000A0, "Wrong size on UK37BatAbilityData");
static_assert(offsetof(UK37BatAbilityData, _brakingDeceleration) == 0x000060, "Member 'UK37BatAbilityData::_brakingDeceleration' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _friction) == 0x000064, "Member 'UK37BatAbilityData::_friction' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _minimumVelocityToOverrideDecelerationValues) == 0x000068, "Member 'UK37BatAbilityData::_minimumVelocityToOverrideDecelerationValues' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _minRangeForTeleport) == 0x00006C, "Member 'UK37BatAbilityData::_minRangeForTeleport' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _maxRangeForTeleport) == 0x000070, "Member 'UK37BatAbilityData::_maxRangeForTeleport' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _teleportSpeed) == 0x000074, "Member 'UK37BatAbilityData::_teleportSpeed' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _onTeleportInteractionStartAkEvent) == 0x000078, "Member 'UK37BatAbilityData::_onTeleportInteractionStartAkEvent' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _onTeleportInteractionCancelAkEvent) == 0x000080, "Member 'UK37BatAbilityData::_onTeleportInteractionCancelAkEvent' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _onTeleportNewHighlightedTargetAkEvent) == 0x000088, "Member 'UK37BatAbilityData::_onTeleportNewHighlightedTargetAkEvent' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _onTeleportStartAkEvent) == 0x000090, "Member 'UK37BatAbilityData::_onTeleportStartAkEvent' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityData, _onTeleportStopAkEvent) == 0x000098, "Member 'UK37BatAbilityData::_onTeleportStopAkEvent' has a wrong offset!");

// Class TheK37.K37WolfAbilityData
// 0x0060 (0x00C0 - 0x0060)
class UK37WolfAbilityData final : public UKillerAbilityData
{
public:
	int32                                         _totalAmountOfChainedPounces;                      // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _chargeChainedPounceDuration;                      // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _chainedPounceAdjustmentDuration;                  // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _chainedPounceAdjustmentDurationMaxSpeedCurve;     // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentTrailParticleLifetimeDuration;               // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentTrailOutlineRevealDistance;                  // 0x007C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentTrailParticleCooldownReductionPercent;       // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentTrailParticleCollectionHasteEffectDuration;  // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentTrailParticleCollectionHasteEffectPercentIncrease; // 0x0088(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UK37OnScentTrailParticleCollectedTimedStatusEffect> _scentTrailParticleCollectionHasteStatusEffectClass; // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentTrailParticleAngle;                          // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scentParticleSpawnGenerationRate;                 // 0x009C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _maxNumSpawnableScentTrailParticlesAsWolf;         // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _maxNumSpawnableScentTrailParticlesAsNonWolf;      // 0x00A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _loudNoiseKillerInstinctDuration;                  // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UK37WolfFormKillerInstinctStatusEffect> _wolfKillerInstinctStatusEffectClass;              // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onScentCollectedAkEvent;                          // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37WolfAbilityData">();
	}
	static class UK37WolfAbilityData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37WolfAbilityData>();
	}
};
static_assert(alignof(UK37WolfAbilityData) == 0x000008, "Wrong alignment on UK37WolfAbilityData");
static_assert(sizeof(UK37WolfAbilityData) == 0x0000C0, "Wrong size on UK37WolfAbilityData");
static_assert(offsetof(UK37WolfAbilityData, _totalAmountOfChainedPounces) == 0x000060, "Member 'UK37WolfAbilityData::_totalAmountOfChainedPounces' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _chargeChainedPounceDuration) == 0x000064, "Member 'UK37WolfAbilityData::_chargeChainedPounceDuration' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _chainedPounceAdjustmentDuration) == 0x000068, "Member 'UK37WolfAbilityData::_chainedPounceAdjustmentDuration' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _chainedPounceAdjustmentDurationMaxSpeedCurve) == 0x000070, "Member 'UK37WolfAbilityData::_chainedPounceAdjustmentDurationMaxSpeedCurve' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailParticleLifetimeDuration) == 0x000078, "Member 'UK37WolfAbilityData::_scentTrailParticleLifetimeDuration' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailOutlineRevealDistance) == 0x00007C, "Member 'UK37WolfAbilityData::_scentTrailOutlineRevealDistance' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailParticleCooldownReductionPercent) == 0x000080, "Member 'UK37WolfAbilityData::_scentTrailParticleCooldownReductionPercent' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailParticleCollectionHasteEffectDuration) == 0x000084, "Member 'UK37WolfAbilityData::_scentTrailParticleCollectionHasteEffectDuration' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailParticleCollectionHasteEffectPercentIncrease) == 0x000088, "Member 'UK37WolfAbilityData::_scentTrailParticleCollectionHasteEffectPercentIncrease' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailParticleCollectionHasteStatusEffectClass) == 0x000090, "Member 'UK37WolfAbilityData::_scentTrailParticleCollectionHasteStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentTrailParticleAngle) == 0x000098, "Member 'UK37WolfAbilityData::_scentTrailParticleAngle' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _scentParticleSpawnGenerationRate) == 0x00009C, "Member 'UK37WolfAbilityData::_scentParticleSpawnGenerationRate' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _maxNumSpawnableScentTrailParticlesAsWolf) == 0x0000A0, "Member 'UK37WolfAbilityData::_maxNumSpawnableScentTrailParticlesAsWolf' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _maxNumSpawnableScentTrailParticlesAsNonWolf) == 0x0000A4, "Member 'UK37WolfAbilityData::_maxNumSpawnableScentTrailParticlesAsNonWolf' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _loudNoiseKillerInstinctDuration) == 0x0000A8, "Member 'UK37WolfAbilityData::_loudNoiseKillerInstinctDuration' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _wolfKillerInstinctStatusEffectClass) == 0x0000B0, "Member 'UK37WolfAbilityData::_wolfKillerInstinctStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK37WolfAbilityData, _onScentCollectedAkEvent) == 0x0000B8, "Member 'UK37WolfAbilityData::_onScentCollectedAkEvent' has a wrong offset!");

// Class TheK37.IsPlayerOpeningAlreadyOpenedChest
// 0x0008 (0x00E8 - 0x00E0)
class UIsPlayerOpeningAlreadyOpenedChest final : public UEventDrivenModifierCondition
{
public:
	bool                                          _isInteractionWithChestThatHasBeenOpened;          // 0x00E0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_IsInteractionWithChestThatHasBeenOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsPlayerOpeningAlreadyOpenedChest">();
	}
	static class UIsPlayerOpeningAlreadyOpenedChest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsPlayerOpeningAlreadyOpenedChest>();
	}
};
static_assert(alignof(UIsPlayerOpeningAlreadyOpenedChest) == 0x000008, "Wrong alignment on UIsPlayerOpeningAlreadyOpenedChest");
static_assert(sizeof(UIsPlayerOpeningAlreadyOpenedChest) == 0x0000E8, "Wrong size on UIsPlayerOpeningAlreadyOpenedChest");
static_assert(offsetof(UIsPlayerOpeningAlreadyOpenedChest, _isInteractionWithChestThatHasBeenOpened) == 0x0000E0, "Member 'UIsPlayerOpeningAlreadyOpenedChest::_isInteractionWithChestThatHasBeenOpened' has a wrong offset!");

// Class TheK37.K37ActivateOnTrackedSurvivorsStrategy
// 0x0008 (0x0038 - 0x0030)
class UK37ActivateOnTrackedSurvivorsStrategy final : public UActivateOnEventBaseActivationStrategy
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37ActivateOnTrackedSurvivorsStrategy">();
	}
	static class UK37ActivateOnTrackedSurvivorsStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37ActivateOnTrackedSurvivorsStrategy>();
	}
};
static_assert(alignof(UK37ActivateOnTrackedSurvivorsStrategy) == 0x000008, "Wrong alignment on UK37ActivateOnTrackedSurvivorsStrategy");
static_assert(sizeof(UK37ActivateOnTrackedSurvivorsStrategy) == 0x000038, "Wrong size on UK37ActivateOnTrackedSurvivorsStrategy");

// Class TheK37.K37AdjustChainedPounceAttackInteraction
// 0x0030 (0x07B0 - 0x0780)
class UK37AdjustChainedPounceAttackInteraction final : public UInteractionDefinition
{
public:
	uint8                                         Pad_778[0x38];                                     // 0x0778(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37AdjustChainedPounceAttackInteraction">();
	}
	static class UK37AdjustChainedPounceAttackInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37AdjustChainedPounceAttackInteraction>();
	}
};
static_assert(alignof(UK37AdjustChainedPounceAttackInteraction) == 0x000010, "Wrong alignment on UK37AdjustChainedPounceAttackInteraction");
static_assert(sizeof(UK37AdjustChainedPounceAttackInteraction) == 0x0007B0, "Wrong size on UK37AdjustChainedPounceAttackInteraction");

// Class TheK37.K37AnimInstance
// 0x0020 (0x0740 - 0x0720)
class UK37AnimInstance final : public UKillerAnimInstance
{
public:
	struct FVector                                _meshScale;                                        // 0x0720(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInVampireForm;                                  // 0x0738(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInBatForm;                                      // 0x0739(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInWolfForm;                                     // 0x073A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _enableWolfIk;                                     // 0x073B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37AnimInstance">();
	}
	static class UK37AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37AnimInstance>();
	}
};
static_assert(alignof(UK37AnimInstance) == 0x000010, "Wrong alignment on UK37AnimInstance");
static_assert(sizeof(UK37AnimInstance) == 0x000740, "Wrong size on UK37AnimInstance");
static_assert(offsetof(UK37AnimInstance, _meshScale) == 0x000720, "Member 'UK37AnimInstance::_meshScale' has a wrong offset!");
static_assert(offsetof(UK37AnimInstance, _isInVampireForm) == 0x000738, "Member 'UK37AnimInstance::_isInVampireForm' has a wrong offset!");
static_assert(offsetof(UK37AnimInstance, _isInBatForm) == 0x000739, "Member 'UK37AnimInstance::_isInBatForm' has a wrong offset!");
static_assert(offsetof(UK37AnimInstance, _isInWolfForm) == 0x00073A, "Member 'UK37AnimInstance::_isInWolfForm' has a wrong offset!");
static_assert(offsetof(UK37AnimInstance, _enableWolfIk) == 0x00073B, "Member 'UK37AnimInstance::_enableWolfIk' has a wrong offset!");

// Class TheK37.K37AttackPickerComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK37AttackPickerComponent final : public USlasherAttackPickerComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37AttackPickerComponent">();
	}
	static class UK37AttackPickerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37AttackPickerComponent>();
	}
};
static_assert(alignof(UK37AttackPickerComponent) == 0x000008, "Wrong alignment on UK37AttackPickerComponent");
static_assert(sizeof(UK37AttackPickerComponent) == 0x0000A8, "Wrong size on UK37AttackPickerComponent");

// Class TheK37.K37BatAbility
// 0x01A0 (0x0348 - 0x01A8)
class UK37BatAbility final : public UKillerAbilityComponent
{
public:
	uint8                                         Pad_1A8[0x48];                                     // 0x01A8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UK37TeleportInteraction>    _teleportInteractionClass;                         // 0x01F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37TeleportInteraction*                _teleportInteraction;                              // 0x01F8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UIgnorePlayersCollisionsComponent*      _ignorePlayersCollisionsComponent;                 // 0x0200(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UIgnoreWindowsCollisionsComponent> _ignoreWindowsCollisionsComponentClass;            // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UIgnoreWindowsCollisionsComponent*      _ignoreWindowsCollisionsComponent;                 // 0x0210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UIgnorePalletsCollisionsComponent> _ignorePalletsCollisionsComponentClass;            // 0x0218(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UIgnorePalletsCollisionsComponent*      _ignorePalletsCollisionsComponent;                 // 0x0220(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UTargetingComponent>        _teleportTargetingComponentClass;                  // 0x0228(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetingComponent*                    _teleportTargetingComponent;                       // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK37TeleportPalletTarget>   _teleportPalletTargetClass;                        // 0x0238(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK37TeleportWindowTarget>   _teleportWindowTargetClass;                        // 0x0240(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTargetableComponent*>           _teleportTargets;                                  // 0x0248(0x0010)(ExportObject, Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK37BatAbilityFlyVelocityCalculationStrategy> _flyVelocityCalculationStrategyClass;              // 0x0258(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37BatAbilityFlyVelocityCalculationStrategy* _flyVelocityCalculationStrategy;                   // 0x0260(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _killerCapsuleHalfHeightInBatForm;                 // 0x0268(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _killerCapsuleRadiusInBatForm;                     // 0x0270(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_274[0xD4];                                     // 0x0274(0x00D4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnTeleportFinished(class AActor* TargetActor);
	void Cosmetic_OnTeleportProgressChanged(const float ProgressPercentage, class AActor* TargetActor);
	void Cosmetic_OnTeleportStarted(class AActor* TargetActor);
	void OnLevelReadyToPlay();
	void OnRep_TeleportTargets();

	float GetMaxRangeForTeleport() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37BatAbility">();
	}
	static class UK37BatAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37BatAbility>();
	}
};
static_assert(alignof(UK37BatAbility) == 0x000008, "Wrong alignment on UK37BatAbility");
static_assert(sizeof(UK37BatAbility) == 0x000348, "Wrong size on UK37BatAbility");
static_assert(offsetof(UK37BatAbility, _teleportInteractionClass) == 0x0001F0, "Member 'UK37BatAbility::_teleportInteractionClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _teleportInteraction) == 0x0001F8, "Member 'UK37BatAbility::_teleportInteraction' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _ignorePlayersCollisionsComponent) == 0x000200, "Member 'UK37BatAbility::_ignorePlayersCollisionsComponent' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _ignoreWindowsCollisionsComponentClass) == 0x000208, "Member 'UK37BatAbility::_ignoreWindowsCollisionsComponentClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _ignoreWindowsCollisionsComponent) == 0x000210, "Member 'UK37BatAbility::_ignoreWindowsCollisionsComponent' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _ignorePalletsCollisionsComponentClass) == 0x000218, "Member 'UK37BatAbility::_ignorePalletsCollisionsComponentClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _ignorePalletsCollisionsComponent) == 0x000220, "Member 'UK37BatAbility::_ignorePalletsCollisionsComponent' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _teleportTargetingComponentClass) == 0x000228, "Member 'UK37BatAbility::_teleportTargetingComponentClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _teleportTargetingComponent) == 0x000230, "Member 'UK37BatAbility::_teleportTargetingComponent' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _teleportPalletTargetClass) == 0x000238, "Member 'UK37BatAbility::_teleportPalletTargetClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _teleportWindowTargetClass) == 0x000240, "Member 'UK37BatAbility::_teleportWindowTargetClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _teleportTargets) == 0x000248, "Member 'UK37BatAbility::_teleportTargets' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _flyVelocityCalculationStrategyClass) == 0x000258, "Member 'UK37BatAbility::_flyVelocityCalculationStrategyClass' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _flyVelocityCalculationStrategy) == 0x000260, "Member 'UK37BatAbility::_flyVelocityCalculationStrategy' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _killerCapsuleHalfHeightInBatForm) == 0x000268, "Member 'UK37BatAbility::_killerCapsuleHalfHeightInBatForm' has a wrong offset!");
static_assert(offsetof(UK37BatAbility, _killerCapsuleRadiusInBatForm) == 0x000270, "Member 'UK37BatAbility::_killerCapsuleRadiusInBatForm' has a wrong offset!");

// Class TheK37.K37BatAbilityFlyVelocityCalculationStrategy
// 0x0030 (0x00D8 - 0x00A8)
class UK37BatAbilityFlyVelocityCalculationStrategy final : public UBaseCharacterVelocityCalculationStrategy
{
public:
	float                                         _brakingDeceleration;                              // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _friction;                                         // 0x00AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _minimumVelocityToOverrideDecelerationValues;      // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _allowedInteractionsToApply;                       // 0x00B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37BatAbilityFlyVelocityCalculationStrategy">();
	}
	static class UK37BatAbilityFlyVelocityCalculationStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37BatAbilityFlyVelocityCalculationStrategy>();
	}
};
static_assert(alignof(UK37BatAbilityFlyVelocityCalculationStrategy) == 0x000008, "Wrong alignment on UK37BatAbilityFlyVelocityCalculationStrategy");
static_assert(sizeof(UK37BatAbilityFlyVelocityCalculationStrategy) == 0x0000D8, "Wrong size on UK37BatAbilityFlyVelocityCalculationStrategy");
static_assert(offsetof(UK37BatAbilityFlyVelocityCalculationStrategy, _brakingDeceleration) == 0x0000A8, "Member 'UK37BatAbilityFlyVelocityCalculationStrategy::_brakingDeceleration' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityFlyVelocityCalculationStrategy, _friction) == 0x0000AC, "Member 'UK37BatAbilityFlyVelocityCalculationStrategy::_friction' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityFlyVelocityCalculationStrategy, _minimumVelocityToOverrideDecelerationValues) == 0x0000B0, "Member 'UK37BatAbilityFlyVelocityCalculationStrategy::_minimumVelocityToOverrideDecelerationValues' has a wrong offset!");
static_assert(offsetof(UK37BatAbilityFlyVelocityCalculationStrategy, _allowedInteractionsToApply) == 0x0000B8, "Member 'UK37BatAbilityFlyVelocityCalculationStrategy::_allowedInteractionsToApply' has a wrong offset!");

// Class TheK37.K37PowerWidgetPresentationComponent
// 0x0008 (0x00C8 - 0x00C0)
class UK37PowerWidgetPresentationComponent : public UPowerWidgetPresentationComponent
{
public:
	bool                                          _showAsTertiaryCooldownIconWhenNotApplicableAndOnCooldown; // 0x00C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37PowerWidgetPresentationComponent">();
	}
	static class UK37PowerWidgetPresentationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37PowerWidgetPresentationComponent>();
	}
};
static_assert(alignof(UK37PowerWidgetPresentationComponent) == 0x000008, "Wrong alignment on UK37PowerWidgetPresentationComponent");
static_assert(sizeof(UK37PowerWidgetPresentationComponent) == 0x0000C8, "Wrong size on UK37PowerWidgetPresentationComponent");
static_assert(offsetof(UK37PowerWidgetPresentationComponent, _showAsTertiaryCooldownIconWhenNotApplicableAndOnCooldown) == 0x0000C0, "Member 'UK37PowerWidgetPresentationComponent::_showAsTertiaryCooldownIconWhenNotApplicableAndOnCooldown' has a wrong offset!");

// Class TheK37.K37BatAbilityMainPowerWidgetComponent
// 0x0000 (0x00C8 - 0x00C8)
class UK37BatAbilityMainPowerWidgetComponent final : public UK37PowerWidgetPresentationComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37BatAbilityMainPowerWidgetComponent">();
	}
	static class UK37BatAbilityMainPowerWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37BatAbilityMainPowerWidgetComponent>();
	}
};
static_assert(alignof(UK37BatAbilityMainPowerWidgetComponent) == 0x000008, "Wrong alignment on UK37BatAbilityMainPowerWidgetComponent");
static_assert(sizeof(UK37BatAbilityMainPowerWidgetComponent) == 0x0000C8, "Wrong size on UK37BatAbilityMainPowerWidgetComponent");

// Class TheK37.K37BatAbilitySecondaryPowerWidgetComponent
// 0x0000 (0x00C8 - 0x00C8)
class UK37BatAbilitySecondaryPowerWidgetComponent final : public UK37PowerWidgetPresentationComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37BatAbilitySecondaryPowerWidgetComponent">();
	}
	static class UK37BatAbilitySecondaryPowerWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37BatAbilitySecondaryPowerWidgetComponent>();
	}
};
static_assert(alignof(UK37BatAbilitySecondaryPowerWidgetComponent) == 0x000008, "Wrong alignment on UK37BatAbilitySecondaryPowerWidgetComponent");
static_assert(sizeof(UK37BatAbilitySecondaryPowerWidgetComponent) == 0x0000C8, "Wrong size on UK37BatAbilitySecondaryPowerWidgetComponent");

// Class TheK37.K37BatAbilitySubAnimInstance
// 0x0010 (0x0600 - 0x05F0)
class UK37BatAbilitySubAnimInstance final : public UBaseKillerAnimInstance
{
public:
	bool                                          _isBatTeleporting;                                 // 0x05F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F1[0xF];                                      // 0x05F1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37BatAbilitySubAnimInstance">();
	}
	static class UK37BatAbilitySubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37BatAbilitySubAnimInstance>();
	}
};
static_assert(alignof(UK37BatAbilitySubAnimInstance) == 0x000010, "Wrong alignment on UK37BatAbilitySubAnimInstance");
static_assert(sizeof(UK37BatAbilitySubAnimInstance) == 0x000600, "Wrong size on UK37BatAbilitySubAnimInstance");
static_assert(offsetof(UK37BatAbilitySubAnimInstance, _isBatTeleporting) == 0x0005F0, "Member 'UK37BatAbilitySubAnimInstance::_isBatTeleporting' has a wrong offset!");

// Class TheK37.K37CastleSpawnerGameStateComponent
// 0x0080 (0x0128 - 0x00A8)
class UK37CastleSpawnerGameStateComponent final : public UKillerSpecificGameStateComponent
{
public:
	TSoftClassPtr<class UClass>                   _castleClass;                                      // 0x00A8(0x0038)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                FallbackSpawnLocation;                             // 0x00E0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               FallbackSpawnRotation;                             // 0x00F8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         FallbackSpawnScale;                                // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 _spawnedCastle;                                    // 0x0118(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             _perMapCastlePositions;                            // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37CastleSpawnerGameStateComponent">();
	}
	static class UK37CastleSpawnerGameStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37CastleSpawnerGameStateComponent>();
	}
};
static_assert(alignof(UK37CastleSpawnerGameStateComponent) == 0x000008, "Wrong alignment on UK37CastleSpawnerGameStateComponent");
static_assert(sizeof(UK37CastleSpawnerGameStateComponent) == 0x000128, "Wrong size on UK37CastleSpawnerGameStateComponent");
static_assert(offsetof(UK37CastleSpawnerGameStateComponent, _castleClass) == 0x0000A8, "Member 'UK37CastleSpawnerGameStateComponent::_castleClass' has a wrong offset!");
static_assert(offsetof(UK37CastleSpawnerGameStateComponent, FallbackSpawnLocation) == 0x0000E0, "Member 'UK37CastleSpawnerGameStateComponent::FallbackSpawnLocation' has a wrong offset!");
static_assert(offsetof(UK37CastleSpawnerGameStateComponent, FallbackSpawnRotation) == 0x0000F8, "Member 'UK37CastleSpawnerGameStateComponent::FallbackSpawnRotation' has a wrong offset!");
static_assert(offsetof(UK37CastleSpawnerGameStateComponent, FallbackSpawnScale) == 0x000110, "Member 'UK37CastleSpawnerGameStateComponent::FallbackSpawnScale' has a wrong offset!");
static_assert(offsetof(UK37CastleSpawnerGameStateComponent, _spawnedCastle) == 0x000118, "Member 'UK37CastleSpawnerGameStateComponent::_spawnedCastle' has a wrong offset!");
static_assert(offsetof(UK37CastleSpawnerGameStateComponent, _perMapCastlePositions) == 0x000120, "Member 'UK37CastleSpawnerGameStateComponent::_perMapCastlePositions' has a wrong offset!");

// Class TheK37.K37ChargeChainedPounceAttackInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UK37ChargeChainedPounceAttackInteraction final : public UChargeableInteractionDefinition
{
public:
	class UChargeableComponent*                   _replicatedChargeableComponent;                    // 0x08C0(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ReplicatedChargeableComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37ChargeChainedPounceAttackInteraction">();
	}
	static class UK37ChargeChainedPounceAttackInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37ChargeChainedPounceAttackInteraction>();
	}
};
static_assert(alignof(UK37ChargeChainedPounceAttackInteraction) == 0x000010, "Wrong alignment on UK37ChargeChainedPounceAttackInteraction");
static_assert(sizeof(UK37ChargeChainedPounceAttackInteraction) == 0x0008D0, "Wrong size on UK37ChargeChainedPounceAttackInteraction");
static_assert(offsetof(UK37ChargeChainedPounceAttackInteraction, _replicatedChargeableComponent) == 0x0008C0, "Member 'UK37ChargeChainedPounceAttackInteraction::_replicatedChargeableComponent' has a wrong offset!");

// Class TheK37.K37CheatComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK37CheatComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37CheatComponent">();
	}
	static class UK37CheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37CheatComponent>();
	}
};
static_assert(alignof(UK37CheatComponent) == 0x000008, "Wrong alignment on UK37CheatComponent");
static_assert(sizeof(UK37CheatComponent) == 0x0000A8, "Wrong size on UK37CheatComponent");

// Class TheK37.K37FlamePillar
// 0x0198 (0x0438 - 0x02A0)
class AK37FlamePillar final : public AActor
{
public:
	class UAkComponent*                           _audioComponent;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EK37FlamePillarState                          _currentState;                                     // 0x02A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      _eruptionCapsuleHitbox;                            // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK37FlamePillarData*                    _flamePillarData;                                  // 0x02B8(0x0008)(Edit, Net, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UK37VampireAbility>      _owningVampireAbility;                             // 0x02C0(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x120];                                    // 0x02C8(0x0120)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthoritativePoolableActorComponent*   _authoritativePoolableActorComponent;              // 0x03E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      _canSurvivorBeAffectedQuery;                       // 0x03F0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void Authority_Despawn();
	void Authority_OnOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Authority_SetCurrentState(EK37FlamePillarState State);
	void Authority_StartErupting();
	void Authority_StartSpawning(const struct FTransform& SpawnTransform, class UK37FlamePillarData* FlamePillarData);
	void Authority_StartVanishing();
	void Cosmetic_OnDespawned();
	void Cosmetic_OnFlamePillarHit(class ACamperPlayer* Survivor);
	void Cosmetic_OnStartErupting();
	void Cosmetic_OnStartSpawning();
	void Cosmetic_OnStartVanishing();
	float GetDurationForFlamePillarState(EK37FlamePillarState State);
	void Multicast_HitSurvivor(class ACamperPlayer* Survivor);
	void OnRep_CurrentState();

	float GetPillarHeight() const;
	float GetPillarRadius() const;
	struct FHitResult GetPillarSpawnHitResult() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FlamePillar">();
	}
	static class AK37FlamePillar* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK37FlamePillar>();
	}
};
static_assert(alignof(AK37FlamePillar) == 0x000008, "Wrong alignment on AK37FlamePillar");
static_assert(sizeof(AK37FlamePillar) == 0x000438, "Wrong size on AK37FlamePillar");
static_assert(offsetof(AK37FlamePillar, _audioComponent) == 0x0002A0, "Member 'AK37FlamePillar::_audioComponent' has a wrong offset!");
static_assert(offsetof(AK37FlamePillar, _currentState) == 0x0002A8, "Member 'AK37FlamePillar::_currentState' has a wrong offset!");
static_assert(offsetof(AK37FlamePillar, _eruptionCapsuleHitbox) == 0x0002B0, "Member 'AK37FlamePillar::_eruptionCapsuleHitbox' has a wrong offset!");
static_assert(offsetof(AK37FlamePillar, _flamePillarData) == 0x0002B8, "Member 'AK37FlamePillar::_flamePillarData' has a wrong offset!");
static_assert(offsetof(AK37FlamePillar, _owningVampireAbility) == 0x0002C0, "Member 'AK37FlamePillar::_owningVampireAbility' has a wrong offset!");
static_assert(offsetof(AK37FlamePillar, _authoritativePoolableActorComponent) == 0x0003E8, "Member 'AK37FlamePillar::_authoritativePoolableActorComponent' has a wrong offset!");
static_assert(offsetof(AK37FlamePillar, _canSurvivorBeAffectedQuery) == 0x0003F0, "Member 'AK37FlamePillar::_canSurvivorBeAffectedQuery' has a wrong offset!");

// Class TheK37.K37FlamePillarAttackCancelInteraction
// 0x0000 (0x0780 - 0x0780)
class UK37FlamePillarAttackCancelInteraction final : public UInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FlamePillarAttackCancelInteraction">();
	}
	static class UK37FlamePillarAttackCancelInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37FlamePillarAttackCancelInteraction>();
	}
};
static_assert(alignof(UK37FlamePillarAttackCancelInteraction) == 0x000010, "Wrong alignment on UK37FlamePillarAttackCancelInteraction");
static_assert(sizeof(UK37FlamePillarAttackCancelInteraction) == 0x000780, "Wrong size on UK37FlamePillarAttackCancelInteraction");

// Class TheK37.K37FlamePillarAttackCastInteraction
// 0x0000 (0x0780 - 0x0780)
class UK37FlamePillarAttackCastInteraction final : public UInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FlamePillarAttackCastInteraction">();
	}
	static class UK37FlamePillarAttackCastInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37FlamePillarAttackCastInteraction>();
	}
};
static_assert(alignof(UK37FlamePillarAttackCastInteraction) == 0x000010, "Wrong alignment on UK37FlamePillarAttackCastInteraction");
static_assert(sizeof(UK37FlamePillarAttackCastInteraction) == 0x000780, "Wrong size on UK37FlamePillarAttackCastInteraction");

// Class TheK37.K37FlamePillarAttackInteraction
// 0x0000 (0x08C0 - 0x08C0)
class UK37FlamePillarAttackInteraction final : public UChargeableInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FlamePillarAttackInteraction">();
	}
	static class UK37FlamePillarAttackInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37FlamePillarAttackInteraction>();
	}
};
static_assert(alignof(UK37FlamePillarAttackInteraction) == 0x000010, "Wrong alignment on UK37FlamePillarAttackInteraction");
static_assert(sizeof(UK37FlamePillarAttackInteraction) == 0x0008C0, "Wrong size on UK37FlamePillarAttackInteraction");

// Class TheK37.K37FlamePillarData
// 0x0030 (0x0068 - 0x0038)
class UK37FlamePillarData final : public UDataAsset
{
public:
	TArray<struct FK37FlamePillarStateData>       FlamePillarStateData;                              // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _radius;                                           // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _height;                                           // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _verticalOffset;                                   // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          _onSpawnAkEvent;                                   // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkAudioEvent*                          _onStartEruptingAkEvent;                           // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FlamePillarData">();
	}
	static class UK37FlamePillarData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37FlamePillarData>();
	}
};
static_assert(alignof(UK37FlamePillarData) == 0x000008, "Wrong alignment on UK37FlamePillarData");
static_assert(sizeof(UK37FlamePillarData) == 0x000068, "Wrong size on UK37FlamePillarData");
static_assert(offsetof(UK37FlamePillarData, FlamePillarStateData) == 0x000038, "Member 'UK37FlamePillarData::FlamePillarStateData' has a wrong offset!");
static_assert(offsetof(UK37FlamePillarData, _radius) == 0x000048, "Member 'UK37FlamePillarData::_radius' has a wrong offset!");
static_assert(offsetof(UK37FlamePillarData, _height) == 0x00004C, "Member 'UK37FlamePillarData::_height' has a wrong offset!");
static_assert(offsetof(UK37FlamePillarData, _verticalOffset) == 0x000050, "Member 'UK37FlamePillarData::_verticalOffset' has a wrong offset!");
static_assert(offsetof(UK37FlamePillarData, _onSpawnAkEvent) == 0x000058, "Member 'UK37FlamePillarData::_onSpawnAkEvent' has a wrong offset!");
static_assert(offsetof(UK37FlamePillarData, _onStartEruptingAkEvent) == 0x000060, "Member 'UK37FlamePillarData::_onStartEruptingAkEvent' has a wrong offset!");

// Class TheK37.K37Form
// 0x0000 (0x00C8 - 0x00C8)
class UK37Form final : public UKillerForm
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37Form">();
	}
	static class UK37Form* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37Form>();
	}
};
static_assert(alignof(UK37Form) == 0x000008, "Wrong alignment on UK37Form");
static_assert(sizeof(UK37Form) == 0x0000C8, "Wrong size on UK37Form");

// Class TheK37.K37FormSwitchingAbility
// 0x0018 (0x02D0 - 0x02B8)
class UK37FormSwitchingAbility final : public UKillerFormSwitchingAbility
{
public:
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _forceToVampireFormTransitionDuration;             // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FormSwitchingAbility">();
	}
	static class UK37FormSwitchingAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37FormSwitchingAbility>();
	}
};
static_assert(alignof(UK37FormSwitchingAbility) == 0x000008, "Wrong alignment on UK37FormSwitchingAbility");
static_assert(sizeof(UK37FormSwitchingAbility) == 0x0002D0, "Wrong size on UK37FormSwitchingAbility");
static_assert(offsetof(UK37FormSwitchingAbility, _forceToVampireFormTransitionDuration) == 0x0002C8, "Member 'UK37FormSwitchingAbility::_forceToVampireFormTransitionDuration' has a wrong offset!");

// Class TheK37.K37FormSwitchingAbilityMainWidgetComponent
// 0x0000 (0x00C8 - 0x00C8)
class UK37FormSwitchingAbilityMainWidgetComponent final : public UK37PowerWidgetPresentationComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37FormSwitchingAbilityMainWidgetComponent">();
	}
	static class UK37FormSwitchingAbilityMainWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37FormSwitchingAbilityMainWidgetComponent>();
	}
};
static_assert(alignof(UK37FormSwitchingAbilityMainWidgetComponent) == 0x000008, "Wrong alignment on UK37FormSwitchingAbilityMainWidgetComponent");
static_assert(sizeof(UK37FormSwitchingAbilityMainWidgetComponent) == 0x0000C8, "Wrong size on UK37FormSwitchingAbilityMainWidgetComponent");

// Class TheK37.K37WolfBiteAttackOpenSubstate
// 0x0000 (0x0130 - 0x0130)
class UK37WolfBiteAttackOpenSubstate final : public UPounceAttackOpenSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K37WolfBiteAttackOpenSubstate">();
	}
	static class UK37WolfBiteAttackOpenSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK37WolfBiteAttackOpenSubstate>();
	}
};
static_assert(alignof(UK37WolfBiteAttackOpenSubstate) == 0x000008, "Wrong alignment on UK37WolfBiteAttackOpenSubstate");
