#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK36

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayUtilities_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDGameplay_classes.hpp"
#include "DBDInteraction_classes.hpp"
#include "TheK36_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StatSystem_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DBDCosmetic_classes.hpp"


namespace SDK
{

// Class TheK36.K36PowerAddon16
// 0x0060 (0x0348 - 0x02E8)
class UK36PowerAddon16 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _mangledStatusEffectClass;                         // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _hemorrhageStatusEffectClass;                      // 0x02F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _mangledEffectLifetime;                            // 0x02F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _hemorrhageEffectLifetime;                         // 0x0320(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36PowerAddon16">();
	}
	static class UK36PowerAddon16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36PowerAddon16>();
	}
};
static_assert(alignof(UK36PowerAddon16) == 0x000008, "Wrong alignment on UK36PowerAddon16");
static_assert(sizeof(UK36PowerAddon16) == 0x000348, "Wrong size on UK36PowerAddon16");
static_assert(offsetof(UK36PowerAddon16, _mangledStatusEffectClass) == 0x0002E8, "Member 'UK36PowerAddon16::_mangledStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK36PowerAddon16, _hemorrhageStatusEffectClass) == 0x0002F0, "Member 'UK36PowerAddon16::_hemorrhageStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK36PowerAddon16, _mangledEffectLifetime) == 0x0002F8, "Member 'UK36PowerAddon16::_mangledEffectLifetime' has a wrong offset!");
static_assert(offsetof(UK36PowerAddon16, _hemorrhageEffectLifetime) == 0x000320, "Member 'UK36PowerAddon16::_hemorrhageEffectLifetime' has a wrong offset!");

// Class TheK36.AISkill_FindCollectable_K36TreasureChest
// 0x0128 (0x04B8 - 0x0390)
class UAISkill_FindCollectable_K36TreasureChest final : public UAISkill_FindCollectable_Searchable
{
public:
	struct FAITunableParameter                    AverageItemCountDifferenceWeight;                  // 0x0390(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HighMagicItemCountWeightPenalty;                   // 0x03F0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         HighMagicItemCountThreshold;                       // 0x0450(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITunableParameter                    OpenedWeightBonus;                                 // 0x0458(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_K36TreasureChest">();
	}
	static class UAISkill_FindCollectable_K36TreasureChest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_K36TreasureChest>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_K36TreasureChest) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_K36TreasureChest");
static_assert(sizeof(UAISkill_FindCollectable_K36TreasureChest) == 0x0004B8, "Wrong size on UAISkill_FindCollectable_K36TreasureChest");
static_assert(offsetof(UAISkill_FindCollectable_K36TreasureChest, AverageItemCountDifferenceWeight) == 0x000390, "Member 'UAISkill_FindCollectable_K36TreasureChest::AverageItemCountDifferenceWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_K36TreasureChest, HighMagicItemCountWeightPenalty) == 0x0003F0, "Member 'UAISkill_FindCollectable_K36TreasureChest::HighMagicItemCountWeightPenalty' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_K36TreasureChest, HighMagicItemCountThreshold) == 0x000450, "Member 'UAISkill_FindCollectable_K36TreasureChest::HighMagicItemCountThreshold' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_K36TreasureChest, OpenedWeightBonus) == 0x000458, "Member 'UAISkill_FindCollectable_K36TreasureChest::OpenedWeightBonus' has a wrong offset!");

// Class TheK36.K36PowerAddon17
// 0x0058 (0x0340 - 0x02E8)
class UK36PowerAddon17 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _undetectableStatusEffectClass;                    // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _undetectableEffectLifetime;                       // 0x02F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   _spellCooldownStateTags;                           // 0x0318(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _authority_undetectableStatusEffect;               // 0x0328(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36PowerAddon17">();
	}
	static class UK36PowerAddon17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36PowerAddon17>();
	}
};
static_assert(alignof(UK36PowerAddon17) == 0x000008, "Wrong alignment on UK36PowerAddon17");
static_assert(sizeof(UK36PowerAddon17) == 0x000340, "Wrong size on UK36PowerAddon17");
static_assert(offsetof(UK36PowerAddon17, _undetectableStatusEffectClass) == 0x0002E8, "Member 'UK36PowerAddon17::_undetectableStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK36PowerAddon17, _undetectableEffectLifetime) == 0x0002F0, "Member 'UK36PowerAddon17::_undetectableEffectLifetime' has a wrong offset!");
static_assert(offsetof(UK36PowerAddon17, _spellCooldownStateTags) == 0x000318, "Member 'UK36PowerAddon17::_spellCooldownStateTags' has a wrong offset!");
static_assert(offsetof(UK36PowerAddon17, _authority_undetectableStatusEffect) == 0x000328, "Member 'UK36PowerAddon17::_authority_undetectableStatusEffect' has a wrong offset!");

// Class TheK36.AISkill_FindInteractable_K36ArtifactInvisibleLocker
// 0x0308 (0x0610 - 0x0308)
class UAISkill_FindInteractable_K36ArtifactInvisibleLocker final : public UAISkill_FindInteractable
{
public:
	float                                         TriggerInvisibilityTime;                           // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITunableParameter                    AverageHookStageDifferenceWeight;                  // 0x0310(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxValidLockerDistance;                            // 0x0370(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinimumRequiredGoalWeight;                         // 0x03D0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    LastSurvivorWeight;                                // 0x0430(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxClosestSurvivorDistance;                        // 0x0490(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    ClosestSurvivorInjuredWeightPenalty;               // 0x04F0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    ClosestSurvivorMaxHookWeightPenalty;               // 0x0550(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    ClosestSurvivorDistanceMaxWeightPenalty;           // 0x05B0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_K36ArtifactInvisibleLocker">();
	}
	static class UAISkill_FindInteractable_K36ArtifactInvisibleLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_K36ArtifactInvisibleLocker>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_K36ArtifactInvisibleLocker");
static_assert(sizeof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker) == 0x000610, "Wrong size on UAISkill_FindInteractable_K36ArtifactInvisibleLocker");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, TriggerInvisibilityTime) == 0x000308, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::TriggerInvisibilityTime' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, AverageHookStageDifferenceWeight) == 0x000310, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::AverageHookStageDifferenceWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, MaxValidLockerDistance) == 0x000370, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::MaxValidLockerDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, MinimumRequiredGoalWeight) == 0x0003D0, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::MinimumRequiredGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, LastSurvivorWeight) == 0x000430, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::LastSurvivorWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, MaxClosestSurvivorDistance) == 0x000490, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::MaxClosestSurvivorDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, ClosestSurvivorInjuredWeightPenalty) == 0x0004F0, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::ClosestSurvivorInjuredWeightPenalty' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, ClosestSurvivorMaxHookWeightPenalty) == 0x000550, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::ClosestSurvivorMaxHookWeightPenalty' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleLocker, ClosestSurvivorDistanceMaxWeightPenalty) == 0x0005B0, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleLocker::ClosestSurvivorDistanceMaxWeightPenalty' has a wrong offset!");

// Class TheK36.K36PowerAddon18
// 0x0028 (0x0338 - 0x0310)
class UK36PowerAddon18 final : public UImposeStatusEffectOnEventAddon
{
public:
	struct FDBDTunableRowHandle                   _guaranteedMimicAmount;                            // 0x0310(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36PowerAddon18">();
	}
	static class UK36PowerAddon18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36PowerAddon18>();
	}
};
static_assert(alignof(UK36PowerAddon18) == 0x000008, "Wrong alignment on UK36PowerAddon18");
static_assert(sizeof(UK36PowerAddon18) == 0x000338, "Wrong size on UK36PowerAddon18");
static_assert(offsetof(UK36PowerAddon18, _guaranteedMimicAmount) == 0x000310, "Member 'UK36PowerAddon18::_guaranteedMimicAmount' has a wrong offset!");

// Class TheK36.AISkill_FindInteractable_K36ArtifactInvisibleUnhook
// 0x0428 (0x0730 - 0x0308)
class UAISkill_FindInteractable_K36ArtifactInvisibleUnhook final : public UAISkill_FindInteractable
{
public:
	float                                         MaxLockerToHookDistance;                           // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinLockerToHookDistance;                           // 0x030C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLockerToPathDistance;                           // 0x0310(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KillerAverageDistanceLerpSpeed;                    // 0x0314(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnhookInteractionID;                               // 0x0318(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HookedAllyWeightAtMinDistance;                     // 0x0328(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HookedAllyMaxDistance;                             // 0x0388(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    AllyDangerStateGoalWeight;                         // 0x03E8(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxHookTimeGoalWeight;                             // 0x0448(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HumanAllyHookedGoalWeight;                         // 0x04A8(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    IdealKillerAverageDistanceFromHook;                // 0x0508(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxKillerAverageProximityWeight;                   // 0x0568(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    BotDangerStateGoalWeight;                          // 0x05C8(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    IncapacitatedAlliesGoalWeight;                     // 0x0628(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<TWeakObjectPtr<class ACamperPlayer>, float> _hookedSurvivorsDistances;                         // 0x0688(0x0050)(NativeAccessSpecifierPrivate)
	class UInteractor*                            _currentHookGoalInteractor;                        // 0x06D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6E0[0x50];                                     // 0x06E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_K36ArtifactInvisibleUnhook">();
	}
	static class UAISkill_FindInteractable_K36ArtifactInvisibleUnhook* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_K36ArtifactInvisibleUnhook>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_K36ArtifactInvisibleUnhook");
static_assert(sizeof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook) == 0x000730, "Wrong size on UAISkill_FindInteractable_K36ArtifactInvisibleUnhook");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, MaxLockerToHookDistance) == 0x000308, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::MaxLockerToHookDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, MinLockerToHookDistance) == 0x00030C, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::MinLockerToHookDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, MaxLockerToPathDistance) == 0x000310, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::MaxLockerToPathDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, KillerAverageDistanceLerpSpeed) == 0x000314, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::KillerAverageDistanceLerpSpeed' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, UnhookInteractionID) == 0x000318, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::UnhookInteractionID' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, HookedAllyWeightAtMinDistance) == 0x000328, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::HookedAllyWeightAtMinDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, HookedAllyMaxDistance) == 0x000388, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::HookedAllyMaxDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, AllyDangerStateGoalWeight) == 0x0003E8, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::AllyDangerStateGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, MaxHookTimeGoalWeight) == 0x000448, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::MaxHookTimeGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, HumanAllyHookedGoalWeight) == 0x0004A8, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::HumanAllyHookedGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, IdealKillerAverageDistanceFromHook) == 0x000508, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::IdealKillerAverageDistanceFromHook' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, MaxKillerAverageProximityWeight) == 0x000568, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::MaxKillerAverageProximityWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, BotDangerStateGoalWeight) == 0x0005C8, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::BotDangerStateGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, IncapacitatedAlliesGoalWeight) == 0x000628, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::IncapacitatedAlliesGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, _hookedSurvivorsDistances) == 0x000688, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::_hookedSurvivorsDistances' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactInvisibleUnhook, _currentHookGoalInteractor) == 0x0006D8, "Member 'UAISkill_FindInteractable_K36ArtifactInvisibleUnhook::_currentHookGoalInteractor' has a wrong offset!");

// Class TheK36.K36PowerChargePresentationItemProgressComponent
// 0x0000 (0x00B0 - 0x00B0)
class UK36PowerChargePresentationItemProgressComponent final : public UPresentationItemProgressComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36PowerChargePresentationItemProgressComponent">();
	}
	static class UK36PowerChargePresentationItemProgressComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36PowerChargePresentationItemProgressComponent>();
	}
};
static_assert(alignof(UK36PowerChargePresentationItemProgressComponent) == 0x000008, "Wrong alignment on UK36PowerChargePresentationItemProgressComponent");
static_assert(sizeof(UK36PowerChargePresentationItemProgressComponent) == 0x0000B0, "Wrong size on UK36PowerChargePresentationItemProgressComponent");

// Class TheK36.AISkill_FindInteractable_K36ArtifactTeleportationLocker
// 0x01E8 (0x04F0 - 0x0308)
class UAISkill_FindInteractable_K36ArtifactTeleportationLocker final : public UAISkill_FindInteractable
{
public:
	struct FAITunableParameter                    AverageHookStageDifferenceWeight;                  // 0x0308(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    PerMeterAwayWeight;                                // 0x0368(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinimumRequiredGoalWeight;                         // 0x03C8(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    LastSurvivorWeight;                                // 0x0428(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxValidDistance;                                  // 0x0488(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         MinimumGeneratorRepairPercent;                     // 0x04E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_K36ArtifactTeleportationLocker">();
	}
	static class UAISkill_FindInteractable_K36ArtifactTeleportationLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_K36ArtifactTeleportationLocker>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_K36ArtifactTeleportationLocker");
static_assert(sizeof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker) == 0x0004F0, "Wrong size on UAISkill_FindInteractable_K36ArtifactTeleportationLocker");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker, AverageHookStageDifferenceWeight) == 0x000308, "Member 'UAISkill_FindInteractable_K36ArtifactTeleportationLocker::AverageHookStageDifferenceWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker, PerMeterAwayWeight) == 0x000368, "Member 'UAISkill_FindInteractable_K36ArtifactTeleportationLocker::PerMeterAwayWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker, MinimumRequiredGoalWeight) == 0x0003C8, "Member 'UAISkill_FindInteractable_K36ArtifactTeleportationLocker::MinimumRequiredGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker, LastSurvivorWeight) == 0x000428, "Member 'UAISkill_FindInteractable_K36ArtifactTeleportationLocker::LastSurvivorWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker, MaxValidDistance) == 0x000488, "Member 'UAISkill_FindInteractable_K36ArtifactTeleportationLocker::MaxValidDistance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_K36ArtifactTeleportationLocker, MinimumGeneratorRepairPercent) == 0x0004E8, "Member 'UAISkill_FindInteractable_K36ArtifactTeleportationLocker::MinimumGeneratorRepairPercent' has a wrong offset!");

// Class TheK36.K36PresentationPowerFadeOutComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK36PresentationPowerFadeOutComponent final : public UPresentationPowerFadeComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36PresentationPowerFadeOutComponent">();
	}
	static class UK36PresentationPowerFadeOutComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36PresentationPowerFadeOutComponent>();
	}
};
static_assert(alignof(UK36PresentationPowerFadeOutComponent) == 0x000008, "Wrong alignment on UK36PresentationPowerFadeOutComponent");
static_assert(sizeof(UK36PresentationPowerFadeOutComponent) == 0x0000A8, "Wrong size on UK36PresentationPowerFadeOutComponent");

// Class TheK36.AISkill_Interaction_K36Invisible
// 0x0000 (0x0280 - 0x0280)
class UAISkill_Interaction_K36Invisible final : public UAISkill_Interaction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_K36Invisible">();
	}
	static class UAISkill_Interaction_K36Invisible* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_K36Invisible>();
	}
};
static_assert(alignof(UAISkill_Interaction_K36Invisible) == 0x000008, "Wrong alignment on UAISkill_Interaction_K36Invisible");
static_assert(sizeof(UAISkill_Interaction_K36Invisible) == 0x000280, "Wrong size on UAISkill_Interaction_K36Invisible");

// Class TheK36.K36AfterFlyVelocityCalculationStrategy
// 0x0078 (0x0120 - 0x00A8)
class UK36AfterFlyVelocityCalculationStrategy final : public UBaseCharacterVelocityCalculationStrategy
{
public:
	struct FDBDTunableRowHandle                   _brakingDeceleration;                              // 0x00A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _friction;                                         // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _minimumVelocityToOverrideDecelerationValues;      // 0x00F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36AfterFlyVelocityCalculationStrategy">();
	}
	static class UK36AfterFlyVelocityCalculationStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36AfterFlyVelocityCalculationStrategy>();
	}
};
static_assert(alignof(UK36AfterFlyVelocityCalculationStrategy) == 0x000008, "Wrong alignment on UK36AfterFlyVelocityCalculationStrategy");
static_assert(sizeof(UK36AfterFlyVelocityCalculationStrategy) == 0x000120, "Wrong size on UK36AfterFlyVelocityCalculationStrategy");
static_assert(offsetof(UK36AfterFlyVelocityCalculationStrategy, _brakingDeceleration) == 0x0000A8, "Member 'UK36AfterFlyVelocityCalculationStrategy::_brakingDeceleration' has a wrong offset!");
static_assert(offsetof(UK36AfterFlyVelocityCalculationStrategy, _friction) == 0x0000D0, "Member 'UK36AfterFlyVelocityCalculationStrategy::_friction' has a wrong offset!");
static_assert(offsetof(UK36AfterFlyVelocityCalculationStrategy, _minimumVelocityToOverrideDecelerationValues) == 0x0000F8, "Member 'UK36AfterFlyVelocityCalculationStrategy::_minimumVelocityToOverrideDecelerationValues' has a wrong offset!");

// Class TheK36.K36AnimInstance
// 0x0010 (0x0730 - 0x0720)
class UK36AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isSelectingSpell;                                 // 0x0720(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingFlySpell;                               // 0x0721(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFlySpellCharged;                                // 0x0722(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFlying;                                         // 0x0723(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isEndingFly;                                      // 0x0724(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingFOTDSpell;                              // 0x0725(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFOTDSpellCharged;                               // 0x0726(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActivatingFOTDSpell;                            // 0x0727(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingDetectionSpell;                         // 0x0728(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDetectionSpellCharged;                          // 0x0729(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActivatingDetectionSpell;                       // 0x072A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingMageHand;                               // 0x072B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isMageHandCharged;                                // 0x072C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActivatingMageHandSpell;                        // 0x072D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72E[0x2];                                      // 0x072E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36AnimInstance">();
	}
	static class UK36AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36AnimInstance>();
	}
};
static_assert(alignof(UK36AnimInstance) == 0x000010, "Wrong alignment on UK36AnimInstance");
static_assert(sizeof(UK36AnimInstance) == 0x000730, "Wrong size on UK36AnimInstance");
static_assert(offsetof(UK36AnimInstance, _isSelectingSpell) == 0x000720, "Member 'UK36AnimInstance::_isSelectingSpell' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isChargingFlySpell) == 0x000721, "Member 'UK36AnimInstance::_isChargingFlySpell' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isFlySpellCharged) == 0x000722, "Member 'UK36AnimInstance::_isFlySpellCharged' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isFlying) == 0x000723, "Member 'UK36AnimInstance::_isFlying' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isEndingFly) == 0x000724, "Member 'UK36AnimInstance::_isEndingFly' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isChargingFOTDSpell) == 0x000725, "Member 'UK36AnimInstance::_isChargingFOTDSpell' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isFOTDSpellCharged) == 0x000726, "Member 'UK36AnimInstance::_isFOTDSpellCharged' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isActivatingFOTDSpell) == 0x000727, "Member 'UK36AnimInstance::_isActivatingFOTDSpell' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isChargingDetectionSpell) == 0x000728, "Member 'UK36AnimInstance::_isChargingDetectionSpell' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isDetectionSpellCharged) == 0x000729, "Member 'UK36AnimInstance::_isDetectionSpellCharged' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isActivatingDetectionSpell) == 0x00072A, "Member 'UK36AnimInstance::_isActivatingDetectionSpell' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isChargingMageHand) == 0x00072B, "Member 'UK36AnimInstance::_isChargingMageHand' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isMageHandCharged) == 0x00072C, "Member 'UK36AnimInstance::_isMageHandCharged' has a wrong offset!");
static_assert(offsetof(UK36AnimInstance, _isActivatingMageHandSpell) == 0x00072D, "Member 'UK36AnimInstance::_isActivatingMageHandSpell' has a wrong offset!");

// Class TheK36.K36ArtifactPowerComponent
// 0x0180 (0x0228 - 0x00A8)
class UK36ArtifactPowerComponent : public UActorComponent
{
public:
	struct FDBDTunableRowHandle                   _onLockerOpenedSmokeEffectTimeWindow;              // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x20];                                      // 0x00D0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class ALocker>>         _cachedInGameLockers;                              // 0x00F0(0x0010)(Net, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class ALocker>>         _basementLockers;                                  // 0x0100(0x0010)(Net, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _basementBoxShrinkSize;                            // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _killerInstinctDuration;                           // 0x0120(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _brokenStatusEffectDuration;                       // 0x0148(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _killerInstinctStatusEffectClass;                  // 0x0170(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _brokenStatusEffectClass;                          // 0x0178(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK36MagicItemArtifact>   _artifact;                                         // 0x0180(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _lockerShimmerOutlineColorForSurvivor;             // 0x0188(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _maxDistanceForShimmerEffect;                      // 0x01A0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x60];                                     // 0x01C8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();
	void Cosmetic_ApplySmokeEffectOnLocker(class ALocker* Locker);
	void Cosmetic_ApplySmokeVfxOnOpenedLocker(class ALocker* Locker, EPlayerTeam PlayerTeam);
	void OnRep_Artifact();
	void OnSurvivorDamageStateChanged(ECamperDamageState OldDamageState, ECamperDamageState NewDamageState);

	class ACamperPlayer* GetOwningSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36ArtifactPowerComponent">();
	}
	static class UK36ArtifactPowerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36ArtifactPowerComponent>();
	}
};
static_assert(alignof(UK36ArtifactPowerComponent) == 0x000008, "Wrong alignment on UK36ArtifactPowerComponent");
static_assert(sizeof(UK36ArtifactPowerComponent) == 0x000228, "Wrong size on UK36ArtifactPowerComponent");
static_assert(offsetof(UK36ArtifactPowerComponent, _onLockerOpenedSmokeEffectTimeWindow) == 0x0000A8, "Member 'UK36ArtifactPowerComponent::_onLockerOpenedSmokeEffectTimeWindow' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _cachedInGameLockers) == 0x0000F0, "Member 'UK36ArtifactPowerComponent::_cachedInGameLockers' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _basementLockers) == 0x000100, "Member 'UK36ArtifactPowerComponent::_basementLockers' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _basementBoxShrinkSize) == 0x000118, "Member 'UK36ArtifactPowerComponent::_basementBoxShrinkSize' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _killerInstinctDuration) == 0x000120, "Member 'UK36ArtifactPowerComponent::_killerInstinctDuration' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _brokenStatusEffectDuration) == 0x000148, "Member 'UK36ArtifactPowerComponent::_brokenStatusEffectDuration' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _killerInstinctStatusEffectClass) == 0x000170, "Member 'UK36ArtifactPowerComponent::_killerInstinctStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _brokenStatusEffectClass) == 0x000178, "Member 'UK36ArtifactPowerComponent::_brokenStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _artifact) == 0x000180, "Member 'UK36ArtifactPowerComponent::_artifact' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _lockerShimmerOutlineColorForSurvivor) == 0x000188, "Member 'UK36ArtifactPowerComponent::_lockerShimmerOutlineColorForSurvivor' has a wrong offset!");
static_assert(offsetof(UK36ArtifactPowerComponent, _maxDistanceForShimmerEffect) == 0x0001A0, "Member 'UK36ArtifactPowerComponent::_maxDistanceForShimmerEffect' has a wrong offset!");

// Class TheK36.K36ArtifactInvisibilityPowerComponent
// 0x0070 (0x0298 - 0x0228)
class UK36ArtifactInvisibilityPowerComponent final : public UK36ArtifactPowerComponent
{
public:
	TSubclassOf<class UK36InvisibilityStatusEffect> _invisibilityStatusEffectClass;                    // 0x0228(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK36InvisibilityStatusEffect*           _invisibilityStatusEffect;                         // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _invisibilityStatusEffectDuration;                 // 0x0238(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x38];                                     // 0x0260(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnSurvivorDamageStateChanged(ECamperDamageState OldState, ECamperDamageState NewState);
	void Multi_TriggerLockerVFXEffects(class ALocker* Locker);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36ArtifactInvisibilityPowerComponent">();
	}
	static class UK36ArtifactInvisibilityPowerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36ArtifactInvisibilityPowerComponent>();
	}
};
static_assert(alignof(UK36ArtifactInvisibilityPowerComponent) == 0x000008, "Wrong alignment on UK36ArtifactInvisibilityPowerComponent");
static_assert(sizeof(UK36ArtifactInvisibilityPowerComponent) == 0x000298, "Wrong size on UK36ArtifactInvisibilityPowerComponent");
static_assert(offsetof(UK36ArtifactInvisibilityPowerComponent, _invisibilityStatusEffectClass) == 0x000228, "Member 'UK36ArtifactInvisibilityPowerComponent::_invisibilityStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UK36ArtifactInvisibilityPowerComponent, _invisibilityStatusEffect) == 0x000230, "Member 'UK36ArtifactInvisibilityPowerComponent::_invisibilityStatusEffect' has a wrong offset!");
static_assert(offsetof(UK36ArtifactInvisibilityPowerComponent, _invisibilityStatusEffectDuration) == 0x000238, "Member 'UK36ArtifactInvisibilityPowerComponent::_invisibilityStatusEffectDuration' has a wrong offset!");

// Class TheK36.K36ArtifactTeleportationPowerComponent
// 0x00D8 (0x0300 - 0x0228)
class UK36ArtifactTeleportationPowerComponent final : public UK36ArtifactPowerComponent
{
public:
	struct FDBDTunableRowHandle                   _timeLockerAuraActive;                             // 0x0228(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _minDistanceFromLocker;                            // 0x0250(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _loudNoiseMaxAudibleDistance;                      // 0x0280(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _lockerOutlineColorForSurvivor;                    // 0x02A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x48];                                     // 0x02B8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnPlayerFastEnteredLocker(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
	void Authority_TriggerExitFromLocker();
	void Multicast_TriggerExitFromLocker(class ALocker* InitialLocker, class ALocker* TargetLocker);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36ArtifactTeleportationPowerComponent">();
	}
	static class UK36ArtifactTeleportationPowerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36ArtifactTeleportationPowerComponent>();
	}
};
static_assert(alignof(UK36ArtifactTeleportationPowerComponent) == 0x000008, "Wrong alignment on UK36ArtifactTeleportationPowerComponent");
static_assert(sizeof(UK36ArtifactTeleportationPowerComponent) == 0x000300, "Wrong size on UK36ArtifactTeleportationPowerComponent");
static_assert(offsetof(UK36ArtifactTeleportationPowerComponent, _timeLockerAuraActive) == 0x000228, "Member 'UK36ArtifactTeleportationPowerComponent::_timeLockerAuraActive' has a wrong offset!");
static_assert(offsetof(UK36ArtifactTeleportationPowerComponent, _minDistanceFromLocker) == 0x000250, "Member 'UK36ArtifactTeleportationPowerComponent::_minDistanceFromLocker' has a wrong offset!");
static_assert(offsetof(UK36ArtifactTeleportationPowerComponent, _loudNoiseMaxAudibleDistance) == 0x000280, "Member 'UK36ArtifactTeleportationPowerComponent::_loudNoiseMaxAudibleDistance' has a wrong offset!");
static_assert(offsetof(UK36ArtifactTeleportationPowerComponent, _lockerOutlineColorForSurvivor) == 0x0002A8, "Member 'UK36ArtifactTeleportationPowerComponent::_lockerOutlineColorForSurvivor' has a wrong offset!");

// Class TheK36.K36BaseMoriInteraction
// 0x0010 (0x09E0 - 0x09D0)
#pragma pack(push, 0x1)
class alignas(0x10) UK36BaseMoriInteraction : public UKillInteractionDefinition
{
public:
	uint8                                         Pad_9D0[0x8];                                      // 0x09D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36BaseMoriInteraction">();
	}
	static class UK36BaseMoriInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36BaseMoriInteraction>();
	}
};
#pragma pack(pop)
static_assert(alignof(UK36BaseMoriInteraction) == 0x000010, "Wrong alignment on UK36BaseMoriInteraction");
static_assert(sizeof(UK36BaseMoriInteraction) == 0x0009E0, "Wrong size on UK36BaseMoriInteraction");

// Class TheK36.K36MageHandBaseState
// 0x0038 (0x0088 - 0x0050)
class UK36MageHandBaseState : public UBaseReplicatedState
{
public:
	bool                                          _authority_registerOnPalletStateChanged;           // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _authority_disableMageEndOnPalletBreak;            // 0x0051(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _resetMageHandStatePredictedStateStackOnEnter;     // 0x0052(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _disableMageHandOnPalletStun;                      // 0x0053(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x34];                                      // 0x0054(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36MageHandBaseState">();
	}
	static class UK36MageHandBaseState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36MageHandBaseState>();
	}
};
static_assert(alignof(UK36MageHandBaseState) == 0x000008, "Wrong alignment on UK36MageHandBaseState");
static_assert(sizeof(UK36MageHandBaseState) == 0x000088, "Wrong size on UK36MageHandBaseState");
static_assert(offsetof(UK36MageHandBaseState, _authority_registerOnPalletStateChanged) == 0x000050, "Member 'UK36MageHandBaseState::_authority_registerOnPalletStateChanged' has a wrong offset!");
static_assert(offsetof(UK36MageHandBaseState, _authority_disableMageEndOnPalletBreak) == 0x000051, "Member 'UK36MageHandBaseState::_authority_disableMageEndOnPalletBreak' has a wrong offset!");
static_assert(offsetof(UK36MageHandBaseState, _resetMageHandStatePredictedStateStackOnEnter) == 0x000052, "Member 'UK36MageHandBaseState::_resetMageHandStatePredictedStateStackOnEnter' has a wrong offset!");
static_assert(offsetof(UK36MageHandBaseState, _disableMageHandOnPalletStun) == 0x000053, "Member 'UK36MageHandBaseState::_disableMageHandOnPalletStun' has a wrong offset!");

// Class TheK36.K36BlockPalletInteractionsState
// 0x0000 (0x0088 - 0x0088)
class UK36BlockPalletInteractionsState : public UK36MageHandBaseState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36BlockPalletInteractionsState">();
	}
	static class UK36BlockPalletInteractionsState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36BlockPalletInteractionsState>();
	}
};
static_assert(alignof(UK36BlockPalletInteractionsState) == 0x000008, "Wrong alignment on UK36BlockPalletInteractionsState");
static_assert(sizeof(UK36BlockPalletInteractionsState) == 0x000088, "Wrong size on UK36BlockPalletInteractionsState");

// Class TheK36.K36CheatComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK36CheatComponent final : public UDLCCheatComponent
{
public:
	void DBD_K36EquipMagicItemOnLocalSurvivor(const class FString& MagicItemTypeName, const class FString& SpellCounterType, const class FString& LocalPlayerId);
	void DBD_K36ShowSpectralEntityCollisions(bool ShowCollisions, bool AlsoShowNearMissCollisions);

	void DBD_K36FillTreasureChestsWithLegendaryMagicItems(const class FString& MagicItemClassName) const;
	void DBD_K36PrintMagicItemInventoryContents() const;
	void DBD_K36ResetAllTreasureChests() const;
	void DBD_K36ResetOpenTreasureChests() const;
	void DBD_K36SetForcedDiceValueOnAllTreasureChests(int32 ForcedRollValue) const;
	void DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor(const class FString& LocalPlayerId) const;
	void DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor(const class FString& LocalPlayerId) const;
	void DBD_K36TriggerDiceRollOnSurvivor(int32 Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36CheatComponent">();
	}
	static class UK36CheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36CheatComponent>();
	}
};
static_assert(alignof(UK36CheatComponent) == 0x000008, "Wrong alignment on UK36CheatComponent");
static_assert(sizeof(UK36CheatComponent) == 0x0000A8, "Wrong size on UK36CheatComponent");

// Class TheK36.K36CollectItemFromTreasureChestInteraction
// 0x0030 (0x07E0 - 0x07B0)
class UK36CollectItemFromTreasureChestInteraction : public UCollectItemInteraction
{
public:
	FMulticastInlineDelegateProperty_             OnMagicItemCollectedFromChest;                     // 0x07A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnShittyItemCollectedFromChest;                    // 0x07B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C8[0x18];                                     // 0x07C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36CollectItemFromTreasureChestInteraction">();
	}
	static class UK36CollectItemFromTreasureChestInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36CollectItemFromTreasureChestInteraction>();
	}
};
static_assert(alignof(UK36CollectItemFromTreasureChestInteraction) == 0x000010, "Wrong alignment on UK36CollectItemFromTreasureChestInteraction");
static_assert(sizeof(UK36CollectItemFromTreasureChestInteraction) == 0x0007E0, "Wrong size on UK36CollectItemFromTreasureChestInteraction");
static_assert(offsetof(UK36CollectItemFromTreasureChestInteraction, OnMagicItemCollectedFromChest) == 0x0007A8, "Member 'UK36CollectItemFromTreasureChestInteraction::OnMagicItemCollectedFromChest' has a wrong offset!");
static_assert(offsetof(UK36CollectItemFromTreasureChestInteraction, OnShittyItemCollectedFromChest) == 0x0007B8, "Member 'UK36CollectItemFromTreasureChestInteraction::OnShittyItemCollectedFromChest' has a wrong offset!");

// Class TheK36.K36D20Dice
// 0x0010 (0x02B0 - 0x02A0)
class AK36D20Dice final : public AActor
{
public:
	class USceneComponent*                        _rootComponent;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   _staticMesh;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Cosmetic_PlayDiceRoll(int32 DiceRollResult, EK36DiceRollOutcome DiceRollOutcome);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36D20Dice">();
	}
	static class AK36D20Dice* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK36D20Dice>();
	}
};
static_assert(alignof(AK36D20Dice) == 0x000008, "Wrong alignment on AK36D20Dice");
static_assert(sizeof(AK36D20Dice) == 0x0002B0, "Wrong size on AK36D20Dice");
static_assert(offsetof(AK36D20Dice, _rootComponent) == 0x0002A0, "Member 'AK36D20Dice::_rootComponent' has a wrong offset!");
static_assert(offsetof(AK36D20Dice, _staticMesh) == 0x0002A8, "Member 'AK36D20Dice::_staticMesh' has a wrong offset!");

// Class TheK36.K36D20VisualDiceRollerComponent
// 0x0040 (0x00E8 - 0x00A8)
class UK36D20VisualDiceRollerComponent final : public UActorComponent
{
public:
	TSubclassOf<class AK36D20Dice>                _diceClass;                                        // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AK36D20Dice*                            _playerDice;                                       // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _relativeLocationFromCamera;                       // 0x00B8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _attachedToCameraScale;                            // 0x00D0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K36D20VisualDiceRollerComponent">();
	}
	static class UK36D20VisualDiceRollerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK36D20VisualDiceRollerComponent>();
	}
};
static_assert(alignof(UK36D20VisualDiceRollerComponent) == 0x000008, "Wrong alignment on UK36D20VisualDiceRollerComponent");
static_assert(sizeof(UK36D20VisualDiceRollerComponent) == 0x0000E8, "Wrong size on UK36D20VisualDiceRollerComponent");
static_assert(offsetof(UK36D20VisualDiceRollerComponent, _diceClass) == 0x0000A8, "Member 'UK36D20VisualDiceRollerComponent::_diceClass' has a wrong offset!");
static_assert(offsetof(UK36D20VisualDiceRollerComponent, _playerDice) == 0x0000B0, "Member 'UK36D20VisualDiceRollerComponent::_playerDice' has a wrong offset!");
static_assert(offsetof(UK36D20VisualDiceRollerComponent, _relativeLocationFromCamera) == 0x0000B8, "Member 'UK36D20VisualDiceRollerComponent::_relativeLocationFromCamera' has a wrong offset!");
static_assert(offsetof(UK36D20VisualDiceRollerComponent, _attachedToCameraScale) == 0x0000D0, "Member 'UK36D20VisualDiceRollerComponent::_attachedToCameraScale' has a wrong offset!");

// Class TheK36.K36SpellInteraction
// 0x0580 (0x0E40 - 0x08C0)
#pragma pack(push, 0x1)
class alignas(0x10) UK36SpellInteraction : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x18];                                     // 0x08C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _chargeSpellTime;                                  // 0x08D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _isChargingSpellStateTag;                          // 0x0900(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _isSpellChargedStateTag;                           // 0x090C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _isActivatingSpellStateTag;                        // 0x0918(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _isSpellOnNonCancelledCooldownStateTag;            // 0x0924(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _spellChargeStartGameEvent;                        // 0x0930(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _spellTriggeredGameEvent;                          // 0x093C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _activationTime;                                   // 0x0948(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _activatedExitDuration;                            // 0x0970(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _cancelExitDuration;                               // 0x0998(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTunableStat                           _initialSpellCooldown;                             // 0x09C0(0x0080)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
