#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK35

#include "Basic.hpp"

#include "TheK35_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function TheK35.K35AnimInstance.OnGameEventReceived
// 0x0040 (0x0040 - 0x0000)
struct K35AnimInstance_OnGameEventReceived final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35AnimInstance_OnGameEventReceived) == 0x000008, "Wrong alignment on K35AnimInstance_OnGameEventReceived");
static_assert(sizeof(K35AnimInstance_OnGameEventReceived) == 0x000040, "Wrong size on K35AnimInstance_OnGameEventReceived");
static_assert(offsetof(K35AnimInstance_OnGameEventReceived, GameplayTag) == 0x000000, "Member 'K35AnimInstance_OnGameEventReceived::GameplayTag' has a wrong offset!");
static_assert(offsetof(K35AnimInstance_OnGameEventReceived, GameEventData) == 0x000010, "Member 'K35AnimInstance_OnGameEventReceived::GameEventData' has a wrong offset!");

// Function TheK35.K35AreaBlast.Cosmetic_OnStateChanged
// 0x0001 (0x0001 - 0x0000)
struct K35AreaBlast_Cosmetic_OnStateChanged final
{
public:
	EK35AreaBlastState                            NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35AreaBlast_Cosmetic_OnStateChanged) == 0x000001, "Wrong alignment on K35AreaBlast_Cosmetic_OnStateChanged");
static_assert(sizeof(K35AreaBlast_Cosmetic_OnStateChanged) == 0x000001, "Wrong size on K35AreaBlast_Cosmetic_OnStateChanged");
static_assert(offsetof(K35AreaBlast_Cosmetic_OnStateChanged, NewState) == 0x000000, "Member 'K35AreaBlast_Cosmetic_OnStateChanged::NewState' has a wrong offset!");

// Function TheK35.K35AreaBlast.Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast
// 0x0010 (0x0010 - 0x0000)
struct K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            CurrentHealthState;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast) == 0x000008, "Wrong alignment on K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast");
static_assert(sizeof(K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast) == 0x000010, "Wrong size on K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast");
static_assert(offsetof(K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast, Survivor) == 0x000000, "Member 'K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast::Survivor' has a wrong offset!");
static_assert(offsetof(K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast, CurrentHealthState) == 0x000008, "Member 'K35AreaBlast_Cosmetic_OnSurvivorAfflictedWithKillerEffectByAreaBlast::CurrentHealthState' has a wrong offset!");

// Function TheK35.K35AreaBlast.Cosmetic_OnSurvivorDamagedByAreaBlast
// 0x0010 (0x0010 - 0x0000)
struct K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            TargetHealthState;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAnySurvivorAlreadyHit;                           // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast) == 0x000008, "Wrong alignment on K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast");
static_assert(sizeof(K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast) == 0x000010, "Wrong size on K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast");
static_assert(offsetof(K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast, Survivor) == 0x000000, "Member 'K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast::Survivor' has a wrong offset!");
static_assert(offsetof(K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast, TargetHealthState) == 0x000008, "Member 'K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast::TargetHealthState' has a wrong offset!");
static_assert(offsetof(K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast, IsAnySurvivorAlreadyHit) == 0x000009, "Member 'K35AreaBlast_Cosmetic_OnSurvivorDamagedByAreaBlast::IsAnySurvivorAlreadyHit' has a wrong offset!");

// Function TheK35.K35AreaBlast.Multicast_Spawn
// 0x0018 (0x0018 - 0x0000)
struct K35AreaBlast_Multicast_Spawn final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35AreaBlast_Multicast_Spawn) == 0x000008, "Wrong alignment on K35AreaBlast_Multicast_Spawn");
static_assert(sizeof(K35AreaBlast_Multicast_Spawn) == 0x000018, "Wrong size on K35AreaBlast_Multicast_Spawn");
static_assert(offsetof(K35AreaBlast_Multicast_Spawn, SpawnLocation) == 0x000000, "Member 'K35AreaBlast_Multicast_Spawn::SpawnLocation' has a wrong offset!");

// Function TheK35.K35AreaBlast.Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast
// 0x0010 (0x0010 - 0x0000)
struct K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            CurrentHealthState;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast) == 0x000008, "Wrong alignment on K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast");
static_assert(sizeof(K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast) == 0x000010, "Wrong size on K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast");
static_assert(offsetof(K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast, Survivor) == 0x000000, "Member 'K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast::Survivor' has a wrong offset!");
static_assert(offsetof(K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast, CurrentHealthState) == 0x000008, "Member 'K35AreaBlast_Multicast_SurvivorAfflictedWithKillerEffectByAreaBlast::CurrentHealthState' has a wrong offset!");

// Function TheK35.K35AreaBlast.Multicast_SurvivorDamagedByAreaBlast
// 0x0010 (0x0010 - 0x0000)
struct K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            TargetHealthState;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast) == 0x000008, "Wrong alignment on K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast");
static_assert(sizeof(K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast) == 0x000010, "Wrong size on K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast");
static_assert(offsetof(K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast, Survivor) == 0x000000, "Member 'K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast::Survivor' has a wrong offset!");
static_assert(offsetof(K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast, TargetHealthState) == 0x000008, "Member 'K35AreaBlast_Multicast_SurvivorDamagedByAreaBlast::TargetHealthState' has a wrong offset!");

// Function TheK35.K35Decoy.Cosmetic_OnVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct K35Decoy_Cosmetic_OnVisibilityChanged final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35Decoy_Cosmetic_OnVisibilityChanged) == 0x000001, "Wrong alignment on K35Decoy_Cosmetic_OnVisibilityChanged");
static_assert(sizeof(K35Decoy_Cosmetic_OnVisibilityChanged) == 0x000001, "Wrong size on K35Decoy_Cosmetic_OnVisibilityChanged");
static_assert(offsetof(K35Decoy_Cosmetic_OnVisibilityChanged, IsVisible) == 0x000000, "Member 'K35Decoy_Cosmetic_OnVisibilityChanged::IsVisible' has a wrong offset!");

// Function TheK35.K35Decoy.Multicast_Spawn
// 0x0018 (0x0018 - 0x0000)
struct K35Decoy_Multicast_Spawn final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35Decoy_Multicast_Spawn) == 0x000008, "Wrong alignment on K35Decoy_Multicast_Spawn");
static_assert(sizeof(K35Decoy_Multicast_Spawn) == 0x000018, "Wrong size on K35Decoy_Multicast_Spawn");
static_assert(offsetof(K35Decoy_Multicast_Spawn, SpawnLocation) == 0x000000, "Member 'K35Decoy_Multicast_Spawn::SpawnLocation' has a wrong offset!");

// Function TheK35.K35Decoy.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K35Decoy_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35Decoy_OnKillerSet) == 0x000008, "Wrong alignment on K35Decoy_OnKillerSet");
static_assert(sizeof(K35Decoy_OnKillerSet) == 0x000008, "Wrong size on K35Decoy_OnKillerSet");
static_assert(offsetof(K35Decoy_OnKillerSet, Killer) == 0x000000, "Member 'K35Decoy_OnKillerSet::Killer' has a wrong offset!");

// Function TheK35.K35Decoy.OnPlayerOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K35Decoy_OnPlayerOverlapBegin final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35Decoy_OnPlayerOverlapBegin) == 0x000008, "Wrong alignment on K35Decoy_OnPlayerOverlapBegin");
static_assert(sizeof(K35Decoy_OnPlayerOverlapBegin) == 0x000110, "Wrong size on K35Decoy_OnPlayerOverlapBegin");
static_assert(offsetof(K35Decoy_OnPlayerOverlapBegin, HitComponent) == 0x000000, "Member 'K35Decoy_OnPlayerOverlapBegin::HitComponent' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapBegin, OtherActor) == 0x000008, "Member 'K35Decoy_OnPlayerOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapBegin, OtherComponent) == 0x000010, "Member 'K35Decoy_OnPlayerOverlapBegin::OtherComponent' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'K35Decoy_OnPlayerOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapBegin, bFromSweep) == 0x00001C, "Member 'K35Decoy_OnPlayerOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapBegin, SweepResult) == 0x000020, "Member 'K35Decoy_OnPlayerOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK35.K35Decoy.OnPlayerOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct K35Decoy_OnPlayerOverlapEnd final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35Decoy_OnPlayerOverlapEnd) == 0x000008, "Wrong alignment on K35Decoy_OnPlayerOverlapEnd");
static_assert(sizeof(K35Decoy_OnPlayerOverlapEnd) == 0x000020, "Wrong size on K35Decoy_OnPlayerOverlapEnd");
static_assert(offsetof(K35Decoy_OnPlayerOverlapEnd, HitComponent) == 0x000000, "Member 'K35Decoy_OnPlayerOverlapEnd::HitComponent' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapEnd, OtherActor) == 0x000008, "Member 'K35Decoy_OnPlayerOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapEnd, OtherComponent) == 0x000010, "Member 'K35Decoy_OnPlayerOverlapEnd::OtherComponent' has a wrong offset!");
static_assert(offsetof(K35Decoy_OnPlayerOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'K35Decoy_OnPlayerOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK35.K35Decoy.SetHuskVisibilityChecked
// 0x0001 (0x0001 - 0x0000)
struct K35Decoy_SetHuskVisibilityChecked final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35Decoy_SetHuskVisibilityChecked) == 0x000001, "Wrong alignment on K35Decoy_SetHuskVisibilityChecked");
static_assert(sizeof(K35Decoy_SetHuskVisibilityChecked) == 0x000001, "Wrong size on K35Decoy_SetHuskVisibilityChecked");
static_assert(offsetof(K35Decoy_SetHuskVisibilityChecked, IsVisible) == 0x000000, "Member 'K35Decoy_SetHuskVisibilityChecked::IsVisible' has a wrong offset!");

// Function TheK35.K35Decoy.IsLocalPlayerOverlapping
// 0x0001 (0x0001 - 0x0000)
struct K35Decoy_IsLocalPlayerOverlapping final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35Decoy_IsLocalPlayerOverlapping) == 0x000001, "Wrong alignment on K35Decoy_IsLocalPlayerOverlapping");
static_assert(sizeof(K35Decoy_IsLocalPlayerOverlapping) == 0x000001, "Wrong size on K35Decoy_IsLocalPlayerOverlapping");
static_assert(offsetof(K35Decoy_IsLocalPlayerOverlapping, ReturnValue) == 0x000000, "Member 'K35Decoy_IsLocalPlayerOverlapping::ReturnValue' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.Authority_OnEnvironmentCollisionComponentHit
// 0x0120 (0x0120 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit) == 0x000120, "Wrong size on K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit, HitComponent) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit::HitComponent' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit, OtherActor) == 0x000008, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit::OtherActor' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit, OtherComp) == 0x000010, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit::OtherComp' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit, NormalImpulse) == 0x000018, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit, Hit) == 0x000030, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentHit::Hit' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.Authority_OnEnvironmentCollisionComponentOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFromSweep;                                       // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin) == 0x000110, "Wrong size on K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin, OverlappedComponent) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin, OtherActor) == 0x000008, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin, OtherComp) == 0x000010, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin, IsFromSweep) == 0x00001C, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin::IsFromSweep' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin, SweepResult) == 0x000020, "Member 'K35KillerAreaBlastTravelProjectile_Authority_OnEnvironmentCollisionComponentOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.Cosmetic_OnProjectileHitEnvironment
// 0x0038 (0x0038 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment final
{
public:
	struct FVector                                ImpactLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpactNormal;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              SurfaceType;                                       // 0x0030(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment) == 0x000038, "Wrong size on K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment, ImpactLocation) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment::ImpactLocation' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment, ImpactNormal) == 0x000018, "Member 'K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment::ImpactNormal' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment, SurfaceType) == 0x000030, "Member 'K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitEnvironment::SurfaceType' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.Cosmetic_OnProjectileHitSurvivor
// 0x0010 (0x0010 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HinderedLifetime;                                  // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor) == 0x000010, "Wrong size on K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor, Survivor) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor::Survivor' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor, HinderedLifetime) == 0x000008, "Member 'K35KillerAreaBlastTravelProjectile_Cosmetic_OnProjectileHitSurvivor::HinderedLifetime' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.Multicast_OnProjectileReachedEnd
// 0x0018 (0x0018 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd final
{
public:
	struct FVector                                EndLocation;                                       // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd) == 0x000018, "Wrong size on K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd, EndLocation) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_Multicast_OnProjectileReachedEnd::EndLocation' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_OnKillerSet) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_OnKillerSet");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_OnKillerSet) == 0x000008, "Wrong size on K35KillerAreaBlastTravelProjectile_OnKillerSet");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_OnKillerSet, Killer) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_OnKillerSet::Killer' has a wrong offset!");

// Function TheK35.K35KillerAreaBlastTravelProjectile.OnSurvivorHitDetected
// 0x00F8 (0x00F8 - 0x0000)
struct K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0008(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected) == 0x000008, "Wrong alignment on K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected");
static_assert(sizeof(K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected) == 0x0000F8, "Wrong size on K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected, Component) == 0x000000, "Member 'K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected::Component' has a wrong offset!");
static_assert(offsetof(K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected, Hit) == 0x000008, "Member 'K35KillerAreaBlastTravelProjectile_OnSurvivorHitDetected::Hit' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Authority_OnSurvivorAdded
// 0x0010 (0x0010 - 0x0000)
struct K35KillerEffectTracker_Authority_OnSurvivorAdded final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASlasherPlayer*                         Killer;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Authority_OnSurvivorAdded) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Authority_OnSurvivorAdded");
static_assert(sizeof(K35KillerEffectTracker_Authority_OnSurvivorAdded) == 0x000010, "Wrong size on K35KillerEffectTracker_Authority_OnSurvivorAdded");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorAdded, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_Authority_OnSurvivorAdded::Survivor' has a wrong offset!");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorAdded, Killer) == 0x000008, "Member 'K35KillerEffectTracker_Authority_OnSurvivorAdded::Killer' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Authority_OnSurvivorDowned
// 0x0040 (0x0040 - 0x0000)
struct K35KillerEffectTracker_Authority_OnSurvivorDowned final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Authority_OnSurvivorDowned) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Authority_OnSurvivorDowned");
static_assert(sizeof(K35KillerEffectTracker_Authority_OnSurvivorDowned) == 0x000040, "Wrong size on K35KillerEffectTracker_Authority_OnSurvivorDowned");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorDowned, GameEventType) == 0x000000, "Member 'K35KillerEffectTracker_Authority_OnSurvivorDowned::GameEventType' has a wrong offset!");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorDowned, GameEventData) == 0x000010, "Member 'K35KillerEffectTracker_Authority_OnSurvivorDowned::GameEventData' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Authority_OnSurvivorEscaped
// 0x0040 (0x0040 - 0x0000)
struct K35KillerEffectTracker_Authority_OnSurvivorEscaped final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Authority_OnSurvivorEscaped) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Authority_OnSurvivorEscaped");
static_assert(sizeof(K35KillerEffectTracker_Authority_OnSurvivorEscaped) == 0x000040, "Wrong size on K35KillerEffectTracker_Authority_OnSurvivorEscaped");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorEscaped, GameEventType) == 0x000000, "Member 'K35KillerEffectTracker_Authority_OnSurvivorEscaped::GameEventType' has a wrong offset!");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorEscaped, GameEventData) == 0x000010, "Member 'K35KillerEffectTracker_Authority_OnSurvivorEscaped::GameEventData' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Authority_OnSurvivorFinishedRepairingGenerator
// 0x0040 (0x0040 - 0x0000)
struct K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator");
static_assert(sizeof(K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator) == 0x000040, "Wrong size on K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator, GameEventType) == 0x000000, "Member 'K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator::GameEventType' has a wrong offset!");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator, GameEventData) == 0x000010, "Member 'K35KillerEffectTracker_Authority_OnSurvivorFinishedRepairingGenerator::GameEventData' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Authority_OnSurvivorInjuredByAreaBlast
// 0x0040 (0x0040 - 0x0000)
struct K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast");
static_assert(sizeof(K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast) == 0x000040, "Wrong size on K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast, GameEventType) == 0x000000, "Member 'K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast::GameEventType' has a wrong offset!");
static_assert(offsetof(K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast, GameEventData) == 0x000010, "Member 'K35KillerEffectTracker_Authority_OnSurvivorInjuredByAreaBlast::GameEventData' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Cosmetic_SurvivorGainedKillerEffect
// 0x0008 (0x0008 - 0x0000)
struct K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect");
static_assert(sizeof(K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect) == 0x000008, "Wrong size on K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect");
static_assert(offsetof(K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_Cosmetic_SurvivorGainedKillerEffect::Survivor' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Cosmetic_SurvivorKillerEffectIncreased
// 0x0008 (0x0008 - 0x0000)
struct K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased");
static_assert(sizeof(K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased) == 0x000008, "Wrong size on K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased");
static_assert(offsetof(K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_Cosmetic_SurvivorKillerEffectIncreased::Survivor' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Cosmetic_SurvivorLostKillerEffect
// 0x0008 (0x0008 - 0x0000)
struct K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect");
static_assert(sizeof(K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect) == 0x000008, "Wrong size on K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect");
static_assert(offsetof(K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_Cosmetic_SurvivorLostKillerEffect::Survivor' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Cosmetic_SurvivorStartsRemovingKillerEffect
// 0x0008 (0x0008 - 0x0000)
struct K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect");
static_assert(sizeof(K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect) == 0x000008, "Wrong size on K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect");
static_assert(offsetof(K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_Cosmetic_SurvivorStartsRemovingKillerEffect::Survivor' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.Cosmetic_SurvivorStopsRemovingKillerEffect
// 0x0008 (0x0008 - 0x0000)
struct K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect) == 0x000008, "Wrong alignment on K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect");
static_assert(sizeof(K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect) == 0x000008, "Wrong size on K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect");
static_assert(offsetof(K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_Cosmetic_SurvivorStopsRemovingKillerEffect::Survivor' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.OnRep_KillerEffectData
// 0x0010 (0x0010 - 0x0000)
struct K35KillerEffectTracker_OnRep_KillerEffectData final
{
public:
	TArray<struct FK35KillerEffectData>           OldKillerEffectData;                               // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerEffectTracker_OnRep_KillerEffectData) == 0x000008, "Wrong alignment on K35KillerEffectTracker_OnRep_KillerEffectData");
static_assert(sizeof(K35KillerEffectTracker_OnRep_KillerEffectData) == 0x000010, "Wrong size on K35KillerEffectTracker_OnRep_KillerEffectData");
static_assert(offsetof(K35KillerEffectTracker_OnRep_KillerEffectData, OldKillerEffectData) == 0x000000, "Member 'K35KillerEffectTracker_OnRep_KillerEffectData::OldKillerEffectData' has a wrong offset!");

// Function TheK35.K35KillerEffectTracker.GetKillerEffectRemovalProgressionForSurvivor
// 0x0010 (0x0010 - 0x0000)
struct K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor final
{
public:
	const class ACamperPlayer*                    Survivor;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor) == 0x000008, "Wrong alignment on K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor");
static_assert(sizeof(K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor) == 0x000010, "Wrong size on K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor");
static_assert(offsetof(K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor, Survivor) == 0x000000, "Member 'K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor::Survivor' has a wrong offset!");
static_assert(offsetof(K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor, ReturnValue) == 0x000008, "Member 'K35KillerEffectTracker_GetKillerEffectRemovalProgressionForSurvivor::ReturnValue' has a wrong offset!");

// Function TheK35.K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition.Authority_OnKillerTeleportPointSpawn
// 0x0040 (0x0040 - 0x0000)
struct K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn) == 0x000008, "Wrong alignment on K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn");
static_assert(sizeof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn) == 0x000040, "Wrong size on K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn");
static_assert(offsetof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn, GameEventType) == 0x000000, "Member 'K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn::GameEventType' has a wrong offset!");
static_assert(offsetof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn, GameEventData) == 0x000010, "Member 'K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Authority_OnKillerTeleportPointSpawn::GameEventData' has a wrong offset!");

// Function TheK35.K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition.Cosmetic_OnCooldownComplete
// 0x0008 (0x0008 - 0x0000)
struct K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete) == 0x000008, "Wrong alignment on K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete");
static_assert(sizeof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete) == 0x000008, "Wrong size on K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete");
static_assert(offsetof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete, Killer) == 0x000000, "Member 'K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_Cosmetic_OnCooldownComplete::Killer' has a wrong offset!");

// Function TheK35.K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet) == 0x000008, "Wrong alignment on K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet");
static_assert(sizeof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet) == 0x000008, "Wrong size on K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet");
static_assert(offsetof(K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet, Killer) == 0x000000, "Member 'K35KillerShootAreaBlastTravelProjectileChargeableInteractionDefinition_OnKillerSet::Killer' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.Cosmetic_OnCancelledDestroyInteraction
// 0x0008 (0x0008 - 0x0000)
struct K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction final
{
public:
	class ADBDPlayer*                             CaughtSurvivor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction) == 0x000008, "Wrong alignment on K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction");
static_assert(sizeof(K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction) == 0x000008, "Wrong size on K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction");
static_assert(offsetof(K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction, CaughtSurvivor) == 0x000000, "Member 'K35KillerTeleportPoint_Cosmetic_OnCancelledDestroyInteraction::CaughtSurvivor' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.Cosmetic_OnKillerTeleportPointStateChanged
// 0x0001 (0x0001 - 0x0000)
struct K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged final
{
public:
	EK35KillerTeleportPointState                  NewKillerTeleportPointState;                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged) == 0x000001, "Wrong alignment on K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged");
static_assert(sizeof(K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged) == 0x000001, "Wrong size on K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged");
static_assert(offsetof(K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged, NewKillerTeleportPointState) == 0x000000, "Member 'K35KillerTeleportPoint_Cosmetic_OnKillerTeleportPointStateChanged::NewKillerTeleportPointState' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.Cosmetic_OnVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged) == 0x000001, "Wrong alignment on K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged");
static_assert(sizeof(K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged) == 0x000001, "Wrong size on K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged");
static_assert(offsetof(K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged, IsVisible) == 0x000000, "Member 'K35KillerTeleportPoint_Cosmetic_OnVisibilityChanged::IsVisible' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.Multicast_OnCancelledDestroyInteraction
// 0x0008 (0x0008 - 0x0000)
struct K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction final
{
public:
	class ADBDPlayer*                             CaughtSurvivor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction) == 0x000008, "Wrong alignment on K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction");
static_assert(sizeof(K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction) == 0x000008, "Wrong size on K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction");
static_assert(offsetof(K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction, CaughtSurvivor) == 0x000000, "Member 'K35KillerTeleportPoint_Multicast_OnCancelledDestroyInteraction::CaughtSurvivor' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.OnDecoySpawn
// 0x0018 (0x0018 - 0x0000)
struct K35KillerTeleportPoint_OnDecoySpawn final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_OnDecoySpawn) == 0x000008, "Wrong alignment on K35KillerTeleportPoint_OnDecoySpawn");
static_assert(sizeof(K35KillerTeleportPoint_OnDecoySpawn) == 0x000018, "Wrong size on K35KillerTeleportPoint_OnDecoySpawn");
static_assert(offsetof(K35KillerTeleportPoint_OnDecoySpawn, Location) == 0x000000, "Member 'K35KillerTeleportPoint_OnDecoySpawn::Location' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K35KillerTeleportPoint_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_OnKillerSet) == 0x000008, "Wrong alignment on K35KillerTeleportPoint_OnKillerSet");
static_assert(sizeof(K35KillerTeleportPoint_OnKillerSet) == 0x000008, "Wrong size on K35KillerTeleportPoint_OnKillerSet");
static_assert(offsetof(K35KillerTeleportPoint_OnKillerSet, Killer) == 0x000000, "Member 'K35KillerTeleportPoint_OnKillerSet::Killer' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.OnKillerTeleportPointStateChanged
// 0x0001 (0x0001 - 0x0000)
struct K35KillerTeleportPoint_OnKillerTeleportPointStateChanged final
{
public:
	EK35KillerTeleportPointState                  NewKillerTeleportPointState;                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K35KillerTeleportPoint_OnKillerTeleportPointStateChanged) == 0x000001, "Wrong alignment on K35KillerTeleportPoint_OnKillerTeleportPointStateChanged");
static_assert(sizeof(K35KillerTeleportPoint_OnKillerTeleportPointStateChanged) == 0x000001, "Wrong size on K35KillerTeleportPoint_OnKillerTeleportPointStateChanged");
static_assert(offsetof(K35KillerTeleportPoint_OnKillerTeleportPointStateChanged, NewKillerTeleportPointState) == 0x000000, "Member 'K35KillerTeleportPoint_OnKillerTeleportPointStateChanged::NewKillerTeleportPointState' has a wrong offset!");

// Function TheK35.K35KillerTeleportPoint.OnPlayerOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K35KillerTeleportPoint_OnPlayerOverlapBegin final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
