#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK28

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum TheK28.EK28NightCycleState
// NumValues: 0x0006
enum class EK28NightCycleState : uint8
{
	Charging                                 = 0,
	TransitioningToDischarging               = 1,
	Discharging                              = 2,
	TransitioningToCharging                  = 3,
	None                                     = 4,
	EK28NightCycleState_MAX                  = 5,
};

// Enum TheK28.EK28ExitLockerCameraBehaviour
// NumValues: 0x0004
enum class EK28ExitLockerCameraBehaviour : uint8
{
	None                                     = 0,
	AttachCameraOnKillerEyesJoint            = 1,
	SetKillerAsPlayerViewTarget              = 2,
	EK28ExitLockerCameraBehaviour_MAX        = 3,
};

// Enum TheK28.EK28LockbarState
// NumValues: 0x0004
enum class EK28LockbarState : uint8
{
	Unlocked                                 = 0,
	Locked                                   = 1,
	Broken                                   = 2,
	EK28LockbarState_MAX                     = 3,
};

// Enum TheK28.EK28RemnantState
// NumValues: 0x0005
enum class EK28RemnantState : uint8
{
	Inactive                                 = 0,
	Active                                   = 1,
	Deactivating                             = 2,
	IsKillerTarget                           = 3,
	EK28RemnantState_MAX                     = 4,
};

// Enum TheK28.EK28TeleportInteractionState
// NumValues: 0x0007
enum class EK28TeleportInteractionState : uint8
{
	Idle                                     = 0,
	ChargingTeleportation                    = 1,
	ReadyToTeleport                          = 2,
	Teleporting                              = 3,
	TeleportationCompleted                   = 4,
	TeleportationAborted                     = 5,
	EK28TeleportInteractionState_MAX         = 6,
};

// ScriptStruct TheK28.PreviousLockerWeightData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FPreviousLockerWeightData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPreviousLockerWeightData) == 0x000004, "Wrong alignment on FPreviousLockerWeightData");
static_assert(sizeof(FPreviousLockerWeightData) == 0x000008, "Wrong size on FPreviousLockerWeightData");

// ScriptStruct TheK28.K28KillerLockerState
// 0x0010 (0x0010 - 0x0000)
struct FK28KillerLockerState final
{
public:
	class UK28LockerComponent*                    _lockerUsedByKiller;                               // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isTeleportingToLocker;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FK28KillerLockerState) == 0x000008, "Wrong alignment on FK28KillerLockerState");
static_assert(sizeof(FK28KillerLockerState) == 0x000010, "Wrong size on FK28KillerLockerState");
static_assert(offsetof(FK28KillerLockerState, _lockerUsedByKiller) == 0x000000, "Member 'FK28KillerLockerState::_lockerUsedByKiller' has a wrong offset!");
static_assert(offsetof(FK28KillerLockerState, _isTeleportingToLocker) == 0x000008, "Member 'FK28KillerLockerState::_isTeleportingToLocker' has a wrong offset!");

// ScriptStruct TheK28.SurvivorQueryPair
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FSurvivorQueryPair final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSurvivorQueryPair) == 0x000008, "Wrong alignment on FSurvivorQueryPair");
static_assert(sizeof(FSurvivorQueryPair) == 0x000040, "Wrong size on FSurvivorQueryPair");

// ScriptStruct TheK28.K28InteractionPreventingTagsModification
// 0x0028 (0x0028 - 0x0000)
struct FK28InteractionPreventingTagsModification final
{
public:
	TSubclassOf<class UInteractionDefinition>     InteractionToAddPreventingTagTo;                   // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PreventingTags;                                    // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FK28InteractionPreventingTagsModification) == 0x000008, "Wrong alignment on FK28InteractionPreventingTagsModification");
static_assert(sizeof(FK28InteractionPreventingTagsModification) == 0x000028, "Wrong size on FK28InteractionPreventingTagsModification");
static_assert(offsetof(FK28InteractionPreventingTagsModification, InteractionToAddPreventingTagTo) == 0x000000, "Member 'FK28InteractionPreventingTagsModification::InteractionToAddPreventingTagTo' has a wrong offset!");
static_assert(offsetof(FK28InteractionPreventingTagsModification, PreventingTags) == 0x000008, "Member 'FK28InteractionPreventingTagsModification::PreventingTags' has a wrong offset!");

// ScriptStruct TheK28.K28SecondaryCameraFOVData
// 0x0020 (0x0020 - 0x0000)
struct FK28SecondaryCameraFOVData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _fovChangeDuration;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _initialFovValue;                                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _targetFovValue;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _fovCurve;                                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FK28SecondaryCameraFOVData) == 0x000008, "Wrong alignment on FK28SecondaryCameraFOVData");
static_assert(sizeof(FK28SecondaryCameraFOVData) == 0x000020, "Wrong size on FK28SecondaryCameraFOVData");
static_assert(offsetof(FK28SecondaryCameraFOVData, _fovChangeDuration) == 0x000008, "Member 'FK28SecondaryCameraFOVData::_fovChangeDuration' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraFOVData, _initialFovValue) == 0x00000C, "Member 'FK28SecondaryCameraFOVData::_initialFovValue' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraFOVData, _targetFovValue) == 0x000010, "Member 'FK28SecondaryCameraFOVData::_targetFovValue' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraFOVData, _fovCurve) == 0x000018, "Member 'FK28SecondaryCameraFOVData::_fovCurve' has a wrong offset!");

// ScriptStruct TheK28.K28SecondaryCameraMovementData
// 0x0080 (0x0080 - 0x0000)
struct FK28SecondaryCameraMovementData final
{
public:
	struct FVector                                InitialActorLocation;                              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetActorLocation;                               // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPerformingGrabRotation;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InitialCameraRotation;                             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               TargetCameraRotation;                              // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UCurveFloat*                            TransitionCurve;                                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraMovementDuration;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FK28SecondaryCameraMovementData) == 0x000008, "Wrong alignment on FK28SecondaryCameraMovementData");
static_assert(sizeof(FK28SecondaryCameraMovementData) == 0x000080, "Wrong size on FK28SecondaryCameraMovementData");
static_assert(offsetof(FK28SecondaryCameraMovementData, InitialActorLocation) == 0x000000, "Member 'FK28SecondaryCameraMovementData::InitialActorLocation' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraMovementData, TargetActorLocation) == 0x000018, "Member 'FK28SecondaryCameraMovementData::TargetActorLocation' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraMovementData, IsPerformingGrabRotation) == 0x000030, "Member 'FK28SecondaryCameraMovementData::IsPerformingGrabRotation' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraMovementData, InitialCameraRotation) == 0x000038, "Member 'FK28SecondaryCameraMovementData::InitialCameraRotation' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraMovementData, TargetCameraRotation) == 0x000050, "Member 'FK28SecondaryCameraMovementData::TargetCameraRotation' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraMovementData, TransitionCurve) == 0x000068, "Member 'FK28SecondaryCameraMovementData::TransitionCurve' has a wrong offset!");
static_assert(offsetof(FK28SecondaryCameraMovementData, CameraMovementDuration) == 0x000070, "Member 'FK28SecondaryCameraMovementData::CameraMovementDuration' has a wrong offset!");

// ScriptStruct TheK28.K28LockerCluster
// 0x0048 (0x0048 - 0x0000)
struct FK28LockerCluster final
{
public:
	TArray<class UK28LockerComponent*>            _lockersInCluster;                                 // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FVector                                _centerLocation;                                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _teleportIndicatorLocation;                        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FK28LockerCluster) == 0x000008, "Wrong alignment on FK28LockerCluster");
static_assert(sizeof(FK28LockerCluster) == 0x000048, "Wrong size on FK28LockerCluster");
static_assert(offsetof(FK28LockerCluster, _lockersInCluster) == 0x000000, "Member 'FK28LockerCluster::_lockersInCluster' has a wrong offset!");
static_assert(offsetof(FK28LockerCluster, _centerLocation) == 0x000010, "Member 'FK28LockerCluster::_centerLocation' has a wrong offset!");
static_assert(offsetof(FK28LockerCluster, _teleportIndicatorLocation) == 0x000028, "Member 'FK28LockerCluster::_teleportIndicatorLocation' has a wrong offset!");

}

