#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK31

#include "Basic.hpp"

#include "DBDCompetence_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "TheK31_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDCosmetic_classes.hpp"
#include "SystemUtilities_structs.hpp"
#include "Competence_classes.hpp"
#include "Achievements_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// Class TheK31.K31PowerChargePresentationPowerFadeComponent
// 0x0008 (0x00B0 - 0x00A8)
class UK31PowerChargePresentationPowerFadeComponent final : public UPresentationPowerFadeComponent
{
public:
	class AK31Power*                              _originatingPower;                                 // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31PowerChargePresentationPowerFadeComponent">();
	}
	static class UK31PowerChargePresentationPowerFadeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31PowerChargePresentationPowerFadeComponent>();
	}
};
static_assert(alignof(UK31PowerChargePresentationPowerFadeComponent) == 0x000008, "Wrong alignment on UK31PowerChargePresentationPowerFadeComponent");
static_assert(sizeof(UK31PowerChargePresentationPowerFadeComponent) == 0x0000B0, "Wrong size on UK31PowerChargePresentationPowerFadeComponent");
static_assert(offsetof(UK31PowerChargePresentationPowerFadeComponent, _originatingPower) == 0x0000A8, "Member 'UK31PowerChargePresentationPowerFadeComponent::_originatingPower' has a wrong offset!");

// Class TheK31.K31DroneBaseAction
// 0x0000 (0x0030 - 0x0030)
class UK31DroneBaseAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneBaseAction">();
	}
	static class UK31DroneBaseAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneBaseAction>();
	}
};
static_assert(alignof(UK31DroneBaseAction) == 0x000008, "Wrong alignment on UK31DroneBaseAction");
static_assert(sizeof(UK31DroneBaseAction) == 0x000030, "Wrong size on UK31DroneBaseAction");

// Class TheK31.K31PowerCosmeticHelper
// 0x0050 (0x00F8 - 0x00A8)
class UK31PowerCosmeticHelper final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_DoesRadarDetectAnySurvivorsUpdatedEvent(bool DoesRadarDetectAnySurvivors);
	void Cosmetic_IsOnPowerCooldownUpdatedEvent(bool IsPowerOnCooldown);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31PowerCosmeticHelper">();
	}
	static class UK31PowerCosmeticHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31PowerCosmeticHelper>();
	}
};
static_assert(alignof(UK31PowerCosmeticHelper) == 0x000008, "Wrong alignment on UK31PowerCosmeticHelper");
static_assert(sizeof(UK31PowerCosmeticHelper) == 0x0000F8, "Wrong size on UK31PowerCosmeticHelper");

// Class TheK31.K31DroneChangeStateAction
// 0x0008 (0x0038 - 0x0030)
class UK31DroneChangeStateAction : public UK31DroneBaseAction
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneChangeStateAction">();
	}
	static class UK31DroneChangeStateAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneChangeStateAction>();
	}
};
static_assert(alignof(UK31DroneChangeStateAction) == 0x000008, "Wrong alignment on UK31DroneChangeStateAction");
static_assert(sizeof(UK31DroneChangeStateAction) == 0x000038, "Wrong size on UK31DroneChangeStateAction");

// Class TheK31.K31PowerSubAnimInstance
// 0x0030 (0x03B0 - 0x0380)
class UK31PowerSubAnimInstance final : public UDBDBaseAnimInstance
{
public:
	bool                                          _isChargingInspection;                             // 0x0380(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _inspectPlayRate;                                  // 0x0384(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _inspectSequenceStartPosition;                     // 0x0388(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          _inspectSequence;                                  // 0x0390(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_398[0x18];                                     // 0x0398(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31PowerSubAnimInstance">();
	}
	static class UK31PowerSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31PowerSubAnimInstance>();
	}
};
static_assert(alignof(UK31PowerSubAnimInstance) == 0x000010, "Wrong alignment on UK31PowerSubAnimInstance");
static_assert(sizeof(UK31PowerSubAnimInstance) == 0x0003B0, "Wrong size on UK31PowerSubAnimInstance");
static_assert(offsetof(UK31PowerSubAnimInstance, _isChargingInspection) == 0x000380, "Member 'UK31PowerSubAnimInstance::_isChargingInspection' has a wrong offset!");
static_assert(offsetof(UK31PowerSubAnimInstance, _inspectPlayRate) == 0x000384, "Member 'UK31PowerSubAnimInstance::_inspectPlayRate' has a wrong offset!");
static_assert(offsetof(UK31PowerSubAnimInstance, _inspectSequenceStartPosition) == 0x000388, "Member 'UK31PowerSubAnimInstance::_inspectSequenceStartPosition' has a wrong offset!");
static_assert(offsetof(UK31PowerSubAnimInstance, _inspectSequence) == 0x000390, "Member 'UK31PowerSubAnimInstance::_inspectSequence' has a wrong offset!");

// Class TheK31.ActivateK31DroneAction
// 0x0000 (0x0038 - 0x0038)
class UActivateK31DroneAction final : public UK31DroneChangeStateAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateK31DroneAction">();
	}
	static class UActivateK31DroneAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateK31DroneAction>();
	}
};
static_assert(alignof(UActivateK31DroneAction) == 0x000008, "Wrong alignment on UActivateK31DroneAction");
static_assert(sizeof(UActivateK31DroneAction) == 0x000038, "Wrong size on UActivateK31DroneAction");

// Class TheK31.ActiveDroneZoneLingeringEffect
// 0x0000 (0x03E8 - 0x03E8)
class UActiveDroneZoneLingeringEffect final : public UBaseLingeringStatusEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActiveDroneZoneLingeringEffect">();
	}
	static class UActiveDroneZoneLingeringEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveDroneZoneLingeringEffect>();
	}
};
static_assert(alignof(UActiveDroneZoneLingeringEffect) == 0x000008, "Wrong alignment on UActiveDroneZoneLingeringEffect");
static_assert(sizeof(UActiveDroneZoneLingeringEffect) == 0x0003E8, "Wrong size on UActiveDroneZoneLingeringEffect");

// Class TheK31.Addon_K31Power_01
// 0x0010 (0x02F8 - 0x02E8)
class UAddon_K31Power_01 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _modifySkillCheckDifficultyEffectClass;            // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _skillCheckDifficultyModifier;                     // 0x02F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_01">();
	}
	static class UAddon_K31Power_01* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_01>();
	}
};
static_assert(alignof(UAddon_K31Power_01) == 0x000008, "Wrong alignment on UAddon_K31Power_01");
static_assert(sizeof(UAddon_K31Power_01) == 0x0002F8, "Wrong size on UAddon_K31Power_01");
static_assert(offsetof(UAddon_K31Power_01, _modifySkillCheckDifficultyEffectClass) == 0x0002E8, "Member 'UAddon_K31Power_01::_modifySkillCheckDifficultyEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_01, _skillCheckDifficultyModifier) == 0x0002F0, "Member 'UAddon_K31Power_01::_skillCheckDifficultyModifier' has a wrong offset!");

// Class TheK31.Addon_K31Power_02
// 0x0008 (0x02F0 - 0x02E8)
class UAddon_K31Power_02 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _blindnessEffectClass;                             // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_02">();
	}
	static class UAddon_K31Power_02* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_02>();
	}
};
static_assert(alignof(UAddon_K31Power_02) == 0x000008, "Wrong alignment on UAddon_K31Power_02");
static_assert(sizeof(UAddon_K31Power_02) == 0x0002F0, "Wrong size on UAddon_K31Power_02");
static_assert(offsetof(UAddon_K31Power_02, _blindnessEffectClass) == 0x0002E8, "Member 'UAddon_K31Power_02::_blindnessEffectClass' has a wrong offset!");

// Class TheK31.Addon_K31Power_03
// 0x0010 (0x02F8 - 0x02E8)
class UAddon_K31Power_03 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _actionSpeedEffect;                                // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _actionSpeedEffectDuration;                        // 0x02F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_03">();
	}
	static class UAddon_K31Power_03* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_03>();
	}
};
static_assert(alignof(UAddon_K31Power_03) == 0x000008, "Wrong alignment on UAddon_K31Power_03");
static_assert(sizeof(UAddon_K31Power_03) == 0x0002F8, "Wrong size on UAddon_K31Power_03");
static_assert(offsetof(UAddon_K31Power_03, _actionSpeedEffect) == 0x0002E8, "Member 'UAddon_K31Power_03::_actionSpeedEffect' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_03, _actionSpeedEffectDuration) == 0x0002F0, "Member 'UAddon_K31Power_03::_actionSpeedEffectDuration' has a wrong offset!");

// Class TheK31.Addon_K31Power_13
// 0x0010 (0x02F8 - 0x02E8)
class UAddon_K31Power_13 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _exhaustedEffectClass;                             // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _exhaustedEffectDurationSeconds;                   // 0x02F0(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_13">();
	}
	static class UAddon_K31Power_13* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_13>();
	}
};
static_assert(alignof(UAddon_K31Power_13) == 0x000008, "Wrong alignment on UAddon_K31Power_13");
static_assert(sizeof(UAddon_K31Power_13) == 0x0002F8, "Wrong size on UAddon_K31Power_13");
static_assert(offsetof(UAddon_K31Power_13, _exhaustedEffectClass) == 0x0002E8, "Member 'UAddon_K31Power_13::_exhaustedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_13, _exhaustedEffectDurationSeconds) == 0x0002F0, "Member 'UAddon_K31Power_13::_exhaustedEffectDurationSeconds' has a wrong offset!");

// Class TheK31.Addon_K31Power_18
// 0x0008 (0x0310 - 0x0308)
class UAddon_K31Power_18 final : public USimpleSpawnEffectsOnAllSurvivorsAddon
{
public:
	float                                         _batteryPercent;                                   // 0x0308(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_18">();
	}
	static class UAddon_K31Power_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_18>();
	}
};
static_assert(alignof(UAddon_K31Power_18) == 0x000008, "Wrong alignment on UAddon_K31Power_18");
static_assert(sizeof(UAddon_K31Power_18) == 0x000310, "Wrong size on UAddon_K31Power_18");
static_assert(offsetof(UAddon_K31Power_18, _batteryPercent) == 0x000308, "Member 'UAddon_K31Power_18::_batteryPercent' has a wrong offset!");

// Class TheK31.Addon_K31Power_19
// 0x0000 (0x02E8 - 0x02E8)
class UAddon_K31Power_19 final : public UItemAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_19">();
	}
	static class UAddon_K31Power_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_19>();
	}
};
static_assert(alignof(UAddon_K31Power_19) == 0x000008, "Wrong alignment on UAddon_K31Power_19");
static_assert(sizeof(UAddon_K31Power_19) == 0x0002E8, "Wrong size on UAddon_K31Power_19");

// Class TheK31.Addon_K31Power_20
// 0x0088 (0x0370 - 0x02E8)
class UAddon_K31Power_20 final : public UItemAddon
{
public:
	float                                         _terrorRadiusSize;                                 // 0x02E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _terrorRadiusDuration;                             // 0x02EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<EK31DroneStateID>                      _allowedDroneStatesForEffectToApply;               // 0x02F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class AK31Drone*                              _targetDrone;                                      // 0x0300(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTerrorRadiusEmitterComponent*          _terrorRadius;                                     // 0x0308(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x30];                                     // 0x0310(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _indicatorEffectClass;                             // 0x0340(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _indicatorEffect;                                  // 0x0348(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _undetectableEffectClass;                          // 0x0350(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _undetectableEffect;                               // 0x0358(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x10];                                     // 0x0360(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnGameEventReceived(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
	void Authority_OnTerrorRadiusLifetimeTimerDone();
	void OnRep_TargetDrone();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K31Power_20">();
	}
	static class UAddon_K31Power_20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K31Power_20>();
	}
};
static_assert(alignof(UAddon_K31Power_20) == 0x000008, "Wrong alignment on UAddon_K31Power_20");
static_assert(sizeof(UAddon_K31Power_20) == 0x000370, "Wrong size on UAddon_K31Power_20");
static_assert(offsetof(UAddon_K31Power_20, _terrorRadiusSize) == 0x0002E8, "Member 'UAddon_K31Power_20::_terrorRadiusSize' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _terrorRadiusDuration) == 0x0002EC, "Member 'UAddon_K31Power_20::_terrorRadiusDuration' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _allowedDroneStatesForEffectToApply) == 0x0002F0, "Member 'UAddon_K31Power_20::_allowedDroneStatesForEffectToApply' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _targetDrone) == 0x000300, "Member 'UAddon_K31Power_20::_targetDrone' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _terrorRadius) == 0x000308, "Member 'UAddon_K31Power_20::_terrorRadius' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _indicatorEffectClass) == 0x000340, "Member 'UAddon_K31Power_20::_indicatorEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _indicatorEffect) == 0x000348, "Member 'UAddon_K31Power_20::_indicatorEffect' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _undetectableEffectClass) == 0x000350, "Member 'UAddon_K31Power_20::_undetectableEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K31Power_20, _undetectableEffect) == 0x000358, "Member 'UAddon_K31Power_20::_undetectableEffect' has a wrong offset!");

// Class TheK31.DeployDroneInteraction
// 0x0010 (0x0790 - 0x0780)
class UDeployDroneInteraction final : public UInteractionDefinition
{
public:
	bool                                          _shouldDeploymentSetPowerOnCooldown;               // 0x0778(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _canPlaceDroneWhilePowerIsOnCooldown;              // 0x0779(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_77A[0x16];                                     // 0x077A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeployDroneInteraction">();
	}
	static class UDeployDroneInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeployDroneInteraction>();
	}
};
static_assert(alignof(UDeployDroneInteraction) == 0x000010, "Wrong alignment on UDeployDroneInteraction");
static_assert(sizeof(UDeployDroneInteraction) == 0x000790, "Wrong size on UDeployDroneInteraction");
static_assert(offsetof(UDeployDroneInteraction, _shouldDeploymentSetPowerOnCooldown) == 0x000778, "Member 'UDeployDroneInteraction::_shouldDeploymentSetPowerOnCooldown' has a wrong offset!");
static_assert(offsetof(UDeployDroneInteraction, _canPlaceDroneWhilePowerIsOnCooldown) == 0x000779, "Member 'UDeployDroneInteraction::_canPlaceDroneWhilePowerIsOnCooldown' has a wrong offset!");

// Class TheK31.DroneRestrictedPlacementAreaStrategy
// 0x0020 (0x00C8 - 0x00A8)
class UDroneRestrictedPlacementAreaStrategy final : public URestrictedPlacementAreaStrategy
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDroneAcquiredChanged(const bool Acquired);
	void OnDroneEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DroneRestrictedPlacementAreaStrategy">();
	}
	static class UDroneRestrictedPlacementAreaStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDroneRestrictedPlacementAreaStrategy>();
	}
};
static_assert(alignof(UDroneRestrictedPlacementAreaStrategy) == 0x000008, "Wrong alignment on UDroneRestrictedPlacementAreaStrategy");
static_assert(sizeof(UDroneRestrictedPlacementAreaStrategy) == 0x0000C8, "Wrong size on UDroneRestrictedPlacementAreaStrategy");

// Class TheK31.HackableDroneState
// 0x0000 (0x0030 - 0x0030)
class IHackableDroneState final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HackableDroneState">();
	}
	static class IHackableDroneState* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHackableDroneState>();
	}
};
static_assert(alignof(IHackableDroneState) == 0x000008, "Wrong alignment on IHackableDroneState");
static_assert(sizeof(IHackableDroneState) == 0x000030, "Wrong size on IHackableDroneState");

// Class TheK31.HitPlayerAfterRecentDetectionScoreEmitter
// 0x0088 (0x00C0 - 0x0038)
class UHitPlayerAfterRecentDetectionScoreEmitter final : public UPlayerScoreEmitter
{
public:
	float                                         _timeSinceDetectionDuration;                       // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           _scoreEvent;                                       // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class ADBDPlayer*, float>                _trackers;                                         // 0x0048(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x28];                                      // 0x0098(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HitPlayerAfterRecentDetectionScoreEmitter">();
	}
	static class UHitPlayerAfterRecentDetectionScoreEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitPlayerAfterRecentDetectionScoreEmitter>();
	}
};
static_assert(alignof(UHitPlayerAfterRecentDetectionScoreEmitter) == 0x000008, "Wrong alignment on UHitPlayerAfterRecentDetectionScoreEmitter");
static_assert(sizeof(UHitPlayerAfterRecentDetectionScoreEmitter) == 0x0000C0, "Wrong size on UHitPlayerAfterRecentDetectionScoreEmitter");
static_assert(offsetof(UHitPlayerAfterRecentDetectionScoreEmitter, _timeSinceDetectionDuration) == 0x000038, "Member 'UHitPlayerAfterRecentDetectionScoreEmitter::_timeSinceDetectionDuration' has a wrong offset!");
static_assert(offsetof(UHitPlayerAfterRecentDetectionScoreEmitter, _scoreEvent) == 0x00003C, "Member 'UHitPlayerAfterRecentDetectionScoreEmitter::_scoreEvent' has a wrong offset!");
static_assert(offsetof(UHitPlayerAfterRecentDetectionScoreEmitter, _trackers) == 0x000048, "Member 'UHitPlayerAfterRecentDetectionScoreEmitter::_trackers' has a wrong offset!");

// Class TheK31.HitPlayerInActiveZoneScoreEmitter
// 0x0080 (0x00B8 - 0x0038)
class UHitPlayerInActiveZoneScoreEmitter final : public UPlayerScoreEmitter
{
public:
	float                                         _activeZoneLingeringDuration;                      // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           _scoreEvent;                                       // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class AActor*, struct FActiveZoneOverlapTracker> _trackers;                                         // 0x0048(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HitPlayerInActiveZoneScoreEmitter">();
	}
	static class UHitPlayerInActiveZoneScoreEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitPlayerInActiveZoneScoreEmitter>();
	}
};
static_assert(alignof(UHitPlayerInActiveZoneScoreEmitter) == 0x000008, "Wrong alignment on UHitPlayerInActiveZoneScoreEmitter");
static_assert(sizeof(UHitPlayerInActiveZoneScoreEmitter) == 0x0000B8, "Wrong size on UHitPlayerInActiveZoneScoreEmitter");
static_assert(offsetof(UHitPlayerInActiveZoneScoreEmitter, _activeZoneLingeringDuration) == 0x000038, "Member 'UHitPlayerInActiveZoneScoreEmitter::_activeZoneLingeringDuration' has a wrong offset!");
static_assert(offsetof(UHitPlayerInActiveZoneScoreEmitter, _scoreEvent) == 0x00003C, "Member 'UHitPlayerInActiveZoneScoreEmitter::_scoreEvent' has a wrong offset!");
static_assert(offsetof(UHitPlayerInActiveZoneScoreEmitter, _trackers) == 0x000048, "Member 'UHitPlayerInActiveZoneScoreEmitter::_trackers' has a wrong offset!");

// Class TheK31.InspectK31DroneInteraction
// 0x0180 (0x0A40 - 0x08C0)
class UInspectK31DroneInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x18];                                     // 0x08C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UK31DroneActionProcessor>   _actionProcessorClass;                             // 0x08D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _inputInterval;                                    // 0x08E0(0x0028)(Edit, DisableEditOnInstance, NoClear, NativeAccessSpecifierPrivate)
	bool                                          _enableMaxSpeedSlowdown;                           // 0x0908(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_909[0x7];                                      // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _chargingSpeedCurve;                               // 0x0910(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _dechargingSpeedCurve;                             // 0x0918(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_920[0x28];                                     // 0x0920(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UK31DroneActionProcessor*               _actionProcessor;                                  // 0x0948(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_950[0xF0];                                     // 0x0950(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChargeCompletedChanged(bool COMPLETED, const TArray<class AActor*>& InstigatorsForCompletion);
	void Server_SetIsPressingInput(bool IsPressing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InspectK31DroneInteraction">();
	}
	static class UInspectK31DroneInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInspectK31DroneInteraction>();
	}
};
static_assert(alignof(UInspectK31DroneInteraction) == 0x000010, "Wrong alignment on UInspectK31DroneInteraction");
static_assert(sizeof(UInspectK31DroneInteraction) == 0x000A40, "Wrong size on UInspectK31DroneInteraction");
static_assert(offsetof(UInspectK31DroneInteraction, _actionProcessorClass) == 0x0008D8, "Member 'UInspectK31DroneInteraction::_actionProcessorClass' has a wrong offset!");
static_assert(offsetof(UInspectK31DroneInteraction, _inputInterval) == 0x0008E0, "Member 'UInspectK31DroneInteraction::_inputInterval' has a wrong offset!");
static_assert(offsetof(UInspectK31DroneInteraction, _enableMaxSpeedSlowdown) == 0x000908, "Member 'UInspectK31DroneInteraction::_enableMaxSpeedSlowdown' has a wrong offset!");
static_assert(offsetof(UInspectK31DroneInteraction, _chargingSpeedCurve) == 0x000910, "Member 'UInspectK31DroneInteraction::_chargingSpeedCurve' has a wrong offset!");
static_assert(offsetof(UInspectK31DroneInteraction, _dechargingSpeedCurve) == 0x000918, "Member 'UInspectK31DroneInteraction::_dechargingSpeedCurve' has a wrong offset!");
static_assert(offsetof(UInspectK31DroneInteraction, _actionProcessor) == 0x000948, "Member 'UInspectK31DroneInteraction::_actionProcessor' has a wrong offset!");

// Class TheK31.K31AnalyticsComponent
// 0x0018 (0x00C0 - 0x00A8)
class UK31AnalyticsComponent final : public UActorComponent
{
public:
	float                                         _analyticInspectionTime;                           // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x14];                                      // 0x00AC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31AnalyticsComponent">();
	}
	static class UK31AnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31AnalyticsComponent>();
	}
};
static_assert(alignof(UK31AnalyticsComponent) == 0x000008, "Wrong alignment on UK31AnalyticsComponent");
static_assert(sizeof(UK31AnalyticsComponent) == 0x0000C0, "Wrong size on UK31AnalyticsComponent");
static_assert(offsetof(UK31AnalyticsComponent, _analyticInspectionTime) == 0x0000A8, "Member 'UK31AnalyticsComponent::_analyticInspectionTime' has a wrong offset!");

// Class TheK31.K31AnimInstance
// 0x0040 (0x0760 - 0x0720)
class UK31AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isInspecting;                                     // 0x0720(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDeployingADrone;                                // 0x0721(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isReceivingADronePassively;                       // 0x0722(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isRecallingADrone;                                // 0x0723(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActivatingADrone;                               // 0x0724(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_725[0x3];                                      // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationAnimationSelector*        _animationSelector;                                // 0x0728(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_730[0x30];                                     // 0x0730(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCustomizationAnimationMappingIDChanged(int32 AnimationMappingIndex);
	void OnGameEventReceived(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
	void ResetIsActivatingADrone();
	void ResetIsDeployingADrone();
	void ResetIsRecallingADrone();
	void ResetIsReceivingADronePassively();

	TArray<class FName> GetCustoAnimTags() const;
	int32 GetCustomizationMappingID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31AnimInstance">();
	}
	static class UK31AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31AnimInstance>();
	}
};
static_assert(alignof(UK31AnimInstance) == 0x000010, "Wrong alignment on UK31AnimInstance");
static_assert(sizeof(UK31AnimInstance) == 0x000760, "Wrong size on UK31AnimInstance");
static_assert(offsetof(UK31AnimInstance, _isInspecting) == 0x000720, "Member 'UK31AnimInstance::_isInspecting' has a wrong offset!");
static_assert(offsetof(UK31AnimInstance, _isDeployingADrone) == 0x000721, "Member 'UK31AnimInstance::_isDeployingADrone' has a wrong offset!");
static_assert(offsetof(UK31AnimInstance, _isReceivingADronePassively) == 0x000722, "Member 'UK31AnimInstance::_isReceivingADronePassively' has a wrong offset!");
static_assert(offsetof(UK31AnimInstance, _isRecallingADrone) == 0x000723, "Member 'UK31AnimInstance::_isRecallingADrone' has a wrong offset!");
static_assert(offsetof(UK31AnimInstance, _isActivatingADrone) == 0x000724, "Member 'UK31AnimInstance::_isActivatingADrone' has a wrong offset!");
static_assert(offsetof(UK31AnimInstance, _animationSelector) == 0x000728, "Member 'UK31AnimInstance::_animationSelector' has a wrong offset!");

// Class TheK31.K31ClawTrap
// 0x0000 (0x02A0 - 0x02A0)
class AK31ClawTrap final : public AActor
{
public:
	void Cosmetic_OnAddedByDrone(class AK31Drone* OriginatingDrone, float ClawTrapCosmeticDelayDuration);
	void Cosmetic_OnBatteryChargeUpdated(float NewCharge);
	void Cosmetic_OnIsBroadcastingChanged(bool IsBroadcasting);
	void Cosmetic_OnTrapAdded();
	void Cosmetic_OnTrapRemoved(bool WasRemovedAutomatically);
	void Cosmetic_Spark();
	void OnAnimNotifyManuallyRemoveTrap();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31ClawTrap">();
	}
	static class AK31ClawTrap* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK31ClawTrap>();
	}
};
static_assert(alignof(AK31ClawTrap) == 0x000008, "Wrong alignment on AK31ClawTrap");
static_assert(sizeof(AK31ClawTrap) == 0x0002A0, "Wrong size on AK31ClawTrap");

// Class TheK31.K31Drone
// 0x00E8 (0x0490 - 0x03A8)
class AK31Drone final : public AInteractable
{
public:
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        _movingRootComponent;                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChildActorComponent*                   _laserChildActorComponent;                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneLaserController*               _laserController;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDSkeletalMeshComponentBudgeted*      _droneMesh;                                        // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _activeZoneMesh;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneMovementComponent*             _movementComponent;                                // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneFlightController*              _flightController;                                 // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthoritativePoolableActorComponent*   _poolableActorComponent;                           // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneOwnershipComponent*            _ownershipComponent;                               // 0x03F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneStateController*               _stateController;                                  // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneDebugComponent*                _debugComponent;                                   // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneZoneComponent*                 _droneZoneComponent;                               // 0x0410(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31TrapProximitySensor*                _trapProximitySensor;                              // 0x0418(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DronePlacementRecaller*             _placementRecallerComponent;                       // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneHackableComponent*             _hackableComponent;                                // 0x0428(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneHackableAvoidanceSensor*       _avoidanceSensor;                                  // 0x0430(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDeployDroneInteraction*                _deployInteraction;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDNavModifierComponent*               _navModifierComponent;                             // 0x0440(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK31DroneDangerPredictionComponent*     _dangerPredictionComponent;                        // 0x0448(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMapActorComponent*                     _droneMapActorComponent;                           // 0x0450(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _lastOwner;                                        // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULocalPlayerTrackerComponent*           _localPlayerTracker;                               // 0x0460(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_468[0x28];                                     // 0x0468(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnIsHackableStateChanged(bool IsHackable);
	void Cosmetic_OnLocallyObservedChanged();
	void Cosmetic_OnRevertToScoutingCurrentChargeChanged(float ChargePercentage);
	void Native_OnLocallyObservedChanged();
	void OnAcquiredChanged(const bool Acquired);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31Drone">();
	}
	static class AK31Drone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK31Drone>();
	}
};
static_assert(alignof(AK31Drone) == 0x000008, "Wrong alignment on AK31Drone");
static_assert(sizeof(AK31Drone) == 0x000490, "Wrong size on AK31Drone");
static_assert(offsetof(AK31Drone, _movingRootComponent) == 0x0003B8, "Member 'AK31Drone::_movingRootComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _laserChildActorComponent) == 0x0003C0, "Member 'AK31Drone::_laserChildActorComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _laserController) == 0x0003C8, "Member 'AK31Drone::_laserController' has a wrong offset!");
static_assert(offsetof(AK31Drone, _droneMesh) == 0x0003D0, "Member 'AK31Drone::_droneMesh' has a wrong offset!");
static_assert(offsetof(AK31Drone, _activeZoneMesh) == 0x0003D8, "Member 'AK31Drone::_activeZoneMesh' has a wrong offset!");
static_assert(offsetof(AK31Drone, _movementComponent) == 0x0003E0, "Member 'AK31Drone::_movementComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _flightController) == 0x0003E8, "Member 'AK31Drone::_flightController' has a wrong offset!");
static_assert(offsetof(AK31Drone, _poolableActorComponent) == 0x0003F0, "Member 'AK31Drone::_poolableActorComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _ownershipComponent) == 0x0003F8, "Member 'AK31Drone::_ownershipComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _stateController) == 0x000400, "Member 'AK31Drone::_stateController' has a wrong offset!");
static_assert(offsetof(AK31Drone, _debugComponent) == 0x000408, "Member 'AK31Drone::_debugComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _droneZoneComponent) == 0x000410, "Member 'AK31Drone::_droneZoneComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _trapProximitySensor) == 0x000418, "Member 'AK31Drone::_trapProximitySensor' has a wrong offset!");
static_assert(offsetof(AK31Drone, _placementRecallerComponent) == 0x000420, "Member 'AK31Drone::_placementRecallerComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _hackableComponent) == 0x000428, "Member 'AK31Drone::_hackableComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _avoidanceSensor) == 0x000430, "Member 'AK31Drone::_avoidanceSensor' has a wrong offset!");
static_assert(offsetof(AK31Drone, _deployInteraction) == 0x000438, "Member 'AK31Drone::_deployInteraction' has a wrong offset!");
static_assert(offsetof(AK31Drone, _navModifierComponent) == 0x000440, "Member 'AK31Drone::_navModifierComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _dangerPredictionComponent) == 0x000448, "Member 'AK31Drone::_dangerPredictionComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _droneMapActorComponent) == 0x000450, "Member 'AK31Drone::_droneMapActorComponent' has a wrong offset!");
static_assert(offsetof(AK31Drone, _lastOwner) == 0x000458, "Member 'AK31Drone::_lastOwner' has a wrong offset!");
static_assert(offsetof(AK31Drone, _localPlayerTracker) == 0x000460, "Member 'AK31Drone::_localPlayerTracker' has a wrong offset!");

// Class TheK31.K31DroneActionProcessor
// 0x0000 (0x00A8 - 0x00A8)
class UK31DroneActionProcessor final : public UActorComponent
{
public:
	void Client_ReceiveActionResponse(const struct FK31DroneActionResponse& Response);
	void Server_RequestAction(const struct FK31DroneActionRequest& Request);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneActionProcessor">();
	}
	static class UK31DroneActionProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneActionProcessor>();
	}
};
static_assert(alignof(UK31DroneActionProcessor) == 0x000008, "Wrong alignment on UK31DroneActionProcessor");
static_assert(sizeof(UK31DroneActionProcessor) == 0x0000A8, "Wrong size on UK31DroneActionProcessor");

// Class TheK31.K31DroneState
// 0x0028 (0x0058 - 0x0030)
class UK31DroneState : public UObject
{
public:
	EK31DroneStateID                              _id;                                               // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UK31DroneStateController*               _stateController;                                  // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneState">();
	}
	static class UK31DroneState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneState>();
	}
};
static_assert(alignof(UK31DroneState) == 0x000008, "Wrong alignment on UK31DroneState");
static_assert(sizeof(UK31DroneState) == 0x000058, "Wrong size on UK31DroneState");
static_assert(offsetof(UK31DroneState, _id) == 0x000030, "Member 'UK31DroneState::_id' has a wrong offset!");
static_assert(offsetof(UK31DroneState, _stateController) == 0x000038, "Member 'UK31DroneState::_stateController' has a wrong offset!");

// Class TheK31.K31DroneActiveState
// 0x03B8 (0x0410 - 0x0058)
class UK31DroneActiveState final : public UK31DroneState
{
public:
	uint8                                         Pad_58[0x20];                                      // 0x0058(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatProperty                          _unhackableDuration;                               // 0x0078(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _revertToScoutingMaxDuration;                      // 0x0100(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _revertToScoutingMinDuration;                      // 0x0188(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _revertToScoutingRechargeRate;                     // 0x0210(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _revertToScoutingDechargeRate;                     // 0x0298(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FStatProperty                          _revertToScoutingDechargeDelay;                    // 0x0320(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          _doNearbyClawTrapsDisableHacking;                  // 0x03A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChargeableComponent*                   _revertToScoutingCharge;                           // 0x03B0(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTimerObject*                           _unhackableTimer;                                  // 0x03B8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x50];                                     // 0x03C0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnChargeDepleted();
	float GetRevertToScoutingCurrentCharge();
	float GetRevertToScoutingMaxCharge();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneActiveState">();
	}
	static class UK31DroneActiveState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneActiveState>();
	}
};
static_assert(alignof(UK31DroneActiveState) == 0x000008, "Wrong alignment on UK31DroneActiveState");
static_assert(sizeof(UK31DroneActiveState) == 0x000410, "Wrong size on UK31DroneActiveState");
static_assert(offsetof(UK31DroneActiveState, _unhackableDuration) == 0x000078, "Member 'UK31DroneActiveState::_unhackableDuration' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _revertToScoutingMaxDuration) == 0x000100, "Member 'UK31DroneActiveState::_revertToScoutingMaxDuration' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _revertToScoutingMinDuration) == 0x000188, "Member 'UK31DroneActiveState::_revertToScoutingMinDuration' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _revertToScoutingRechargeRate) == 0x000210, "Member 'UK31DroneActiveState::_revertToScoutingRechargeRate' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _revertToScoutingDechargeRate) == 0x000298, "Member 'UK31DroneActiveState::_revertToScoutingDechargeRate' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _revertToScoutingDechargeDelay) == 0x000320, "Member 'UK31DroneActiveState::_revertToScoutingDechargeDelay' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _doNearbyClawTrapsDisableHacking) == 0x0003A8, "Member 'UK31DroneActiveState::_doNearbyClawTrapsDisableHacking' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _revertToScoutingCharge) == 0x0003B0, "Member 'UK31DroneActiveState::_revertToScoutingCharge' has a wrong offset!");
static_assert(offsetof(UK31DroneActiveState, _unhackableTimer) == 0x0003B8, "Member 'UK31DroneActiveState::_unhackableTimer' has a wrong offset!");

// Class TheK31.K31DroneAnimInstance
// 0x0020 (0x0370 - 0x0350)
class UK31DroneAnimInstance final : public UAnimInstance
{
public:
	EK31DroneStateID                              _droneState;                                       // 0x0350(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UK31DroneStateController*               _droneStateController;                             // 0x0358(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AK31Drone*                              _owningDrone;                                      // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneAnimInstance">();
	}
	static class UK31DroneAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneAnimInstance>();
	}
};
static_assert(alignof(UK31DroneAnimInstance) == 0x000010, "Wrong alignment on UK31DroneAnimInstance");
static_assert(sizeof(UK31DroneAnimInstance) == 0x000370, "Wrong size on UK31DroneAnimInstance");
static_assert(offsetof(UK31DroneAnimInstance, _droneState) == 0x000350, "Member 'UK31DroneAnimInstance::_droneState' has a wrong offset!");
static_assert(offsetof(UK31DroneAnimInstance, _droneStateController) == 0x000358, "Member 'UK31DroneAnimInstance::_droneStateController' has a wrong offset!");
static_assert(offsetof(UK31DroneAnimInstance, _owningDrone) == 0x000360, "Member 'UK31DroneAnimInstance::_owningDrone' has a wrong offset!");

// Class TheK31.K31DroneBeingDeployed
// 0x0000 (0x0058 - 0x0058)
class UK31DroneBeingDeployed final : public UK31DroneState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneBeingDeployed">();
	}
	static class UK31DroneBeingDeployed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneBeingDeployed>();
	}
};
static_assert(alignof(UK31DroneBeingDeployed) == 0x000008, "Wrong alignment on UK31DroneBeingDeployed");
static_assert(sizeof(UK31DroneBeingDeployed) == 0x000058, "Wrong size on UK31DroneBeingDeployed");

// Class TheK31.K31DroneBeingHackedState
// 0x0020 (0x0078 - 0x0058)
class UK31DroneBeingHackedState final : public UK31DroneState
{
public:
	uint8                                         Pad_58[0x20];                                      // 0x0058(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneBeingHackedState">();
	}
	static class UK31DroneBeingHackedState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneBeingHackedState>();
	}
};
static_assert(alignof(UK31DroneBeingHackedState) == 0x000008, "Wrong alignment on UK31DroneBeingHackedState");
static_assert(sizeof(UK31DroneBeingHackedState) == 0x000078, "Wrong size on UK31DroneBeingHackedState");

// Class TheK31.K31DroneDangerPredictionComponent
// 0x0080 (0x0190 - 0x0110)
class UK31DroneDangerPredictionComponent final : public UDBDDangerPredictionComponent
{
public:
	uint8                                         Pad_110[0x50];                                     // 0x0110(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _minimumTraverseAngle;                             // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maximumTraverseAngle;                             // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _crouchRangeMargin;                                // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _crouchingHeightDifference;                        // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _crouchAngleNumerator;                             // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _crouchRotatingSpeedPercentAngleMargin;            // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxCrouchRange;                                   // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _activeUnhackableWeight;                           // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _activeHackableWeight;                             // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _scoutingWeight;                                   // 0x0184(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K31DroneDangerPredictionComponent">();
	}
	static class UK31DroneDangerPredictionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK31DroneDangerPredictionComponent>();
	}
};
static_assert(alignof(UK31DroneDangerPredictionComponent) == 0x000008, "Wrong alignment on UK31DroneDangerPredictionComponent");
static_assert(sizeof(UK31DroneDangerPredictionComponent) == 0x000190, "Wrong size on UK31DroneDangerPredictionComponent");
static_assert(offsetof(UK31DroneDangerPredictionComponent, _minimumTraverseAngle) == 0x000160, "Member 'UK31DroneDangerPredictionComponent::_minimumTraverseAngle' has a wrong offset!");
