#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK24

#include "Basic.hpp"

#include "DataTableUtilities_structs.hpp"
#include "TheK24_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDGameplay_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDBots_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "StatSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDAttack_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"


namespace SDK
{

// Class TheK24.ZombieBlindingFXComponent
// 0x0000 (0x0140 - 0x0140)
class UZombieBlindingFXComponent final : public UKillerBlindingFXComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieBlindingFXComponent">();
	}
	static class UZombieBlindingFXComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieBlindingFXComponent>();
	}
};
static_assert(alignof(UZombieBlindingFXComponent) == 0x000008, "Wrong alignment on UZombieBlindingFXComponent");
static_assert(sizeof(UZombieBlindingFXComponent) == 0x000140, "Wrong size on UZombieBlindingFXComponent");

// Class TheK24.ActivateK24PowerInteraction
// 0x0090 (0x0950 - 0x08C0)
class UActivateK24PowerInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x10];                                     // 0x08C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _interactionViewPitchMax;                          // 0x08D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMin;                          // 0x08F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maximumTimeToTriggerRegularAttack;                // 0x0920(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetK24Power(class AK24Power* K24Power);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateK24PowerInteraction">();
	}
	static class UActivateK24PowerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateK24PowerInteraction>();
	}
};
static_assert(alignof(UActivateK24PowerInteraction) == 0x000010, "Wrong alignment on UActivateK24PowerInteraction");
static_assert(sizeof(UActivateK24PowerInteraction) == 0x000950, "Wrong size on UActivateK24PowerInteraction");
static_assert(offsetof(UActivateK24PowerInteraction, _interactionViewPitchMax) == 0x0008D0, "Member 'UActivateK24PowerInteraction::_interactionViewPitchMax' has a wrong offset!");
static_assert(offsetof(UActivateK24PowerInteraction, _interactionViewPitchMin) == 0x0008F8, "Member 'UActivateK24PowerInteraction::_interactionViewPitchMin' has a wrong offset!");
static_assert(offsetof(UActivateK24PowerInteraction, _maximumTimeToTriggerRegularAttack) == 0x000920, "Member 'UActivateK24PowerInteraction::_maximumTimeToTriggerRegularAttack' has a wrong offset!");

// Class TheK24.ZombieCharacter
// 0x0390 (0x09E0 - 0x0650)
class AZombieCharacter final : public ACharacter
{
public:
	uint8                                         Pad_650[0x40];                                     // 0x0650(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _zombieWalkSpeed;                                  // 0x0690(0x0080)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_710[0x8];                                      // 0x0710(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthoritativePoolableActorComponent*   _poolableComponent;                                // 0x0718(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USphereComponent*                       _zombieAttackDetector;                             // 0x0720(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   _attackDamageZone;                                 // 0x0728(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EZombieState                                  _zombieState;                                      // 0x0730(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_731[0x3F];                                     // 0x0731(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _zombieRespawnTimeKilledBySlasher;                 // 0x0770(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _zombieRespawnTimeKilledBySurvivor;                // 0x07F0(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FTransform                             _respawnPositionBehindGate;                        // 0x0870(0x0060)(Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EZombieGender                                 _zombieGender;                                     // 0x08D0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         _owningKiller;                                     // 0x08D8(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMesh*                          _femaleSkeletalMesh;                               // 0x08E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 _audioSwitchState;                                 // 0x08E8(0x0010)(Edit, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UZombieBlindableComponent*              _blindableComponent;                               // 0x08F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _blindingChargeableComponent;                      // 0x0900(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URangedExplosiveEffectHandlerComponent* _rangedExplosiveEffectHandlerComponent;            // 0x0908(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFlashlightableComponent*               _flashLightableComponent;                          // 0x0910(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_918[0x50];                                     // 0x0918(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _zombieStunBaseTime;                               // 0x0968(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UGameplayTagContainerComponent*         _objectState;                                      // 0x0990(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_998[0x8];                                      // 0x0998(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterPositionRecorderComponent*    _positionRecorder;                                 // 0x09A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthoritativeMovementComponent*        _authoritativeMovementComponent;                   // 0x09A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOtherCharactersVerticalCollisionsHandler* _otherCharactersVerticalCollisionsHandler;         // 0x09B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         _ignoreActors;                                     // 0x09B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C8[0x4];                                      // 0x09C8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _zombieStunnedCapsuleRadius;                       // 0x09CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minFallHeight;                                    // 0x09D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9D4[0x8];                                      // 0x09D4(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _afterInAirAttackCooldown;                         // 0x09DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_DeactivateZombieAndStartRespawnTimer();
	void Authority_OnFlashlightAdded(const class UFlashlightComponent* Flashlight);
	void Authority_OnFlashlightRemoved(const class UFlashlightComponent* Flashlight);
	void Authority_OnRangedExplosiveInRangeBegin(const struct FRangedExplosiveEffectData& EffectData);
	void Authority_OnZombieStateChanged(EZombieState ZombieState);
	void Multicast_ZombieKilledByKillerCosmetic(EAttackType AttackType);
	void OnBeginOverlapZombieAttackDetector(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndOverlapZombieAttackDetector(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnFemaleGenderSet_Cosmetic();
	void OnRep_OwningKiller();
	void OnRep_ZombieGender();
	void OnRep_ZombieState(EZombieState PreviousState);
	void OnZombieStateChanged_Cosmetic(EZombieState ZombieState);
	void SetCharacterActive_Cosmetic(const bool Value);
	void ZombieKilledByKiller_Cosmetic(EAttackType AttackType);

	class FString GetAudioSwitchState() const;
	class UAuthoritativeMovementComponent* GetAuthoritativeMovementComponent() const;
	class UOtherCharactersVerticalCollisionsHandler* GetOtherCharactersVerticalCollisionsHandler() const;
	EZombieGender GetZombieGender() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieCharacter">();
	}
	static class AZombieCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombieCharacter>();
	}
};
static_assert(alignof(AZombieCharacter) == 0x000010, "Wrong alignment on AZombieCharacter");
static_assert(sizeof(AZombieCharacter) == 0x0009E0, "Wrong size on AZombieCharacter");
static_assert(offsetof(AZombieCharacter, _zombieWalkSpeed) == 0x000690, "Member 'AZombieCharacter::_zombieWalkSpeed' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _poolableComponent) == 0x000718, "Member 'AZombieCharacter::_poolableComponent' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieAttackDetector) == 0x000720, "Member 'AZombieCharacter::_zombieAttackDetector' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _attackDamageZone) == 0x000728, "Member 'AZombieCharacter::_attackDamageZone' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieState) == 0x000730, "Member 'AZombieCharacter::_zombieState' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieRespawnTimeKilledBySlasher) == 0x000770, "Member 'AZombieCharacter::_zombieRespawnTimeKilledBySlasher' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieRespawnTimeKilledBySurvivor) == 0x0007F0, "Member 'AZombieCharacter::_zombieRespawnTimeKilledBySurvivor' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _respawnPositionBehindGate) == 0x000870, "Member 'AZombieCharacter::_respawnPositionBehindGate' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieGender) == 0x0008D0, "Member 'AZombieCharacter::_zombieGender' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _owningKiller) == 0x0008D8, "Member 'AZombieCharacter::_owningKiller' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _femaleSkeletalMesh) == 0x0008E0, "Member 'AZombieCharacter::_femaleSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _audioSwitchState) == 0x0008E8, "Member 'AZombieCharacter::_audioSwitchState' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _blindableComponent) == 0x0008F8, "Member 'AZombieCharacter::_blindableComponent' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _blindingChargeableComponent) == 0x000900, "Member 'AZombieCharacter::_blindingChargeableComponent' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _rangedExplosiveEffectHandlerComponent) == 0x000908, "Member 'AZombieCharacter::_rangedExplosiveEffectHandlerComponent' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _flashLightableComponent) == 0x000910, "Member 'AZombieCharacter::_flashLightableComponent' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieStunBaseTime) == 0x000968, "Member 'AZombieCharacter::_zombieStunBaseTime' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _objectState) == 0x000990, "Member 'AZombieCharacter::_objectState' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _positionRecorder) == 0x0009A0, "Member 'AZombieCharacter::_positionRecorder' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _authoritativeMovementComponent) == 0x0009A8, "Member 'AZombieCharacter::_authoritativeMovementComponent' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _otherCharactersVerticalCollisionsHandler) == 0x0009B0, "Member 'AZombieCharacter::_otherCharactersVerticalCollisionsHandler' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _ignoreActors) == 0x0009B8, "Member 'AZombieCharacter::_ignoreActors' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _zombieStunnedCapsuleRadius) == 0x0009CC, "Member 'AZombieCharacter::_zombieStunnedCapsuleRadius' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _minFallHeight) == 0x0009D0, "Member 'AZombieCharacter::_minFallHeight' has a wrong offset!");
static_assert(offsetof(AZombieCharacter, _afterInAirAttackCooldown) == 0x0009DC, "Member 'AZombieCharacter::_afterInAirAttackCooldown' has a wrong offset!");

// Class TheK24.Addon_K24_04
// 0x0018 (0x0310 - 0x02F8)
class UAddon_K24_04 final : public UOnEventBaseAddon
{
public:
	float                                         _effectTime;                                       // 0x02F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           OutlineColor;                                      // 0x02FC(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K24_04">();
	}
	static class UAddon_K24_04* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K24_04>();
	}
};
static_assert(alignof(UAddon_K24_04) == 0x000008, "Wrong alignment on UAddon_K24_04");
static_assert(sizeof(UAddon_K24_04) == 0x000310, "Wrong size on UAddon_K24_04");
static_assert(offsetof(UAddon_K24_04, _effectTime) == 0x0002F8, "Member 'UAddon_K24_04::_effectTime' has a wrong offset!");
static_assert(offsetof(UAddon_K24_04, OutlineColor) == 0x0002FC, "Member 'UAddon_K24_04::OutlineColor' has a wrong offset!");

// Class TheK24.ZombieChaseStateBTService
// 0x0000 (0x00A0 - 0x00A0)
class UZombieChaseStateBTService final : public UBTService_BlueprintBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieChaseStateBTService">();
	}
	static class UZombieChaseStateBTService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieChaseStateBTService>();
	}
};
static_assert(alignof(UZombieChaseStateBTService) == 0x000008, "Wrong alignment on UZombieChaseStateBTService");
static_assert(sizeof(UZombieChaseStateBTService) == 0x0000A0, "Wrong size on UZombieChaseStateBTService");

// Class TheK24.Addon_K24_18
// 0x0008 (0x0318 - 0x0310)
class UAddon_K24_18 final : public UImposeStatusEffectOnEventAddon
{
public:
	TSubclassOf<class AZombieEscapeDoorPointsActor> _zombieEscapeDoorPointsActor;                      // 0x0310(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K24_18">();
	}
	static class UAddon_K24_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K24_18>();
	}
};
static_assert(alignof(UAddon_K24_18) == 0x000008, "Wrong alignment on UAddon_K24_18");
static_assert(sizeof(UAddon_K24_18) == 0x000318, "Wrong size on UAddon_K24_18");
static_assert(offsetof(UAddon_K24_18, _zombieEscapeDoorPointsActor) == 0x000310, "Member 'UAddon_K24_18::_zombieEscapeDoorPointsActor' has a wrong offset!");

// Class TheK24.ZombiesManagement
// 0x00C8 (0x0368 - 0x02A0)
class AZombiesManagement final : public AActor
{
public:
	uint8                                         Pad_2A0[0x10];                                     // 0x02A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthoritativeActorPoolComponent*       _zombiePool;                                       // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UZombiesPatrolAreaManager*              _zombiesPatrolAreaManager;                         // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AZombieCharacter*>               _spawnedZombiesArray;                              // 0x02C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D0[0x38];                                     // 0x02D0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _firstZombieSpawnTime;                             // 0x0308(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _numberOfZombieToSpawnAtStart;                     // 0x0330(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class AZombieEscapeDoorPointsActor*>   _zombieEscapeDoorPoints;                           // 0x0358(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void Authority_OnIntroComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombiesManagement">();
	}
	static class AZombiesManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombiesManagement>();
	}
};
static_assert(alignof(AZombiesManagement) == 0x000008, "Wrong alignment on AZombiesManagement");
static_assert(sizeof(AZombiesManagement) == 0x000368, "Wrong size on AZombiesManagement");
static_assert(offsetof(AZombiesManagement, _zombiePool) == 0x0002B0, "Member 'AZombiesManagement::_zombiePool' has a wrong offset!");
static_assert(offsetof(AZombiesManagement, _zombiesPatrolAreaManager) == 0x0002B8, "Member 'AZombiesManagement::_zombiesPatrolAreaManager' has a wrong offset!");
static_assert(offsetof(AZombiesManagement, _spawnedZombiesArray) == 0x0002C0, "Member 'AZombiesManagement::_spawnedZombiesArray' has a wrong offset!");
static_assert(offsetof(AZombiesManagement, _firstZombieSpawnTime) == 0x000308, "Member 'AZombiesManagement::_firstZombieSpawnTime' has a wrong offset!");
static_assert(offsetof(AZombiesManagement, _numberOfZombieToSpawnAtStart) == 0x000330, "Member 'AZombiesManagement::_numberOfZombieToSpawnAtStart' has a wrong offset!");
static_assert(offsetof(AZombiesManagement, _zombieEscapeDoorPoints) == 0x000358, "Member 'AZombiesManagement::_zombieEscapeDoorPoints' has a wrong offset!");

// Class TheK24.BTTask_MoveToAbortIfStuck
// 0x0028 (0x00E8 - 0x00C0)
class UBTTask_MoveToAbortIfStuck final : public UBTTask_MoveTo
{
public:
	uint8                                         Pad_C0[0x4];                                       // 0x00C0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _deltaConsideredStuck;                             // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxTimeStuck;                                     // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_MoveToAbortIfStuck">();
	}
	static class UBTTask_MoveToAbortIfStuck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_MoveToAbortIfStuck>();
	}
};
static_assert(alignof(UBTTask_MoveToAbortIfStuck) == 0x000008, "Wrong alignment on UBTTask_MoveToAbortIfStuck");
static_assert(sizeof(UBTTask_MoveToAbortIfStuck) == 0x0000E8, "Wrong size on UBTTask_MoveToAbortIfStuck");
static_assert(offsetof(UBTTask_MoveToAbortIfStuck, _deltaConsideredStuck) == 0x0000C4, "Member 'UBTTask_MoveToAbortIfStuck::_deltaConsideredStuck' has a wrong offset!");
static_assert(offsetof(UBTTask_MoveToAbortIfStuck, _maxTimeStuck) == 0x0000E0, "Member 'UBTTask_MoveToAbortIfStuck::_maxTimeStuck' has a wrong offset!");

// Class TheK24.ZombieEscapeDoorPointsActor
// 0x0010 (0x02B0 - 0x02A0)
class AZombieEscapeDoorPointsActor final : public AActor
{
public:
	TArray<class UArrowComponent*>                _availablePoints;                                  // 0x02A0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieEscapeDoorPointsActor">();
	}
	static class AZombieEscapeDoorPointsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombieEscapeDoorPointsActor>();
	}
};
static_assert(alignof(AZombieEscapeDoorPointsActor) == 0x000008, "Wrong alignment on AZombieEscapeDoorPointsActor");
static_assert(sizeof(AZombieEscapeDoorPointsActor) == 0x0002B0, "Wrong size on AZombieEscapeDoorPointsActor");
static_assert(offsetof(AZombieEscapeDoorPointsActor, _availablePoints) == 0x0002A0, "Member 'AZombieEscapeDoorPointsActor::_availablePoints' has a wrong offset!");

// Class TheK24.AISkill_FindCollectable_SupplyCrate
// 0x00C0 (0x0450 - 0x0390)
class UAISkill_FindCollectable_SupplyCrate final : public UAISkill_FindCollectable_Searchable
{
public:
	struct FAITunableParameter                    UrgencyGoalWeight;                                 // 0x0390(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    OpenedWeightMultiplier;                            // 0x03F0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_SupplyCrate">();
	}
	static class UAISkill_FindCollectable_SupplyCrate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_SupplyCrate>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_SupplyCrate) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_SupplyCrate");
static_assert(sizeof(UAISkill_FindCollectable_SupplyCrate) == 0x000450, "Wrong size on UAISkill_FindCollectable_SupplyCrate");
static_assert(offsetof(UAISkill_FindCollectable_SupplyCrate, UrgencyGoalWeight) == 0x000390, "Member 'UAISkill_FindCollectable_SupplyCrate::UrgencyGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_SupplyCrate, OpenedWeightMultiplier) == 0x0003F0, "Member 'UAISkill_FindCollectable_SupplyCrate::OpenedWeightMultiplier' has a wrong offset!");

// Class TheK24.ZombieEvaluateEnterChaseBTService
// 0x0000 (0x00A0 - 0x00A0)
class UZombieEvaluateEnterChaseBTService final : public UBTService_BlueprintBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieEvaluateEnterChaseBTService">();
	}
	static class UZombieEvaluateEnterChaseBTService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieEvaluateEnterChaseBTService>();
	}
};
static_assert(alignof(UZombieEvaluateEnterChaseBTService) == 0x000008, "Wrong alignment on UZombieEvaluateEnterChaseBTService");
static_assert(sizeof(UZombieEvaluateEnterChaseBTService) == 0x0000A0, "Wrong size on UZombieEvaluateEnterChaseBTService");

// Class TheK24.AISkill_InteractionUseItem_Serum
// 0x0000 (0x0290 - 0x0290)
class UAISkill_InteractionUseItem_Serum final : public UAISkill_InteractionUseItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem_Serum">();
	}
	static class UAISkill_InteractionUseItem_Serum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem_Serum>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem_Serum) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem_Serum");
static_assert(sizeof(UAISkill_InteractionUseItem_Serum) == 0x000290, "Wrong size on UAISkill_InteractionUseItem_Serum");

// Class TheK24.ZombieStunnableComponent
// 0x0008 (0x00B0 - 0x00A8)
class UZombieStunnableComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieStunnableComponent">();
	}
	static class UZombieStunnableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieStunnableComponent>();
	}
};
static_assert(alignof(UZombieStunnableComponent) == 0x000008, "Wrong alignment on UZombieStunnableComponent");
static_assert(sizeof(UZombieStunnableComponent) == 0x0000B0, "Wrong size on UZombieStunnableComponent");

// Class TheK24.ChangeZombieStateBTTask
// 0x0008 (0x00B8 - 0x00B0)
class UChangeZombieStateBTTask final : public UBTTask_BlueprintBase
{
public:
	EZombieState                                  _zombieState;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChangeZombieStateBTTask">();
	}
	static class UChangeZombieStateBTTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeZombieStateBTTask>();
	}
};
static_assert(alignof(UChangeZombieStateBTTask) == 0x000008, "Wrong alignment on UChangeZombieStateBTTask");
static_assert(sizeof(UChangeZombieStateBTTask) == 0x0000B8, "Wrong size on UChangeZombieStateBTTask");
static_assert(offsetof(UChangeZombieStateBTTask, _zombieState) == 0x0000B0, "Member 'UChangeZombieStateBTTask::_zombieState' has a wrong offset!");

// Class TheK24.ZombieEvaluteEnterAttackBTService
// 0x0000 (0x00A0 - 0x00A0)
class UZombieEvaluteEnterAttackBTService final : public UBTService_BlueprintBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZombieEvaluteEnterAttackBTService">();
	}
	static class UZombieEvaluteEnterAttackBTService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieEvaluteEnterAttackBTService>();
	}
};
static_assert(alignof(UZombieEvaluteEnterAttackBTService) == 0x000008, "Wrong alignment on UZombieEvaluteEnterAttackBTService");
static_assert(sizeof(UZombieEvaluteEnterAttackBTService) == 0x0000A0, "Wrong size on UZombieEvaluteEnterAttackBTService");

// Class TheK24.BlindZombieFlashlightableLightingStrategy
// 0x0000 (0x0040 - 0x0040)
class UBlindZombieFlashlightableLightingStrategy final : public UFlashlightablePointsLightingStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlindZombieFlashlightableLightingStrategy">();
	}
	static class UBlindZombieFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindZombieFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UBlindZombieFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UBlindZombieFlashlightableLightingStrategy");
static_assert(sizeof(UBlindZombieFlashlightableLightingStrategy) == 0x000040, "Wrong size on UBlindZombieFlashlightableLightingStrategy");

// Class TheK24.ContaminationSerumCollectable
// 0x0010 (0x05A8 - 0x0598)
class AContaminationSerumCollectable final : public ABaseCamperCollectable
{
public:
	uint8                                         Pad_598[0x10];                                     // 0x0598(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContaminationSerumCollectable">();
	}
	static class AContaminationSerumCollectable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AContaminationSerumCollectable>();
	}
};
static_assert(alignof(AContaminationSerumCollectable) == 0x000008, "Wrong alignment on AContaminationSerumCollectable");
static_assert(sizeof(AContaminationSerumCollectable) == 0x0005A8, "Wrong size on AContaminationSerumCollectable");

// Class TheK24.ContaminationSubAnimInstance
// 0x0080 (0x0660 - 0x05E0)
class UContaminationSubAnimInstance final : public UBaseSurvivorAnimInstance
{
public:
	uint8                                         Pad_5E0[0x8];                                      // 0x05E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isContaminated;                                   // 0x05E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjectingSerumSelf;                             // 0x05E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjectingSerumOther;                            // 0x05EA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingInjectedWithSerum;                         // 0x05EB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingHealed;                                    // 0x05EC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFirstContaminationHit;                          // 0x05ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _triggerCough;                                     // 0x05EE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5EF[0x1];                                      // 0x05EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeBetweenCough;                                 // 0x05F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x05F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrouched;                                       // 0x05F5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInsideCloset;                                   // 0x05F6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInteracting;                                    // 0x05F7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingAimItem;                                 // 0x05F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCrawling;                                       // 0x05F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHooked;                                         // 0x05FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDead;                                           // 0x05FB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isFrightScreaming;                                // 0x05FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingSmallItem;                               // 0x05FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isUsingAimItem;                                   // 0x05FE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isHoldingHandleItem;                              // 0x05FF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInjured;                                        // 0x0600(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isCarried;                                        // 0x0601(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionAnimation                         _interactionType;                                  // 0x0602(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_603[0x5D];                                     // 0x0603(0x005D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContaminationSubAnimInstance">();
	}
	static class UContaminationSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContaminationSubAnimInstance>();
	}
};
static_assert(alignof(UContaminationSubAnimInstance) == 0x000010, "Wrong alignment on UContaminationSubAnimInstance");
static_assert(sizeof(UContaminationSubAnimInstance) == 0x000660, "Wrong size on UContaminationSubAnimInstance");
static_assert(offsetof(UContaminationSubAnimInstance, _isContaminated) == 0x0005E8, "Member 'UContaminationSubAnimInstance::_isContaminated' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInjectingSerumSelf) == 0x0005E9, "Member 'UContaminationSubAnimInstance::_isInjectingSerumSelf' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInjectingSerumOther) == 0x0005EA, "Member 'UContaminationSubAnimInstance::_isInjectingSerumOther' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isBeingInjectedWithSerum) == 0x0005EB, "Member 'UContaminationSubAnimInstance::_isBeingInjectedWithSerum' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isBeingHealed) == 0x0005EC, "Member 'UContaminationSubAnimInstance::_isBeingHealed' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isFirstContaminationHit) == 0x0005ED, "Member 'UContaminationSubAnimInstance::_isFirstContaminationHit' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _triggerCough) == 0x0005EE, "Member 'UContaminationSubAnimInstance::_triggerCough' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _timeBetweenCough) == 0x0005F0, "Member 'UContaminationSubAnimInstance::_timeBetweenCough' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isIdle) == 0x0005F4, "Member 'UContaminationSubAnimInstance::_isIdle' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isCrouched) == 0x0005F5, "Member 'UContaminationSubAnimInstance::_isCrouched' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInsideCloset) == 0x0005F6, "Member 'UContaminationSubAnimInstance::_isInsideCloset' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInteracting) == 0x0005F7, "Member 'UContaminationSubAnimInstance::_isInteracting' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isHoldingAimItem) == 0x0005F8, "Member 'UContaminationSubAnimInstance::_isHoldingAimItem' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isCrawling) == 0x0005F9, "Member 'UContaminationSubAnimInstance::_isCrawling' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isHooked) == 0x0005FA, "Member 'UContaminationSubAnimInstance::_isHooked' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isDead) == 0x0005FB, "Member 'UContaminationSubAnimInstance::_isDead' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isFrightScreaming) == 0x0005FC, "Member 'UContaminationSubAnimInstance::_isFrightScreaming' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isHoldingSmallItem) == 0x0005FD, "Member 'UContaminationSubAnimInstance::_isHoldingSmallItem' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isUsingAimItem) == 0x0005FE, "Member 'UContaminationSubAnimInstance::_isUsingAimItem' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isHoldingHandleItem) == 0x0005FF, "Member 'UContaminationSubAnimInstance::_isHoldingHandleItem' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isInjured) == 0x000600, "Member 'UContaminationSubAnimInstance::_isInjured' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _isCarried) == 0x000601, "Member 'UContaminationSubAnimInstance::_isCarried' has a wrong offset!");
static_assert(offsetof(UContaminationSubAnimInstance, _interactionType) == 0x000602, "Member 'UContaminationSubAnimInstance::_interactionType' has a wrong offset!");

// Class TheK24.EnvQueryContext_ZombiePatrolAreaPoint
// 0x0000 (0x0030 - 0x0030)
class UEnvQueryContext_ZombiePatrolAreaPoint final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryContext_ZombiePatrolAreaPoint">();
	}
	static class UEnvQueryContext_ZombiePatrolAreaPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_ZombiePatrolAreaPoint>();
	}
};
static_assert(alignof(UEnvQueryContext_ZombiePatrolAreaPoint) == 0x000008, "Wrong alignment on UEnvQueryContext_ZombiePatrolAreaPoint");
static_assert(sizeof(UEnvQueryContext_ZombiePatrolAreaPoint) == 0x000030, "Wrong size on UEnvQueryContext_ZombiePatrolAreaPoint");

// Class TheK24.Eruption
// 0x0058 (0x0478 - 0x0420)
class UEruption final : public UPerk
{
public:
	TArray<class AGenerator*>                     _server_affectedGenerators;                        // 0x0420(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          _isPerkEnabled;                                    // 0x0430(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _generatorRegressPercentage[0x3];                  // 0x0434(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _survivorImposedStatusEffectDuration[0x3];         // 0x0440(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _perkCooldownDuration[0x3];                        // 0x044C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _screamRevealLocationDuration;                     // 0x0458(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _survivorEffectClass;                              // 0x0460(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_468[0x10];                                     // 0x0468(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnGeneratorHighlightEnd(class AGenerator* HighlightedGenerator);
	void Cosmetic_OnGeneratorHighlightStart(class AGenerator* HighlightedGenerator);
	void Multicast_HighlightGenerator(class AGenerator* Generator);
	void Multicast_RemoveHighlights(const TArray<class AGenerator*>& HighlightedGenerators);

	float GetGeneratorRegressPercentageAtLevel() const;
	float GetScreamRevealLocationDuration() const;
	float GetSurvivorImposedStatusEffectDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Eruption">();
	}
	static class UEruption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEruption>();
	}
};
static_assert(alignof(UEruption) == 0x000008, "Wrong alignment on UEruption");
static_assert(sizeof(UEruption) == 0x000478, "Wrong size on UEruption");
static_assert(offsetof(UEruption, _server_affectedGenerators) == 0x000420, "Member 'UEruption::_server_affectedGenerators' has a wrong offset!");
static_assert(offsetof(UEruption, _isPerkEnabled) == 0x000430, "Member 'UEruption::_isPerkEnabled' has a wrong offset!");
static_assert(offsetof(UEruption, _generatorRegressPercentage) == 0x000434, "Member 'UEruption::_generatorRegressPercentage' has a wrong offset!");
static_assert(offsetof(UEruption, _survivorImposedStatusEffectDuration) == 0x000440, "Member 'UEruption::_survivorImposedStatusEffectDuration' has a wrong offset!");
static_assert(offsetof(UEruption, _perkCooldownDuration) == 0x00044C, "Member 'UEruption::_perkCooldownDuration' has a wrong offset!");
static_assert(offsetof(UEruption, _screamRevealLocationDuration) == 0x000458, "Member 'UEruption::_screamRevealLocationDuration' has a wrong offset!");
static_assert(offsetof(UEruption, _survivorEffectClass) == 0x000460, "Member 'UEruption::_survivorEffectClass' has a wrong offset!");

// Class TheK24.EruptionIconStrategy
// 0x0000 (0x0038 - 0x0038)
class UEruptionIconStrategy final : public UBasePerkIconStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EruptionIconStrategy">();
	}
	static class UEruptionIconStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEruptionIconStrategy>();
	}
};
static_assert(alignof(UEruptionIconStrategy) == 0x000008, "Wrong alignment on UEruptionIconStrategy");
static_assert(sizeof(UEruptionIconStrategy) == 0x000038, "Wrong size on UEruptionIconStrategy");

// Class TheK24.Hysteria
// 0x0078 (0x0498 - 0x0420)
class UHysteria final : public UPerk
{
public:
	float                                         _obliviousEffectDuration[0x3];                     // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _perkCooldownDuration[0x3];                        // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UHysteriaObliviousEffect>   _obliviousEffectClass;                             // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class ACamperPlayer*, class UHysteriaObliviousEffect*> _obliviousEffectPerSurvivorMap;                    // 0x0448(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	float GetObliviousEffectDurationAtLevel() const;
	float GetPerkCooldownDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Hysteria">();
	}
	static class UHysteria* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHysteria>();
	}
};
static_assert(alignof(UHysteria) == 0x000008, "Wrong alignment on UHysteria");
static_assert(sizeof(UHysteria) == 0x000498, "Wrong size on UHysteria");
static_assert(offsetof(UHysteria, _obliviousEffectDuration) == 0x000420, "Member 'UHysteria::_obliviousEffectDuration' has a wrong offset!");
static_assert(offsetof(UHysteria, _perkCooldownDuration) == 0x00042C, "Member 'UHysteria::_perkCooldownDuration' has a wrong offset!");
static_assert(offsetof(UHysteria, _obliviousEffectClass) == 0x000440, "Member 'UHysteria::_obliviousEffectClass' has a wrong offset!");
static_assert(offsetof(UHysteria, _obliviousEffectPerSurvivorMap) == 0x000448, "Member 'UHysteria::_obliviousEffectPerSurvivorMap' has a wrong offset!");

// Class TheK24.HysteriaObliviousEffect
// 0x0000 (0x0390 - 0x0390)
class UHysteriaObliviousEffect final : public UTimedObliviousEffect
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HysteriaObliviousEffect">();
	}
	static class UHysteriaObliviousEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHysteriaObliviousEffect>();
	}
};
static_assert(alignof(UHysteriaObliviousEffect) == 0x000008, "Wrong alignment on UHysteriaObliviousEffect");
static_assert(sizeof(UHysteriaObliviousEffect) == 0x000390, "Wrong size on UHysteriaObliviousEffect");

// Class TheK24.IncreaseZombiesSpeedStatusEffect
// 0x0008 (0x0388 - 0x0380)
class UIncreaseZombiesSpeedStatusEffect final : public UStatusEffect
{
public:
	float                                         _zombieSpeedAdditive;                              // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IncreaseZombiesSpeedStatusEffect">();
	}
	static class UIncreaseZombiesSpeedStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIncreaseZombiesSpeedStatusEffect>();
	}
};
static_assert(alignof(UIncreaseZombiesSpeedStatusEffect) == 0x000008, "Wrong alignment on UIncreaseZombiesSpeedStatusEffect");
static_assert(sizeof(UIncreaseZombiesSpeedStatusEffect) == 0x000388, "Wrong size on UIncreaseZombiesSpeedStatusEffect");
static_assert(offsetof(UIncreaseZombiesSpeedStatusEffect, _zombieSpeedAdditive) == 0x000380, "Member 'UIncreaseZombiesSpeedStatusEffect::_zombieSpeedAdditive' has a wrong offset!");

// Class TheK24.InjectSerumInteraction
// 0x00D0 (0x0990 - 0x08C0)
class UInjectSerumInteraction : public UChargeableInteractionDefinition
{
public:
	TSubclassOf<class UStatusEffect>              _killerInstinctStatusEffectClass;                  // 0x08C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _injectSerumKillerInstinctTime;                    // 0x08C8(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           _scoreEvent;                                       // 0x0950(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_95C[0x4];                                      // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _serumApplyHeal;                                   // 0x0960(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_988[0x8];                                      // 0x0988(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_CureSurvivor(class ACamperPlayer* CamperPlayer);

	class ACamperPlayer* GetInjectionTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InjectSerumInteraction">();
	}
	static class UInjectSerumInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInjectSerumInteraction>();
	}
};
static_assert(alignof(UInjectSerumInteraction) == 0x000010, "Wrong alignment on UInjectSerumInteraction");
static_assert(sizeof(UInjectSerumInteraction) == 0x000990, "Wrong size on UInjectSerumInteraction");
static_assert(offsetof(UInjectSerumInteraction, _killerInstinctStatusEffectClass) == 0x0008C0, "Member 'UInjectSerumInteraction::_killerInstinctStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UInjectSerumInteraction, _injectSerumKillerInstinctTime) == 0x0008C8, "Member 'UInjectSerumInteraction::_injectSerumKillerInstinctTime' has a wrong offset!");
static_assert(offsetof(UInjectSerumInteraction, _scoreEvent) == 0x000950, "Member 'UInjectSerumInteraction::_scoreEvent' has a wrong offset!");
static_assert(offsetof(UInjectSerumInteraction, _serumApplyHeal) == 0x000960, "Member 'UInjectSerumInteraction::_serumApplyHeal' has a wrong offset!");

// Class TheK24.InjectSerumOther
// 0x0000 (0x0990 - 0x0990)
class UInjectSerumOther final : public UInjectSerumInteraction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InjectSerumOther">();
	}
	static class UInjectSerumOther* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInjectSerumOther>();
	}
};
static_assert(alignof(UInjectSerumOther) == 0x000010, "Wrong alignment on UInjectSerumOther");
static_assert(sizeof(UInjectSerumOther) == 0x000990, "Wrong size on UInjectSerumOther");

// Class TheK24.InjectSerumSelf
// 0x0000 (0x0990 - 0x0990)
class UInjectSerumSelf final : public UInjectSerumInteraction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InjectSerumSelf">();
	}
	static class UInjectSerumSelf* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInjectSerumSelf>();
	}
};
static_assert(alignof(UInjectSerumSelf) == 0x000010, "Wrong alignment on UInjectSerumSelf");
static_assert(sizeof(UInjectSerumSelf) == 0x000990, "Wrong size on UInjectSerumSelf");

// Class TheK24.K24AnimInstance
// 0x0020 (0x0740 - 0x0720)
class UK24AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isInPowerMode;                                    // 0x0720(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingPower;                                  // 0x0721(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isK24PowerAttacking;                              // 0x0722(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isRequestingPowerAttack;                          // 0x0723(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         _powerLevel;                                       // 0x0724(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_728[0x18];                                     // 0x0728(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillerPowerLevelChanged(int32 Powerlevel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K24AnimInstance">();
	}
	static class UK24AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK24AnimInstance>();
	}
};
static_assert(alignof(UK24AnimInstance) == 0x000010, "Wrong alignment on UK24AnimInstance");
static_assert(sizeof(UK24AnimInstance) == 0x000740, "Wrong size on UK24AnimInstance");
static_assert(offsetof(UK24AnimInstance, _isInPowerMode) == 0x000720, "Member 'UK24AnimInstance::_isInPowerMode' has a wrong offset!");
static_assert(offsetof(UK24AnimInstance, _isChargingPower) == 0x000721, "Member 'UK24AnimInstance::_isChargingPower' has a wrong offset!");
static_assert(offsetof(UK24AnimInstance, _isK24PowerAttacking) == 0x000722, "Member 'UK24AnimInstance::_isK24PowerAttacking' has a wrong offset!");
static_assert(offsetof(UK24AnimInstance, _isRequestingPowerAttack) == 0x000723, "Member 'UK24AnimInstance::_isRequestingPowerAttack' has a wrong offset!");
static_assert(offsetof(UK24AnimInstance, _powerLevel) == 0x000724, "Member 'UK24AnimInstance::_powerLevel' has a wrong offset!");

// Class TheK24.K24CharacterFXComponent
// 0x0050 (0x00F8 - 0x00A8)
class UK24CharacterFXComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnPowerLevelChangedFx;                             // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Local_OnKillerHitZombie;                           // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Local_OnKillerContaminatedSurvivor;                // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
