#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK35

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum TheK35.EK35AreaBlastState
// NumValues: 0x0006
enum class EK35AreaBlastState : uint8
{
	Inactive                                 = 0,
	BeforeGrowing                            = 1,
	Growing                                  = 2,
	BeforeShrinking                          = 3,
	Shrinking                                = 4,
	EK35AreaBlastState_MAX                   = 5,
};

// Enum TheK35.EK35KillerTeleportPointState
// NumValues: 0x0004
enum class EK35KillerTeleportPointState : uint8
{
	None                                     = 0,
	Cooldown                                 = 1,
	Active                                   = 2,
	EK35KillerTeleportPointState_MAX         = 3,
};

// ScriptStruct TheK35.K35KillerEffectData
// 0x0018 (0x0018 - 0x0000)
struct FK35KillerEffectData final
{
public:
	class ACamperPlayer*                          OwningSurvivor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAffected;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemovalProgress;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HadSightLastTick;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FK35KillerEffectData) == 0x000008, "Wrong alignment on FK35KillerEffectData");
static_assert(sizeof(FK35KillerEffectData) == 0x000018, "Wrong size on FK35KillerEffectData");
static_assert(offsetof(FK35KillerEffectData, OwningSurvivor) == 0x000000, "Member 'FK35KillerEffectData::OwningSurvivor' has a wrong offset!");
static_assert(offsetof(FK35KillerEffectData, IsAffected) == 0x000008, "Member 'FK35KillerEffectData::IsAffected' has a wrong offset!");
static_assert(offsetof(FK35KillerEffectData, RemovalProgress) == 0x00000C, "Member 'FK35KillerEffectData::RemovalProgress' has a wrong offset!");
static_assert(offsetof(FK35KillerEffectData, HadSightLastTick) == 0x000010, "Member 'FK35KillerEffectData::HadSightLastTick' has a wrong offset!");

// ScriptStruct TheK35.K35KillerTeleportPointTargetIndicatorSettings
// 0x0038 (0x0038 - 0x0000)
struct FK35KillerTeleportPointTargetIndicatorSettings final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               SpawnForwardRotation;                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsVisible;                                         // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FK35KillerTeleportPointTargetIndicatorSettings) == 0x000008, "Wrong alignment on FK35KillerTeleportPointTargetIndicatorSettings");
static_assert(sizeof(FK35KillerTeleportPointTargetIndicatorSettings) == 0x000038, "Wrong size on FK35KillerTeleportPointTargetIndicatorSettings");
static_assert(offsetof(FK35KillerTeleportPointTargetIndicatorSettings, SpawnLocation) == 0x000000, "Member 'FK35KillerTeleportPointTargetIndicatorSettings::SpawnLocation' has a wrong offset!");
static_assert(offsetof(FK35KillerTeleportPointTargetIndicatorSettings, SpawnForwardRotation) == 0x000018, "Member 'FK35KillerTeleportPointTargetIndicatorSettings::SpawnForwardRotation' has a wrong offset!");
static_assert(offsetof(FK35KillerTeleportPointTargetIndicatorSettings, IsVisible) == 0x000030, "Member 'FK35KillerTeleportPointTargetIndicatorSettings::IsVisible' has a wrong offset!");

}

