#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK32

#include "Basic.hpp"

#include "DBDInteraction_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "TheK32_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "DBDGameplay_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "GameplayUtilities_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SystemUtilities_structs.hpp"
#include "DBDCosmetic_classes.hpp"


namespace SDK
{

// Class TheK32.K32BaseProjectile
// 0x0130 (0x03D0 - 0x02A0)
class alignas(0x10) AK32BaseProjectile final : public AActor
{
public:
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAcquiredChanged;                                 // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _speedInMeterPerSecond;                            // 0x02B8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _hitDistance;                                      // 0x02E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0xB8];                                     // 0x0308(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _isAcquiredFromPool;                               // 0x03C0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C1[0xF];                                      // 0x03C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnProjectileHidden();
	void Cosmetic_OnProjectileVisible();
	void OnRep_IsAcquiredFromPool(bool OldIsAcquiredFromPool);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32BaseProjectile">();
	}
	static class AK32BaseProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK32BaseProjectile>();
	}
};
static_assert(alignof(AK32BaseProjectile) == 0x000010, "Wrong alignment on AK32BaseProjectile");
static_assert(sizeof(AK32BaseProjectile) == 0x0003D0, "Wrong size on AK32BaseProjectile");
static_assert(offsetof(AK32BaseProjectile, OnAcquiredChanged) == 0x0002A8, "Member 'AK32BaseProjectile::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK32BaseProjectile, _speedInMeterPerSecond) == 0x0002B8, "Member 'AK32BaseProjectile::_speedInMeterPerSecond' has a wrong offset!");
static_assert(offsetof(AK32BaseProjectile, _hitDistance) == 0x0002E0, "Member 'AK32BaseProjectile::_hitDistance' has a wrong offset!");
static_assert(offsetof(AK32BaseProjectile, _isAcquiredFromPool) == 0x0003C0, "Member 'AK32BaseProjectile::_isAcquiredFromPool' has a wrong offset!");

// Class TheK32.Addon_K32Power_14
// 0x0088 (0x0370 - 0x02E8)
class UAddon_K32Power_14 final : public UItemAddon
{
public:
	struct FDBDTunableRowHandle                   _addon14RecentAssimilationWithinTime;              // 0x02E8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UStatusEffect>              _addon14ModifyTerrorRadiusStatusEffect;            // 0x0310(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _addon14TerrorRadiusAdditive;                      // 0x0318(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _addon14TerrorRadiusAdditiveDuration;              // 0x0340(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UStatusEffect*                          _lastModifyTerrorRadiusStatusEffect;               // 0x0368(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K32Power_14">();
	}
	static class UAddon_K32Power_14* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K32Power_14>();
	}
};
static_assert(alignof(UAddon_K32Power_14) == 0x000008, "Wrong alignment on UAddon_K32Power_14");
static_assert(sizeof(UAddon_K32Power_14) == 0x000370, "Wrong size on UAddon_K32Power_14");
static_assert(offsetof(UAddon_K32Power_14, _addon14RecentAssimilationWithinTime) == 0x0002E8, "Member 'UAddon_K32Power_14::_addon14RecentAssimilationWithinTime' has a wrong offset!");
static_assert(offsetof(UAddon_K32Power_14, _addon14ModifyTerrorRadiusStatusEffect) == 0x000310, "Member 'UAddon_K32Power_14::_addon14ModifyTerrorRadiusStatusEffect' has a wrong offset!");
static_assert(offsetof(UAddon_K32Power_14, _addon14TerrorRadiusAdditive) == 0x000318, "Member 'UAddon_K32Power_14::_addon14TerrorRadiusAdditive' has a wrong offset!");
static_assert(offsetof(UAddon_K32Power_14, _addon14TerrorRadiusAdditiveDuration) == 0x000340, "Member 'UAddon_K32Power_14::_addon14TerrorRadiusAdditiveDuration' has a wrong offset!");
static_assert(offsetof(UAddon_K32Power_14, _lastModifyTerrorRadiusStatusEffect) == 0x000368, "Member 'UAddon_K32Power_14::_lastModifyTerrorRadiusStatusEffect' has a wrong offset!");

// Class TheK32.Addon_K32Power_19
// 0x0030 (0x0318 - 0x02E8)
class UAddon_K32Power_19 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _addon19HinderedStatusEffect;                      // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _addon19HinderedDuration;                          // 0x02F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K32Power_19">();
	}
	static class UAddon_K32Power_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K32Power_19>();
	}
};
static_assert(alignof(UAddon_K32Power_19) == 0x000008, "Wrong alignment on UAddon_K32Power_19");
static_assert(sizeof(UAddon_K32Power_19) == 0x000318, "Wrong size on UAddon_K32Power_19");
static_assert(offsetof(UAddon_K32Power_19, _addon19HinderedStatusEffect) == 0x0002E8, "Member 'UAddon_K32Power_19::_addon19HinderedStatusEffect' has a wrong offset!");
static_assert(offsetof(UAddon_K32Power_19, _addon19HinderedDuration) == 0x0002F0, "Member 'UAddon_K32Power_19::_addon19HinderedDuration' has a wrong offset!");

// Class TheK32.InK32PodZoneLingeringEffect
// 0x00A0 (0x0488 - 0x03E8)
class UInK32PodZoneLingeringEffect final : public UBaseLingeringStatusEffect
{
public:
	struct FDBDTunableRowHandle                   _range;                                            // 0x03E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class AK32KillerPod*>                  _podsInRange;                                      // 0x0410(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x68];                                     // 0x0420(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnKillerPodAcquiredChanged(const bool IsAcquired);
	void Authority_OnKillerPodDisabledChanged(const bool IsDisabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InK32PodZoneLingeringEffect">();
	}
	static class UInK32PodZoneLingeringEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInK32PodZoneLingeringEffect>();
	}
};
static_assert(alignof(UInK32PodZoneLingeringEffect) == 0x000008, "Wrong alignment on UInK32PodZoneLingeringEffect");
static_assert(sizeof(UInK32PodZoneLingeringEffect) == 0x000488, "Wrong size on UInK32PodZoneLingeringEffect");
static_assert(offsetof(UInK32PodZoneLingeringEffect, _range) == 0x0003E8, "Member 'UInK32PodZoneLingeringEffect::_range' has a wrong offset!");
static_assert(offsetof(UInK32PodZoneLingeringEffect, _podsInRange) == 0x000410, "Member 'UInK32PodZoneLingeringEffect::_podsInRange' has a wrong offset!");

// Class TheK32.K32AnalyticsComponent
// 0x0038 (0x00E0 - 0x00A8)
class UK32AnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          _survivorAssimilatedFirstTime;                     // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAssimilationFromDifferentPodsStageData _assimilationFromDifferentPodsStage;               // 0x00C0(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32AnalyticsComponent">();
	}
	static class UK32AnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32AnalyticsComponent>();
	}
};
static_assert(alignof(UK32AnalyticsComponent) == 0x000008, "Wrong alignment on UK32AnalyticsComponent");
static_assert(sizeof(UK32AnalyticsComponent) == 0x0000E0, "Wrong size on UK32AnalyticsComponent");
static_assert(offsetof(UK32AnalyticsComponent, _survivorAssimilatedFirstTime) == 0x0000B8, "Member 'UK32AnalyticsComponent::_survivorAssimilatedFirstTime' has a wrong offset!");
static_assert(offsetof(UK32AnalyticsComponent, _assimilationFromDifferentPodsStage) == 0x0000C0, "Member 'UK32AnalyticsComponent::_assimilationFromDifferentPodsStage' has a wrong offset!");

// Class TheK32.K32AnimInstance
// 0x0060 (0x0780 - 0x0720)
class UK32AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isAimingPodPlacement;                             // 0x0720(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isShootingPod;                                    // 0x0721(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInOverclockMode;                                // 0x0722(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isTeleporting;                                    // 0x0723(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isControllingPod;                                 // 0x0724(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isTeleportingFromKillerPovWithInAntiCamp;         // 0x0725(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_726[0x2];                                      // 0x0726(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _chargeKillerProjectileSpawnPercent;               // 0x0728(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _overclockStatusEffectClass;                       // 0x0730(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_738[0x48];                                     // 0x0738(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameEventReceived(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
	void ResetIsShootingPod();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32AnimInstance">();
	}
	static class UK32AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32AnimInstance>();
	}
};
static_assert(alignof(UK32AnimInstance) == 0x000010, "Wrong alignment on UK32AnimInstance");
static_assert(sizeof(UK32AnimInstance) == 0x000780, "Wrong size on UK32AnimInstance");
static_assert(offsetof(UK32AnimInstance, _isAimingPodPlacement) == 0x000720, "Member 'UK32AnimInstance::_isAimingPodPlacement' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _isShootingPod) == 0x000721, "Member 'UK32AnimInstance::_isShootingPod' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _isInOverclockMode) == 0x000722, "Member 'UK32AnimInstance::_isInOverclockMode' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _isTeleporting) == 0x000723, "Member 'UK32AnimInstance::_isTeleporting' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _isControllingPod) == 0x000724, "Member 'UK32AnimInstance::_isControllingPod' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _isTeleportingFromKillerPovWithInAntiCamp) == 0x000725, "Member 'UK32AnimInstance::_isTeleportingFromKillerPovWithInAntiCamp' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _chargeKillerProjectileSpawnPercent) == 0x000728, "Member 'UK32AnimInstance::_chargeKillerProjectileSpawnPercent' has a wrong offset!");
static_assert(offsetof(UK32AnimInstance, _overclockStatusEffectClass) == 0x000730, "Member 'UK32AnimInstance::_overclockStatusEffectClass' has a wrong offset!");

// Class TheK32.K32AntiCampZoneIdentifierComponent
// 0x0000 (0x0108 - 0x0108)
class UK32AntiCampZoneIdentifierComponent final : public UObjectPlacementValidationWithRestrictionStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32AntiCampZoneIdentifierComponent">();
	}
	static class UK32AntiCampZoneIdentifierComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32AntiCampZoneIdentifierComponent>();
	}
};
static_assert(alignof(UK32AntiCampZoneIdentifierComponent) == 0x000008, "Wrong alignment on UK32AntiCampZoneIdentifierComponent");
static_assert(sizeof(UK32AntiCampZoneIdentifierComponent) == 0x000108, "Wrong size on UK32AntiCampZoneIdentifierComponent");

// Class TheK32.K32AssimilationAnimInstance
// 0x0010 (0x03B0 - 0x03A0)
class UK32AssimilationAnimInstance final : public USurvivorDynamicAccessoryAnimInstance
{
public:
	bool                                          _isAssimilated;                                    // 0x0398(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDestroyedByEmp;                                 // 0x0399(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDestroyedByHook;                                // 0x039A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isDestroyedByTeleport;                            // 0x039B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isBeingLookedAtByKillerPod;                       // 0x039C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39D[0x13];                                     // 0x039D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetIsDestroyedByEmp();
	void ResetIsDestroyedByHook();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32AssimilationAnimInstance">();
	}
	static class UK32AssimilationAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32AssimilationAnimInstance>();
	}
};
static_assert(alignof(UK32AssimilationAnimInstance) == 0x000010, "Wrong alignment on UK32AssimilationAnimInstance");
static_assert(sizeof(UK32AssimilationAnimInstance) == 0x0003B0, "Wrong size on UK32AssimilationAnimInstance");
static_assert(offsetof(UK32AssimilationAnimInstance, _isAssimilated) == 0x000398, "Member 'UK32AssimilationAnimInstance::_isAssimilated' has a wrong offset!");
static_assert(offsetof(UK32AssimilationAnimInstance, _isDestroyedByEmp) == 0x000399, "Member 'UK32AssimilationAnimInstance::_isDestroyedByEmp' has a wrong offset!");
static_assert(offsetof(UK32AssimilationAnimInstance, _isDestroyedByHook) == 0x00039A, "Member 'UK32AssimilationAnimInstance::_isDestroyedByHook' has a wrong offset!");
static_assert(offsetof(UK32AssimilationAnimInstance, _isDestroyedByTeleport) == 0x00039B, "Member 'UK32AssimilationAnimInstance::_isDestroyedByTeleport' has a wrong offset!");
static_assert(offsetof(UK32AssimilationAnimInstance, _isBeingLookedAtByKillerPod) == 0x00039C, "Member 'UK32AssimilationAnimInstance::_isBeingLookedAtByKillerPod' has a wrong offset!");

// Class TheK32.K32CollectItemInItemBoxInteraction
// 0x0050 (0x0800 - 0x07B0)
class UK32CollectItemInItemBoxInteraction final : public UCollectItemInteraction
{
public:
	struct FDBDTunableRowHandle                   _autoCollectOnItemBoxSpeedUpInteractionFinished;   // 0x07A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AK32ItemBox*                            _owningItemBox;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D8[0x28];                                     // 0x07D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32CollectItemInItemBoxInteraction">();
	}
	static class UK32CollectItemInItemBoxInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32CollectItemInItemBoxInteraction>();
	}
};
static_assert(alignof(UK32CollectItemInItemBoxInteraction) == 0x000010, "Wrong alignment on UK32CollectItemInItemBoxInteraction");
static_assert(sizeof(UK32CollectItemInItemBoxInteraction) == 0x000800, "Wrong size on UK32CollectItemInItemBoxInteraction");
static_assert(offsetof(UK32CollectItemInItemBoxInteraction, _autoCollectOnItemBoxSpeedUpInteractionFinished) == 0x0007A8, "Member 'UK32CollectItemInItemBoxInteraction::_autoCollectOnItemBoxSpeedUpInteractionFinished' has a wrong offset!");
static_assert(offsetof(UK32CollectItemInItemBoxInteraction, _owningItemBox) == 0x0007D0, "Member 'UK32CollectItemInItemBoxInteraction::_owningItemBox' has a wrong offset!");

// Class TheK32.K32Emp
// 0x01F0 (0x0788 - 0x0598)
class AK32Emp final : public ABaseCamperCollectable
{
public:
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAcquiredChanged;                                 // 0x05A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector                                _customStrafingOffset;                             // 0x05B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _strafingOffsetMultiplier;                         // 0x05C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UK32EmpInteraction*                     _empInteraction;                                   // 0x05F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _empInteractionChargeable;                         // 0x05F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _empInteractionSecondsToCharge;                    // 0x0600(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _empRange;                                         // 0x0628(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _empAmmoCount;                                     // 0x0650(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _revealToSurvivorStatusEffectClass;                // 0x0678(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ACamperPlayer*>                  _authority_assimilatedSurvivorsInRange;            // 0x0680(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AK32KillerPod*>                  _authority_podsInRange;                            // 0x0690(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         _numTargetsInRange;                                // 0x06A0(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isVisible;                                        // 0x06A4(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isAcquiredFromPool;                               // 0x06A5(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A6[0x2];                                      // 0x06A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ADBDPlayer*, class UStatusEffect*> _revealToSurvivorStatusEffects;                    // 0x06A8(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _previousCollector;                                // 0x06F8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_700[0x88];                                     // 0x0700(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnDropped();
	void Cosmetic_OnEmpInteractionCancelled();
	void Cosmetic_OnEmpInteractionFinished(int32 NumberOfAffectedTargets, class ADBDPlayer* InteractingPlayer);
	void Cosmetic_OnEmpInteractionStarted();
	void Cosmetic_OnNumTargetsInRangeChanged(int32 NumberOfAffectedTargets);
	void Cosmetic_OnPickedUp();
	void Cosmetic_OnVisibilityChanged(bool PreviousIsVisible, bool IsVisible);
	void Multicast_UseEmp(const int32 NumAffectedTargets, class ADBDPlayer* InteractingPlayer);
	void OnEmpInteractionEntered(class ADBDPlayer* InteractingPlayer);
	void OnEmpInteractionFinished(class ADBDPlayer* InteractingPlayer, bool HasInteractionStarted);
	void OnRep_IsAcquiredFromPool();
	void OnRep_IsVisible(bool PreviousIsVisible);
	void OnRep_NumTargetsInRange();
	void SetComponentContextProviders();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32Emp">();
	}
	static class AK32Emp* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK32Emp>();
	}
};
static_assert(alignof(AK32Emp) == 0x000008, "Wrong alignment on AK32Emp");
static_assert(sizeof(AK32Emp) == 0x000788, "Wrong size on AK32Emp");
static_assert(offsetof(AK32Emp, OnAcquiredChanged) == 0x0005A0, "Member 'AK32Emp::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK32Emp, _customStrafingOffset) == 0x0005B0, "Member 'AK32Emp::_customStrafingOffset' has a wrong offset!");
static_assert(offsetof(AK32Emp, _strafingOffsetMultiplier) == 0x0005C8, "Member 'AK32Emp::_strafingOffsetMultiplier' has a wrong offset!");
static_assert(offsetof(AK32Emp, _empInteraction) == 0x0005F0, "Member 'AK32Emp::_empInteraction' has a wrong offset!");
static_assert(offsetof(AK32Emp, _empInteractionChargeable) == 0x0005F8, "Member 'AK32Emp::_empInteractionChargeable' has a wrong offset!");
static_assert(offsetof(AK32Emp, _empInteractionSecondsToCharge) == 0x000600, "Member 'AK32Emp::_empInteractionSecondsToCharge' has a wrong offset!");
static_assert(offsetof(AK32Emp, _empRange) == 0x000628, "Member 'AK32Emp::_empRange' has a wrong offset!");
static_assert(offsetof(AK32Emp, _empAmmoCount) == 0x000650, "Member 'AK32Emp::_empAmmoCount' has a wrong offset!");
static_assert(offsetof(AK32Emp, _revealToSurvivorStatusEffectClass) == 0x000678, "Member 'AK32Emp::_revealToSurvivorStatusEffectClass' has a wrong offset!");
static_assert(offsetof(AK32Emp, _authority_assimilatedSurvivorsInRange) == 0x000680, "Member 'AK32Emp::_authority_assimilatedSurvivorsInRange' has a wrong offset!");
static_assert(offsetof(AK32Emp, _authority_podsInRange) == 0x000690, "Member 'AK32Emp::_authority_podsInRange' has a wrong offset!");
static_assert(offsetof(AK32Emp, _numTargetsInRange) == 0x0006A0, "Member 'AK32Emp::_numTargetsInRange' has a wrong offset!");
static_assert(offsetof(AK32Emp, _isVisible) == 0x0006A4, "Member 'AK32Emp::_isVisible' has a wrong offset!");
static_assert(offsetof(AK32Emp, _isAcquiredFromPool) == 0x0006A5, "Member 'AK32Emp::_isAcquiredFromPool' has a wrong offset!");
static_assert(offsetof(AK32Emp, _revealToSurvivorStatusEffects) == 0x0006A8, "Member 'AK32Emp::_revealToSurvivorStatusEffects' has a wrong offset!");
static_assert(offsetof(AK32Emp, _previousCollector) == 0x0006F8, "Member 'AK32Emp::_previousCollector' has a wrong offset!");

// Class TheK32.K32EmpInteraction
// 0x0010 (0x08D0 - 0x08C0)
class UK32EmpInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x10];                                     // 0x08C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32EmpInteraction">();
	}
	static class UK32EmpInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32EmpInteraction>();
	}
};
static_assert(alignof(UK32EmpInteraction) == 0x000010, "Wrong alignment on UK32EmpInteraction");
static_assert(sizeof(UK32EmpInteraction) == 0x0008D0, "Wrong size on UK32EmpInteraction");

// Class TheK32.K32EmpScoreComponent
// 0x01A8 (0x0250 - 0x00A8)
class UK32EmpScoreComponent final : public UActorComponent
{
public:
	struct FDBDTunableRowHandle                   _minPodsRemovedForManyPodsRemovedScoreEvent;       // 0x00A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _minUnhookedSurvivorAssimilationsRemovedForManyCleansedScoreEvent; // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _minHookedSurvivorAssimilationsRemovedForManyCleansedScoreEvent; // 0x00F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _basePodRemovalScoreValue;                         // 0x0120(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _podRemovedScoreEventDepreciationCurve;            // 0x0148(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _unhookedSurvivorsCleansedScoreEventDepreciationCurve; // 0x0150(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _hookedSurvivorsCleansedScoreEventDepreciationCurve; // 0x0158(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0xF0];                                     // 0x0160(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32EmpScoreComponent">();
	}
	static class UK32EmpScoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32EmpScoreComponent>();
	}
};
static_assert(alignof(UK32EmpScoreComponent) == 0x000008, "Wrong alignment on UK32EmpScoreComponent");
static_assert(sizeof(UK32EmpScoreComponent) == 0x000250, "Wrong size on UK32EmpScoreComponent");
static_assert(offsetof(UK32EmpScoreComponent, _minPodsRemovedForManyPodsRemovedScoreEvent) == 0x0000A8, "Member 'UK32EmpScoreComponent::_minPodsRemovedForManyPodsRemovedScoreEvent' has a wrong offset!");
static_assert(offsetof(UK32EmpScoreComponent, _minUnhookedSurvivorAssimilationsRemovedForManyCleansedScoreEvent) == 0x0000D0, "Member 'UK32EmpScoreComponent::_minUnhookedSurvivorAssimilationsRemovedForManyCleansedScoreEvent' has a wrong offset!");
static_assert(offsetof(UK32EmpScoreComponent, _minHookedSurvivorAssimilationsRemovedForManyCleansedScoreEvent) == 0x0000F8, "Member 'UK32EmpScoreComponent::_minHookedSurvivorAssimilationsRemovedForManyCleansedScoreEvent' has a wrong offset!");
static_assert(offsetof(UK32EmpScoreComponent, _basePodRemovalScoreValue) == 0x000120, "Member 'UK32EmpScoreComponent::_basePodRemovalScoreValue' has a wrong offset!");
static_assert(offsetof(UK32EmpScoreComponent, _podRemovedScoreEventDepreciationCurve) == 0x000148, "Member 'UK32EmpScoreComponent::_podRemovedScoreEventDepreciationCurve' has a wrong offset!");
static_assert(offsetof(UK32EmpScoreComponent, _unhookedSurvivorsCleansedScoreEventDepreciationCurve) == 0x000150, "Member 'UK32EmpScoreComponent::_unhookedSurvivorsCleansedScoreEventDepreciationCurve' has a wrong offset!");
static_assert(offsetof(UK32EmpScoreComponent, _hookedSurvivorsCleansedScoreEventDepreciationCurve) == 0x000158, "Member 'UK32EmpScoreComponent::_hookedSurvivorsCleansedScoreEventDepreciationCurve' has a wrong offset!");

// Class TheK32.K32GameStateComponent
// 0x0010 (0x00B8 - 0x00A8)
class UK32GameStateComponent final : public UActorComponent
{
public:
	TArray<class AK32ItemBox*>                    _k32ItemBox;                                       // 0x00A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32GameStateComponent">();
	}
	static class UK32GameStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32GameStateComponent>();
	}
};
static_assert(alignof(UK32GameStateComponent) == 0x000008, "Wrong alignment on UK32GameStateComponent");
static_assert(sizeof(UK32GameStateComponent) == 0x0000B8, "Wrong size on UK32GameStateComponent");
static_assert(offsetof(UK32GameStateComponent, _k32ItemBox) == 0x0000A8, "Member 'UK32GameStateComponent::_k32ItemBox' has a wrong offset!");

// Class TheK32.K32ItemBox
// 0x00E8 (0x0490 - 0x03A8)
class AK32ItemBox final : public AInteractable
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UChargeableComponent*                   _chargeable;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACollectable*                           _spawnedItem;                                      // 0x03B8(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        _containingItemSpawnPoint;                         // 0x03C0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        _itemDropPoint;                                    // 0x03C8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EK32ItemBoxState                              _state;                                            // 0x03D0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UK32ItemBoxSpeedUpInteraction*          _itemBoxSpeedUpInteraction;                        // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractor*                            _interactor;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    _interactionZone;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDSkeletalMeshComponentBudgeted*      _skeletalMeshComponent;                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _inProgressDuration;                               // 0x0400(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _addon12ChargeTimeExtension;                       // 0x0428(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maxAutoChargeRatio;                               // 0x0450(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          _isSurvivorInteracting;                            // 0x0478(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             _survivorInteracting;                              // 0x0480(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnItemPickup(class ADBDPlayer* Player);
	void Cosmetic_OnStateChanged(EK32ItemBoxState NewState);
	void Cosmetic_OnSurvivorInteractingChanged(bool IsInteracting);
	void Multicast_SetIsChargeTimeExtended(const bool IsAddonExtendingFirstActivationTimer);
	void OnChargeableCompleteEvent(bool COMPLETED, const TArray<class AActor*>& InstigatorsForCompletion);
	void OnRep_IsSurvivorInteracting();
	void OnRep_SpawnedItem();
	void OnRep_State();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32ItemBox">();
	}
	static class AK32ItemBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK32ItemBox>();
	}
};
static_assert(alignof(AK32ItemBox) == 0x000008, "Wrong alignment on AK32ItemBox");
static_assert(sizeof(AK32ItemBox) == 0x000490, "Wrong size on AK32ItemBox");
static_assert(offsetof(AK32ItemBox, _chargeable) == 0x0003B0, "Member 'AK32ItemBox::_chargeable' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _spawnedItem) == 0x0003B8, "Member 'AK32ItemBox::_spawnedItem' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _containingItemSpawnPoint) == 0x0003C0, "Member 'AK32ItemBox::_containingItemSpawnPoint' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _itemDropPoint) == 0x0003C8, "Member 'AK32ItemBox::_itemDropPoint' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _state) == 0x0003D0, "Member 'AK32ItemBox::_state' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _itemBoxSpeedUpInteraction) == 0x0003D8, "Member 'AK32ItemBox::_itemBoxSpeedUpInteraction' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _interactor) == 0x0003E0, "Member 'AK32ItemBox::_interactor' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _interactionZone) == 0x0003E8, "Member 'AK32ItemBox::_interactionZone' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _outlineComponent) == 0x0003F0, "Member 'AK32ItemBox::_outlineComponent' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _skeletalMeshComponent) == 0x0003F8, "Member 'AK32ItemBox::_skeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _inProgressDuration) == 0x000400, "Member 'AK32ItemBox::_inProgressDuration' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _addon12ChargeTimeExtension) == 0x000428, "Member 'AK32ItemBox::_addon12ChargeTimeExtension' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _maxAutoChargeRatio) == 0x000450, "Member 'AK32ItemBox::_maxAutoChargeRatio' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _isSurvivorInteracting) == 0x000478, "Member 'AK32ItemBox::_isSurvivorInteracting' has a wrong offset!");
static_assert(offsetof(AK32ItemBox, _survivorInteracting) == 0x000480, "Member 'AK32ItemBox::_survivorInteracting' has a wrong offset!");

// Class TheK32.K32ItemBoxAnimInstance
// 0x0010 (0x0390 - 0x0380)
class UK32ItemBoxAnimInstance final : public UDBDBaseAnimInstance
{
public:
	class AK32ItemBox*                            _owningItemBox;                                    // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EK32ItemBoxState                              _currentState;                                     // 0x0388(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32ItemBoxAnimInstance">();
	}
	static class UK32ItemBoxAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32ItemBoxAnimInstance>();
	}
};
static_assert(alignof(UK32ItemBoxAnimInstance) == 0x000010, "Wrong alignment on UK32ItemBoxAnimInstance");
static_assert(sizeof(UK32ItemBoxAnimInstance) == 0x000390, "Wrong size on UK32ItemBoxAnimInstance");
static_assert(offsetof(UK32ItemBoxAnimInstance, _owningItemBox) == 0x000380, "Member 'UK32ItemBoxAnimInstance::_owningItemBox' has a wrong offset!");
static_assert(offsetof(UK32ItemBoxAnimInstance, _currentState) == 0x000388, "Member 'UK32ItemBoxAnimInstance::_currentState' has a wrong offset!");

// Class TheK32.K32ItemBoxIterativeWeightAdjustmentStrategy
// 0x0018 (0x0048 - 0x0030)
class UK32ItemBoxIterativeWeightAdjustmentStrategy final : public UIterativeWeightAdjustmentStrategy
{
public:
	TArray<TScriptInterface<class IWeightedElement>> _selectedSpawners;                                 // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _penaltyFromDistanceToClosestK32ItemBox;           // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32ItemBoxIterativeWeightAdjustmentStrategy">();
	}
	static class UK32ItemBoxIterativeWeightAdjustmentStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32ItemBoxIterativeWeightAdjustmentStrategy>();
	}
};
static_assert(alignof(UK32ItemBoxIterativeWeightAdjustmentStrategy) == 0x000008, "Wrong alignment on UK32ItemBoxIterativeWeightAdjustmentStrategy");
static_assert(sizeof(UK32ItemBoxIterativeWeightAdjustmentStrategy) == 0x000048, "Wrong size on UK32ItemBoxIterativeWeightAdjustmentStrategy");
static_assert(offsetof(UK32ItemBoxIterativeWeightAdjustmentStrategy, _selectedSpawners) == 0x000030, "Member 'UK32ItemBoxIterativeWeightAdjustmentStrategy::_selectedSpawners' has a wrong offset!");
static_assert(offsetof(UK32ItemBoxIterativeWeightAdjustmentStrategy, _penaltyFromDistanceToClosestK32ItemBox) == 0x000040, "Member 'UK32ItemBoxIterativeWeightAdjustmentStrategy::_penaltyFromDistanceToClosestK32ItemBox' has a wrong offset!");

// Class TheK32.K32ItemBoxManagerComponent
// 0x0048 (0x00F0 - 0x00A8)
class UK32ItemBoxManagerComponent final : public UActorComponent
{
public:
	struct FDBDTunableRowHandle                   _initialNumberOfInProgressBoxes;                   // 0x00A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class AK32ItemBox*>                    _itemBoxes;                                        // 0x00D0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnItemBoxDeactivated(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32ItemBoxManagerComponent">();
	}
	static class UK32ItemBoxManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32ItemBoxManagerComponent>();
	}
};
static_assert(alignof(UK32ItemBoxManagerComponent) == 0x000008, "Wrong alignment on UK32ItemBoxManagerComponent");
static_assert(sizeof(UK32ItemBoxManagerComponent) == 0x0000F0, "Wrong size on UK32ItemBoxManagerComponent");
static_assert(offsetof(UK32ItemBoxManagerComponent, _initialNumberOfInProgressBoxes) == 0x0000A8, "Member 'UK32ItemBoxManagerComponent::_initialNumberOfInProgressBoxes' has a wrong offset!");
static_assert(offsetof(UK32ItemBoxManagerComponent, _itemBoxes) == 0x0000D0, "Member 'UK32ItemBoxManagerComponent::_itemBoxes' has a wrong offset!");

// Class TheK32.K32ItemBoxOutlineUpdateStrategy
// 0x00D0 (0x01A0 - 0x00D0)
class UK32ItemBoxOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FTunableStat                           _distanceToShowOutline;                            // 0x00D0(0x0080)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _isOutlineVisibleToSurvivorsWithEmp;               // 0x0150(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _belowMaxAutoChargeRatioOutlineColor;              // 0x0178(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _aboveMaxAutoChargeRatioOutlineColor;              // 0x0188(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDistanceStatValueUpdated(const float Distance);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32ItemBoxOutlineUpdateStrategy">();
	}
	static class UK32ItemBoxOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32ItemBoxOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UK32ItemBoxOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UK32ItemBoxOutlineUpdateStrategy");
static_assert(sizeof(UK32ItemBoxOutlineUpdateStrategy) == 0x0001A0, "Wrong size on UK32ItemBoxOutlineUpdateStrategy");
static_assert(offsetof(UK32ItemBoxOutlineUpdateStrategy, _distanceToShowOutline) == 0x0000D0, "Member 'UK32ItemBoxOutlineUpdateStrategy::_distanceToShowOutline' has a wrong offset!");
static_assert(offsetof(UK32ItemBoxOutlineUpdateStrategy, _isOutlineVisibleToSurvivorsWithEmp) == 0x000150, "Member 'UK32ItemBoxOutlineUpdateStrategy::_isOutlineVisibleToSurvivorsWithEmp' has a wrong offset!");
static_assert(offsetof(UK32ItemBoxOutlineUpdateStrategy, _belowMaxAutoChargeRatioOutlineColor) == 0x000178, "Member 'UK32ItemBoxOutlineUpdateStrategy::_belowMaxAutoChargeRatioOutlineColor' has a wrong offset!");
static_assert(offsetof(UK32ItemBoxOutlineUpdateStrategy, _aboveMaxAutoChargeRatioOutlineColor) == 0x000188, "Member 'UK32ItemBoxOutlineUpdateStrategy::_aboveMaxAutoChargeRatioOutlineColor' has a wrong offset!");

// Class TheK32.K32ItemBoxSpeedUpInteraction
// 0x00A0 (0x0960 - 0x08C0)
class UK32ItemBoxSpeedUpInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x18];                                     // 0x08C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _interactionProgressMultiplier;                    // 0x08D8(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_958[0x8];                                      // 0x0958(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32ItemBoxSpeedUpInteraction">();
	}
	static class UK32ItemBoxSpeedUpInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32ItemBoxSpeedUpInteraction>();
	}
};
static_assert(alignof(UK32ItemBoxSpeedUpInteraction) == 0x000010, "Wrong alignment on UK32ItemBoxSpeedUpInteraction");
static_assert(sizeof(UK32ItemBoxSpeedUpInteraction) == 0x000960, "Wrong size on UK32ItemBoxSpeedUpInteraction");
static_assert(offsetof(UK32ItemBoxSpeedUpInteraction, _interactionProgressMultiplier) == 0x0008D8, "Member 'UK32ItemBoxSpeedUpInteraction::_interactionProgressMultiplier' has a wrong offset!");

// Class TheK32.K32KillerInstinctStatusEffect
// 0x0038 (0x03B8 - 0x0380)
class UK32KillerInstinctStatusEffect final : public UKillerInstinctStatusEffect
{
public:
	EK32KillerInstinctType                        _killerInstinctType;                               // 0x0380(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_381[0x37];                                     // 0x0381(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32KillerInstinctStatusEffect">();
	}
	static class UK32KillerInstinctStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32KillerInstinctStatusEffect>();
	}
};
static_assert(alignof(UK32KillerInstinctStatusEffect) == 0x000008, "Wrong alignment on UK32KillerInstinctStatusEffect");
static_assert(sizeof(UK32KillerInstinctStatusEffect) == 0x0003B8, "Wrong size on UK32KillerInstinctStatusEffect");
static_assert(offsetof(UK32KillerInstinctStatusEffect, _killerInstinctType) == 0x000380, "Member 'UK32KillerInstinctStatusEffect::_killerInstinctType' has a wrong offset!");

// Class TheK32.K32KillerPod
// 0x02A8 (0x0548 - 0x02A0)
class AK32KillerPod final : public AActor
{
public:
	uint8                                         Pad_2A0[0x18];                                     // 0x02A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDisabledChanged;                                 // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x18];                                     // 0x02C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAcquiredChanged;                                 // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   _overlapTestingMeshComponent;                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMapActorComponent*                     _mapActorComponent;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _podDisableTime;                                   // 0x0300(0x0080)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _killerHearSoundsInPodActivationDelay;             // 0x0380(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _podDisabledPreEndingEffectTime;                   // 0x03A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FK32KillerPodSettings                  _settings;                                         // 0x03D0(0x0098)(Net, RepNotify, NativeAccessSpecifierPrivate)
	bool                                          _isAcquiredFromPool;                               // 0x0468(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_469[0xB7];                                     // 0x0469(0x00B7)(Fixing Size After Last Property [ Dumper-7 ])
	class UK32PodDangerPredictionComponent*       _dangerPredictionComponent;                        // 0x0520(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAIPerceptionStimuliSourceComponent*    _perceptionStimuliComponent;                       // 0x0528(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_530[0x18];                                     // 0x0530(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnDisabledTimerDone();
	void Authority_OnPodDisabledPreEndingEffectStarted();
	void Cosmetic_IsBlockingPodSpawningChanged(const bool IsBlocking, const float DistanceBetweenPods);
	void Cosmetic_OnControlledByKillerChanged(const struct FK32KillerPodSettings& PreviousSettings, const struct FK32KillerPodSettings& Settings);
	void Cosmetic_OnDestroyedByEmp(class ADBDPlayer* DestroyingSurvivor);
	void Cosmetic_OnDestroyedByManualRemoval();
	void Cosmetic_OnDestroyedByRecycle();
	void Cosmetic_OnDisabledChanged(const struct FK32KillerPodSettings& PreviousSettings, const struct FK32KillerPodSettings& Settings);
	void Cosmetic_OnKillerHearSoundsInPodActivated();
	void Cosmetic_OnKillerHearSoundsInPodDeactivated();
	void Cosmetic_OnSettingsChanged(const struct FK32KillerPodSettings& PreviousSettings, const struct FK32KillerPodSettings& Settings);
	void Multicast_OnDestroyedByEmp(class ADBDPlayer* DestroyingSurvivor);
	void Multicast_OnDestroyedByManualRemoval();
	void Multicast_OnDestroyedByRecycle();
	void Multicast_OnPodDisabled();
	void OnKillerLocallyObservedChanged(const bool IsKillerLocallyObserved);
	void OnKillerSet(class ASlasherPlayer* Killer);
	void OnLevelReadyToPlay();
	void OnRep_IsAcquiredFromPool();
	void OnRep_Settings(const struct FK32KillerPodSettings& PreviousSettings);
	void OnVisibilityChanged(const struct FK32KillerPodSettings& PreviousSettings, const struct FK32KillerPodSettings& Settings);

	class ASlasherPlayer* GetKiller() const;
	struct FK32KillerPodSettings GetSettings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32KillerPod">();
	}
	static class AK32KillerPod* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK32KillerPod>();
	}
};
static_assert(alignof(AK32KillerPod) == 0x000008, "Wrong alignment on AK32KillerPod");
static_assert(sizeof(AK32KillerPod) == 0x000548, "Wrong size on AK32KillerPod");
static_assert(offsetof(AK32KillerPod, OnDisabledChanged) == 0x0002B8, "Member 'AK32KillerPod::OnDisabledChanged' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, OnAcquiredChanged) == 0x0002E0, "Member 'AK32KillerPod::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _overlapTestingMeshComponent) == 0x0002F0, "Member 'AK32KillerPod::_overlapTestingMeshComponent' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _mapActorComponent) == 0x0002F8, "Member 'AK32KillerPod::_mapActorComponent' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _podDisableTime) == 0x000300, "Member 'AK32KillerPod::_podDisableTime' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _killerHearSoundsInPodActivationDelay) == 0x000380, "Member 'AK32KillerPod::_killerHearSoundsInPodActivationDelay' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _podDisabledPreEndingEffectTime) == 0x0003A8, "Member 'AK32KillerPod::_podDisabledPreEndingEffectTime' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _settings) == 0x0003D0, "Member 'AK32KillerPod::_settings' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _isAcquiredFromPool) == 0x000468, "Member 'AK32KillerPod::_isAcquiredFromPool' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _dangerPredictionComponent) == 0x000520, "Member 'AK32KillerPod::_dangerPredictionComponent' has a wrong offset!");
static_assert(offsetof(AK32KillerPod, _perceptionStimuliComponent) == 0x000528, "Member 'AK32KillerPod::_perceptionStimuliComponent' has a wrong offset!");

// Class TheK32.K32KillerPodAimingCrosshairComponent
// 0x0008 (0x00F0 - 0x00E8)
class UK32KillerPodAimingCrosshairComponent final : public UAimingCrosshairComponent
{
public:
	class UCameraComponent*                       _currentPodCamera;                                 // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UCameraComponent* GetCurrentPodCamera();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32KillerPodAimingCrosshairComponent">();
	}
	static class UK32KillerPodAimingCrosshairComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32KillerPodAimingCrosshairComponent>();
	}
};
static_assert(alignof(UK32KillerPodAimingCrosshairComponent) == 0x000008, "Wrong alignment on UK32KillerPodAimingCrosshairComponent");
static_assert(sizeof(UK32KillerPodAimingCrosshairComponent) == 0x0000F0, "Wrong size on UK32KillerPodAimingCrosshairComponent");
static_assert(offsetof(UK32KillerPodAimingCrosshairComponent, _currentPodCamera) == 0x0000E8, "Member 'UK32KillerPodAimingCrosshairComponent::_currentPodCamera' has a wrong offset!");

// Class TheK32.K32KillerPodLockOnCooldownComponent
// 0x00A0 (0x0148 - 0x00A8)
class UK32KillerPodLockOnCooldownComponent final : public UActorComponent
{
public:
	struct FTunableStat                           _cooldownTime;                                     // 0x00A8(0x0080)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x20];                                     // 0x0128(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K32KillerPodLockOnCooldownComponent">();
	}
	static class UK32KillerPodLockOnCooldownComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK32KillerPodLockOnCooldownComponent>();
	}
};
static_assert(alignof(UK32KillerPodLockOnCooldownComponent) == 0x000008, "Wrong alignment on UK32KillerPodLockOnCooldownComponent");
static_assert(sizeof(UK32KillerPodLockOnCooldownComponent) == 0x000148, "Wrong size on UK32KillerPodLockOnCooldownComponent");
static_assert(offsetof(UK32KillerPodLockOnCooldownComponent, _cooldownTime) == 0x0000A8, "Member 'UK32KillerPodLockOnCooldownComponent::_cooldownTime' has a wrong offset!");

// Class TheK32.K32KillerPodLockOnProgressComponent
// 0x0088 (0x0130 - 0x00A8)
class UK32KillerPodLockOnProgressComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x1];                                       // 0x00A8(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EAimingCrosshairState                         _crosshairState;                                   // 0x00A9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
