#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK25

#include "Basic.hpp"

#include "SystemUtilities_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "Competence_classes.hpp"
#include "Projectile_structs.hpp"
#include "Projectile_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TheK25_structs.hpp"
#include "FiniteStateMachine_classes.hpp"
#include "GameplayUtilities_classes.hpp"
#include "DBDInteraction_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDAttack_classes.hpp"
#include "DBDGameplay_structs.hpp"
#include "AnimationUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class TheK25.K25Projectile
// 0x0118 (0x04C0 - 0x03A8)
class AK25Projectile : public AKillerProjectile
{
public:
	uint8                                         Pad_3A8[0x48];                                     // 0x03A8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   _staticMesh;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    _characterCollider;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    _environmentCollider;                              // 0x0400(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKillerProjectileDodgeComponent*        _projectileDodgeComponent;                         // 0x0408(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLaunchInfo                            _launchInfo;                                       // 0x0410(0x0038)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class AK25Chain*                              _attachedChain;                                    // 0x0448(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _timeIgnoreSlasherCollision;                       // 0x0450(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isActive;                                         // 0x0454(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FK25ProjectileDeactivationData         _lastDeactivationData;                             // 0x0458(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x48];                                     // 0x0478(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnProjectileActivated();
	void Cosmetic_OnProjectileDeactivated(const struct FK25ProjectileDeactivationData& DeactivationData);
	void OnProjectileStopped(const struct FHitResult& Result);
	void Server_RequestDisableProjectile(EK25ProjectileDeactivateReason DeactivateReason);

	struct FVector GetChainAttachmentLocation() const;
	class UDBDProjectileMovementComponent* GetMovementComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25Projectile">();
	}
	static class AK25Projectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK25Projectile>();
	}
};
static_assert(alignof(AK25Projectile) == 0x000008, "Wrong alignment on AK25Projectile");
static_assert(sizeof(AK25Projectile) == 0x0004C0, "Wrong size on AK25Projectile");
static_assert(offsetof(AK25Projectile, _staticMesh) == 0x0003F0, "Member 'AK25Projectile::_staticMesh' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _characterCollider) == 0x0003F8, "Member 'AK25Projectile::_characterCollider' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _environmentCollider) == 0x000400, "Member 'AK25Projectile::_environmentCollider' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _projectileDodgeComponent) == 0x000408, "Member 'AK25Projectile::_projectileDodgeComponent' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _launchInfo) == 0x000410, "Member 'AK25Projectile::_launchInfo' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _attachedChain) == 0x000448, "Member 'AK25Projectile::_attachedChain' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _timeIgnoreSlasherCollision) == 0x000450, "Member 'AK25Projectile::_timeIgnoreSlasherCollision' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _isActive) == 0x000454, "Member 'AK25Projectile::_isActive' has a wrong offset!");
static_assert(offsetof(AK25Projectile, _lastDeactivationData) == 0x000458, "Member 'AK25Projectile::_lastDeactivationData' has a wrong offset!");

// Class TheK25.K25UncontrolledProjectile
// 0x0188 (0x0648 - 0x04C0)
class AK25UncontrolledProjectile final : public AK25Projectile
{
public:
	uint8                                         Pad_4C0[0x8];                                      // 0x04C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAcquiredChanged;                                 // 0x04C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _minimumTimeBeforeProjectileLaunch;                // 0x04D8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _maximumTimeBeforeProjectileLaunch;                // 0x0500(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _projectileSpeed;                                  // 0x0528(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _projectileMaximumTravelDistance;                  // 0x0550(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _maximumInactiveProjectileTime;                    // 0x0578(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          _isAcquiredFromPool;                               // 0x05A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A1[0x67];                                     // 0x05A1(0x0067)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          _targetSurvivor;                                   // 0x0608(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_610[0x38];                                     // 0x0610(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnDamageStateChanged(ECamperDamageState OldDamageState, ECamperDamageState CurrentDamageState);
	void Cosmetic_TriggerUncontrolledProjectileSpawnSFX();
	void OnRep_TargetSurvivor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25UncontrolledProjectile">();
	}
	static class AK25UncontrolledProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK25UncontrolledProjectile>();
	}
};
static_assert(alignof(AK25UncontrolledProjectile) == 0x000008, "Wrong alignment on AK25UncontrolledProjectile");
static_assert(sizeof(AK25UncontrolledProjectile) == 0x000648, "Wrong size on AK25UncontrolledProjectile");
static_assert(offsetof(AK25UncontrolledProjectile, OnAcquiredChanged) == 0x0004C8, "Member 'AK25UncontrolledProjectile::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _minimumTimeBeforeProjectileLaunch) == 0x0004D8, "Member 'AK25UncontrolledProjectile::_minimumTimeBeforeProjectileLaunch' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _maximumTimeBeforeProjectileLaunch) == 0x000500, "Member 'AK25UncontrolledProjectile::_maximumTimeBeforeProjectileLaunch' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _projectileSpeed) == 0x000528, "Member 'AK25UncontrolledProjectile::_projectileSpeed' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _projectileMaximumTravelDistance) == 0x000550, "Member 'AK25UncontrolledProjectile::_projectileMaximumTravelDistance' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _maximumInactiveProjectileTime) == 0x000578, "Member 'AK25UncontrolledProjectile::_maximumInactiveProjectileTime' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _isAcquiredFromPool) == 0x0005A0, "Member 'AK25UncontrolledProjectile::_isAcquiredFromPool' has a wrong offset!");
static_assert(offsetof(AK25UncontrolledProjectile, _targetSurvivor) == 0x000608, "Member 'AK25UncontrolledProjectile::_targetSurvivor' has a wrong offset!");

// Class TheK25.Addon_K25Power_16
// 0x0010 (0x02F8 - 0x02E8)
class UAddon_K25Power_16 final : public UItemAddon
{
public:
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K25Power_16">();
	}
	static class UAddon_K25Power_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K25Power_16>();
	}
};
static_assert(alignof(UAddon_K25Power_16) == 0x000008, "Wrong alignment on UAddon_K25Power_16");
static_assert(sizeof(UAddon_K25Power_16) == 0x0002F8, "Wrong size on UAddon_K25Power_16");

// Class TheK25.K25AttackSubAnimInstance
// 0x0010 (0x06D0 - 0x06C0)
class UK25AttackSubAnimInstance final : public UKillerAttackSubAnimInstance
{
public:
	bool                                          _hasDownedTargetHoldingLamentConfiguration;        // 0x06B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B9[0x17];                                     // 0x06B9(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttackStart(const EAttackType AttackType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25AttackSubAnimInstance">();
	}
	static class UK25AttackSubAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25AttackSubAnimInstance>();
	}
};
static_assert(alignof(UK25AttackSubAnimInstance) == 0x000010, "Wrong alignment on UK25AttackSubAnimInstance");
static_assert(sizeof(UK25AttackSubAnimInstance) == 0x0006D0, "Wrong size on UK25AttackSubAnimInstance");
static_assert(offsetof(UK25AttackSubAnimInstance, _hasDownedTargetHoldingLamentConfiguration) == 0x0006B8, "Member 'UK25AttackSubAnimInstance::_hasDownedTargetHoldingLamentConfiguration' has a wrong offset!");

// Class TheK25.K25ProjectileReplicationComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK25ProjectileReplicationComponent : public UBaseProjectileReplicationComponent
{
public:
	void Multicast_DeactivateProjectile(class AK25Projectile* Projectile, const struct FK25ProjectileDeactivationData& DeactivationData);
	void Multicast_SetAttachedChain(class AK25Projectile* Projectile, class AK25Chain* ChainToAttach, const struct FLaunchInfo& LaunchInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25ProjectileReplicationComponent">();
	}
	static class UK25ProjectileReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25ProjectileReplicationComponent>();
	}
};
static_assert(alignof(UK25ProjectileReplicationComponent) == 0x000008, "Wrong alignment on UK25ProjectileReplicationComponent");
static_assert(sizeof(UK25ProjectileReplicationComponent) == 0x0000A8, "Wrong size on UK25ProjectileReplicationComponent");

// Class TheK25.K25UncontrolledProjectileReplicationComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK25UncontrolledProjectileReplicationComponent final : public UK25ProjectileReplicationComponent
{
public:
	void Multicast_LaunchProjectile(class AK25UncontrolledProjectile* Projectile, const struct FLaunchInfo& LaunchInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25UncontrolledProjectileReplicationComponent">();
	}
	static class UK25UncontrolledProjectileReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25UncontrolledProjectileReplicationComponent>();
	}
};
static_assert(alignof(UK25UncontrolledProjectileReplicationComponent) == 0x000008, "Wrong alignment on UK25UncontrolledProjectileReplicationComponent");
static_assert(sizeof(UK25UncontrolledProjectileReplicationComponent) == 0x0000A8, "Wrong size on UK25UncontrolledProjectileReplicationComponent");

// Class TheK25.AISkill_FindCollectable_LamentConfiguration
// 0x00C0 (0x0438 - 0x0378)
class UAISkill_FindCollectable_LamentConfiguration final : public UAISkill_FindCollectable
{
public:
	struct FAITunableParameter                    StopChainHuntGoalWeight;                           // 0x0378(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    PreemptiveFindLamentGoalWeight;                    // 0x03D8(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindCollectable_LamentConfiguration">();
	}
	static class UAISkill_FindCollectable_LamentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindCollectable_LamentConfiguration>();
	}
};
static_assert(alignof(UAISkill_FindCollectable_LamentConfiguration) == 0x000008, "Wrong alignment on UAISkill_FindCollectable_LamentConfiguration");
static_assert(sizeof(UAISkill_FindCollectable_LamentConfiguration) == 0x000438, "Wrong size on UAISkill_FindCollectable_LamentConfiguration");
static_assert(offsetof(UAISkill_FindCollectable_LamentConfiguration, StopChainHuntGoalWeight) == 0x000378, "Member 'UAISkill_FindCollectable_LamentConfiguration::StopChainHuntGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindCollectable_LamentConfiguration, PreemptiveFindLamentGoalWeight) == 0x0003D8, "Member 'UAISkill_FindCollectable_LamentConfiguration::PreemptiveFindLamentGoalWeight' has a wrong offset!");

// Class TheK25.K25Utilities
// 0x0000 (0x0030 - 0x0030)
class UK25Utilities final : public UBlueprintFunctionLibrary
{
public:
	static class AK25ControlledProjectile* GetK25ControlledProjectile(const class UObject* WorldContextObject);
	static class AK25Gateway* GetK25Gateway(const class UObject* WorldContextObject);
	static class AK25Husk* GetK25Husk(const class UObject* WorldContextObject);
	static class AK25Power* GetK25Power(const class UObject* WorldContextObject);
	static class ALamentConfiguration* GetLamentConfiguration(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25Utilities">();
	}
	static class UK25Utilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25Utilities>();
	}
};
static_assert(alignof(UK25Utilities) == 0x000008, "Wrong alignment on UK25Utilities");
static_assert(sizeof(UK25Utilities) == 0x000030, "Wrong size on UK25Utilities");

// Class TheK25.AISkill_InteractionBreakFreeFromChains
// 0x0028 (0x02A8 - 0x0280)
class UAISkill_InteractionBreakFreeFromChains final : public UAISkill_Interaction
{
public:
	struct FDBDTunableRowHandle                   _breakFreeFromChainsMaxCharge;                     // 0x0280(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionBreakFreeFromChains">();
	}
	static class UAISkill_InteractionBreakFreeFromChains* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionBreakFreeFromChains>();
	}
};
static_assert(alignof(UAISkill_InteractionBreakFreeFromChains) == 0x000008, "Wrong alignment on UAISkill_InteractionBreakFreeFromChains");
static_assert(sizeof(UAISkill_InteractionBreakFreeFromChains) == 0x0002A8, "Wrong size on UAISkill_InteractionBreakFreeFromChains");
static_assert(offsetof(UAISkill_InteractionBreakFreeFromChains, _breakFreeFromChainsMaxCharge) == 0x000280, "Member 'UAISkill_InteractionBreakFreeFromChains::_breakFreeFromChainsMaxCharge' has a wrong offset!");

// Class TheK25.AISkill_InteractionUseItem_LamentConfiguration
// 0x0088 (0x0318 - 0x0290)
class UAISkill_InteractionUseItem_LamentConfiguration final : public UAISkill_InteractionUseItem
{
public:
	struct FAITunableParameter                    SolveLamentThreshold;                              // 0x0290(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDBDTunableRowHandle                   _solveLamentMaxCharge;                             // 0x02F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_InteractionUseItem_LamentConfiguration">();
	}
	static class UAISkill_InteractionUseItem_LamentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_InteractionUseItem_LamentConfiguration>();
	}
};
static_assert(alignof(UAISkill_InteractionUseItem_LamentConfiguration) == 0x000008, "Wrong alignment on UAISkill_InteractionUseItem_LamentConfiguration");
static_assert(sizeof(UAISkill_InteractionUseItem_LamentConfiguration) == 0x000318, "Wrong size on UAISkill_InteractionUseItem_LamentConfiguration");
static_assert(offsetof(UAISkill_InteractionUseItem_LamentConfiguration, SolveLamentThreshold) == 0x000290, "Member 'UAISkill_InteractionUseItem_LamentConfiguration::SolveLamentThreshold' has a wrong offset!");
static_assert(offsetof(UAISkill_InteractionUseItem_LamentConfiguration, _solveLamentMaxCharge) == 0x0002F0, "Member 'UAISkill_InteractionUseItem_LamentConfiguration::_solveLamentMaxCharge' has a wrong offset!");

// Class TheK25.LamentConfiguration
// 0x02E8 (0x0838 - 0x0550)
class ALamentConfiguration final : public ACollectable
{
public:
	uint8                                         Pad_550[0x30];                                     // 0x0550(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USpherePlayerOverlapComponent*          _interactable;                                     // 0x0580(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractor*                            _collectableInteractor;                            // 0x0588(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25CollectLamentConfigurationInteraction* _survivorCollectItemInteraction;                   // 0x0590(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25CollectLamentConfigurationInteraction* _killerCollectItemInteraction;                     // 0x0598(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDOutlineComponent*                   _outlineComponent;                                 // 0x05A0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialHelper*                        _materialHelper;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULamentConfigurationOutlineStrategy*    _outlineStrategy;                                  // 0x05B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULamentConfigurationSpawnStrategy*      _spawnStrategy;                                    // 0x05B8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULamentConfigurationChainHuntComponent* _chainHuntComponent;                               // 0x05C0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _dotProductMinValue;                               // 0x05C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttachToSocketNameEnum                       _survivorAttachmentSocket;                         // 0x05CC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttachToSocketNameEnum                       _killerAttachmentSocket;                           // 0x05CD(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5CE[0x2];                                      // 0x05CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationMontageSlave*                 _montageFollower;                                  // 0x05D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMontagePlayer*                         _montagePlayer;                                    // 0x05D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AAnimationFollowerActor>    _chainAnimationActorClass;                         // 0x05E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AK25LamentConfigurationTeleportIndicator> _lamentConfigurationTeleportIndicatorClass;        // 0x05E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   _chainAnimationFollowerAttachmentSocketName;       // 0x05F0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkObservedPlayerSoundLoop             _possessionSoundLoop;                              // 0x0600(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterLamentConfigurationSolved;        // 0x0640(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterKillerPickUp;                     // 0x0668(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterSurvivorFreeBySelf;               // 0x0690(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _respawnTimeAfterSurvivorFreeByAttack;             // 0x06B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _numberChainsToLaunchUponKillerPickUpLamentConfiguration; // 0x06E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                   _hostageInteractionTime;                           // 0x0708(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_730[0x8];                                      // 0x0730(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ELamentConfigurationState                     _localLamentConfigurationState;                    // 0x0738(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELamentConfigurationState                     _lamentconfigurationState;                         // 0x0739(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_73A[0x6];                                      // 0x073A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAnimationFollowerActor*                _chainAnimationActor;                              // 0x0740(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_748[0x40];                                     // 0x0748(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          _survivorHeldHostage;                              // 0x0788(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_790[0x88];                                     // 0x0790(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          _standingOnLamentConfigurationCollisionChecker;    // 0x0818(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _timeAllowedToStandOnCubeBeforeTeleport;           // 0x0820(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _solvedLamentConfigurationDropDistanceToCollectorCentimeters; // 0x0824(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _failedLamentConfigurationSolveDropDistanceToCollectorCentimeters; // 0x0828(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _solved;                                           // 0x082C(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _releasedByAttack;                                 // 0x082D(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_82E[0x2];                                      // 0x082E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AK25LamentConfigurationTeleportIndicator* _lamentConfigurationTeleportIndicator;             // 0x0830(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnEndGameOver(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Authority_OnGameEnded(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Authority_OnIntroCompletedOrLevelReadyToPlay();
	void Authority_OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Authority_OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Authority_OnSurvivorHitByControlledProjectile(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Authority_RespawnLamentConfiguration(bool TriggerChainHuntUponSpawning);
	void Cosmetic_BeginSolvingCube();
	void Cosmetic_EndSolvingCube(bool HasBeenSolved);
	void Cosmetic_OnChainHuntChargeEnd();
	void Cosmetic_OnChainHuntChargeStart(float ChargeTime);
	void Cosmetic_OnChainHuntEndedEffects();
	void Cosmetic_OnChainHuntStartedEffects();
	void Cosmetic_OnHoldingSurvivorHostageEnd(bool HasEndedThroughKillerAttack);
	void Cosmetic_OnHoldingSurvivorHostageStart(float HostageDuration);
	void Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration(class ASlasherPlayer* Killer, class ACamperPlayer* SurvivorDowned);
	void Cosmetic_TriggerDisappearsSFX();
	void Cosmetic_TriggerOnSurvivorEscapedWithLamentConfigurationSFX();
	void Cosmetic_TriggerRespawnDuringChainHuntSFX();
	void Cosmetic_TriggerSolvedSFX();
	void Cosmetic_TriggerSpawnedSFX();
	void Cosmetic_TriggerSurvivorPickUpSFX();
	void Multicast_CorrectLamentConfigurationPosition(const struct FVector& NewPosition);
	void Multicast_DownedSurvivorHoldingLamentConfiguration(class ACamperPlayer* Survivor);
	void Multicast_TriggerKillerPickUpSFX(const TArray<class ACamperPlayer*>& AffectedSurvivors);
	void Multicast_TriggerSolvedSFX();
	void OnCamperEscaped(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void OnRep_LamentConfigurationState();
	void OnRep_SurvivorHeldHostage(class ACamperPlayer* OldSurvivorHeldHostage);
	void TriggerKillerPickUpSFX(const TArray<class ACamperPlayer*>& AffectedSurvivors);

	float GetChainHuntProgressPercentage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LamentConfiguration">();
	}
	static class ALamentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALamentConfiguration>();
	}
};
static_assert(alignof(ALamentConfiguration) == 0x000008, "Wrong alignment on ALamentConfiguration");
static_assert(sizeof(ALamentConfiguration) == 0x000838, "Wrong size on ALamentConfiguration");
static_assert(offsetof(ALamentConfiguration, _interactable) == 0x000580, "Member 'ALamentConfiguration::_interactable' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _collectableInteractor) == 0x000588, "Member 'ALamentConfiguration::_collectableInteractor' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _survivorCollectItemInteraction) == 0x000590, "Member 'ALamentConfiguration::_survivorCollectItemInteraction' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _killerCollectItemInteraction) == 0x000598, "Member 'ALamentConfiguration::_killerCollectItemInteraction' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _outlineComponent) == 0x0005A0, "Member 'ALamentConfiguration::_outlineComponent' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _materialHelper) == 0x0005A8, "Member 'ALamentConfiguration::_materialHelper' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _outlineStrategy) == 0x0005B0, "Member 'ALamentConfiguration::_outlineStrategy' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _spawnStrategy) == 0x0005B8, "Member 'ALamentConfiguration::_spawnStrategy' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainHuntComponent) == 0x0005C0, "Member 'ALamentConfiguration::_chainHuntComponent' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _dotProductMinValue) == 0x0005C8, "Member 'ALamentConfiguration::_dotProductMinValue' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _survivorAttachmentSocket) == 0x0005CC, "Member 'ALamentConfiguration::_survivorAttachmentSocket' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _killerAttachmentSocket) == 0x0005CD, "Member 'ALamentConfiguration::_killerAttachmentSocket' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _montageFollower) == 0x0005D0, "Member 'ALamentConfiguration::_montageFollower' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _montagePlayer) == 0x0005D8, "Member 'ALamentConfiguration::_montagePlayer' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainAnimationActorClass) == 0x0005E0, "Member 'ALamentConfiguration::_chainAnimationActorClass' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _lamentConfigurationTeleportIndicatorClass) == 0x0005E8, "Member 'ALamentConfiguration::_lamentConfigurationTeleportIndicatorClass' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainAnimationFollowerAttachmentSocketName) == 0x0005F0, "Member 'ALamentConfiguration::_chainAnimationFollowerAttachmentSocketName' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _possessionSoundLoop) == 0x000600, "Member 'ALamentConfiguration::_possessionSoundLoop' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterLamentConfigurationSolved) == 0x000640, "Member 'ALamentConfiguration::_respawnTimeAfterLamentConfigurationSolved' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterKillerPickUp) == 0x000668, "Member 'ALamentConfiguration::_respawnTimeAfterKillerPickUp' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterSurvivorFreeBySelf) == 0x000690, "Member 'ALamentConfiguration::_respawnTimeAfterSurvivorFreeBySelf' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _respawnTimeAfterSurvivorFreeByAttack) == 0x0006B8, "Member 'ALamentConfiguration::_respawnTimeAfterSurvivorFreeByAttack' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _numberChainsToLaunchUponKillerPickUpLamentConfiguration) == 0x0006E0, "Member 'ALamentConfiguration::_numberChainsToLaunchUponKillerPickUpLamentConfiguration' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _hostageInteractionTime) == 0x000708, "Member 'ALamentConfiguration::_hostageInteractionTime' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _localLamentConfigurationState) == 0x000738, "Member 'ALamentConfiguration::_localLamentConfigurationState' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _lamentconfigurationState) == 0x000739, "Member 'ALamentConfiguration::_lamentconfigurationState' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _chainAnimationActor) == 0x000740, "Member 'ALamentConfiguration::_chainAnimationActor' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _survivorHeldHostage) == 0x000788, "Member 'ALamentConfiguration::_survivorHeldHostage' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _standingOnLamentConfigurationCollisionChecker) == 0x000818, "Member 'ALamentConfiguration::_standingOnLamentConfigurationCollisionChecker' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _timeAllowedToStandOnCubeBeforeTeleport) == 0x000820, "Member 'ALamentConfiguration::_timeAllowedToStandOnCubeBeforeTeleport' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _solvedLamentConfigurationDropDistanceToCollectorCentimeters) == 0x000824, "Member 'ALamentConfiguration::_solvedLamentConfigurationDropDistanceToCollectorCentimeters' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _failedLamentConfigurationSolveDropDistanceToCollectorCentimeters) == 0x000828, "Member 'ALamentConfiguration::_failedLamentConfigurationSolveDropDistanceToCollectorCentimeters' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _solved) == 0x00082C, "Member 'ALamentConfiguration::_solved' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _releasedByAttack) == 0x00082D, "Member 'ALamentConfiguration::_releasedByAttack' has a wrong offset!");
static_assert(offsetof(ALamentConfiguration, _lamentConfigurationTeleportIndicator) == 0x000830, "Member 'ALamentConfiguration::_lamentConfigurationTeleportIndicator' has a wrong offset!");

// Class TheK25.ChainAttachedGateBlockerEffect
// 0x0028 (0x03E0 - 0x03B8)
class UChainAttachedGateBlockerEffect final : public UGateBlockerEffect
{
public:
	struct FDBDTunableRowHandle                   _blockGateLingeringTimeDyingState;                 // 0x03B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void OnSurvivorDamageStateChanged(const ECamperDamageState OldState, const ECamperDamageState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChainAttachedGateBlockerEffect">();
	}
	static class UChainAttachedGateBlockerEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChainAttachedGateBlockerEffect>();
	}
};
static_assert(alignof(UChainAttachedGateBlockerEffect) == 0x000008, "Wrong alignment on UChainAttachedGateBlockerEffect");
static_assert(sizeof(UChainAttachedGateBlockerEffect) == 0x0003E0, "Wrong size on UChainAttachedGateBlockerEffect");
static_assert(offsetof(UChainAttachedGateBlockerEffect, _blockGateLingeringTimeDyingState) == 0x0003B8, "Member 'UChainAttachedGateBlockerEffect::_blockGateLingeringTimeDyingState' has a wrong offset!");

// Class TheK25.LamentConfigurationAnalyticsComponent
// 0x0030 (0x00D8 - 0x00A8)
class ULamentConfigurationAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x30];                                      // 0x00A8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LamentConfigurationAnalyticsComponent">();
	}
	static class ULamentConfigurationAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULamentConfigurationAnalyticsComponent>();
	}
};
static_assert(alignof(ULamentConfigurationAnalyticsComponent) == 0x000008, "Wrong alignment on ULamentConfigurationAnalyticsComponent");
static_assert(sizeof(ULamentConfigurationAnalyticsComponent) == 0x0000D8, "Wrong size on ULamentConfigurationAnalyticsComponent");

// Class TheK25.IsChainHuntActive
// 0x0028 (0x0108 - 0x00E0)
class UIsChainHuntActive final : public UEventDrivenModifierCondition
{
public:
	uint8                                         Pad_E0[0x28];                                      // 0x00E0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsChainHuntActive">();
	}
	static class UIsChainHuntActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsChainHuntActive>();
	}
};
static_assert(alignof(UIsChainHuntActive) == 0x000008, "Wrong alignment on UIsChainHuntActive");
static_assert(sizeof(UIsChainHuntActive) == 0x000108, "Wrong size on UIsChainHuntActive");

// Class TheK25.LamentConfigurationChainHuntComponent
// 0x01C8 (0x0270 - 0x00A8)
class ULamentConfigurationChainHuntComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x78];                                      // 0x00A8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _floorChainHuntTimeBetweenChainStrikes;            // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _chainHuntChargeTime;                              // 0x0128(0x0080)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _chainNumberPerChainHuntCluster;                   // 0x01A8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _timeBetweenChainHuntClusterStrikes;               // 0x01B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UK25KillerChainHuntEffectsComponent> _killerChainHuntEffectsComponentClass;             // 0x01B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UK25SurvivorChainHuntEffectsComponent> _survivorChainHuntEffectsComponentClass;           // 0x01C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25KillerChainHuntEffectsComponent*    _killerChainHuntEffectsComponent;                  // 0x01C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UK25SurvivorChainHuntEffectsComponent*> _chainHuntEffectsComponents;                       // 0x01D0(0x0010)(ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E0[0x30];                                     // 0x01E0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _cachedAdditiveChainStrikeDelayTime;               // 0x0210(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_214[0x34];                                     // 0x0214(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChainHuntStateData                    _chainHuntStateData;                               // 0x0248(0x0010)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	EChainHuntState                               _oldChainHuntState;                                // 0x0258(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_259[0x17];                                     // 0x0259(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ChainHuntStateData();

	float GetChainHuntProgressPercentage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LamentConfigurationChainHuntComponent">();
	}
	static class ULamentConfigurationChainHuntComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULamentConfigurationChainHuntComponent>();
	}
};
static_assert(alignof(ULamentConfigurationChainHuntComponent) == 0x000008, "Wrong alignment on ULamentConfigurationChainHuntComponent");
static_assert(sizeof(ULamentConfigurationChainHuntComponent) == 0x000270, "Wrong size on ULamentConfigurationChainHuntComponent");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _floorChainHuntTimeBetweenChainStrikes) == 0x000120, "Member 'ULamentConfigurationChainHuntComponent::_floorChainHuntTimeBetweenChainStrikes' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _chainHuntChargeTime) == 0x000128, "Member 'ULamentConfigurationChainHuntComponent::_chainHuntChargeTime' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _chainNumberPerChainHuntCluster) == 0x0001A8, "Member 'ULamentConfigurationChainHuntComponent::_chainNumberPerChainHuntCluster' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _timeBetweenChainHuntClusterStrikes) == 0x0001B0, "Member 'ULamentConfigurationChainHuntComponent::_timeBetweenChainHuntClusterStrikes' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _killerChainHuntEffectsComponentClass) == 0x0001B8, "Member 'ULamentConfigurationChainHuntComponent::_killerChainHuntEffectsComponentClass' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _survivorChainHuntEffectsComponentClass) == 0x0001C0, "Member 'ULamentConfigurationChainHuntComponent::_survivorChainHuntEffectsComponentClass' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _killerChainHuntEffectsComponent) == 0x0001C8, "Member 'ULamentConfigurationChainHuntComponent::_killerChainHuntEffectsComponent' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _chainHuntEffectsComponents) == 0x0001D0, "Member 'ULamentConfigurationChainHuntComponent::_chainHuntEffectsComponents' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _cachedAdditiveChainStrikeDelayTime) == 0x000210, "Member 'ULamentConfigurationChainHuntComponent::_cachedAdditiveChainStrikeDelayTime' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _chainHuntStateData) == 0x000248, "Member 'ULamentConfigurationChainHuntComponent::_chainHuntStateData' has a wrong offset!");
static_assert(offsetof(ULamentConfigurationChainHuntComponent, _oldChainHuntState) == 0x000258, "Member 'ULamentConfigurationChainHuntComponent::_oldChainHuntState' has a wrong offset!");

// Class TheK25.K25AnimInstance
// 0x0010 (0x0730 - 0x0720)
class UK25AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isTeleporting;                                    // 0x0720(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isPossessingGateway;                              // 0x0721(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSelectingGatewayLocation;                       // 0x0722(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_723[0xD];                                      // 0x0723(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25AnimInstance">();
	}
	static class UK25AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK25AnimInstance>();
	}
};
static_assert(alignof(UK25AnimInstance) == 0x000010, "Wrong alignment on UK25AnimInstance");
static_assert(sizeof(UK25AnimInstance) == 0x000730, "Wrong size on UK25AnimInstance");
static_assert(offsetof(UK25AnimInstance, _isTeleporting) == 0x000720, "Member 'UK25AnimInstance::_isTeleporting' has a wrong offset!");
static_assert(offsetof(UK25AnimInstance, _isPossessingGateway) == 0x000721, "Member 'UK25AnimInstance::_isPossessingGateway' has a wrong offset!");
static_assert(offsetof(UK25AnimInstance, _isSelectingGatewayLocation) == 0x000722, "Member 'UK25AnimInstance::_isSelectingGatewayLocation' has a wrong offset!");

// Class TheK25.K25Chain
// 0x0240 (0x04E0 - 0x02A0)
class AK25Chain final : public AActor
{
public:
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAcquiredChanged;                                 // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _attachedToProjectileInfluenceCurve;               // 0x02B8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _reelbackInfluenceCurve;                           // 0x02C0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _offsetMultiplierInfluenceCurve;                   // 0x02C8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x50];                                     // 0x02D0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _reelingBackSpeed;                                 // 0x0320(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         _chainOffsetMinValue;                              // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainOffsetMaxValue;                              // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reelbackChainOffsetMinValue;                      // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reelbackChainOffsetMaxValue;                      // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainInstanceSpacing;                             // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _quickChainOffsetTimerLength;                      // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _reachingSurvivorAnchorTime;                       // 0x0360(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _chainScale;                                       // 0x0368(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _chainOffsetTimerLength;                           // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        _currentChainPoints;                               // 0x0388(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          _isAcquiredFromPool;                               // 0x0398(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _sphereTraceRadius;                                // 0x039C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _chainStartPosition;                               // 0x03A0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _reelBackPosition;                                 // 0x03B8(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _reelbackStartPosition;                            // 0x03D0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AK25Projectile*                         _projectileAttachedTo;                             // 0x03E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor> _survivorAnchorAttachedTo;                         // 0x03F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor> _targetAnchorToReach;                              // 0x03F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       _chainSplineComponent;                             // 0x0400(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          _chainInstancedMesh;                               // 0x0408(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _currentInfluenceCurve;                            // 0x0410(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                _chainCurveOffset;                                 // 0x0418(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EK25ChainState                                _chainState;                                       // 0x0430(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFastTimer                             _curveOffsetStrengthTimer;                         // 0x0438(0x0030)(Transient, NativeAccessSpecifierPrivate)
	struct FFastTimer                             _reelbackTimer;                                    // 0x0468(0x0030)(Transient, NativeAccessSpecifierPrivate)
	struct FFastTimer                             _reachSurvivorAnchorPositionTimer;                 // 0x0498(0x0030)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        _forcedPositions;                                  // 0x04C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	EK25ChainCreationStrategy                     _chainCreationStrategy;                            // 0x04D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnChainAppears();
	void Cosmetic_OnChainAttachedToSurvivor(bool WasReachingSurvivorAnchorPoint);
	void Cosmetic_OnChainDetachedFromSurvivor(EK25ChainDetachmentReason DetachmentReason);
	void Cosmetic_OnChainDisappears();
	void Cosmetic_OnChainStartedToReelback();
	void Cosmetic_OnChainUnleashedWithProjectile();
	void Cosmetic_OnInstantChainUnleashedTowardsAttachmentPointFX();
	void Cosmetic_OnSurvivorStartedRemovingChainSFX();
	void Cosmetic_OnSurvivorStoppedRemovingChainSFX(bool HasRemovedChainDueToInteraction);
	void SetInstancedMeshComponent(class UInstancedStaticMeshComponent* InstancedMesh);
	void SetSplineComponent(class USplineComponent* Component);

	struct FVector GetChainEndLocation() const;
	struct FVector GetChainStartLocation() const;
	class AK25SurvivorChainAttachmentAnchor* GetSurvivorChainAttachmentAnchor() const;
	bool IsAttachedToControlledProjectile() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K25Chain">();
	}
	static class AK25Chain* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK25Chain>();
	}
};
static_assert(alignof(AK25Chain) == 0x000008, "Wrong alignment on AK25Chain");
static_assert(sizeof(AK25Chain) == 0x0004E0, "Wrong size on AK25Chain");
static_assert(offsetof(AK25Chain, OnAcquiredChanged) == 0x0002A8, "Member 'AK25Chain::OnAcquiredChanged' has a wrong offset!");
static_assert(offsetof(AK25Chain, _attachedToProjectileInfluenceCurve) == 0x0002B8, "Member 'AK25Chain::_attachedToProjectileInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackInfluenceCurve) == 0x0002C0, "Member 'AK25Chain::_reelbackInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _offsetMultiplierInfluenceCurve) == 0x0002C8, "Member 'AK25Chain::_offsetMultiplierInfluenceCurve' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelingBackSpeed) == 0x000320, "Member 'AK25Chain::_reelingBackSpeed' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainOffsetMinValue) == 0x000348, "Member 'AK25Chain::_chainOffsetMinValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _chainOffsetMaxValue) == 0x00034C, "Member 'AK25Chain::_chainOffsetMaxValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackChainOffsetMinValue) == 0x000350, "Member 'AK25Chain::_reelbackChainOffsetMinValue' has a wrong offset!");
static_assert(offsetof(AK25Chain, _reelbackChainOffsetMaxValue) == 0x000354, "Member 'AK25Chain::_reelbackChainOffsetMaxValue' has a wrong offset!");
