#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK36

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "TheK36_structs.hpp"
#include "AnimationUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TheK36.K36ArtifactPowerComponent.Cosmetic_ApplySmokeEffectOnLocker
// 0x0008 (0x0008 - 0x0000)
struct K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker final
{
public:
	class ALocker*                                Locker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker) == 0x000008, "Wrong alignment on K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker");
static_assert(sizeof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker) == 0x000008, "Wrong size on K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker");
static_assert(offsetof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker, Locker) == 0x000000, "Member 'K36ArtifactPowerComponent_Cosmetic_ApplySmokeEffectOnLocker::Locker' has a wrong offset!");

// Function TheK36.K36ArtifactPowerComponent.Cosmetic_ApplySmokeVfxOnOpenedLocker
// 0x0010 (0x0010 - 0x0000)
struct K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker final
{
public:
	class ALocker*                                Locker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerTeam                                   PlayerTeam;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker) == 0x000008, "Wrong alignment on K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker");
static_assert(sizeof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker) == 0x000010, "Wrong size on K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker");
static_assert(offsetof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker, Locker) == 0x000000, "Member 'K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker::Locker' has a wrong offset!");
static_assert(offsetof(K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker, PlayerTeam) == 0x000008, "Member 'K36ArtifactPowerComponent_Cosmetic_ApplySmokeVfxOnOpenedLocker::PlayerTeam' has a wrong offset!");

// Function TheK36.K36ArtifactPowerComponent.OnSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K36ArtifactPowerComponent_OnSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            OldDamageState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            NewDamageState;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactPowerComponent_OnSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on K36ArtifactPowerComponent_OnSurvivorDamageStateChanged");
static_assert(sizeof(K36ArtifactPowerComponent_OnSurvivorDamageStateChanged) == 0x000002, "Wrong size on K36ArtifactPowerComponent_OnSurvivorDamageStateChanged");
static_assert(offsetof(K36ArtifactPowerComponent_OnSurvivorDamageStateChanged, OldDamageState) == 0x000000, "Member 'K36ArtifactPowerComponent_OnSurvivorDamageStateChanged::OldDamageState' has a wrong offset!");
static_assert(offsetof(K36ArtifactPowerComponent_OnSurvivorDamageStateChanged, NewDamageState) == 0x000001, "Member 'K36ArtifactPowerComponent_OnSurvivorDamageStateChanged::NewDamageState' has a wrong offset!");

// Function TheK36.K36ArtifactPowerComponent.GetOwningSurvivor
// 0x0008 (0x0008 - 0x0000)
struct K36ArtifactPowerComponent_GetOwningSurvivor final
{
public:
	class ACamperPlayer*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactPowerComponent_GetOwningSurvivor) == 0x000008, "Wrong alignment on K36ArtifactPowerComponent_GetOwningSurvivor");
static_assert(sizeof(K36ArtifactPowerComponent_GetOwningSurvivor) == 0x000008, "Wrong size on K36ArtifactPowerComponent_GetOwningSurvivor");
static_assert(offsetof(K36ArtifactPowerComponent_GetOwningSurvivor, ReturnValue) == 0x000000, "Member 'K36ArtifactPowerComponent_GetOwningSurvivor::ReturnValue' has a wrong offset!");

// Function TheK36.K36ArtifactInvisibilityPowerComponent.Authority_OnSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            OldState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            NewState;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged");
static_assert(sizeof(K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged) == 0x000002, "Wrong size on K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged");
static_assert(offsetof(K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged, OldState) == 0x000000, "Member 'K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged, NewState) == 0x000001, "Member 'K36ArtifactInvisibilityPowerComponent_Authority_OnSurvivorDamageStateChanged::NewState' has a wrong offset!");

// Function TheK36.K36ArtifactInvisibilityPowerComponent.Multi_TriggerLockerVFXEffects
// 0x0008 (0x0008 - 0x0000)
struct K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects final
{
public:
	class ALocker*                                Locker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects) == 0x000008, "Wrong alignment on K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects");
static_assert(sizeof(K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects) == 0x000008, "Wrong size on K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects");
static_assert(offsetof(K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects, Locker) == 0x000000, "Member 'K36ArtifactInvisibilityPowerComponent_Multi_TriggerLockerVFXEffects::Locker' has a wrong offset!");

// Function TheK36.K36ArtifactTeleportationPowerComponent.Authority_OnPlayerFastEnteredLocker
// 0x0040 (0x0040 - 0x0000)
struct K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker) == 0x000008, "Wrong alignment on K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker");
static_assert(sizeof(K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker) == 0x000040, "Wrong size on K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker");
static_assert(offsetof(K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker, GameplayTag) == 0x000000, "Member 'K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker::GameplayTag' has a wrong offset!");
static_assert(offsetof(K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker, GameEventData) == 0x000010, "Member 'K36ArtifactTeleportationPowerComponent_Authority_OnPlayerFastEnteredLocker::GameEventData' has a wrong offset!");

// Function TheK36.K36ArtifactTeleportationPowerComponent.Multicast_TriggerExitFromLocker
// 0x0010 (0x0010 - 0x0000)
struct K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker final
{
public:
	class ALocker*                                InitialLocker;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALocker*                                TargetLocker;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker) == 0x000008, "Wrong alignment on K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker");
static_assert(sizeof(K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker) == 0x000010, "Wrong size on K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker");
static_assert(offsetof(K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker, InitialLocker) == 0x000000, "Member 'K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker::InitialLocker' has a wrong offset!");
static_assert(offsetof(K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker, TargetLocker) == 0x000008, "Member 'K36ArtifactTeleportationPowerComponent_Multicast_TriggerExitFromLocker::TargetLocker' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36EquipMagicItemOnLocalSurvivor
// 0x0030 (0x0030 - 0x0000)
struct K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor final
{
public:
	class FString                                 MagicItemTypeName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpellCounterType;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalPlayerId;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor) == 0x000008, "Wrong alignment on K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor");
static_assert(sizeof(K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor) == 0x000030, "Wrong size on K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor");
static_assert(offsetof(K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor, MagicItemTypeName) == 0x000000, "Member 'K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor::MagicItemTypeName' has a wrong offset!");
static_assert(offsetof(K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor, SpellCounterType) == 0x000010, "Member 'K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor::SpellCounterType' has a wrong offset!");
static_assert(offsetof(K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor, LocalPlayerId) == 0x000020, "Member 'K36CheatComponent_DBD_K36EquipMagicItemOnLocalSurvivor::LocalPlayerId' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36ShowSpectralEntityCollisions
// 0x0002 (0x0002 - 0x0000)
struct K36CheatComponent_DBD_K36ShowSpectralEntityCollisions final
{
public:
	bool                                          ShowCollisions;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlsoShowNearMissCollisions;                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36ShowSpectralEntityCollisions) == 0x000001, "Wrong alignment on K36CheatComponent_DBD_K36ShowSpectralEntityCollisions");
static_assert(sizeof(K36CheatComponent_DBD_K36ShowSpectralEntityCollisions) == 0x000002, "Wrong size on K36CheatComponent_DBD_K36ShowSpectralEntityCollisions");
static_assert(offsetof(K36CheatComponent_DBD_K36ShowSpectralEntityCollisions, ShowCollisions) == 0x000000, "Member 'K36CheatComponent_DBD_K36ShowSpectralEntityCollisions::ShowCollisions' has a wrong offset!");
static_assert(offsetof(K36CheatComponent_DBD_K36ShowSpectralEntityCollisions, AlsoShowNearMissCollisions) == 0x000001, "Member 'K36CheatComponent_DBD_K36ShowSpectralEntityCollisions::AlsoShowNearMissCollisions' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36FillTreasureChestsWithLegendaryMagicItems
// 0x0010 (0x0010 - 0x0000)
struct K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems final
{
public:
	class FString                                 MagicItemClassName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems) == 0x000008, "Wrong alignment on K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems");
static_assert(sizeof(K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems) == 0x000010, "Wrong size on K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems");
static_assert(offsetof(K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems, MagicItemClassName) == 0x000000, "Member 'K36CheatComponent_DBD_K36FillTreasureChestsWithLegendaryMagicItems::MagicItemClassName' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36SetForcedDiceValueOnAllTreasureChests
// 0x0004 (0x0004 - 0x0000)
struct K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests final
{
public:
	int32                                         ForcedRollValue;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests) == 0x000004, "Wrong alignment on K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests");
static_assert(sizeof(K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests) == 0x000004, "Wrong size on K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests");
static_assert(offsetof(K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests, ForcedRollValue) == 0x000000, "Member 'K36CheatComponent_DBD_K36SetForcedDiceValueOnAllTreasureChests::ForcedRollValue' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor
// 0x0010 (0x0010 - 0x0000)
struct K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor final
{
public:
	class FString                                 LocalPlayerId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor) == 0x000008, "Wrong alignment on K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor");
static_assert(sizeof(K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor) == 0x000010, "Wrong size on K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor");
static_assert(offsetof(K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor, LocalPlayerId) == 0x000000, "Member 'K36CheatComponent_DBD_K36SpawnEyeOfVecnaOnLocallyControlledSurvivor::LocalPlayerId' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor
// 0x0010 (0x0010 - 0x0000)
struct K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor final
{
public:
	class FString                                 LocalPlayerId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor) == 0x000008, "Wrong alignment on K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor");
static_assert(sizeof(K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor) == 0x000010, "Wrong size on K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor");
static_assert(offsetof(K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor, LocalPlayerId) == 0x000000, "Member 'K36CheatComponent_DBD_K36SpawnHandOfVecnaOnLocallyControlledSurvivor::LocalPlayerId' has a wrong offset!");

// Function TheK36.K36CheatComponent.DBD_K36TriggerDiceRollOnSurvivor
// 0x0004 (0x0004 - 0x0000)
struct K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor) == 0x000004, "Wrong alignment on K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor");
static_assert(sizeof(K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor) == 0x000004, "Wrong size on K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor");
static_assert(offsetof(K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor, Result) == 0x000000, "Member 'K36CheatComponent_DBD_K36TriggerDiceRollOnSurvivor::Result' has a wrong offset!");

// Function TheK36.K36D20Dice.Cosmetic_PlayDiceRoll
// 0x0008 (0x0008 - 0x0000)
struct K36D20Dice_Cosmetic_PlayDiceRoll final
{
public:
	int32                                         DiceRollResult;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EK36DiceRollOutcome                           DiceRollOutcome;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K36D20Dice_Cosmetic_PlayDiceRoll) == 0x000004, "Wrong alignment on K36D20Dice_Cosmetic_PlayDiceRoll");
static_assert(sizeof(K36D20Dice_Cosmetic_PlayDiceRoll) == 0x000008, "Wrong size on K36D20Dice_Cosmetic_PlayDiceRoll");
static_assert(offsetof(K36D20Dice_Cosmetic_PlayDiceRoll, DiceRollResult) == 0x000000, "Member 'K36D20Dice_Cosmetic_PlayDiceRoll::DiceRollResult' has a wrong offset!");
static_assert(offsetof(K36D20Dice_Cosmetic_PlayDiceRoll, DiceRollOutcome) == 0x000004, "Member 'K36D20Dice_Cosmetic_PlayDiceRoll::DiceRollOutcome' has a wrong offset!");

// Function TheK36.K36SpellInteraction.OnRep_SpellActivationData
// 0x0010 (0x0010 - 0x0000)
struct K36SpellInteraction_OnRep_SpellActivationData final
{
public:
	struct FK36SpellActivationData                PreviousActivationData;                            // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36SpellInteraction_OnRep_SpellActivationData) == 0x000008, "Wrong alignment on K36SpellInteraction_OnRep_SpellActivationData");
static_assert(sizeof(K36SpellInteraction_OnRep_SpellActivationData) == 0x000010, "Wrong size on K36SpellInteraction_OnRep_SpellActivationData");
static_assert(offsetof(K36SpellInteraction_OnRep_SpellActivationData, PreviousActivationData) == 0x000000, "Member 'K36SpellInteraction_OnRep_SpellActivationData::PreviousActivationData' has a wrong offset!");

// Function TheK36.K36SpellInteraction.Server_ActivateSpell
// 0x0010 (0x0010 - 0x0000)
struct K36SpellInteraction_Server_ActivateSpell final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CustomObjectParameter;                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36SpellInteraction_Server_ActivateSpell) == 0x000008, "Wrong alignment on K36SpellInteraction_Server_ActivateSpell");
static_assert(sizeof(K36SpellInteraction_Server_ActivateSpell) == 0x000010, "Wrong size on K36SpellInteraction_Server_ActivateSpell");
static_assert(offsetof(K36SpellInteraction_Server_ActivateSpell, Killer) == 0x000000, "Member 'K36SpellInteraction_Server_ActivateSpell::Killer' has a wrong offset!");
static_assert(offsetof(K36SpellInteraction_Server_ActivateSpell, CustomObjectParameter) == 0x000008, "Member 'K36SpellInteraction_Server_ActivateSpell::CustomObjectParameter' has a wrong offset!");

// Function TheK36.K36DetectionSpellInteraction.Server_RequestSphereLaunch
// 0x0038 (0x0038 - 0x0000)
struct K36DetectionSpellInteraction_Server_RequestSphereLaunch final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SphereLocation;                                    // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LaunchDirection;                                   // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DetectionSpellInteraction_Server_RequestSphereLaunch) == 0x000008, "Wrong alignment on K36DetectionSpellInteraction_Server_RequestSphereLaunch");
static_assert(sizeof(K36DetectionSpellInteraction_Server_RequestSphereLaunch) == 0x000038, "Wrong size on K36DetectionSpellInteraction_Server_RequestSphereLaunch");
static_assert(offsetof(K36DetectionSpellInteraction_Server_RequestSphereLaunch, Killer) == 0x000000, "Member 'K36DetectionSpellInteraction_Server_RequestSphereLaunch::Killer' has a wrong offset!");
static_assert(offsetof(K36DetectionSpellInteraction_Server_RequestSphereLaunch, SphereLocation) == 0x000008, "Member 'K36DetectionSpellInteraction_Server_RequestSphereLaunch::SphereLocation' has a wrong offset!");
static_assert(offsetof(K36DetectionSpellInteraction_Server_RequestSphereLaunch, LaunchDirection) == 0x000020, "Member 'K36DetectionSpellInteraction_Server_RequestSphereLaunch::LaunchDirection' has a wrong offset!");

// Function TheK36.K36DetectionSpellKillerInstinctStatusEffect.GetLingeringDuration
// 0x0004 (0x0004 - 0x0000)
struct K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration) == 0x000004, "Wrong alignment on K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration");
static_assert(sizeof(K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration) == 0x000004, "Wrong size on K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration");
static_assert(offsetof(K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration, ReturnValue) == 0x000000, "Member 'K36DetectionSpellKillerInstinctStatusEffect_GetLingeringDuration::ReturnValue' has a wrong offset!");

// Function TheK36.K36DispellingSphere.Authority_OnSurvivorDetectionEnd
// 0x0020 (0x0020 - 0x0000)
struct K36DispellingSphere_Authority_OnSurvivorDetectionEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K36DispellingSphere_Authority_OnSurvivorDetectionEnd) == 0x000008, "Wrong alignment on K36DispellingSphere_Authority_OnSurvivorDetectionEnd");
static_assert(sizeof(K36DispellingSphere_Authority_OnSurvivorDetectionEnd) == 0x000020, "Wrong size on K36DispellingSphere_Authority_OnSurvivorDetectionEnd");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionEnd, OverlappedComponent) == 0x000000, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionEnd::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionEnd, OtherActor) == 0x000008, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionEnd, OtherComp) == 0x000010, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionEnd, OtherBodyIndex) == 0x000018, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK36.K36DispellingSphere.Authority_OnSurvivorDetectionStart
// 0x0110 (0x0110 - 0x0000)
struct K36DispellingSphere_Authority_OnSurvivorDetectionStart final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_Authority_OnSurvivorDetectionStart) == 0x000008, "Wrong alignment on K36DispellingSphere_Authority_OnSurvivorDetectionStart");
static_assert(sizeof(K36DispellingSphere_Authority_OnSurvivorDetectionStart) == 0x000110, "Wrong size on K36DispellingSphere_Authority_OnSurvivorDetectionStart");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionStart, HitComponent) == 0x000000, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionStart::HitComponent' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionStart, OtherActor) == 0x000008, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionStart::OtherActor' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionStart, OtherComp) == 0x000010, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionStart::OtherComp' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionStart, OtherBodyIndex) == 0x000018, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionStart::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionStart, bFromSweep) == 0x00001C, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionStart::bFromSweep' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Authority_OnSurvivorDetectionStart, SweepResult) == 0x000020, "Member 'K36DispellingSphere_Authority_OnSurvivorDetectionStart::SweepResult' has a wrong offset!");

// Function TheK36.K36DispellingSphere.Cosmetic_OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K36DispellingSphere_Cosmetic_OnStateChanged final
{
public:
	EK36DetectionSphereState                      NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EK36DetectionSphereState                      PreviousState;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_Cosmetic_OnStateChanged) == 0x000001, "Wrong alignment on K36DispellingSphere_Cosmetic_OnStateChanged");
static_assert(sizeof(K36DispellingSphere_Cosmetic_OnStateChanged) == 0x000002, "Wrong size on K36DispellingSphere_Cosmetic_OnStateChanged");
static_assert(offsetof(K36DispellingSphere_Cosmetic_OnStateChanged, NewState) == 0x000000, "Member 'K36DispellingSphere_Cosmetic_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(K36DispellingSphere_Cosmetic_OnStateChanged, PreviousState) == 0x000001, "Member 'K36DispellingSphere_Cosmetic_OnStateChanged::PreviousState' has a wrong offset!");

// Function TheK36.K36DispellingSphere.Cosmetic_RadiusUpdated
// 0x0004 (0x0004 - 0x0000)
struct K36DispellingSphere_Cosmetic_RadiusUpdated final
{
public:
	float                                         NewRadiusValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_Cosmetic_RadiusUpdated) == 0x000004, "Wrong alignment on K36DispellingSphere_Cosmetic_RadiusUpdated");
static_assert(sizeof(K36DispellingSphere_Cosmetic_RadiusUpdated) == 0x000004, "Wrong size on K36DispellingSphere_Cosmetic_RadiusUpdated");
static_assert(offsetof(K36DispellingSphere_Cosmetic_RadiusUpdated, NewRadiusValue) == 0x000000, "Member 'K36DispellingSphere_Cosmetic_RadiusUpdated::NewRadiusValue' has a wrong offset!");

// Function TheK36.K36DispellingSphere.Cosmetic_SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct K36DispellingSphere_Cosmetic_SetVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_Cosmetic_SetVisibility) == 0x000001, "Wrong alignment on K36DispellingSphere_Cosmetic_SetVisibility");
static_assert(sizeof(K36DispellingSphere_Cosmetic_SetVisibility) == 0x000001, "Wrong size on K36DispellingSphere_Cosmetic_SetVisibility");
static_assert(offsetof(K36DispellingSphere_Cosmetic_SetVisibility, IsVisible) == 0x000000, "Member 'K36DispellingSphere_Cosmetic_SetVisibility::IsVisible' has a wrong offset!");

// Function TheK36.K36DispellingSphere.OnRep_State
// 0x0001 (0x0001 - 0x0000)
struct K36DispellingSphere_OnRep_State final
{
public:
	EK36DetectionSphereState                      PreviousState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_OnRep_State) == 0x000001, "Wrong alignment on K36DispellingSphere_OnRep_State");
static_assert(sizeof(K36DispellingSphere_OnRep_State) == 0x000001, "Wrong size on K36DispellingSphere_OnRep_State");
static_assert(offsetof(K36DispellingSphere_OnRep_State, PreviousState) == 0x000000, "Member 'K36DispellingSphere_OnRep_State::PreviousState' has a wrong offset!");

// Function TheK36.K36DispellingSphere.GetState
// 0x0001 (0x0001 - 0x0000)
struct K36DispellingSphere_GetState final
{
public:
	EK36DetectionSphereState                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_GetState) == 0x000001, "Wrong alignment on K36DispellingSphere_GetState");
static_assert(sizeof(K36DispellingSphere_GetState) == 0x000001, "Wrong size on K36DispellingSphere_GetState");
static_assert(offsetof(K36DispellingSphere_GetState, ReturnValue) == 0x000000, "Member 'K36DispellingSphere_GetState::ReturnValue' has a wrong offset!");

// Function TheK36.K36DispellingSphere.GetVisibility
// 0x0001 (0x0001 - 0x0000)
struct K36DispellingSphere_GetVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36DispellingSphere_GetVisibility) == 0x000001, "Wrong alignment on K36DispellingSphere_GetVisibility");
static_assert(sizeof(K36DispellingSphere_GetVisibility) == 0x000001, "Wrong size on K36DispellingSphere_GetVisibility");
static_assert(offsetof(K36DispellingSphere_GetVisibility, ReturnValue) == 0x000000, "Member 'K36DispellingSphere_GetVisibility::ReturnValue' has a wrong offset!");

// Function TheK36.K36EscapeFromMimicChestInteraction.Authority_OnSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            OldDamageState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            NewDamageState;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged");
static_assert(sizeof(K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged) == 0x000002, "Wrong size on K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged");
static_assert(offsetof(K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged, OldDamageState) == 0x000000, "Member 'K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged::OldDamageState' has a wrong offset!");
static_assert(offsetof(K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged, NewDamageState) == 0x000001, "Member 'K36EscapeFromMimicChestInteraction_Authority_OnSurvivorDamageStateChanged::NewDamageState' has a wrong offset!");

// Function TheK36.K36FlySpellInteraction.Server_StopFlying
// 0x0008 (0x0008 - 0x0000)
struct K36FlySpellInteraction_Server_StopFlying final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FlySpellInteraction_Server_StopFlying) == 0x000008, "Wrong alignment on K36FlySpellInteraction_Server_StopFlying");
static_assert(sizeof(K36FlySpellInteraction_Server_StopFlying) == 0x000008, "Wrong size on K36FlySpellInteraction_Server_StopFlying");
static_assert(offsetof(K36FlySpellInteraction_Server_StopFlying, Killer) == 0x000000, "Member 'K36FlySpellInteraction_Server_StopFlying::Killer' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.Authority_OnCollisionOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin) == 0x000008, "Wrong alignment on K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin");
static_assert(sizeof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin) == 0x000110, "Wrong size on K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin, OverlappedComp) == 0x000000, "Member 'K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin::OverlappedComp' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin, OtherActor) == 0x000008, "Member 'K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin, OtherComp) == 0x000010, "Member 'K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin, FromSweep) == 0x00001C, "Member 'K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin::FromSweep' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin, SweepResult) == 0x000020, "Member 'K36FOTDSpectralEntity_Authority_OnCollisionOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.Authority_OnNearMissCollisionOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd) == 0x000008, "Wrong alignment on K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd");
static_assert(sizeof(K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd) == 0x000020, "Wrong size on K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd, OverlappedComponent) == 0x000000, "Member 'K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd, OtherActor) == 0x000008, "Member 'K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd, OtherComp) == 0x000010, "Member 'K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'K36FOTDSpectralEntity_Authority_OnNearMissCollisionOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.Cosmetic_OnHitSurvivor
// 0x0008 (0x0008 - 0x0000)
struct K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor final
{
public:
	class ACamperPlayer*                          SurvivorHit;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor) == 0x000008, "Wrong alignment on K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor");
static_assert(sizeof(K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor) == 0x000008, "Wrong size on K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor");
static_assert(offsetof(K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor, SurvivorHit) == 0x000000, "Member 'K36FOTDSpectralEntity_Cosmetic_OnHitSurvivor::SurvivorHit' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.Cosmetic_OnStateChanged
// 0x0008 (0x0008 - 0x0000)
struct K36FOTDSpectralEntity_Cosmetic_OnStateChanged final
{
public:
	EK36FOTDSpectralEntityState                   PreviousState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EK36FOTDSpectralEntityState                   CurrentState;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomParameter;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FOTDSpectralEntity_Cosmetic_OnStateChanged) == 0x000004, "Wrong alignment on K36FOTDSpectralEntity_Cosmetic_OnStateChanged");
static_assert(sizeof(K36FOTDSpectralEntity_Cosmetic_OnStateChanged) == 0x000008, "Wrong size on K36FOTDSpectralEntity_Cosmetic_OnStateChanged");
static_assert(offsetof(K36FOTDSpectralEntity_Cosmetic_OnStateChanged, PreviousState) == 0x000000, "Member 'K36FOTDSpectralEntity_Cosmetic_OnStateChanged::PreviousState' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Cosmetic_OnStateChanged, CurrentState) == 0x000001, "Member 'K36FOTDSpectralEntity_Cosmetic_OnStateChanged::CurrentState' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Cosmetic_OnStateChanged, CustomParameter) == 0x000004, "Member 'K36FOTDSpectralEntity_Cosmetic_OnStateChanged::CustomParameter' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.Multicast_SetLocationAndRotation
// 0x0030 (0x0030 - 0x0000)
struct K36FOTDSpectralEntity_Multicast_SetLocationAndRotation final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FOTDSpectralEntity_Multicast_SetLocationAndRotation) == 0x000008, "Wrong alignment on K36FOTDSpectralEntity_Multicast_SetLocationAndRotation");
static_assert(sizeof(K36FOTDSpectralEntity_Multicast_SetLocationAndRotation) == 0x000030, "Wrong size on K36FOTDSpectralEntity_Multicast_SetLocationAndRotation");
static_assert(offsetof(K36FOTDSpectralEntity_Multicast_SetLocationAndRotation, Position) == 0x000000, "Member 'K36FOTDSpectralEntity_Multicast_SetLocationAndRotation::Position' has a wrong offset!");
static_assert(offsetof(K36FOTDSpectralEntity_Multicast_SetLocationAndRotation, Rotation) == 0x000018, "Member 'K36FOTDSpectralEntity_Multicast_SetLocationAndRotation::Rotation' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.Multicast_TriggerHitSurvivorCosmetic
// 0x0008 (0x0008 - 0x0000)
struct K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic final
{
public:
	class ACamperPlayer*                          TargetSurvivor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic) == 0x000008, "Wrong alignment on K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic");
static_assert(sizeof(K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic) == 0x000008, "Wrong size on K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic");
static_assert(offsetof(K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic, TargetSurvivor) == 0x000000, "Member 'K36FOTDSpectralEntity_Multicast_TriggerHitSurvivorCosmetic::TargetSurvivor' has a wrong offset!");

// Function TheK36.K36FOTDSpectralEntity.OnRep_State
// 0x0001 (0x0001 - 0x0000)
struct K36FOTDSpectralEntity_OnRep_State final
{
public:
	EK36FOTDSpectralEntityState                   PreviousState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FOTDSpectralEntity_OnRep_State) == 0x000001, "Wrong alignment on K36FOTDSpectralEntity_OnRep_State");
static_assert(sizeof(K36FOTDSpectralEntity_OnRep_State) == 0x000001, "Wrong size on K36FOTDSpectralEntity_OnRep_State");
static_assert(offsetof(K36FOTDSpectralEntity_OnRep_State, PreviousState) == 0x000000, "Member 'K36FOTDSpectralEntity_OnRep_State::PreviousState' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_CreateSpellAtSpellSlotPosition
// 0x0010 (0x0010 - 0x0000)
struct K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition final
{
public:
	EK36SpellSlot                                 SelectedSpellSlot;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EK36SpellType                                 SpellType;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         MenuVFXInstance;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition) == 0x000008, "Wrong alignment on K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition");
static_assert(sizeof(K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition) == 0x000010, "Wrong size on K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition");
static_assert(offsetof(K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition, SelectedSpellSlot) == 0x000000, "Member 'K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition::SelectedSpellSlot' has a wrong offset!");
static_assert(offsetof(K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition, SpellType) == 0x000001, "Member 'K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition::SpellType' has a wrong offset!");
static_assert(offsetof(K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition, MenuVFXInstance) == 0x000008, "Member 'K36FXInterface_Cosmetic_CreateSpellAtSpellSlotPosition::MenuVFXInstance' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_OnFOVChanged
// 0x0004 (0x0004 - 0x0000)
struct K36FXInterface_Cosmetic_OnFOVChanged final
{
public:
	float                                         NewFOV;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_OnFOVChanged) == 0x000004, "Wrong alignment on K36FXInterface_Cosmetic_OnFOVChanged");
static_assert(sizeof(K36FXInterface_Cosmetic_OnFOVChanged) == 0x000004, "Wrong size on K36FXInterface_Cosmetic_OnFOVChanged");
static_assert(offsetof(K36FXInterface_Cosmetic_OnFOVChanged, NewFOV) == 0x000000, "Member 'K36FXInterface_Cosmetic_OnFOVChanged::NewFOV' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_OnSpellCooldownEnded
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_OnSpellCooldownEnded final
{
public:
	EK36SpellType                                 SpellType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_OnSpellCooldownEnded) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_OnSpellCooldownEnded");
static_assert(sizeof(K36FXInterface_Cosmetic_OnSpellCooldownEnded) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_OnSpellCooldownEnded");
static_assert(offsetof(K36FXInterface_Cosmetic_OnSpellCooldownEnded, SpellType) == 0x000000, "Member 'K36FXInterface_Cosmetic_OnSpellCooldownEnded::SpellType' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_OnSpellCooldownStarted
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_OnSpellCooldownStarted final
{
public:
	EK36SpellType                                 SpellType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_OnSpellCooldownStarted) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_OnSpellCooldownStarted");
static_assert(sizeof(K36FXInterface_Cosmetic_OnSpellCooldownStarted) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_OnSpellCooldownStarted");
static_assert(offsetof(K36FXInterface_Cosmetic_OnSpellCooldownStarted, SpellType) == 0x000000, "Member 'K36FXInterface_Cosmetic_OnSpellCooldownStarted::SpellType' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_OnSpellEnded
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_OnSpellEnded final
{
public:
	EK36SpellType                                 SpellType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_OnSpellEnded) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_OnSpellEnded");
static_assert(sizeof(K36FXInterface_Cosmetic_OnSpellEnded) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_OnSpellEnded");
static_assert(offsetof(K36FXInterface_Cosmetic_OnSpellEnded, SpellType) == 0x000000, "Member 'K36FXInterface_Cosmetic_OnSpellEnded::SpellType' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_SetSelectedSpell
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_SetSelectedSpell final
{
public:
	EK36SpellType                                 SpellType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_SetSelectedSpell) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_SetSelectedSpell");
static_assert(sizeof(K36FXInterface_Cosmetic_SetSelectedSpell) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_SetSelectedSpell");
static_assert(offsetof(K36FXInterface_Cosmetic_SetSelectedSpell, SpellType) == 0x000000, "Member 'K36FXInterface_Cosmetic_SetSelectedSpell::SpellType' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_SetSpellMenuVisibility
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_SetSpellMenuVisibility final
{
public:
	bool                                          IsSpellMenuVisible;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_SetSpellMenuVisibility) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_SetSpellMenuVisibility");
static_assert(sizeof(K36FXInterface_Cosmetic_SetSpellMenuVisibility) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_SetSpellMenuVisibility");
static_assert(offsetof(K36FXInterface_Cosmetic_SetSpellMenuVisibility, IsSpellMenuVisible) == 0x000000, "Member 'K36FXInterface_Cosmetic_SetSpellMenuVisibility::IsSpellMenuVisible' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_SetSpellVignetteVisibility
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_SetSpellVignetteVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_SetSpellVignetteVisibility) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_SetSpellVignetteVisibility");
static_assert(sizeof(K36FXInterface_Cosmetic_SetSpellVignetteVisibility) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_SetSpellVignetteVisibility");
static_assert(offsetof(K36FXInterface_Cosmetic_SetSpellVignetteVisibility, IsVisible) == 0x000000, "Member 'K36FXInterface_Cosmetic_SetSpellVignetteVisibility::IsVisible' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_SpellActivated
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_SpellActivated final
{
public:
	EK36SpellType                                 SpellType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_SpellActivated) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_SpellActivated");
static_assert(sizeof(K36FXInterface_Cosmetic_SpellActivated) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_SpellActivated");
static_assert(offsetof(K36FXInterface_Cosmetic_SpellActivated, SpellType) == 0x000000, "Member 'K36FXInterface_Cosmetic_SpellActivated::SpellType' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_SpellCancelled
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_SpellCancelled final
{
public:
	EK36SpellType                                 SpellType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K36FXInterface_Cosmetic_SpellCancelled) == 0x000001, "Wrong alignment on K36FXInterface_Cosmetic_SpellCancelled");
static_assert(sizeof(K36FXInterface_Cosmetic_SpellCancelled) == 0x000001, "Wrong size on K36FXInterface_Cosmetic_SpellCancelled");
static_assert(offsetof(K36FXInterface_Cosmetic_SpellCancelled, SpellType) == 0x000000, "Member 'K36FXInterface_Cosmetic_SpellCancelled::SpellType' has a wrong offset!");

// Function TheK36.K36FXInterface.Cosmetic_SpellChargeCompleted
// 0x0001 (0x0001 - 0x0000)
struct K36FXInterface_Cosmetic_SpellChargeCompleted final
{
public:
