#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK32

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TheK32_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TheK32.K32BaseProjectile.OnRep_IsAcquiredFromPool
// 0x0001 (0x0001 - 0x0000)
struct K32BaseProjectile_OnRep_IsAcquiredFromPool final
{
public:
	bool                                          OldIsAcquiredFromPool;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32BaseProjectile_OnRep_IsAcquiredFromPool) == 0x000001, "Wrong alignment on K32BaseProjectile_OnRep_IsAcquiredFromPool");
static_assert(sizeof(K32BaseProjectile_OnRep_IsAcquiredFromPool) == 0x000001, "Wrong size on K32BaseProjectile_OnRep_IsAcquiredFromPool");
static_assert(offsetof(K32BaseProjectile_OnRep_IsAcquiredFromPool, OldIsAcquiredFromPool) == 0x000000, "Member 'K32BaseProjectile_OnRep_IsAcquiredFromPool::OldIsAcquiredFromPool' has a wrong offset!");

// Function TheK32.InK32PodZoneLingeringEffect.Authority_OnKillerPodAcquiredChanged
// 0x0001 (0x0001 - 0x0000)
struct InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged final
{
public:
	bool                                          IsAcquired;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged) == 0x000001, "Wrong alignment on InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged");
static_assert(sizeof(InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged) == 0x000001, "Wrong size on InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged");
static_assert(offsetof(InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged, IsAcquired) == 0x000000, "Member 'InK32PodZoneLingeringEffect_Authority_OnKillerPodAcquiredChanged::IsAcquired' has a wrong offset!");

// Function TheK32.InK32PodZoneLingeringEffect.Authority_OnKillerPodDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged) == 0x000001, "Wrong alignment on InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged");
static_assert(sizeof(InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged) == 0x000001, "Wrong size on InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged");
static_assert(offsetof(InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged, IsDisabled) == 0x000000, "Member 'InK32PodZoneLingeringEffect_Authority_OnKillerPodDisabledChanged::IsDisabled' has a wrong offset!");

// Function TheK32.K32AnimInstance.OnGameEventReceived
// 0x0040 (0x0040 - 0x0000)
struct K32AnimInstance_OnGameEventReceived final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32AnimInstance_OnGameEventReceived) == 0x000008, "Wrong alignment on K32AnimInstance_OnGameEventReceived");
static_assert(sizeof(K32AnimInstance_OnGameEventReceived) == 0x000040, "Wrong size on K32AnimInstance_OnGameEventReceived");
static_assert(offsetof(K32AnimInstance_OnGameEventReceived, GameplayTag) == 0x000000, "Member 'K32AnimInstance_OnGameEventReceived::GameplayTag' has a wrong offset!");
static_assert(offsetof(K32AnimInstance_OnGameEventReceived, GameEventData) == 0x000010, "Member 'K32AnimInstance_OnGameEventReceived::GameEventData' has a wrong offset!");

// Function TheK32.K32Emp.Cosmetic_OnEmpInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct K32Emp_Cosmetic_OnEmpInteractionFinished final
{
public:
	int32                                         NumberOfAffectedTargets;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32Emp_Cosmetic_OnEmpInteractionFinished) == 0x000008, "Wrong alignment on K32Emp_Cosmetic_OnEmpInteractionFinished");
static_assert(sizeof(K32Emp_Cosmetic_OnEmpInteractionFinished) == 0x000010, "Wrong size on K32Emp_Cosmetic_OnEmpInteractionFinished");
static_assert(offsetof(K32Emp_Cosmetic_OnEmpInteractionFinished, NumberOfAffectedTargets) == 0x000000, "Member 'K32Emp_Cosmetic_OnEmpInteractionFinished::NumberOfAffectedTargets' has a wrong offset!");
static_assert(offsetof(K32Emp_Cosmetic_OnEmpInteractionFinished, InteractingPlayer) == 0x000008, "Member 'K32Emp_Cosmetic_OnEmpInteractionFinished::InteractingPlayer' has a wrong offset!");

// Function TheK32.K32Emp.Cosmetic_OnNumTargetsInRangeChanged
// 0x0004 (0x0004 - 0x0000)
struct K32Emp_Cosmetic_OnNumTargetsInRangeChanged final
{
public:
	int32                                         NumberOfAffectedTargets;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32Emp_Cosmetic_OnNumTargetsInRangeChanged) == 0x000004, "Wrong alignment on K32Emp_Cosmetic_OnNumTargetsInRangeChanged");
static_assert(sizeof(K32Emp_Cosmetic_OnNumTargetsInRangeChanged) == 0x000004, "Wrong size on K32Emp_Cosmetic_OnNumTargetsInRangeChanged");
static_assert(offsetof(K32Emp_Cosmetic_OnNumTargetsInRangeChanged, NumberOfAffectedTargets) == 0x000000, "Member 'K32Emp_Cosmetic_OnNumTargetsInRangeChanged::NumberOfAffectedTargets' has a wrong offset!");

// Function TheK32.K32Emp.Cosmetic_OnVisibilityChanged
// 0x0002 (0x0002 - 0x0000)
struct K32Emp_Cosmetic_OnVisibilityChanged final
{
public:
	bool                                          PreviousIsVisible;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisible;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32Emp_Cosmetic_OnVisibilityChanged) == 0x000001, "Wrong alignment on K32Emp_Cosmetic_OnVisibilityChanged");
static_assert(sizeof(K32Emp_Cosmetic_OnVisibilityChanged) == 0x000002, "Wrong size on K32Emp_Cosmetic_OnVisibilityChanged");
static_assert(offsetof(K32Emp_Cosmetic_OnVisibilityChanged, PreviousIsVisible) == 0x000000, "Member 'K32Emp_Cosmetic_OnVisibilityChanged::PreviousIsVisible' has a wrong offset!");
static_assert(offsetof(K32Emp_Cosmetic_OnVisibilityChanged, IsVisible) == 0x000001, "Member 'K32Emp_Cosmetic_OnVisibilityChanged::IsVisible' has a wrong offset!");

// Function TheK32.K32Emp.Multicast_UseEmp
// 0x0010 (0x0010 - 0x0000)
struct K32Emp_Multicast_UseEmp final
{
public:
	int32                                         NumAffectedTargets;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32Emp_Multicast_UseEmp) == 0x000008, "Wrong alignment on K32Emp_Multicast_UseEmp");
static_assert(sizeof(K32Emp_Multicast_UseEmp) == 0x000010, "Wrong size on K32Emp_Multicast_UseEmp");
static_assert(offsetof(K32Emp_Multicast_UseEmp, NumAffectedTargets) == 0x000000, "Member 'K32Emp_Multicast_UseEmp::NumAffectedTargets' has a wrong offset!");
static_assert(offsetof(K32Emp_Multicast_UseEmp, InteractingPlayer) == 0x000008, "Member 'K32Emp_Multicast_UseEmp::InteractingPlayer' has a wrong offset!");

// Function TheK32.K32Emp.OnEmpInteractionEntered
// 0x0008 (0x0008 - 0x0000)
struct K32Emp_OnEmpInteractionEntered final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32Emp_OnEmpInteractionEntered) == 0x000008, "Wrong alignment on K32Emp_OnEmpInteractionEntered");
static_assert(sizeof(K32Emp_OnEmpInteractionEntered) == 0x000008, "Wrong size on K32Emp_OnEmpInteractionEntered");
static_assert(offsetof(K32Emp_OnEmpInteractionEntered, InteractingPlayer) == 0x000000, "Member 'K32Emp_OnEmpInteractionEntered::InteractingPlayer' has a wrong offset!");

// Function TheK32.K32Emp.OnEmpInteractionFinished
// 0x0010 (0x0010 - 0x0000)
struct K32Emp_OnEmpInteractionFinished final
{
public:
	class ADBDPlayer*                             InteractingPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasInteractionStarted;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K32Emp_OnEmpInteractionFinished) == 0x000008, "Wrong alignment on K32Emp_OnEmpInteractionFinished");
static_assert(sizeof(K32Emp_OnEmpInteractionFinished) == 0x000010, "Wrong size on K32Emp_OnEmpInteractionFinished");
static_assert(offsetof(K32Emp_OnEmpInteractionFinished, InteractingPlayer) == 0x000000, "Member 'K32Emp_OnEmpInteractionFinished::InteractingPlayer' has a wrong offset!");
static_assert(offsetof(K32Emp_OnEmpInteractionFinished, HasInteractionStarted) == 0x000008, "Member 'K32Emp_OnEmpInteractionFinished::HasInteractionStarted' has a wrong offset!");

// Function TheK32.K32Emp.OnRep_IsVisible
// 0x0001 (0x0001 - 0x0000)
struct K32Emp_OnRep_IsVisible final
{
public:
	bool                                          PreviousIsVisible;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32Emp_OnRep_IsVisible) == 0x000001, "Wrong alignment on K32Emp_OnRep_IsVisible");
static_assert(sizeof(K32Emp_OnRep_IsVisible) == 0x000001, "Wrong size on K32Emp_OnRep_IsVisible");
static_assert(offsetof(K32Emp_OnRep_IsVisible, PreviousIsVisible) == 0x000000, "Member 'K32Emp_OnRep_IsVisible::PreviousIsVisible' has a wrong offset!");

// Function TheK32.K32ItemBox.Authority_OnItemPickup
// 0x0008 (0x0008 - 0x0000)
struct K32ItemBox_Authority_OnItemPickup final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBox_Authority_OnItemPickup) == 0x000008, "Wrong alignment on K32ItemBox_Authority_OnItemPickup");
static_assert(sizeof(K32ItemBox_Authority_OnItemPickup) == 0x000008, "Wrong size on K32ItemBox_Authority_OnItemPickup");
static_assert(offsetof(K32ItemBox_Authority_OnItemPickup, Player) == 0x000000, "Member 'K32ItemBox_Authority_OnItemPickup::Player' has a wrong offset!");

// Function TheK32.K32ItemBox.Cosmetic_OnStateChanged
// 0x0001 (0x0001 - 0x0000)
struct K32ItemBox_Cosmetic_OnStateChanged final
{
public:
	EK32ItemBoxState                              NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBox_Cosmetic_OnStateChanged) == 0x000001, "Wrong alignment on K32ItemBox_Cosmetic_OnStateChanged");
static_assert(sizeof(K32ItemBox_Cosmetic_OnStateChanged) == 0x000001, "Wrong size on K32ItemBox_Cosmetic_OnStateChanged");
static_assert(offsetof(K32ItemBox_Cosmetic_OnStateChanged, NewState) == 0x000000, "Member 'K32ItemBox_Cosmetic_OnStateChanged::NewState' has a wrong offset!");

// Function TheK32.K32ItemBox.Cosmetic_OnSurvivorInteractingChanged
// 0x0001 (0x0001 - 0x0000)
struct K32ItemBox_Cosmetic_OnSurvivorInteractingChanged final
{
public:
	bool                                          IsInteracting;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBox_Cosmetic_OnSurvivorInteractingChanged) == 0x000001, "Wrong alignment on K32ItemBox_Cosmetic_OnSurvivorInteractingChanged");
static_assert(sizeof(K32ItemBox_Cosmetic_OnSurvivorInteractingChanged) == 0x000001, "Wrong size on K32ItemBox_Cosmetic_OnSurvivorInteractingChanged");
static_assert(offsetof(K32ItemBox_Cosmetic_OnSurvivorInteractingChanged, IsInteracting) == 0x000000, "Member 'K32ItemBox_Cosmetic_OnSurvivorInteractingChanged::IsInteracting' has a wrong offset!");

// Function TheK32.K32ItemBox.Multicast_SetIsChargeTimeExtended
// 0x0001 (0x0001 - 0x0000)
struct K32ItemBox_Multicast_SetIsChargeTimeExtended final
{
public:
	bool                                          IsAddonExtendingFirstActivationTimer;              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBox_Multicast_SetIsChargeTimeExtended) == 0x000001, "Wrong alignment on K32ItemBox_Multicast_SetIsChargeTimeExtended");
static_assert(sizeof(K32ItemBox_Multicast_SetIsChargeTimeExtended) == 0x000001, "Wrong size on K32ItemBox_Multicast_SetIsChargeTimeExtended");
static_assert(offsetof(K32ItemBox_Multicast_SetIsChargeTimeExtended, IsAddonExtendingFirstActivationTimer) == 0x000000, "Member 'K32ItemBox_Multicast_SetIsChargeTimeExtended::IsAddonExtendingFirstActivationTimer' has a wrong offset!");

// Function TheK32.K32ItemBox.OnChargeableCompleteEvent
// 0x0018 (0x0018 - 0x0000)
struct K32ItemBox_OnChargeableCompleteEvent final
{
public:
	bool                                          COMPLETED;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         InstigatorsForCompletion;                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBox_OnChargeableCompleteEvent) == 0x000008, "Wrong alignment on K32ItemBox_OnChargeableCompleteEvent");
static_assert(sizeof(K32ItemBox_OnChargeableCompleteEvent) == 0x000018, "Wrong size on K32ItemBox_OnChargeableCompleteEvent");
static_assert(offsetof(K32ItemBox_OnChargeableCompleteEvent, COMPLETED) == 0x000000, "Member 'K32ItemBox_OnChargeableCompleteEvent::COMPLETED' has a wrong offset!");
static_assert(offsetof(K32ItemBox_OnChargeableCompleteEvent, InstigatorsForCompletion) == 0x000008, "Member 'K32ItemBox_OnChargeableCompleteEvent::InstigatorsForCompletion' has a wrong offset!");

// Function TheK32.K32ItemBoxManagerComponent.Authority_OnItemBoxDeactivated
// 0x0040 (0x0040 - 0x0000)
struct K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated) == 0x000008, "Wrong alignment on K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated");
static_assert(sizeof(K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated) == 0x000040, "Wrong size on K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated");
static_assert(offsetof(K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated, GameplayTag) == 0x000000, "Member 'K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated::GameplayTag' has a wrong offset!");
static_assert(offsetof(K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated, GameEventData) == 0x000010, "Member 'K32ItemBoxManagerComponent_Authority_OnItemBoxDeactivated::GameEventData' has a wrong offset!");

// Function TheK32.K32ItemBoxOutlineUpdateStrategy.OnDistanceStatValueUpdated
// 0x0004 (0x0004 - 0x0000)
struct K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated) == 0x000004, "Wrong alignment on K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated");
static_assert(sizeof(K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated) == 0x000004, "Wrong size on K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated");
static_assert(offsetof(K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated, Distance) == 0x000000, "Member 'K32ItemBoxOutlineUpdateStrategy_OnDistanceStatValueUpdated::Distance' has a wrong offset!");

// Function TheK32.K32KillerPod.Cosmetic_IsBlockingPodSpawningChanged
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged final
{
public:
	bool                                          IsBlocking;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceBetweenPods;                               // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged) == 0x000004, "Wrong alignment on K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged");
static_assert(sizeof(K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged) == 0x000008, "Wrong size on K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged");
static_assert(offsetof(K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged, IsBlocking) == 0x000000, "Member 'K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged::IsBlocking' has a wrong offset!");
static_assert(offsetof(K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged, DistanceBetweenPods) == 0x000004, "Member 'K32KillerPod_Cosmetic_IsBlockingPodSpawningChanged::DistanceBetweenPods' has a wrong offset!");

// Function TheK32.K32KillerPod.Cosmetic_OnControlledByKillerChanged
// 0x0130 (0x0130 - 0x0000)
struct K32KillerPod_Cosmetic_OnControlledByKillerChanged final
{
public:
	struct FK32KillerPodSettings                  PreviousSettings;                                  // 0x0000(0x0098)(Parm, NativeAccessSpecifierPublic)
	struct FK32KillerPodSettings                  Settings;                                          // 0x0098(0x0098)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_Cosmetic_OnControlledByKillerChanged) == 0x000008, "Wrong alignment on K32KillerPod_Cosmetic_OnControlledByKillerChanged");
static_assert(sizeof(K32KillerPod_Cosmetic_OnControlledByKillerChanged) == 0x000130, "Wrong size on K32KillerPod_Cosmetic_OnControlledByKillerChanged");
static_assert(offsetof(K32KillerPod_Cosmetic_OnControlledByKillerChanged, PreviousSettings) == 0x000000, "Member 'K32KillerPod_Cosmetic_OnControlledByKillerChanged::PreviousSettings' has a wrong offset!");
static_assert(offsetof(K32KillerPod_Cosmetic_OnControlledByKillerChanged, Settings) == 0x000098, "Member 'K32KillerPod_Cosmetic_OnControlledByKillerChanged::Settings' has a wrong offset!");

// Function TheK32.K32KillerPod.Cosmetic_OnDestroyedByEmp
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPod_Cosmetic_OnDestroyedByEmp final
{
public:
	class ADBDPlayer*                             DestroyingSurvivor;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_Cosmetic_OnDestroyedByEmp) == 0x000008, "Wrong alignment on K32KillerPod_Cosmetic_OnDestroyedByEmp");
static_assert(sizeof(K32KillerPod_Cosmetic_OnDestroyedByEmp) == 0x000008, "Wrong size on K32KillerPod_Cosmetic_OnDestroyedByEmp");
static_assert(offsetof(K32KillerPod_Cosmetic_OnDestroyedByEmp, DestroyingSurvivor) == 0x000000, "Member 'K32KillerPod_Cosmetic_OnDestroyedByEmp::DestroyingSurvivor' has a wrong offset!");

// Function TheK32.K32KillerPod.Cosmetic_OnDisabledChanged
// 0x0130 (0x0130 - 0x0000)
struct K32KillerPod_Cosmetic_OnDisabledChanged final
{
public:
	struct FK32KillerPodSettings                  PreviousSettings;                                  // 0x0000(0x0098)(Parm, NativeAccessSpecifierPublic)
	struct FK32KillerPodSettings                  Settings;                                          // 0x0098(0x0098)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_Cosmetic_OnDisabledChanged) == 0x000008, "Wrong alignment on K32KillerPod_Cosmetic_OnDisabledChanged");
static_assert(sizeof(K32KillerPod_Cosmetic_OnDisabledChanged) == 0x000130, "Wrong size on K32KillerPod_Cosmetic_OnDisabledChanged");
static_assert(offsetof(K32KillerPod_Cosmetic_OnDisabledChanged, PreviousSettings) == 0x000000, "Member 'K32KillerPod_Cosmetic_OnDisabledChanged::PreviousSettings' has a wrong offset!");
static_assert(offsetof(K32KillerPod_Cosmetic_OnDisabledChanged, Settings) == 0x000098, "Member 'K32KillerPod_Cosmetic_OnDisabledChanged::Settings' has a wrong offset!");

// Function TheK32.K32KillerPod.Cosmetic_OnSettingsChanged
// 0x0130 (0x0130 - 0x0000)
struct K32KillerPod_Cosmetic_OnSettingsChanged final
{
public:
	struct FK32KillerPodSettings                  PreviousSettings;                                  // 0x0000(0x0098)(Parm, NativeAccessSpecifierPublic)
	struct FK32KillerPodSettings                  Settings;                                          // 0x0098(0x0098)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_Cosmetic_OnSettingsChanged) == 0x000008, "Wrong alignment on K32KillerPod_Cosmetic_OnSettingsChanged");
static_assert(sizeof(K32KillerPod_Cosmetic_OnSettingsChanged) == 0x000130, "Wrong size on K32KillerPod_Cosmetic_OnSettingsChanged");
static_assert(offsetof(K32KillerPod_Cosmetic_OnSettingsChanged, PreviousSettings) == 0x000000, "Member 'K32KillerPod_Cosmetic_OnSettingsChanged::PreviousSettings' has a wrong offset!");
static_assert(offsetof(K32KillerPod_Cosmetic_OnSettingsChanged, Settings) == 0x000098, "Member 'K32KillerPod_Cosmetic_OnSettingsChanged::Settings' has a wrong offset!");

// Function TheK32.K32KillerPod.Multicast_OnDestroyedByEmp
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPod_Multicast_OnDestroyedByEmp final
{
public:
	class ADBDPlayer*                             DestroyingSurvivor;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_Multicast_OnDestroyedByEmp) == 0x000008, "Wrong alignment on K32KillerPod_Multicast_OnDestroyedByEmp");
static_assert(sizeof(K32KillerPod_Multicast_OnDestroyedByEmp) == 0x000008, "Wrong size on K32KillerPod_Multicast_OnDestroyedByEmp");
static_assert(offsetof(K32KillerPod_Multicast_OnDestroyedByEmp, DestroyingSurvivor) == 0x000000, "Member 'K32KillerPod_Multicast_OnDestroyedByEmp::DestroyingSurvivor' has a wrong offset!");

// Function TheK32.K32KillerPod.OnKillerLocallyObservedChanged
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPod_OnKillerLocallyObservedChanged final
{
public:
	bool                                          IsKillerLocallyObserved;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_OnKillerLocallyObservedChanged) == 0x000001, "Wrong alignment on K32KillerPod_OnKillerLocallyObservedChanged");
static_assert(sizeof(K32KillerPod_OnKillerLocallyObservedChanged) == 0x000001, "Wrong size on K32KillerPod_OnKillerLocallyObservedChanged");
static_assert(offsetof(K32KillerPod_OnKillerLocallyObservedChanged, IsKillerLocallyObserved) == 0x000000, "Member 'K32KillerPod_OnKillerLocallyObservedChanged::IsKillerLocallyObserved' has a wrong offset!");

// Function TheK32.K32KillerPod.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPod_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_OnKillerSet) == 0x000008, "Wrong alignment on K32KillerPod_OnKillerSet");
static_assert(sizeof(K32KillerPod_OnKillerSet) == 0x000008, "Wrong size on K32KillerPod_OnKillerSet");
static_assert(offsetof(K32KillerPod_OnKillerSet, Killer) == 0x000000, "Member 'K32KillerPod_OnKillerSet::Killer' has a wrong offset!");

// Function TheK32.K32KillerPod.OnRep_Settings
// 0x0098 (0x0098 - 0x0000)
struct K32KillerPod_OnRep_Settings final
{
public:
	struct FK32KillerPodSettings                  PreviousSettings;                                  // 0x0000(0x0098)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_OnRep_Settings) == 0x000008, "Wrong alignment on K32KillerPod_OnRep_Settings");
static_assert(sizeof(K32KillerPod_OnRep_Settings) == 0x000098, "Wrong size on K32KillerPod_OnRep_Settings");
static_assert(offsetof(K32KillerPod_OnRep_Settings, PreviousSettings) == 0x000000, "Member 'K32KillerPod_OnRep_Settings::PreviousSettings' has a wrong offset!");

// Function TheK32.K32KillerPod.OnVisibilityChanged
// 0x0130 (0x0130 - 0x0000)
struct K32KillerPod_OnVisibilityChanged final
{
public:
	struct FK32KillerPodSettings                  PreviousSettings;                                  // 0x0000(0x0098)(Parm, NativeAccessSpecifierPublic)
	struct FK32KillerPodSettings                  Settings;                                          // 0x0098(0x0098)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_OnVisibilityChanged) == 0x000008, "Wrong alignment on K32KillerPod_OnVisibilityChanged");
static_assert(sizeof(K32KillerPod_OnVisibilityChanged) == 0x000130, "Wrong size on K32KillerPod_OnVisibilityChanged");
static_assert(offsetof(K32KillerPod_OnVisibilityChanged, PreviousSettings) == 0x000000, "Member 'K32KillerPod_OnVisibilityChanged::PreviousSettings' has a wrong offset!");
static_assert(offsetof(K32KillerPod_OnVisibilityChanged, Settings) == 0x000098, "Member 'K32KillerPod_OnVisibilityChanged::Settings' has a wrong offset!");

// Function TheK32.K32KillerPod.GetKiller
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPod_GetKiller final
{
public:
	class ASlasherPlayer*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_GetKiller) == 0x000008, "Wrong alignment on K32KillerPod_GetKiller");
static_assert(sizeof(K32KillerPod_GetKiller) == 0x000008, "Wrong size on K32KillerPod_GetKiller");
static_assert(offsetof(K32KillerPod_GetKiller, ReturnValue) == 0x000000, "Member 'K32KillerPod_GetKiller::ReturnValue' has a wrong offset!");

// Function TheK32.K32KillerPod.GetSettings
// 0x0098 (0x0098 - 0x0000)
struct K32KillerPod_GetSettings final
{
public:
	struct FK32KillerPodSettings                  ReturnValue;                                       // 0x0000(0x0098)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPod_GetSettings) == 0x000008, "Wrong alignment on K32KillerPod_GetSettings");
static_assert(sizeof(K32KillerPod_GetSettings) == 0x000098, "Wrong size on K32KillerPod_GetSettings");
static_assert(offsetof(K32KillerPod_GetSettings, ReturnValue) == 0x000000, "Member 'K32KillerPod_GetSettings::ReturnValue' has a wrong offset!");

// Function TheK32.K32KillerPodAimingCrosshairComponent.GetCurrentPodCamera
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera final
{
public:
	class UCameraComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera) == 0x000008, "Wrong alignment on K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera");
static_assert(sizeof(K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera) == 0x000008, "Wrong size on K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera");
static_assert(offsetof(K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera, ReturnValue) == 0x000000, "Member 'K32KillerPodAimingCrosshairComponent_GetCurrentPodCamera::ReturnValue' has a wrong offset!");

// Function TheK32.K32KillerPodLockOnProgressComponent.Server_SetCrosshairState
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodLockOnProgressComponent_Server_SetCrosshairState final
{
public:
	EAimingCrosshairState                         CrosshairState;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodLockOnProgressComponent_Server_SetCrosshairState) == 0x000001, "Wrong alignment on K32KillerPodLockOnProgressComponent_Server_SetCrosshairState");
static_assert(sizeof(K32KillerPodLockOnProgressComponent_Server_SetCrosshairState) == 0x000001, "Wrong size on K32KillerPodLockOnProgressComponent_Server_SetCrosshairState");
static_assert(offsetof(K32KillerPodLockOnProgressComponent_Server_SetCrosshairState, CrosshairState) == 0x000000, "Member 'K32KillerPodLockOnProgressComponent_Server_SetCrosshairState::CrosshairState' has a wrong offset!");

// Function TheK32.K32KillerPodLockOnProgressComponent.Server_SetLockOnState
// 0x0018 (0x0018 - 0x0000)
struct K32KillerPodLockOnProgressComponent_Server_SetLockOnState final
{
public:
	ELockOnState                                  State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAimingCrosshairState                         CrosshairState;                                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class ACamperPlayer*                    SurvivorBeingLockedOn;                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESurvivorLockedOnProgressState                SurvivorLockedOnProgressState;                     // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K32KillerPodLockOnProgressComponent_Server_SetLockOnState) == 0x000008, "Wrong alignment on K32KillerPodLockOnProgressComponent_Server_SetLockOnState");
static_assert(sizeof(K32KillerPodLockOnProgressComponent_Server_SetLockOnState) == 0x000018, "Wrong size on K32KillerPodLockOnProgressComponent_Server_SetLockOnState");
static_assert(offsetof(K32KillerPodLockOnProgressComponent_Server_SetLockOnState, State) == 0x000000, "Member 'K32KillerPodLockOnProgressComponent_Server_SetLockOnState::State' has a wrong offset!");
static_assert(offsetof(K32KillerPodLockOnProgressComponent_Server_SetLockOnState, CrosshairState) == 0x000001, "Member 'K32KillerPodLockOnProgressComponent_Server_SetLockOnState::CrosshairState' has a wrong offset!");
static_assert(offsetof(K32KillerPodLockOnProgressComponent_Server_SetLockOnState, SurvivorBeingLockedOn) == 0x000008, "Member 'K32KillerPodLockOnProgressComponent_Server_SetLockOnState::SurvivorBeingLockedOn' has a wrong offset!");
static_assert(offsetof(K32KillerPodLockOnProgressComponent_Server_SetLockOnState, SurvivorLockedOnProgressState) == 0x000010, "Member 'K32KillerPodLockOnProgressComponent_Server_SetLockOnState::SurvivorLockedOnProgressState' has a wrong offset!");

// Function TheK32.K32KillerPodPool.Authority_OnDestroyPodDelayTimerDone
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone final
{
public:
	class ADBDPlayer*                             LaunchingSurvivor;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone) == 0x000008, "Wrong alignment on K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone");
static_assert(sizeof(K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone) == 0x000008, "Wrong size on K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone");
static_assert(offsetof(K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone, LaunchingSurvivor) == 0x000000, "Member 'K32KillerPodPool_Authority_OnDestroyPodDelayTimerDone::LaunchingSurvivor' has a wrong offset!");

// Function TheK32.K32KillerPodPool.OnKillerPodAcquiredChanged
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodPool_OnKillerPodAcquiredChanged final
{
public:
	bool                                          IsAcquired;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodPool_OnKillerPodAcquiredChanged) == 0x000001, "Wrong alignment on K32KillerPodPool_OnKillerPodAcquiredChanged");
static_assert(sizeof(K32KillerPodPool_OnKillerPodAcquiredChanged) == 0x000001, "Wrong size on K32KillerPodPool_OnKillerPodAcquiredChanged");
static_assert(offsetof(K32KillerPodPool_OnKillerPodAcquiredChanged, IsAcquired) == 0x000000, "Member 'K32KillerPodPool_OnKillerPodAcquiredChanged::IsAcquired' has a wrong offset!");

// Function TheK32.K32KillerPodPool.OnKillerPodCreated
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodPool_OnKillerPodCreated final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodPool_OnKillerPodCreated) == 0x000008, "Wrong alignment on K32KillerPodPool_OnKillerPodCreated");
static_assert(sizeof(K32KillerPodPool_OnKillerPodCreated) == 0x000008, "Wrong size on K32KillerPodPool_OnKillerPodCreated");
static_assert(offsetof(K32KillerPodPool_OnKillerPodCreated, Actor) == 0x000000, "Member 'K32KillerPodPool_OnKillerPodCreated::Actor' has a wrong offset!");

// Function TheK32.K32KillerPodRestrictedZone.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodRestrictedZone_GetStaticMesh final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodRestrictedZone_GetStaticMesh) == 0x000008, "Wrong alignment on K32KillerPodRestrictedZone_GetStaticMesh");
static_assert(sizeof(K32KillerPodRestrictedZone_GetStaticMesh) == 0x000008, "Wrong size on K32KillerPodRestrictedZone_GetStaticMesh");
static_assert(offsetof(K32KillerPodRestrictedZone_GetStaticMesh, ReturnValue) == 0x000000, "Member 'K32KillerPodRestrictedZone_GetStaticMesh::ReturnValue' has a wrong offset!");

// Function TheK32.K32KillerPodSpawningComponent.Server_FireKillerProjectile
// 0x0050 (0x0050 - 0x0000)
struct K32KillerPodSpawningComponent_Server_FireKillerProjectile final
{
public:
	struct FK32KillerPodSpawningInputData         InputData;                                         // 0x0000(0x0048)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	EK32KillerPodSpawningResult                   ExpectedResult;                                    // 0x0048(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(K32KillerPodSpawningComponent_Server_FireKillerProjectile) == 0x000008, "Wrong alignment on K32KillerPodSpawningComponent_Server_FireKillerProjectile");
static_assert(sizeof(K32KillerPodSpawningComponent_Server_FireKillerProjectile) == 0x000050, "Wrong size on K32KillerPodSpawningComponent_Server_FireKillerProjectile");
static_assert(offsetof(K32KillerPodSpawningComponent_Server_FireKillerProjectile, InputData) == 0x000000, "Member 'K32KillerPodSpawningComponent_Server_FireKillerProjectile::InputData' has a wrong offset!");
static_assert(offsetof(K32KillerPodSpawningComponent_Server_FireKillerProjectile, ExpectedResult) == 0x000048, "Member 'K32KillerPodSpawningComponent_Server_FireKillerProjectile::ExpectedResult' has a wrong offset!");

// Function TheK32.K32KillerPodSpawningComponent.Cosmetic_OnInvalidPodTriggers
// 0x0018 (0x0018 - 0x0000)
struct K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers final
{
public:
	struct FVector                                InvalidLocation;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers) == 0x000008, "Wrong alignment on K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers");
static_assert(sizeof(K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers) == 0x000018, "Wrong size on K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers");
static_assert(offsetof(K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers, InvalidLocation) == 0x000000, "Member 'K32KillerPodSpawningComponent_Cosmetic_OnInvalidPodTriggers::InvalidLocation' has a wrong offset!");

// Function TheK32.K32KillerPodSpawningIndicator.Cosmetic_OnSettingsChanged
// 0x0070 (0x0070 - 0x0000)
struct K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged final
{
public:
	struct FK32KillerPodSpawningIndicatorSettings PreviousSettings;                                  // 0x0000(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FK32KillerPodSpawningIndicatorSettings Settings;                                          // 0x0038(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged) == 0x000008, "Wrong alignment on K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged");
static_assert(sizeof(K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged) == 0x000070, "Wrong size on K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged");
static_assert(offsetof(K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged, PreviousSettings) == 0x000000, "Member 'K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged::PreviousSettings' has a wrong offset!");
static_assert(offsetof(K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged, Settings) == 0x000038, "Member 'K32KillerPodSpawningIndicator_Cosmetic_OnSettingsChanged::Settings' has a wrong offset!");

// Function TheK32.K32KillerPodSpawningIndicator.GetSettings
// 0x0038 (0x0038 - 0x0000)
struct K32KillerPodSpawningIndicator_GetSettings final
{
public:
	struct FK32KillerPodSpawningIndicatorSettings ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodSpawningIndicator_GetSettings) == 0x000008, "Wrong alignment on K32KillerPodSpawningIndicator_GetSettings");
static_assert(sizeof(K32KillerPodSpawningIndicator_GetSettings) == 0x000038, "Wrong size on K32KillerPodSpawningIndicator_GetSettings");
static_assert(offsetof(K32KillerPodSpawningIndicator_GetSettings, ReturnValue) == 0x000000, "Member 'K32KillerPodSpawningIndicator_GetSettings::ReturnValue' has a wrong offset!");

// Function TheK32.K32KillerPodTargetIndicator.Cosmetic_OnSettingsChanged
// 0x0070 (0x0070 - 0x0000)
struct K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged final
{
public:
	struct FK32KillerPodTargetIndicatorSettings   PreviousSettings;                                  // 0x0000(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FK32KillerPodTargetIndicatorSettings   Settings;                                          // 0x0038(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged) == 0x000008, "Wrong alignment on K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged");
static_assert(sizeof(K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged) == 0x000070, "Wrong size on K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged");
static_assert(offsetof(K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged, PreviousSettings) == 0x000000, "Member 'K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged::PreviousSettings' has a wrong offset!");
static_assert(offsetof(K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged, Settings) == 0x000038, "Member 'K32KillerPodTargetIndicator_Cosmetic_OnSettingsChanged::Settings' has a wrong offset!");

// Function TheK32.K32KillerPodTargetIndicator.GetSettings
// 0x0038 (0x0038 - 0x0000)
struct K32KillerPodTargetIndicator_GetSettings final
{
public:
	struct FK32KillerPodTargetIndicatorSettings   ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodTargetIndicator_GetSettings) == 0x000008, "Wrong alignment on K32KillerPodTargetIndicator_GetSettings");
static_assert(sizeof(K32KillerPodTargetIndicator_GetSettings) == 0x000038, "Wrong size on K32KillerPodTargetIndicator_GetSettings");
static_assert(offsetof(K32KillerPodTargetIndicator_GetSettings, ReturnValue) == 0x000000, "Member 'K32KillerPodTargetIndicator_GetSettings::ReturnValue' has a wrong offset!");

// Function TheK32.K32KillerPodTargetingComponent.Cosmetic_Local_NewKillerPodTargeted
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted final
{
public:
	class AK32KillerPod*                          NewTarget;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted) == 0x000008, "Wrong alignment on K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted");
static_assert(sizeof(K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted) == 0x000008, "Wrong size on K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted");
static_assert(offsetof(K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted, NewTarget) == 0x000000, "Member 'K32KillerPodTargetingComponent_Cosmetic_Local_NewKillerPodTargeted::NewTarget' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Authority_OnControlledPodDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged) == 0x000001, "Wrong alignment on K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged");
static_assert(sizeof(K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged) == 0x000001, "Wrong size on K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged");
static_assert(offsetof(K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged, IsDisabled) == 0x000000, "Member 'K32KillerPodVisionController_Authority_OnControlledPodDisabledChanged::IsDisabled' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Cosmetic_Local_OnCurrentPodDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged) == 0x000001, "Wrong alignment on K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged");
static_assert(sizeof(K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged) == 0x000001, "Wrong size on K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged");
static_assert(offsetof(K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged, IsDisabled) == 0x000000, "Member 'K32KillerPodVisionController_Cosmetic_Local_OnCurrentPodDisabledChanged::IsDisabled' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Multicast_OnControlledPodDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged) == 0x000001, "Wrong alignment on K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged");
static_assert(sizeof(K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged) == 0x000001, "Wrong size on K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged");
static_assert(offsetof(K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged, IsDisabled) == 0x000000, "Member 'K32KillerPodVisionController_Multicast_OnControlledPodDisabledChanged::IsDisabled' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Multicast_SetCameraOrientation
// 0x0018 (0x0018 - 0x0000)
struct K32KillerPodVisionController_Multicast_SetCameraOrientation final
{
public:
	struct FRotator                               NewOrientation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Multicast_SetCameraOrientation) == 0x000008, "Wrong alignment on K32KillerPodVisionController_Multicast_SetCameraOrientation");
static_assert(sizeof(K32KillerPodVisionController_Multicast_SetCameraOrientation) == 0x000018, "Wrong size on K32KillerPodVisionController_Multicast_SetCameraOrientation");
static_assert(offsetof(K32KillerPodVisionController_Multicast_SetCameraOrientation, NewOrientation) == 0x000000, "Member 'K32KillerPodVisionController_Multicast_SetCameraOrientation::NewOrientation' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Multicast_SetKillerCollisionDisabledForSurvivors
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors) == 0x000001, "Wrong alignment on K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors");
static_assert(sizeof(K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors) == 0x000001, "Wrong size on K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors");
static_assert(offsetof(K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors, IsDisabled) == 0x000000, "Member 'K32KillerPodVisionController_Multicast_SetKillerCollisionDisabledForSurvivors::IsDisabled' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Multicast_SetLocationAndRotation
// 0x0018 (0x0018 - 0x0000)
struct K32KillerPodVisionController_Multicast_SetLocationAndRotation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Multicast_SetLocationAndRotation) == 0x000008, "Wrong alignment on K32KillerPodVisionController_Multicast_SetLocationAndRotation");
static_assert(sizeof(K32KillerPodVisionController_Multicast_SetLocationAndRotation) == 0x000018, "Wrong size on K32KillerPodVisionController_Multicast_SetLocationAndRotation");
static_assert(offsetof(K32KillerPodVisionController_Multicast_SetLocationAndRotation, Location) == 0x000000, "Member 'K32KillerPodVisionController_Multicast_SetLocationAndRotation::Location' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.OnControlledPodUnacquiredFromPool
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodVisionController_OnControlledPodUnacquiredFromPool final
{
public:
	bool                                          IsAcquired;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_OnControlledPodUnacquiredFromPool) == 0x000001, "Wrong alignment on K32KillerPodVisionController_OnControlledPodUnacquiredFromPool");
static_assert(sizeof(K32KillerPodVisionController_OnControlledPodUnacquiredFromPool) == 0x000001, "Wrong size on K32KillerPodVisionController_OnControlledPodUnacquiredFromPool");
static_assert(offsetof(K32KillerPodVisionController_OnControlledPodUnacquiredFromPool, IsAcquired) == 0x000000, "Member 'K32KillerPodVisionController_OnControlledPodUnacquiredFromPool::IsAcquired' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.OnInteractionStarted
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodVisionController_OnInteractionStarted final
{
public:
	class UInteractionDefinition*                 Interaction;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_OnInteractionStarted) == 0x000008, "Wrong alignment on K32KillerPodVisionController_OnInteractionStarted");
static_assert(sizeof(K32KillerPodVisionController_OnInteractionStarted) == 0x000008, "Wrong size on K32KillerPodVisionController_OnInteractionStarted");
static_assert(offsetof(K32KillerPodVisionController_OnInteractionStarted, Interaction) == 0x000000, "Member 'K32KillerPodVisionController_OnInteractionStarted::Interaction' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.OnKillerLocallyObservedChanged
// 0x0001 (0x0001 - 0x0000)
struct K32KillerPodVisionController_OnKillerLocallyObservedChanged final
{
public:
	bool                                          IsKillerLocallyObserved;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_OnKillerLocallyObservedChanged) == 0x000001, "Wrong alignment on K32KillerPodVisionController_OnKillerLocallyObservedChanged");
static_assert(sizeof(K32KillerPodVisionController_OnKillerLocallyObservedChanged) == 0x000001, "Wrong size on K32KillerPodVisionController_OnKillerLocallyObservedChanged");
static_assert(offsetof(K32KillerPodVisionController_OnKillerLocallyObservedChanged, IsKillerLocallyObserved) == 0x000000, "Member 'K32KillerPodVisionController_OnKillerLocallyObservedChanged::IsKillerLocallyObserved' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.OnKillerSet
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodVisionController_OnKillerSet final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_OnKillerSet) == 0x000008, "Wrong alignment on K32KillerPodVisionController_OnKillerSet");
static_assert(sizeof(K32KillerPodVisionController_OnKillerSet) == 0x000008, "Wrong size on K32KillerPodVisionController_OnKillerSet");
static_assert(offsetof(K32KillerPodVisionController_OnKillerSet, Killer) == 0x000000, "Member 'K32KillerPodVisionController_OnKillerSet::Killer' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Server_SetCameraOrientation
// 0x0018 (0x0018 - 0x0000)
struct K32KillerPodVisionController_Server_SetCameraOrientation final
{
public:
	struct FRotator                               NewOrientation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Server_SetCameraOrientation) == 0x000008, "Wrong alignment on K32KillerPodVisionController_Server_SetCameraOrientation");
static_assert(sizeof(K32KillerPodVisionController_Server_SetCameraOrientation) == 0x000018, "Wrong size on K32KillerPodVisionController_Server_SetCameraOrientation");
static_assert(offsetof(K32KillerPodVisionController_Server_SetCameraOrientation, NewOrientation) == 0x000000, "Member 'K32KillerPodVisionController_Server_SetCameraOrientation::NewOrientation' has a wrong offset!");

// Function TheK32.K32KillerPodVisionController.Server_TakeControlOfPod
// 0x0008 (0x0008 - 0x0000)
struct K32KillerPodVisionController_Server_TakeControlOfPod final
{
public:
	class AK32KillerPod*                          KillerPodToBeControlled;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionController_Server_TakeControlOfPod) == 0x000008, "Wrong alignment on K32KillerPodVisionController_Server_TakeControlOfPod");
static_assert(sizeof(K32KillerPodVisionController_Server_TakeControlOfPod) == 0x000008, "Wrong size on K32KillerPodVisionController_Server_TakeControlOfPod");
static_assert(offsetof(K32KillerPodVisionController_Server_TakeControlOfPod, KillerPodToBeControlled) == 0x000000, "Member 'K32KillerPodVisionController_Server_TakeControlOfPod::KillerPodToBeControlled' has a wrong offset!");

// Function TheK32.K32KillerPodVisionLockOnComponent.Cosmetic_ShootPodProjectileAtSurvivor
// 0x0010 (0x0010 - 0x0000)
struct K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor final
{
public:
	const class AK32KillerPod*                    CurrentPod;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACamperPlayer*                          TargetSurvivor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor) == 0x000008, "Wrong alignment on K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor");
static_assert(sizeof(K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor) == 0x000010, "Wrong size on K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor");
static_assert(offsetof(K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor, CurrentPod) == 0x000000, "Member 'K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor::CurrentPod' has a wrong offset!");
static_assert(offsetof(K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor, TargetSurvivor) == 0x000008, "Member 'K32KillerPodVisionLockOnComponent_Cosmetic_ShootPodProjectileAtSurvivor::TargetSurvivor' has a wrong offset!");

// Function TheK32.K32KillerPodVisionLockOnComponent.Multicast_ShootPodProjectileAtSurvivor
// 0x0010 (0x0010 - 0x0000)
struct K32KillerPodVisionLockOnComponent_Multicast_ShootPodProjectileAtSurvivor final
{
public:
