#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK28

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DBDCompetence_classes.hpp"
#include "DBDBots_classes.hpp"
#include "DBDAnimation_classes.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "Competence_classes.hpp"
#include "Engine_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "StatSystem_structs.hpp"
#include "TheK28_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DBDInteraction_classes.hpp"
#include "DBDCosmetic_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// Class TheK28.Addon_K28Power_04
// 0x0000 (0x02E8 - 0x02E8)
class UAddon_K28Power_04 final : public UItemAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_04">();
	}
	static class UAddon_K28Power_04* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_04>();
	}
};
static_assert(alignof(UAddon_K28Power_04) == 0x000008, "Wrong alignment on UAddon_K28Power_04");
static_assert(sizeof(UAddon_K28Power_04) == 0x0002E8, "Wrong size on UAddon_K28Power_04");

// Class TheK28.Addon_K28Power_15
// 0x0018 (0x0310 - 0x02F8)
class UAddon_K28Power_15 final : public UOnEventBaseAddon
{
public:
	TArray<TSubclassOf<class UStatusEffect>>      _survivorImposedEffectClasses;                     // 0x02F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         _statusEffectTime;                                 // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_15">();
	}
	static class UAddon_K28Power_15* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_15>();
	}
};
static_assert(alignof(UAddon_K28Power_15) == 0x000008, "Wrong alignment on UAddon_K28Power_15");
static_assert(sizeof(UAddon_K28Power_15) == 0x000310, "Wrong size on UAddon_K28Power_15");
static_assert(offsetof(UAddon_K28Power_15, _survivorImposedEffectClasses) == 0x0002F8, "Member 'UAddon_K28Power_15::_survivorImposedEffectClasses' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_15, _statusEffectTime) == 0x000308, "Member 'UAddon_K28Power_15::_statusEffectTime' has a wrong offset!");

// Class TheK28.Addon_K28Power_16
// 0x0000 (0x02F8 - 0x02F8)
class UAddon_K28Power_16 final : public UOnEventBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_16">();
	}
	static class UAddon_K28Power_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_16>();
	}
};
static_assert(alignof(UAddon_K28Power_16) == 0x000008, "Wrong alignment on UAddon_K28Power_16");
static_assert(sizeof(UAddon_K28Power_16) == 0x0002F8, "Wrong size on UAddon_K28Power_16");

// Class TheK28.Addon_K28Power_17
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K28Power_17 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorImposedEffectClass;                       // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _statusEffectDuration;                             // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnIntroComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_17">();
	}
	static class UAddon_K28Power_17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_17>();
	}
};
static_assert(alignof(UAddon_K28Power_17) == 0x000008, "Wrong alignment on UAddon_K28Power_17");
static_assert(sizeof(UAddon_K28Power_17) == 0x000308, "Wrong size on UAddon_K28Power_17");
static_assert(offsetof(UAddon_K28Power_17, _survivorImposedEffectClass) == 0x0002F8, "Member 'UAddon_K28Power_17::_survivorImposedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_17, _statusEffectDuration) == 0x000300, "Member 'UAddon_K28Power_17::_statusEffectDuration' has a wrong offset!");

// Class TheK28.Addon_K28Power_18
// 0x0038 (0x0330 - 0x02F8)
class UAddon_K28Power_18 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorImposedEffectClass;                       // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _survivorStatusEffectTime;                         // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _lockersToSlamRange;                               // 0x0304(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _montage;                                          // 0x0308(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_TriggerLockerAnimationOnAllLockers(const TArray<class ALocker*>& Lockers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_18">();
	}
	static class UAddon_K28Power_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_18>();
	}
};
static_assert(alignof(UAddon_K28Power_18) == 0x000008, "Wrong alignment on UAddon_K28Power_18");
static_assert(sizeof(UAddon_K28Power_18) == 0x000330, "Wrong size on UAddon_K28Power_18");
static_assert(offsetof(UAddon_K28Power_18, _survivorImposedEffectClass) == 0x0002F8, "Member 'UAddon_K28Power_18::_survivorImposedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_18, _survivorStatusEffectTime) == 0x000300, "Member 'UAddon_K28Power_18::_survivorStatusEffectTime' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_18, _lockersToSlamRange) == 0x000304, "Member 'UAddon_K28Power_18::_lockersToSlamRange' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_18, _montage) == 0x000308, "Member 'UAddon_K28Power_18::_montage' has a wrong offset!");

// Class TheK28.Addon_K28Power_19
// 0x0020 (0x0318 - 0x02F8)
class UAddon_K28Power_19 final : public UOnEventBaseAddon
{
public:
	uint8                                         Pad_2F8[0x10];                                     // 0x02F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _blockingRadius;                                   // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _blockDuration;                                    // 0x030C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_19">();
	}
	static class UAddon_K28Power_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_19>();
	}
};
static_assert(alignof(UAddon_K28Power_19) == 0x000008, "Wrong alignment on UAddon_K28Power_19");
static_assert(sizeof(UAddon_K28Power_19) == 0x000318, "Wrong size on UAddon_K28Power_19");
static_assert(offsetof(UAddon_K28Power_19, _blockingRadius) == 0x000308, "Member 'UAddon_K28Power_19::_blockingRadius' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_19, _blockDuration) == 0x00030C, "Member 'UAddon_K28Power_19::_blockDuration' has a wrong offset!");

// Class TheK28.Addon_K28Power_20
// 0x0090 (0x0378 - 0x02E8)
class UAddon_K28Power_20 final : public UItemAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorImposedEffectClass;                       // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _effectDuration;                                   // 0x02F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x84];                                     // 0x02F4(0x0084)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K28Power_20">();
	}
	static class UAddon_K28Power_20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K28Power_20>();
	}
};
static_assert(alignof(UAddon_K28Power_20) == 0x000008, "Wrong alignment on UAddon_K28Power_20");
static_assert(sizeof(UAddon_K28Power_20) == 0x000378, "Wrong size on UAddon_K28Power_20");
static_assert(offsetof(UAddon_K28Power_20, _survivorImposedEffectClass) == 0x0002E8, "Member 'UAddon_K28Power_20::_survivorImposedEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K28Power_20, _effectDuration) == 0x0002F0, "Member 'UAddon_K28Power_20::_effectDuration' has a wrong offset!");

// Class TheK28.AISkill_FindInteractable_Lockbar
// 0x0408 (0x0710 - 0x0308)
class UAISkill_FindInteractable_Lockbar final : public UAISkill_FindInteractable
{
public:
	float                                         LockerTopHeightDiffFromActorLocation;              // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITunableParameter                    LockbarMaxDistanceFromCamper;                      // 0x0310(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    LockbarMaxDistanceFromCamperTolerance;             // 0x0370(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinLockbarWeight;                                  // 0x03D0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxLockbarWeight;                                  // 0x0430(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    HighLockbarWeightLastSeconds;                      // 0x0490(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MinDistanceToReachMaxLockbarWeight;                // 0x04F0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxDistanceToReachMinLockbarWeight;                // 0x0550(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxDistanceToReachMinLockbarWeightIfNearGenerator; // 0x05B0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAITunableParameter                    MaxHeightDifferenceFromGenerator;                  // 0x0610(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_670[0xA0];                                     // 0x0670(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_Lockbar">();
	}
	static class UAISkill_FindInteractable_Lockbar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_Lockbar>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_Lockbar) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_Lockbar");
static_assert(sizeof(UAISkill_FindInteractable_Lockbar) == 0x000710, "Wrong size on UAISkill_FindInteractable_Lockbar");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, LockerTopHeightDiffFromActorLocation) == 0x000308, "Member 'UAISkill_FindInteractable_Lockbar::LockerTopHeightDiffFromActorLocation' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, LockbarMaxDistanceFromCamper) == 0x000310, "Member 'UAISkill_FindInteractable_Lockbar::LockbarMaxDistanceFromCamper' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, LockbarMaxDistanceFromCamperTolerance) == 0x000370, "Member 'UAISkill_FindInteractable_Lockbar::LockbarMaxDistanceFromCamperTolerance' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MinLockbarWeight) == 0x0003D0, "Member 'UAISkill_FindInteractable_Lockbar::MinLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MaxLockbarWeight) == 0x000430, "Member 'UAISkill_FindInteractable_Lockbar::MaxLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, HighLockbarWeightLastSeconds) == 0x000490, "Member 'UAISkill_FindInteractable_Lockbar::HighLockbarWeightLastSeconds' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MinDistanceToReachMaxLockbarWeight) == 0x0004F0, "Member 'UAISkill_FindInteractable_Lockbar::MinDistanceToReachMaxLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MaxDistanceToReachMinLockbarWeight) == 0x000550, "Member 'UAISkill_FindInteractable_Lockbar::MaxDistanceToReachMinLockbarWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MaxDistanceToReachMinLockbarWeightIfNearGenerator) == 0x0005B0, "Member 'UAISkill_FindInteractable_Lockbar::MaxDistanceToReachMinLockbarWeightIfNearGenerator' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_Lockbar, MaxHeightDifferenceFromGenerator) == 0x000610, "Member 'UAISkill_FindInteractable_Lockbar::MaxHeightDifferenceFromGenerator' has a wrong offset!");

// Class TheK28.BTService_FindObject_K28Remnant
// 0x0008 (0x0228 - 0x0220)
class UBTService_FindObject_K28Remnant final : public UBTService_FindObject
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTService_FindObject_K28Remnant">();
	}
	static class UBTService_FindObject_K28Remnant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_FindObject_K28Remnant>();
	}
};
static_assert(alignof(UBTService_FindObject_K28Remnant) == 0x000008, "Wrong alignment on UBTService_FindObject_K28Remnant");
static_assert(sizeof(UBTService_FindObject_K28Remnant) == 0x000228, "Wrong size on UBTService_FindObject_K28Remnant");

// Class TheK28.K28TeleportTarget
// 0x0000 (0x0030 - 0x0030)
class IK28TeleportTarget final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28TeleportTarget">();
	}
	static class IK28TeleportTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IK28TeleportTarget>();
	}
};
static_assert(alignof(IK28TeleportTarget) == 0x000008, "Wrong alignment on IK28TeleportTarget");
static_assert(sizeof(IK28TeleportTarget) == 0x000030, "Wrong size on IK28TeleportTarget");

// Class TheK28.IsInRangeOfK28UsedLocker
// 0x0030 (0x0118 - 0x00E8)
class UIsInRangeOfK28UsedLocker final : public URangeBasedCondition
{
public:
	uint8                                         Pad_E8[0x30];                                      // 0x00E8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IsInRangeOfK28UsedLocker">();
	}
	static class UIsInRangeOfK28UsedLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsInRangeOfK28UsedLocker>();
	}
};
static_assert(alignof(UIsInRangeOfK28UsedLocker) == 0x000008, "Wrong alignment on UIsInRangeOfK28UsedLocker");
static_assert(sizeof(UIsInRangeOfK28UsedLocker) == 0x000118, "Wrong size on UIsInRangeOfK28UsedLocker");

// Class TheK28.K28AnimInstance
// 0x0030 (0x0750 - 0x0720)
class UK28AnimInstance final : public UKillerAnimInstance
{
public:
	bool                                          _isInLocker;                                       // 0x0720(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInChase;                                        // 0x0721(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isChargingTeleportation;                          // 0x0722(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasTeleportationPowerCharged;                     // 0x0723(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasTeleportationBeenCancelled;                    // 0x0724(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hideHandsInFPV;                                   // 0x0725(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_726[0x2];                                      // 0x0726(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCustomizationAnimationSelector> _customizationAnimationSelectorClass;              // 0x0728(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizationAnimationSelector*        _customizationAnimationSelector;                   // 0x0730(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_738[0x18];                                     // 0x0738(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCustomizationAnimationMappingIDChanged(int32 AnimationMappingIndex);

	int32 GetAnimationMappingIndex() const;
	TArray<class FName> GetCustomAnimationTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28AnimInstance">();
	}
	static class UK28AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28AnimInstance>();
	}
};
static_assert(alignof(UK28AnimInstance) == 0x000010, "Wrong alignment on UK28AnimInstance");
static_assert(sizeof(UK28AnimInstance) == 0x000750, "Wrong size on UK28AnimInstance");
static_assert(offsetof(UK28AnimInstance, _isInLocker) == 0x000720, "Member 'UK28AnimInstance::_isInLocker' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _isInChase) == 0x000721, "Member 'UK28AnimInstance::_isInChase' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _isChargingTeleportation) == 0x000722, "Member 'UK28AnimInstance::_isChargingTeleportation' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _hasTeleportationPowerCharged) == 0x000723, "Member 'UK28AnimInstance::_hasTeleportationPowerCharged' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _hasTeleportationBeenCancelled) == 0x000724, "Member 'UK28AnimInstance::_hasTeleportationBeenCancelled' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _hideHandsInFPV) == 0x000725, "Member 'UK28AnimInstance::_hideHandsInFPV' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _customizationAnimationSelectorClass) == 0x000728, "Member 'UK28AnimInstance::_customizationAnimationSelectorClass' has a wrong offset!");
static_assert(offsetof(UK28AnimInstance, _customizationAnimationSelector) == 0x000730, "Member 'UK28AnimInstance::_customizationAnimationSelector' has a wrong offset!");

// Class TheK28.K28CheatComponent
// 0x0000 (0x00A8 - 0x00A8)
class UK28CheatComponent final : public UActorComponent
{
public:
	void DBD_K28BreakAllLocks();
	void DBD_K28DebugCosmetics(bool NoCooldown);
	void DBD_K28DisplayLockerClusters(float SecondsToDisplayDebugElements);
	void DBD_K28LockAllLockbars();
	void DBD_K28SetPowerNoCooldown(bool NoCooldown);
	void DBD_K28TriggerNextNightCycle();
	void DBD_K28UnlockAllLockbars();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28CheatComponent">();
	}
	static class UK28CheatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28CheatComponent>();
	}
};
static_assert(alignof(UK28CheatComponent) == 0x000008, "Wrong alignment on UK28CheatComponent");
static_assert(sizeof(UK28CheatComponent) == 0x0000A8, "Wrong size on UK28CheatComponent");

// Class TheK28.K28DayNightComponent
// 0x0580 (0x0628 - 0x00A8)
class UK28DayNightComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x48];                                      // 0x00A8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UK28KillerComponent>        _killerK28ComponentClass;                          // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK28SurvivorComponent>      _survivorK28ComponentClass;                        // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _chargesRequiredForNightCharge;                    // 0x0100(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _transitionToNightDuration;                        // 0x0128(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _transitiionToDayDuration;                         // 0x0150(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _chargesRequiredForNightDischarge;                 // 0x0178(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _killerInjuresSurvivorChargeAmount;                // 0x01F8(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _killerHookSurvivorChargeAmount;                   // 0x0278(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _killerTeleportsToRemnantChargeAmount;             // 0x02F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _defaultNightChargeTime;                           // 0x0320(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _injuredSurvivorsChargeTime;                       // 0x03A0(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _killerHidingInLockerChargeTime;                   // 0x0420(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _defaultNightTimeDischargeRate;                    // 0x04A0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _survivorInLockerDischargeRate;                    // 0x04C8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nighttimeNearingActivationThresholdPercent;       // 0x04F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nightCycleNearingEndThresholdPercent;             // 0x0518(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EK28NightCycleState                           _currentNightCycleState;                           // 0x0540(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_541[0x17];                                     // 0x0541(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _authority_numberInjuredSurvivors;                 // 0x0558(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxChargeAmount;                                  // 0x055C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _currentChargeAmount;                              // 0x0560(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_564[0x35];                                     // 0x0564(0x0035)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _nighttimeNearingActivationThresholdReached;       // 0x0599(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _hasReachedNightCycleNearEndThreshold;             // 0x059A(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59B[0x45];                                     // 0x059B(0x0045)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _killerIsAtNightfall;                              // 0x05E0(0x0048)(Net, Transient, NativeAccessSpecifierPrivate)

public:
	void Authority_OnIntroCompleted();
	void Authority_OnSurvivorDamageStateChanged(ECamperDamageState PreviousDamageState, ECamperDamageState NewDamageState);
	void Cosmetic_OnIsInLastTwentySecondsOfNightCycle(class UAkComponent* AkComponent);
	void Cosmetic_OnNightCycleChanged(class UAkComponent* AkComponent, EK28NightCycleState NewNightCycleState);
	void OnRep_CurrentDayNightCycle();
	void OnRep_HasReachedNightCycleNearEndThreshold();
	void OnRep_NighttimeNearingActivation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28DayNightComponent">();
	}
	static class UK28DayNightComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28DayNightComponent>();
	}
};
static_assert(alignof(UK28DayNightComponent) == 0x000008, "Wrong alignment on UK28DayNightComponent");
static_assert(sizeof(UK28DayNightComponent) == 0x000628, "Wrong size on UK28DayNightComponent");
static_assert(offsetof(UK28DayNightComponent, _killerK28ComponentClass) == 0x0000F0, "Member 'UK28DayNightComponent::_killerK28ComponentClass' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _survivorK28ComponentClass) == 0x0000F8, "Member 'UK28DayNightComponent::_survivorK28ComponentClass' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _chargesRequiredForNightCharge) == 0x000100, "Member 'UK28DayNightComponent::_chargesRequiredForNightCharge' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _transitionToNightDuration) == 0x000128, "Member 'UK28DayNightComponent::_transitionToNightDuration' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _transitiionToDayDuration) == 0x000150, "Member 'UK28DayNightComponent::_transitiionToDayDuration' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _chargesRequiredForNightDischarge) == 0x000178, "Member 'UK28DayNightComponent::_chargesRequiredForNightDischarge' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerInjuresSurvivorChargeAmount) == 0x0001F8, "Member 'UK28DayNightComponent::_killerInjuresSurvivorChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerHookSurvivorChargeAmount) == 0x000278, "Member 'UK28DayNightComponent::_killerHookSurvivorChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerTeleportsToRemnantChargeAmount) == 0x0002F8, "Member 'UK28DayNightComponent::_killerTeleportsToRemnantChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _defaultNightChargeTime) == 0x000320, "Member 'UK28DayNightComponent::_defaultNightChargeTime' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _injuredSurvivorsChargeTime) == 0x0003A0, "Member 'UK28DayNightComponent::_injuredSurvivorsChargeTime' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerHidingInLockerChargeTime) == 0x000420, "Member 'UK28DayNightComponent::_killerHidingInLockerChargeTime' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _defaultNightTimeDischargeRate) == 0x0004A0, "Member 'UK28DayNightComponent::_defaultNightTimeDischargeRate' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _survivorInLockerDischargeRate) == 0x0004C8, "Member 'UK28DayNightComponent::_survivorInLockerDischargeRate' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _nighttimeNearingActivationThresholdPercent) == 0x0004F0, "Member 'UK28DayNightComponent::_nighttimeNearingActivationThresholdPercent' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _nightCycleNearingEndThresholdPercent) == 0x000518, "Member 'UK28DayNightComponent::_nightCycleNearingEndThresholdPercent' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _currentNightCycleState) == 0x000540, "Member 'UK28DayNightComponent::_currentNightCycleState' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _authority_numberInjuredSurvivors) == 0x000558, "Member 'UK28DayNightComponent::_authority_numberInjuredSurvivors' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _maxChargeAmount) == 0x00055C, "Member 'UK28DayNightComponent::_maxChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _currentChargeAmount) == 0x000560, "Member 'UK28DayNightComponent::_currentChargeAmount' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _nighttimeNearingActivationThresholdReached) == 0x000599, "Member 'UK28DayNightComponent::_nighttimeNearingActivationThresholdReached' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _hasReachedNightCycleNearEndThreshold) == 0x00059A, "Member 'UK28DayNightComponent::_hasReachedNightCycleNearEndThreshold' has a wrong offset!");
static_assert(offsetof(UK28DayNightComponent, _killerIsAtNightfall) == 0x0005E0, "Member 'UK28DayNightComponent::_killerIsAtNightfall' has a wrong offset!");

// Class TheK28.K28FXInterface
// 0x0000 (0x0030 - 0x0030)
class IK28FXInterface final : public IInterface
{
public:
	void Cosmetic_OnChargeTeleportCancelled();
	void Cosmetic_OnChargeTeleportComplete();
	void Cosmetic_OnChargeTeleportStart();
	void Cosmetic_OnHideKiller();
	void Cosmetic_OnIsKillingSurvivorWithMoriStateChanged(bool IsKillingSurvivorWithMori);
	void Cosmetic_OnKillerEnterLocker();
	void Cosmetic_OnLocallyObservedChanged();
	void Cosmetic_OnLockerTeleportTargetHighlighted();
	void Cosmetic_OnShowKiller(bool IsInstantShow);
	void Cosmetic_OnTeleportationToLockerEnd();
	void Cosmetic_OnTeleportationToLockerStart(float TeleportationDuration, bool IsKillerAlreadyHidingInLocker);
	void Cosmetic_OnTeleportCooldownEnded();
	void Cosmetic_SetBlackMaterialOnKiller(bool blackMaterialApplied);
	void Cosmetic_SetDebugCosmetics(bool IsDebugCosmeticsActive);
	void Cosmetic_TriggerFadeIn();
	void Cosmetic_TriggerFadeOut();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28FXInterface">();
	}
	static class IK28FXInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IK28FXInterface>();
	}
};
static_assert(alignof(IK28FXInterface) == 0x000008, "Wrong alignment on IK28FXInterface");
static_assert(sizeof(IK28FXInterface) == 0x000030, "Wrong size on IK28FXInterface");

// Class TheK28.K28IsNightCycleState
// 0x0010 (0x00F0 - 0x00E0)
class UK28IsNightCycleState final : public UEventDrivenModifierCondition
{
public:
	EK28NightCycleState                           _nightCycleState;                                  // 0x00E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28IsNightCycleState">();
	}
	static class UK28IsNightCycleState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28IsNightCycleState>();
	}
};
static_assert(alignof(UK28IsNightCycleState) == 0x000008, "Wrong alignment on UK28IsNightCycleState");
static_assert(sizeof(UK28IsNightCycleState) == 0x0000F0, "Wrong size on UK28IsNightCycleState");
static_assert(offsetof(UK28IsNightCycleState, _nightCycleState) == 0x0000E0, "Member 'UK28IsNightCycleState::_nightCycleState' has a wrong offset!");

// Class TheK28.K28PlayerComponent
// 0x0108 (0x01B0 - 0x00A8)
class UK28PlayerComponent : public UActorComponent
{
public:
	TWeakObjectPtr<class UK28DayNightComponent>   _dayNightComponent;                                // 0x00A8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _nightEffectMinimumDistance;                       // 0x00B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _nightEffectMaximumDistance;                       // 0x00E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x60];                                     // 0x0108(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _stateTagsToDisableNightMode;                      // 0x0168(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x38];                                     // 0x0178(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_DayNightComponent();
	void OnSurvivorInRangeChanged(const bool InRange, class ACamperPlayer* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28PlayerComponent">();
	}
	static class UK28PlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28PlayerComponent>();
	}
};
static_assert(alignof(UK28PlayerComponent) == 0x000008, "Wrong alignment on UK28PlayerComponent");
static_assert(sizeof(UK28PlayerComponent) == 0x0001B0, "Wrong size on UK28PlayerComponent");
static_assert(offsetof(UK28PlayerComponent, _dayNightComponent) == 0x0000A8, "Member 'UK28PlayerComponent::_dayNightComponent' has a wrong offset!");
static_assert(offsetof(UK28PlayerComponent, _nightEffectMinimumDistance) == 0x0000B8, "Member 'UK28PlayerComponent::_nightEffectMinimumDistance' has a wrong offset!");
static_assert(offsetof(UK28PlayerComponent, _nightEffectMaximumDistance) == 0x0000E0, "Member 'UK28PlayerComponent::_nightEffectMaximumDistance' has a wrong offset!");
static_assert(offsetof(UK28PlayerComponent, _stateTagsToDisableNightMode) == 0x000168, "Member 'UK28PlayerComponent::_stateTagsToDisableNightMode' has a wrong offset!");

// Class TheK28.K28KillerComponent
// 0x0030 (0x01E0 - 0x01B0)
class UK28KillerComponent final : public UK28PlayerComponent
{
public:
	uint8                                         Pad_1B0[0x30];                                     // 0x01B0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnNightCycleStateChanged(class ASlasherPlayer* Killer, EK28NightCycleState DayNightCycleState, bool Instant);
	void Cosmetic_OnNighttimeNearingActivation(class ASlasherPlayer* Killer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerComponent">();
	}
	static class UK28KillerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerComponent>();
	}
};
static_assert(alignof(UK28KillerComponent) == 0x000008, "Wrong alignment on UK28KillerComponent");
static_assert(sizeof(UK28KillerComponent) == 0x0001E0, "Wrong size on UK28KillerComponent");

// Class TheK28.K28KillerEnterLockerInteraction
// 0x0030 (0x07E0 - 0x07B0)
class UK28KillerEnterLockerInteraction final : public UBaseLockerInteraction
{
public:
	float                                         _hideKillerTimePercentage;                         // 0x07A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7AC[0x34];                                     // 0x07AC(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsKillerAllowedToEnterLocker(const class ADBDPlayer* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerEnterLockerInteraction">();
	}
	static class UK28KillerEnterLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerEnterLockerInteraction>();
	}
};
static_assert(alignof(UK28KillerEnterLockerInteraction) == 0x000010, "Wrong alignment on UK28KillerEnterLockerInteraction");
static_assert(sizeof(UK28KillerEnterLockerInteraction) == 0x0007E0, "Wrong size on UK28KillerEnterLockerInteraction");
static_assert(offsetof(UK28KillerEnterLockerInteraction, _hideKillerTimePercentage) == 0x0007A8, "Member 'UK28KillerEnterLockerInteraction::_hideKillerTimePercentage' has a wrong offset!");

// Class TheK28.K28KillerExitLockerInteraction
// 0x00B0 (0x0860 - 0x07B0)
class UK28KillerExitLockerInteraction : public UBaseLockerInteraction
{
public:
	EK28ExitLockerCameraBehaviour                 _cameraBehaviour;                                  // 0x07A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _timeSearchLockerInteractionBlocked;               // 0x07B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _minDotProductFadeOutThreshold;                    // 0x07D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _rotationMaxTime;                                  // 0x07DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fadeOutTime;                                      // 0x07E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fovChangeTime;                                    // 0x07E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _fovChangeTeleportationCurve;                      // 0x07E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7F0[0x70];                                     // 0x07F0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerExitLockerInteraction">();
	}
	static class UK28KillerExitLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerExitLockerInteraction>();
	}
};
static_assert(alignof(UK28KillerExitLockerInteraction) == 0x000010, "Wrong alignment on UK28KillerExitLockerInteraction");
static_assert(sizeof(UK28KillerExitLockerInteraction) == 0x000860, "Wrong size on UK28KillerExitLockerInteraction");
static_assert(offsetof(UK28KillerExitLockerInteraction, _cameraBehaviour) == 0x0007A8, "Member 'UK28KillerExitLockerInteraction::_cameraBehaviour' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _timeSearchLockerInteractionBlocked) == 0x0007B0, "Member 'UK28KillerExitLockerInteraction::_timeSearchLockerInteractionBlocked' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _minDotProductFadeOutThreshold) == 0x0007D8, "Member 'UK28KillerExitLockerInteraction::_minDotProductFadeOutThreshold' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _rotationMaxTime) == 0x0007DC, "Member 'UK28KillerExitLockerInteraction::_rotationMaxTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _fadeOutTime) == 0x0007E0, "Member 'UK28KillerExitLockerInteraction::_fadeOutTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _fovChangeTime) == 0x0007E4, "Member 'UK28KillerExitLockerInteraction::_fovChangeTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerInteraction, _fovChangeTeleportationCurve) == 0x0007E8, "Member 'UK28KillerExitLockerInteraction::_fovChangeTeleportationCurve' has a wrong offset!");

// Class TheK28.K28KillerExitLockedLockerInteraction
// 0x0070 (0x08D0 - 0x0860)
class UK28KillerExitLockedLockerInteraction final : public UK28KillerExitLockerInteraction
{
public:
	float                                         _lockbarBreakTimePercentage;                       // 0x0860(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minInteractionTime;                               // 0x0864(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _exitInteractionTime;                              // 0x0868(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_890[0x40];                                     // 0x0890(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerExitLockedLockerInteraction">();
	}
	static class UK28KillerExitLockedLockerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerExitLockedLockerInteraction>();
	}
};
static_assert(alignof(UK28KillerExitLockedLockerInteraction) == 0x000010, "Wrong alignment on UK28KillerExitLockedLockerInteraction");
static_assert(sizeof(UK28KillerExitLockedLockerInteraction) == 0x0008D0, "Wrong size on UK28KillerExitLockedLockerInteraction");
static_assert(offsetof(UK28KillerExitLockedLockerInteraction, _lockbarBreakTimePercentage) == 0x000860, "Member 'UK28KillerExitLockedLockerInteraction::_lockbarBreakTimePercentage' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockedLockerInteraction, _minInteractionTime) == 0x000864, "Member 'UK28KillerExitLockedLockerInteraction::_minInteractionTime' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockedLockerInteraction, _exitInteractionTime) == 0x000868, "Member 'UK28KillerExitLockedLockerInteraction::_exitInteractionTime' has a wrong offset!");

// Class TheK28.K28KillerExitLockerWithSurvivorInteraction
// 0x00A0 (0x0900 - 0x0860)
class UK28KillerExitLockerWithSurvivorInteraction final : public UK28KillerExitLockerInteraction
{
public:
	float                                         _waitTimeBeforeSettingIntoCarryState;              // 0x0860(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_864[0xC];                                      // 0x0864(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationMontageDescriptor            _montageFromTeleportation;                         // 0x0870(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _montageFromAbduction;                             // 0x0890(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8B0[0x50];                                     // 0x08B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerExitLockerWithSurvivorInteraction">();
	}
	static class UK28KillerExitLockerWithSurvivorInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerExitLockerWithSurvivorInteraction>();
	}
};
static_assert(alignof(UK28KillerExitLockerWithSurvivorInteraction) == 0x000010, "Wrong alignment on UK28KillerExitLockerWithSurvivorInteraction");
static_assert(sizeof(UK28KillerExitLockerWithSurvivorInteraction) == 0x000900, "Wrong size on UK28KillerExitLockerWithSurvivorInteraction");
static_assert(offsetof(UK28KillerExitLockerWithSurvivorInteraction, _waitTimeBeforeSettingIntoCarryState) == 0x000860, "Member 'UK28KillerExitLockerWithSurvivorInteraction::_waitTimeBeforeSettingIntoCarryState' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerWithSurvivorInteraction, _montageFromTeleportation) == 0x000870, "Member 'UK28KillerExitLockerWithSurvivorInteraction::_montageFromTeleportation' has a wrong offset!");
static_assert(offsetof(UK28KillerExitLockerWithSurvivorInteraction, _montageFromAbduction) == 0x000890, "Member 'UK28KillerExitLockerWithSurvivorInteraction::_montageFromAbduction' has a wrong offset!");

// Class TheK28.K28KillerInstinctEffect
// 0x00D0 (0x0450 - 0x0380)
class UK28KillerInstinctEffect final : public UStatusEffect
{
public:
	struct FTunableStat                           _secondsToLinger;                                  // 0x0380(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maxDistanceToApplyRemnantTeleportKillerInstinct;  // 0x0400(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _lingeringEffectClass;                             // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _lingeringEffect;                                  // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x18];                                     // 0x0438(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnKillerInstinctApplicableChanged(bool Active);
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerInstinctEffect">();
	}
	static class UK28KillerInstinctEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerInstinctEffect>();
	}
};
static_assert(alignof(UK28KillerInstinctEffect) == 0x000008, "Wrong alignment on UK28KillerInstinctEffect");
static_assert(sizeof(UK28KillerInstinctEffect) == 0x000450, "Wrong size on UK28KillerInstinctEffect");
static_assert(offsetof(UK28KillerInstinctEffect, _secondsToLinger) == 0x000380, "Member 'UK28KillerInstinctEffect::_secondsToLinger' has a wrong offset!");
static_assert(offsetof(UK28KillerInstinctEffect, _maxDistanceToApplyRemnantTeleportKillerInstinct) == 0x000400, "Member 'UK28KillerInstinctEffect::_maxDistanceToApplyRemnantTeleportKillerInstinct' has a wrong offset!");
static_assert(offsetof(UK28KillerInstinctEffect, _lingeringEffectClass) == 0x000428, "Member 'UK28KillerInstinctEffect::_lingeringEffectClass' has a wrong offset!");
static_assert(offsetof(UK28KillerInstinctEffect, _lingeringEffect) == 0x000430, "Member 'UK28KillerInstinctEffect::_lingeringEffect' has a wrong offset!");

// Class TheK28.K28KillerLockerComponent
// 0x0198 (0x0240 - 0x00A8)
class UK28KillerLockerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _targetLockerFOV;                                  // 0x00C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _fovChangeTeleportationCurve;                      // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _fovChangeTime;                                    // 0x00F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FK28KillerLockerState                  _lockerState_replicated;                           // 0x00F8(0x0010)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0xE8];                                     // 0x0108(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AAnimationFollowerActor>    _extraArmsAnimationFollowerActorClass;             // 0x01F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AAnimationFollowerActor*                _extraArmsAnimationFollowerActor;                  // 0x01F8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0x8];                                      // 0x0200(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeBetweenAttemptTrigger;                        // 0x0208(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20C[0x34];                                     // 0x020C(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerInLockerChanged(class ADBDPlayer* PreviousPlayerInLocker, class ADBDPlayer* NewPlayerInLocker);
	void OnRep_LockerState_Replicated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerLockerComponent">();
	}
	static class UK28KillerLockerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerLockerComponent>();
	}
};
static_assert(alignof(UK28KillerLockerComponent) == 0x000008, "Wrong alignment on UK28KillerLockerComponent");
static_assert(sizeof(UK28KillerLockerComponent) == 0x000240, "Wrong size on UK28KillerLockerComponent");
static_assert(offsetof(UK28KillerLockerComponent, _targetLockerFOV) == 0x0000C0, "Member 'UK28KillerLockerComponent::_targetLockerFOV' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _fovChangeTeleportationCurve) == 0x0000E8, "Member 'UK28KillerLockerComponent::_fovChangeTeleportationCurve' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _fovChangeTime) == 0x0000F0, "Member 'UK28KillerLockerComponent::_fovChangeTime' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _lockerState_replicated) == 0x0000F8, "Member 'UK28KillerLockerComponent::_lockerState_replicated' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _extraArmsAnimationFollowerActorClass) == 0x0001F0, "Member 'UK28KillerLockerComponent::_extraArmsAnimationFollowerActorClass' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _extraArmsAnimationFollowerActor) == 0x0001F8, "Member 'UK28KillerLockerComponent::_extraArmsAnimationFollowerActor' has a wrong offset!");
static_assert(offsetof(UK28KillerLockerComponent, _timeBetweenAttemptTrigger) == 0x000208, "Member 'UK28KillerLockerComponent::_timeBetweenAttemptTrigger' has a wrong offset!");

// Class TheK28.K28KillerPlayerViewComponent
// 0x0028 (0x00D0 - 0x00A8)
class UK28KillerPlayerViewComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerPlayerViewComponent">();
	}
	static class UK28KillerPlayerViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerPlayerViewComponent>();
	}
};
static_assert(alignof(UK28KillerPlayerViewComponent) == 0x000008, "Wrong alignment on UK28KillerPlayerViewComponent");
static_assert(sizeof(UK28KillerPlayerViewComponent) == 0x0000D0, "Wrong size on UK28KillerPlayerViewComponent");

// Class TheK28.K28KillerTeleportationComponent
// 0x0288 (0x0330 - 0x00A8)
class UK28KillerTeleportationComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _teleportationSpeed_DayCycle;                      // 0x00C0(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _teleportationSpeed_NightCycle;                    // 0x0140(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _teleportationTimeForSurvivorGrab;                 // 0x0168(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _survivorPanicInLockerAnimationMontageDescriptor;  // 0x0190(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagStateBool                          _isTeleporting;                                    // 0x01C0(0x0048)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _defaultTeleportationCurve;                        // 0x0210(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _grabTeleportationCurve;                           // 0x0218(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x58];                                     // 0x0220(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UGeneratorOutlineUpdateStrategy*>  _generatorOutlineUpdateStrategies;                 // 0x0278(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x30];                                     // 0x02C8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _actorsHiddenDuringTeleport;                       // 0x02F8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_308[0x28];                                     // 0x0308(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Local_OnTeleportCollisionOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Local_OnTeleportCollisionOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Multicast_TeleportToLockerEnd(class UK28LockerComponent* LockerTeleportedTo, class ACamperPlayer* SurvivorInLocker);
	void Multicast_TeleportToLockerStart(const struct FK28SecondaryCameraMovementData& CameraMovementData, class UK28LockerComponent* LockerBeingTeleportedTo, class ACamperPlayer* SurvivorToGrab);
	void OnLevelReadyToPlay();
	void OnPlayerFinishedEnteringLocker(class ADBDPlayer* PlayerThatWasInLocker, class ADBDPlayer* PlayerNowInLocker);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K28KillerTeleportationComponent">();
	}
	static class UK28KillerTeleportationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK28KillerTeleportationComponent>();
	}
};
