#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK25

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "Projectile_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TheK25_structs.hpp"


namespace SDK::Params
{

// Function TheK25.K25Projectile.Cosmetic_OnProjectileDeactivated
// 0x0020 (0x0020 - 0x0000)
struct K25Projectile_Cosmetic_OnProjectileDeactivated final
{
public:
	struct FK25ProjectileDeactivationData         DeactivationData;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Projectile_Cosmetic_OnProjectileDeactivated) == 0x000008, "Wrong alignment on K25Projectile_Cosmetic_OnProjectileDeactivated");
static_assert(sizeof(K25Projectile_Cosmetic_OnProjectileDeactivated) == 0x000020, "Wrong size on K25Projectile_Cosmetic_OnProjectileDeactivated");
static_assert(offsetof(K25Projectile_Cosmetic_OnProjectileDeactivated, DeactivationData) == 0x000000, "Member 'K25Projectile_Cosmetic_OnProjectileDeactivated::DeactivationData' has a wrong offset!");

// Function TheK25.K25Projectile.OnProjectileStopped
// 0x00F0 (0x00F0 - 0x0000)
struct K25Projectile_OnProjectileStopped final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Projectile_OnProjectileStopped) == 0x000008, "Wrong alignment on K25Projectile_OnProjectileStopped");
static_assert(sizeof(K25Projectile_OnProjectileStopped) == 0x0000F0, "Wrong size on K25Projectile_OnProjectileStopped");
static_assert(offsetof(K25Projectile_OnProjectileStopped, Result) == 0x000000, "Member 'K25Projectile_OnProjectileStopped::Result' has a wrong offset!");

// Function TheK25.K25Projectile.Server_RequestDisableProjectile
// 0x0001 (0x0001 - 0x0000)
struct K25Projectile_Server_RequestDisableProjectile final
{
public:
	EK25ProjectileDeactivateReason                DeactivateReason;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Projectile_Server_RequestDisableProjectile) == 0x000001, "Wrong alignment on K25Projectile_Server_RequestDisableProjectile");
static_assert(sizeof(K25Projectile_Server_RequestDisableProjectile) == 0x000001, "Wrong size on K25Projectile_Server_RequestDisableProjectile");
static_assert(offsetof(K25Projectile_Server_RequestDisableProjectile, DeactivateReason) == 0x000000, "Member 'K25Projectile_Server_RequestDisableProjectile::DeactivateReason' has a wrong offset!");

// Function TheK25.K25Projectile.GetChainAttachmentLocation
// 0x0018 (0x0018 - 0x0000)
struct K25Projectile_GetChainAttachmentLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Projectile_GetChainAttachmentLocation) == 0x000008, "Wrong alignment on K25Projectile_GetChainAttachmentLocation");
static_assert(sizeof(K25Projectile_GetChainAttachmentLocation) == 0x000018, "Wrong size on K25Projectile_GetChainAttachmentLocation");
static_assert(offsetof(K25Projectile_GetChainAttachmentLocation, ReturnValue) == 0x000000, "Member 'K25Projectile_GetChainAttachmentLocation::ReturnValue' has a wrong offset!");

// Function TheK25.K25Projectile.GetMovementComponent
// 0x0008 (0x0008 - 0x0000)
struct K25Projectile_GetMovementComponent final
{
public:
	class UDBDProjectileMovementComponent*        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Projectile_GetMovementComponent) == 0x000008, "Wrong alignment on K25Projectile_GetMovementComponent");
static_assert(sizeof(K25Projectile_GetMovementComponent) == 0x000008, "Wrong size on K25Projectile_GetMovementComponent");
static_assert(offsetof(K25Projectile_GetMovementComponent, ReturnValue) == 0x000000, "Member 'K25Projectile_GetMovementComponent::ReturnValue' has a wrong offset!");

// Function TheK25.K25UncontrolledProjectile.Authority_OnDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct K25UncontrolledProjectile_Authority_OnDamageStateChanged final
{
public:
	ECamperDamageState                            OldDamageState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            CurrentDamageState;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25UncontrolledProjectile_Authority_OnDamageStateChanged) == 0x000001, "Wrong alignment on K25UncontrolledProjectile_Authority_OnDamageStateChanged");
static_assert(sizeof(K25UncontrolledProjectile_Authority_OnDamageStateChanged) == 0x000002, "Wrong size on K25UncontrolledProjectile_Authority_OnDamageStateChanged");
static_assert(offsetof(K25UncontrolledProjectile_Authority_OnDamageStateChanged, OldDamageState) == 0x000000, "Member 'K25UncontrolledProjectile_Authority_OnDamageStateChanged::OldDamageState' has a wrong offset!");
static_assert(offsetof(K25UncontrolledProjectile_Authority_OnDamageStateChanged, CurrentDamageState) == 0x000001, "Member 'K25UncontrolledProjectile_Authority_OnDamageStateChanged::CurrentDamageState' has a wrong offset!");

// Function TheK25.K25AttackSubAnimInstance.OnAttackStart
// 0x0001 (0x0001 - 0x0000)
struct K25AttackSubAnimInstance_OnAttackStart final
{
public:
	EAttackType                                   AttackType;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25AttackSubAnimInstance_OnAttackStart) == 0x000001, "Wrong alignment on K25AttackSubAnimInstance_OnAttackStart");
static_assert(sizeof(K25AttackSubAnimInstance_OnAttackStart) == 0x000001, "Wrong size on K25AttackSubAnimInstance_OnAttackStart");
static_assert(offsetof(K25AttackSubAnimInstance_OnAttackStart, AttackType) == 0x000000, "Member 'K25AttackSubAnimInstance_OnAttackStart::AttackType' has a wrong offset!");

// Function TheK25.K25ProjectileReplicationComponent.Multicast_DeactivateProjectile
// 0x0028 (0x0028 - 0x0000)
struct K25ProjectileReplicationComponent_Multicast_DeactivateProjectile final
{
public:
	class AK25Projectile*                         Projectile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FK25ProjectileDeactivationData         DeactivationData;                                  // 0x0008(0x0020)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ProjectileReplicationComponent_Multicast_DeactivateProjectile) == 0x000008, "Wrong alignment on K25ProjectileReplicationComponent_Multicast_DeactivateProjectile");
static_assert(sizeof(K25ProjectileReplicationComponent_Multicast_DeactivateProjectile) == 0x000028, "Wrong size on K25ProjectileReplicationComponent_Multicast_DeactivateProjectile");
static_assert(offsetof(K25ProjectileReplicationComponent_Multicast_DeactivateProjectile, Projectile) == 0x000000, "Member 'K25ProjectileReplicationComponent_Multicast_DeactivateProjectile::Projectile' has a wrong offset!");
static_assert(offsetof(K25ProjectileReplicationComponent_Multicast_DeactivateProjectile, DeactivationData) == 0x000008, "Member 'K25ProjectileReplicationComponent_Multicast_DeactivateProjectile::DeactivationData' has a wrong offset!");

// Function TheK25.K25ProjectileReplicationComponent.Multicast_SetAttachedChain
// 0x0048 (0x0048 - 0x0000)
struct K25ProjectileReplicationComponent_Multicast_SetAttachedChain final
{
public:
	class AK25Projectile*                         Projectile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25Chain*                              ChainToAttach;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLaunchInfo                            LaunchInfo;                                        // 0x0010(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ProjectileReplicationComponent_Multicast_SetAttachedChain) == 0x000008, "Wrong alignment on K25ProjectileReplicationComponent_Multicast_SetAttachedChain");
static_assert(sizeof(K25ProjectileReplicationComponent_Multicast_SetAttachedChain) == 0x000048, "Wrong size on K25ProjectileReplicationComponent_Multicast_SetAttachedChain");
static_assert(offsetof(K25ProjectileReplicationComponent_Multicast_SetAttachedChain, Projectile) == 0x000000, "Member 'K25ProjectileReplicationComponent_Multicast_SetAttachedChain::Projectile' has a wrong offset!");
static_assert(offsetof(K25ProjectileReplicationComponent_Multicast_SetAttachedChain, ChainToAttach) == 0x000008, "Member 'K25ProjectileReplicationComponent_Multicast_SetAttachedChain::ChainToAttach' has a wrong offset!");
static_assert(offsetof(K25ProjectileReplicationComponent_Multicast_SetAttachedChain, LaunchInfo) == 0x000010, "Member 'K25ProjectileReplicationComponent_Multicast_SetAttachedChain::LaunchInfo' has a wrong offset!");

// Function TheK25.K25UncontrolledProjectileReplicationComponent.Multicast_LaunchProjectile
// 0x0040 (0x0040 - 0x0000)
struct K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile final
{
public:
	class AK25UncontrolledProjectile*             Projectile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLaunchInfo                            LaunchInfo;                                        // 0x0008(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile) == 0x000008, "Wrong alignment on K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile");
static_assert(sizeof(K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile) == 0x000040, "Wrong size on K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile");
static_assert(offsetof(K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile, Projectile) == 0x000000, "Member 'K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile::Projectile' has a wrong offset!");
static_assert(offsetof(K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile, LaunchInfo) == 0x000008, "Member 'K25UncontrolledProjectileReplicationComponent_Multicast_LaunchProjectile::LaunchInfo' has a wrong offset!");

// Function TheK25.K25Utilities.GetK25ControlledProjectile
// 0x0010 (0x0010 - 0x0000)
struct K25Utilities_GetK25ControlledProjectile final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25ControlledProjectile*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Utilities_GetK25ControlledProjectile) == 0x000008, "Wrong alignment on K25Utilities_GetK25ControlledProjectile");
static_assert(sizeof(K25Utilities_GetK25ControlledProjectile) == 0x000010, "Wrong size on K25Utilities_GetK25ControlledProjectile");
static_assert(offsetof(K25Utilities_GetK25ControlledProjectile, WorldContextObject) == 0x000000, "Member 'K25Utilities_GetK25ControlledProjectile::WorldContextObject' has a wrong offset!");
static_assert(offsetof(K25Utilities_GetK25ControlledProjectile, ReturnValue) == 0x000008, "Member 'K25Utilities_GetK25ControlledProjectile::ReturnValue' has a wrong offset!");

// Function TheK25.K25Utilities.GetK25Gateway
// 0x0010 (0x0010 - 0x0000)
struct K25Utilities_GetK25Gateway final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25Gateway*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Utilities_GetK25Gateway) == 0x000008, "Wrong alignment on K25Utilities_GetK25Gateway");
static_assert(sizeof(K25Utilities_GetK25Gateway) == 0x000010, "Wrong size on K25Utilities_GetK25Gateway");
static_assert(offsetof(K25Utilities_GetK25Gateway, WorldContextObject) == 0x000000, "Member 'K25Utilities_GetK25Gateway::WorldContextObject' has a wrong offset!");
static_assert(offsetof(K25Utilities_GetK25Gateway, ReturnValue) == 0x000008, "Member 'K25Utilities_GetK25Gateway::ReturnValue' has a wrong offset!");

// Function TheK25.K25Utilities.GetK25Husk
// 0x0010 (0x0010 - 0x0000)
struct K25Utilities_GetK25Husk final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25Husk*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Utilities_GetK25Husk) == 0x000008, "Wrong alignment on K25Utilities_GetK25Husk");
static_assert(sizeof(K25Utilities_GetK25Husk) == 0x000010, "Wrong size on K25Utilities_GetK25Husk");
static_assert(offsetof(K25Utilities_GetK25Husk, WorldContextObject) == 0x000000, "Member 'K25Utilities_GetK25Husk::WorldContextObject' has a wrong offset!");
static_assert(offsetof(K25Utilities_GetK25Husk, ReturnValue) == 0x000008, "Member 'K25Utilities_GetK25Husk::ReturnValue' has a wrong offset!");

// Function TheK25.K25Utilities.GetK25Power
// 0x0010 (0x0010 - 0x0000)
struct K25Utilities_GetK25Power final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25Power*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Utilities_GetK25Power) == 0x000008, "Wrong alignment on K25Utilities_GetK25Power");
static_assert(sizeof(K25Utilities_GetK25Power) == 0x000010, "Wrong size on K25Utilities_GetK25Power");
static_assert(offsetof(K25Utilities_GetK25Power, WorldContextObject) == 0x000000, "Member 'K25Utilities_GetK25Power::WorldContextObject' has a wrong offset!");
static_assert(offsetof(K25Utilities_GetK25Power, ReturnValue) == 0x000008, "Member 'K25Utilities_GetK25Power::ReturnValue' has a wrong offset!");

// Function TheK25.K25Utilities.GetLamentConfiguration
// 0x0010 (0x0010 - 0x0000)
struct K25Utilities_GetLamentConfiguration final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALamentConfiguration*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Utilities_GetLamentConfiguration) == 0x000008, "Wrong alignment on K25Utilities_GetLamentConfiguration");
static_assert(sizeof(K25Utilities_GetLamentConfiguration) == 0x000010, "Wrong size on K25Utilities_GetLamentConfiguration");
static_assert(offsetof(K25Utilities_GetLamentConfiguration, WorldContextObject) == 0x000000, "Member 'K25Utilities_GetLamentConfiguration::WorldContextObject' has a wrong offset!");
static_assert(offsetof(K25Utilities_GetLamentConfiguration, ReturnValue) == 0x000008, "Member 'K25Utilities_GetLamentConfiguration::ReturnValue' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnEndGameOver
// 0x0040 (0x0040 - 0x0000)
struct LamentConfiguration_Authority_OnEndGameOver final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnEndGameOver) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnEndGameOver");
static_assert(sizeof(LamentConfiguration_Authority_OnEndGameOver) == 0x000040, "Wrong size on LamentConfiguration_Authority_OnEndGameOver");
static_assert(offsetof(LamentConfiguration_Authority_OnEndGameOver, GameEventType) == 0x000000, "Member 'LamentConfiguration_Authority_OnEndGameOver::GameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnEndGameOver, GameEventData) == 0x000010, "Member 'LamentConfiguration_Authority_OnEndGameOver::GameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnGameEnded
// 0x0040 (0x0040 - 0x0000)
struct LamentConfiguration_Authority_OnGameEnded final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnGameEnded) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnGameEnded");
static_assert(sizeof(LamentConfiguration_Authority_OnGameEnded) == 0x000040, "Wrong size on LamentConfiguration_Authority_OnGameEnded");
static_assert(offsetof(LamentConfiguration_Authority_OnGameEnded, GameEventType) == 0x000000, "Member 'LamentConfiguration_Authority_OnGameEnded::GameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnGameEnded, GameEventData) == 0x000010, "Member 'LamentConfiguration_Authority_OnGameEnded::GameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnOverlapBegin
// 0x0110 (0x0110 - 0x0000)
struct LamentConfiguration_Authority_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnOverlapBegin) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnOverlapBegin");
static_assert(sizeof(LamentConfiguration_Authority_OnOverlapBegin) == 0x000110, "Wrong size on LamentConfiguration_Authority_OnOverlapBegin");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, OverlappedComponent) == 0x000000, "Member 'LamentConfiguration_Authority_OnOverlapBegin::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, Other) == 0x000008, "Member 'LamentConfiguration_Authority_OnOverlapBegin::Other' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, OtherComp) == 0x000010, "Member 'LamentConfiguration_Authority_OnOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'LamentConfiguration_Authority_OnOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, bFromSweep) == 0x00001C, "Member 'LamentConfiguration_Authority_OnOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapBegin, SweepResult) == 0x000020, "Member 'LamentConfiguration_Authority_OnOverlapBegin::SweepResult' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct LamentConfiguration_Authority_OnOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LamentConfiguration_Authority_OnOverlapEnd) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnOverlapEnd");
static_assert(sizeof(LamentConfiguration_Authority_OnOverlapEnd) == 0x000020, "Wrong size on LamentConfiguration_Authority_OnOverlapEnd");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, OverlappedComponent) == 0x000000, "Member 'LamentConfiguration_Authority_OnOverlapEnd::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, OtherActor) == 0x000008, "Member 'LamentConfiguration_Authority_OnOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, OtherComp) == 0x000010, "Member 'LamentConfiguration_Authority_OnOverlapEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'LamentConfiguration_Authority_OnOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_OnSurvivorHitByControlledProjectile
// 0x0040 (0x0040 - 0x0000)
struct LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile) == 0x000008, "Wrong alignment on LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile");
static_assert(sizeof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile) == 0x000040, "Wrong size on LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile");
static_assert(offsetof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile, GameEventType) == 0x000000, "Member 'LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile::GameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile, GameEventData) == 0x000010, "Member 'LamentConfiguration_Authority_OnSurvivorHitByControlledProjectile::GameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.Authority_RespawnLamentConfiguration
// 0x0001 (0x0001 - 0x0000)
struct LamentConfiguration_Authority_RespawnLamentConfiguration final
{
public:
	bool                                          TriggerChainHuntUponSpawning;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Authority_RespawnLamentConfiguration) == 0x000001, "Wrong alignment on LamentConfiguration_Authority_RespawnLamentConfiguration");
static_assert(sizeof(LamentConfiguration_Authority_RespawnLamentConfiguration) == 0x000001, "Wrong size on LamentConfiguration_Authority_RespawnLamentConfiguration");
static_assert(offsetof(LamentConfiguration_Authority_RespawnLamentConfiguration, TriggerChainHuntUponSpawning) == 0x000000, "Member 'LamentConfiguration_Authority_RespawnLamentConfiguration::TriggerChainHuntUponSpawning' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_EndSolvingCube
// 0x0001 (0x0001 - 0x0000)
struct LamentConfiguration_Cosmetic_EndSolvingCube final
{
public:
	bool                                          HasBeenSolved;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_EndSolvingCube) == 0x000001, "Wrong alignment on LamentConfiguration_Cosmetic_EndSolvingCube");
static_assert(sizeof(LamentConfiguration_Cosmetic_EndSolvingCube) == 0x000001, "Wrong size on LamentConfiguration_Cosmetic_EndSolvingCube");
static_assert(offsetof(LamentConfiguration_Cosmetic_EndSolvingCube, HasBeenSolved) == 0x000000, "Member 'LamentConfiguration_Cosmetic_EndSolvingCube::HasBeenSolved' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnChainHuntChargeStart
// 0x0004 (0x0004 - 0x0000)
struct LamentConfiguration_Cosmetic_OnChainHuntChargeStart final
{
public:
	float                                         ChargeTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnChainHuntChargeStart) == 0x000004, "Wrong alignment on LamentConfiguration_Cosmetic_OnChainHuntChargeStart");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnChainHuntChargeStart) == 0x000004, "Wrong size on LamentConfiguration_Cosmetic_OnChainHuntChargeStart");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnChainHuntChargeStart, ChargeTime) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnChainHuntChargeStart::ChargeTime' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnHoldingSurvivorHostageEnd
// 0x0001 (0x0001 - 0x0000)
struct LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd final
{
public:
	bool                                          HasEndedThroughKillerAttack;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd) == 0x000001, "Wrong alignment on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd) == 0x000001, "Wrong size on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd, HasEndedThroughKillerAttack) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageEnd::HasEndedThroughKillerAttack' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnHoldingSurvivorHostageStart
// 0x0004 (0x0004 - 0x0000)
struct LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart final
{
public:
	float                                         HostageDuration;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart) == 0x000004, "Wrong alignment on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart) == 0x000004, "Wrong size on LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart, HostageDuration) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnHoldingSurvivorHostageStart::HostageDuration' has a wrong offset!");

// Function TheK25.LamentConfiguration.Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration
// 0x0010 (0x0010 - 0x0000)
struct LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration final
{
public:
	class ASlasherPlayer*                         Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACamperPlayer*                          SurvivorDowned;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration) == 0x000008, "Wrong alignment on LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration");
static_assert(sizeof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration) == 0x000010, "Wrong size on LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration, Killer) == 0x000000, "Member 'LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration::Killer' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration, SurvivorDowned) == 0x000008, "Member 'LamentConfiguration_Cosmetic_OnKillerDownedSurvivorHoldingLamentConfiguration::SurvivorDowned' has a wrong offset!");

// Function TheK25.LamentConfiguration.Multicast_CorrectLamentConfigurationPosition
// 0x0018 (0x0018 - 0x0000)
struct LamentConfiguration_Multicast_CorrectLamentConfigurationPosition final
{
public:
	struct FVector                                NewPosition;                                       // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Multicast_CorrectLamentConfigurationPosition) == 0x000008, "Wrong alignment on LamentConfiguration_Multicast_CorrectLamentConfigurationPosition");
static_assert(sizeof(LamentConfiguration_Multicast_CorrectLamentConfigurationPosition) == 0x000018, "Wrong size on LamentConfiguration_Multicast_CorrectLamentConfigurationPosition");
static_assert(offsetof(LamentConfiguration_Multicast_CorrectLamentConfigurationPosition, NewPosition) == 0x000000, "Member 'LamentConfiguration_Multicast_CorrectLamentConfigurationPosition::NewPosition' has a wrong offset!");

// Function TheK25.LamentConfiguration.Multicast_DownedSurvivorHoldingLamentConfiguration
// 0x0008 (0x0008 - 0x0000)
struct LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration final
{
public:
	class ACamperPlayer*                          Survivor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration) == 0x000008, "Wrong alignment on LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration");
static_assert(sizeof(LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration) == 0x000008, "Wrong size on LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration");
static_assert(offsetof(LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration, Survivor) == 0x000000, "Member 'LamentConfiguration_Multicast_DownedSurvivorHoldingLamentConfiguration::Survivor' has a wrong offset!");

// Function TheK25.LamentConfiguration.Multicast_TriggerKillerPickUpSFX
// 0x0010 (0x0010 - 0x0000)
struct LamentConfiguration_Multicast_TriggerKillerPickUpSFX final
{
public:
	TArray<class ACamperPlayer*>                  AffectedSurvivors;                                 // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_Multicast_TriggerKillerPickUpSFX) == 0x000008, "Wrong alignment on LamentConfiguration_Multicast_TriggerKillerPickUpSFX");
static_assert(sizeof(LamentConfiguration_Multicast_TriggerKillerPickUpSFX) == 0x000010, "Wrong size on LamentConfiguration_Multicast_TriggerKillerPickUpSFX");
static_assert(offsetof(LamentConfiguration_Multicast_TriggerKillerPickUpSFX, AffectedSurvivors) == 0x000000, "Member 'LamentConfiguration_Multicast_TriggerKillerPickUpSFX::AffectedSurvivors' has a wrong offset!");

// Function TheK25.LamentConfiguration.OnCamperEscaped
// 0x0040 (0x0040 - 0x0000)
struct LamentConfiguration_OnCamperEscaped final
{
public:
	struct FGameplayTag                           GameEventType;                                     // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameEventData                         GameEventData;                                     // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_OnCamperEscaped) == 0x000008, "Wrong alignment on LamentConfiguration_OnCamperEscaped");
static_assert(sizeof(LamentConfiguration_OnCamperEscaped) == 0x000040, "Wrong size on LamentConfiguration_OnCamperEscaped");
static_assert(offsetof(LamentConfiguration_OnCamperEscaped, GameEventType) == 0x000000, "Member 'LamentConfiguration_OnCamperEscaped::GameEventType' has a wrong offset!");
static_assert(offsetof(LamentConfiguration_OnCamperEscaped, GameEventData) == 0x000010, "Member 'LamentConfiguration_OnCamperEscaped::GameEventData' has a wrong offset!");

// Function TheK25.LamentConfiguration.OnRep_SurvivorHeldHostage
// 0x0008 (0x0008 - 0x0000)
struct LamentConfiguration_OnRep_SurvivorHeldHostage final
{
public:
	class ACamperPlayer*                          OldSurvivorHeldHostage;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_OnRep_SurvivorHeldHostage) == 0x000008, "Wrong alignment on LamentConfiguration_OnRep_SurvivorHeldHostage");
static_assert(sizeof(LamentConfiguration_OnRep_SurvivorHeldHostage) == 0x000008, "Wrong size on LamentConfiguration_OnRep_SurvivorHeldHostage");
static_assert(offsetof(LamentConfiguration_OnRep_SurvivorHeldHostage, OldSurvivorHeldHostage) == 0x000000, "Member 'LamentConfiguration_OnRep_SurvivorHeldHostage::OldSurvivorHeldHostage' has a wrong offset!");

// Function TheK25.LamentConfiguration.TriggerKillerPickUpSFX
// 0x0010 (0x0010 - 0x0000)
struct LamentConfiguration_TriggerKillerPickUpSFX final
{
public:
	TArray<class ACamperPlayer*>                  AffectedSurvivors;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_TriggerKillerPickUpSFX) == 0x000008, "Wrong alignment on LamentConfiguration_TriggerKillerPickUpSFX");
static_assert(sizeof(LamentConfiguration_TriggerKillerPickUpSFX) == 0x000010, "Wrong size on LamentConfiguration_TriggerKillerPickUpSFX");
static_assert(offsetof(LamentConfiguration_TriggerKillerPickUpSFX, AffectedSurvivors) == 0x000000, "Member 'LamentConfiguration_TriggerKillerPickUpSFX::AffectedSurvivors' has a wrong offset!");

// Function TheK25.LamentConfiguration.GetChainHuntProgressPercentage
// 0x0004 (0x0004 - 0x0000)
struct LamentConfiguration_GetChainHuntProgressPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfiguration_GetChainHuntProgressPercentage) == 0x000004, "Wrong alignment on LamentConfiguration_GetChainHuntProgressPercentage");
static_assert(sizeof(LamentConfiguration_GetChainHuntProgressPercentage) == 0x000004, "Wrong size on LamentConfiguration_GetChainHuntProgressPercentage");
static_assert(offsetof(LamentConfiguration_GetChainHuntProgressPercentage, ReturnValue) == 0x000000, "Member 'LamentConfiguration_GetChainHuntProgressPercentage::ReturnValue' has a wrong offset!");

// Function TheK25.ChainAttachedGateBlockerEffect.OnSurvivorDamageStateChanged
// 0x0002 (0x0002 - 0x0000)
struct ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged final
{
public:
	ECamperDamageState                            OldState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECamperDamageState                            NewState;                                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged) == 0x000001, "Wrong alignment on ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged");
static_assert(sizeof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged) == 0x000002, "Wrong size on ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged");
static_assert(offsetof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged, OldState) == 0x000000, "Member 'ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged, NewState) == 0x000001, "Member 'ChainAttachedGateBlockerEffect_OnSurvivorDamageStateChanged::NewState' has a wrong offset!");

// Function TheK25.LamentConfigurationChainHuntComponent.GetChainHuntProgressPercentage
// 0x0004 (0x0004 - 0x0000)
struct LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage) == 0x000004, "Wrong alignment on LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage");
static_assert(sizeof(LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage) == 0x000004, "Wrong size on LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage");
static_assert(offsetof(LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage, ReturnValue) == 0x000000, "Member 'LamentConfigurationChainHuntComponent_GetChainHuntProgressPercentage::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.Cosmetic_OnChainAttachedToSurvivor
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_Cosmetic_OnChainAttachedToSurvivor final
{
public:
	bool                                          WasReachingSurvivorAnchorPoint;                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_Cosmetic_OnChainAttachedToSurvivor) == 0x000001, "Wrong alignment on K25Chain_Cosmetic_OnChainAttachedToSurvivor");
static_assert(sizeof(K25Chain_Cosmetic_OnChainAttachedToSurvivor) == 0x000001, "Wrong size on K25Chain_Cosmetic_OnChainAttachedToSurvivor");
static_assert(offsetof(K25Chain_Cosmetic_OnChainAttachedToSurvivor, WasReachingSurvivorAnchorPoint) == 0x000000, "Member 'K25Chain_Cosmetic_OnChainAttachedToSurvivor::WasReachingSurvivorAnchorPoint' has a wrong offset!");

// Function TheK25.K25Chain.Cosmetic_OnChainDetachedFromSurvivor
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_Cosmetic_OnChainDetachedFromSurvivor final
{
public:
	EK25ChainDetachmentReason                     DetachmentReason;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_Cosmetic_OnChainDetachedFromSurvivor) == 0x000001, "Wrong alignment on K25Chain_Cosmetic_OnChainDetachedFromSurvivor");
static_assert(sizeof(K25Chain_Cosmetic_OnChainDetachedFromSurvivor) == 0x000001, "Wrong size on K25Chain_Cosmetic_OnChainDetachedFromSurvivor");
static_assert(offsetof(K25Chain_Cosmetic_OnChainDetachedFromSurvivor, DetachmentReason) == 0x000000, "Member 'K25Chain_Cosmetic_OnChainDetachedFromSurvivor::DetachmentReason' has a wrong offset!");

// Function TheK25.K25Chain.Cosmetic_OnSurvivorStoppedRemovingChainSFX
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX final
{
public:
	bool                                          HasRemovedChainDueToInteraction;                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX) == 0x000001, "Wrong alignment on K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX");
static_assert(sizeof(K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX) == 0x000001, "Wrong size on K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX");
static_assert(offsetof(K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX, HasRemovedChainDueToInteraction) == 0x000000, "Member 'K25Chain_Cosmetic_OnSurvivorStoppedRemovingChainSFX::HasRemovedChainDueToInteraction' has a wrong offset!");

// Function TheK25.K25Chain.SetInstancedMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct K25Chain_SetInstancedMeshComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedMesh;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_SetInstancedMeshComponent) == 0x000008, "Wrong alignment on K25Chain_SetInstancedMeshComponent");
static_assert(sizeof(K25Chain_SetInstancedMeshComponent) == 0x000008, "Wrong size on K25Chain_SetInstancedMeshComponent");
static_assert(offsetof(K25Chain_SetInstancedMeshComponent, InstancedMesh) == 0x000000, "Member 'K25Chain_SetInstancedMeshComponent::InstancedMesh' has a wrong offset!");

// Function TheK25.K25Chain.SetSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct K25Chain_SetSplineComponent final
{
public:
	class USplineComponent*                       Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_SetSplineComponent) == 0x000008, "Wrong alignment on K25Chain_SetSplineComponent");
static_assert(sizeof(K25Chain_SetSplineComponent) == 0x000008, "Wrong size on K25Chain_SetSplineComponent");
static_assert(offsetof(K25Chain_SetSplineComponent, Component) == 0x000000, "Member 'K25Chain_SetSplineComponent::Component' has a wrong offset!");

// Function TheK25.K25Chain.GetChainEndLocation
// 0x0018 (0x0018 - 0x0000)
struct K25Chain_GetChainEndLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_GetChainEndLocation) == 0x000008, "Wrong alignment on K25Chain_GetChainEndLocation");
static_assert(sizeof(K25Chain_GetChainEndLocation) == 0x000018, "Wrong size on K25Chain_GetChainEndLocation");
static_assert(offsetof(K25Chain_GetChainEndLocation, ReturnValue) == 0x000000, "Member 'K25Chain_GetChainEndLocation::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.GetChainStartLocation
// 0x0018 (0x0018 - 0x0000)
struct K25Chain_GetChainStartLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_GetChainStartLocation) == 0x000008, "Wrong alignment on K25Chain_GetChainStartLocation");
static_assert(sizeof(K25Chain_GetChainStartLocation) == 0x000018, "Wrong size on K25Chain_GetChainStartLocation");
static_assert(offsetof(K25Chain_GetChainStartLocation, ReturnValue) == 0x000000, "Member 'K25Chain_GetChainStartLocation::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.GetSurvivorChainAttachmentAnchor
// 0x0008 (0x0008 - 0x0000)
struct K25Chain_GetSurvivorChainAttachmentAnchor final
{
public:
	class AK25SurvivorChainAttachmentAnchor*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_GetSurvivorChainAttachmentAnchor) == 0x000008, "Wrong alignment on K25Chain_GetSurvivorChainAttachmentAnchor");
static_assert(sizeof(K25Chain_GetSurvivorChainAttachmentAnchor) == 0x000008, "Wrong size on K25Chain_GetSurvivorChainAttachmentAnchor");
static_assert(offsetof(K25Chain_GetSurvivorChainAttachmentAnchor, ReturnValue) == 0x000000, "Member 'K25Chain_GetSurvivorChainAttachmentAnchor::ReturnValue' has a wrong offset!");

// Function TheK25.K25Chain.IsAttachedToControlledProjectile
// 0x0001 (0x0001 - 0x0000)
struct K25Chain_IsAttachedToControlledProjectile final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25Chain_IsAttachedToControlledProjectile) == 0x000001, "Wrong alignment on K25Chain_IsAttachedToControlledProjectile");
static_assert(sizeof(K25Chain_IsAttachedToControlledProjectile) == 0x000001, "Wrong size on K25Chain_IsAttachedToControlledProjectile");
static_assert(offsetof(K25Chain_IsAttachedToControlledProjectile, ReturnValue) == 0x000000, "Member 'K25Chain_IsAttachedToControlledProjectile::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_AttachChainToAnchor
// 0x0018 (0x0018 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor final
{
public:
	class UK25SurvivorChainAttachmentComponent*   ChainAttachementComponent;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25Chain*                              ChainToAttach;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25SurvivorChainAttachmentAnchor*      AnchorPoint;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor) == 0x000018, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor, ChainAttachementComponent) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor::ChainAttachementComponent' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor, ChainToAttach) == 0x000008, "Member 'K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor::ChainToAttach' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor, AnchorPoint) == 0x000010, "Member 'K25ChainAttachmentReplicationComponent_Multicast_AttachChainToAnchor::AnchorPoint' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_DetachChains
// 0x0030 (0x0030 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_DetachChains final
{
public:
	class UK25SurvivorChainAttachmentComponent*   ChainAttachementComponent;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AK25Chain*>                      ChainsToDetach;                                    // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EK25ChainDetachmentReason                     DetachmentReason;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AK25Chain*>                      ChainsAttached;                                    // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_DetachChains");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains) == 0x000030, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_DetachChains");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, ChainAttachementComponent) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::ChainAttachementComponent' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, ChainsToDetach) == 0x000008, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::ChainsToDetach' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, DetachmentReason) == 0x000018, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::DetachmentReason' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_DetachChains, ChainsAttached) == 0x000020, "Member 'K25ChainAttachmentReplicationComponent_Multicast_DetachChains::ChainsAttached' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_LaunchInstantHitChainTowardsSurvivor
// 0x0028 (0x0028 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor final
{
public:
	class AK25Chain*                              NewChainToAttach;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AK25SurvivorChainAttachmentAnchor*      TargetAnchor;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartPosition;                                     // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor) == 0x000028, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor, NewChainToAttach) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor::NewChainToAttach' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor, TargetAnchor) == 0x000008, "Member 'K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor::TargetAnchor' has a wrong offset!");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor, StartPosition) == 0x000010, "Member 'K25ChainAttachmentReplicationComponent_Multicast_LaunchInstantHitChainTowardsSurvivor::StartPosition' has a wrong offset!");

// Function TheK25.K25ChainAttachmentReplicationComponent.Multicast_StartChainReelback
// 0x0008 (0x0008 - 0x0000)
struct K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback final
{
public:
	class AK25Chain*                              ChainToAttach;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback) == 0x000008, "Wrong alignment on K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback");
static_assert(sizeof(K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback) == 0x000008, "Wrong size on K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback");
static_assert(offsetof(K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback, ChainToAttach) == 0x000000, "Member 'K25ChainAttachmentReplicationComponent_Multicast_StartChainReelback::ChainToAttach' has a wrong offset!");

// Function TheK25.K25ChainHuntEffectsComponent.Cosmetic_ActivateChainHuntEffects
// 0x0001 (0x0001 - 0x0000)
struct K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects final
{
public:
	bool                                          HasChainHuntStarted;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects) == 0x000001, "Wrong alignment on K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects");
static_assert(sizeof(K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects) == 0x000001, "Wrong size on K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects");
static_assert(offsetof(K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects, HasChainHuntStarted) == 0x000000, "Member 'K25ChainHuntEffectsComponent_Cosmetic_ActivateChainHuntEffects::HasChainHuntStarted' has a wrong offset!");

// Function TheK25.K25ChainHuntEffectsComponent.GetOwningPlayer
// 0x0008 (0x0008 - 0x0000)
struct K25ChainHuntEffectsComponent_GetOwningPlayer final
{
public:
	class ADBDPlayer*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(K25ChainHuntEffectsComponent_GetOwningPlayer) == 0x000008, "Wrong alignment on K25ChainHuntEffectsComponent_GetOwningPlayer");
static_assert(sizeof(K25ChainHuntEffectsComponent_GetOwningPlayer) == 0x000008, "Wrong size on K25ChainHuntEffectsComponent_GetOwningPlayer");
static_assert(offsetof(K25ChainHuntEffectsComponent_GetOwningPlayer, ReturnValue) == 0x000000, "Member 'K25ChainHuntEffectsComponent_GetOwningPlayer::ReturnValue' has a wrong offset!");

// Function TheK25.K25ChainLocomotionSurvivorAnimInstance.OnChainAttached
// 0x0010 (0x0010 - 0x0000)
struct K25ChainLocomotionSurvivorAnimInstance_OnChainAttached final
{
public:
	class AK25Chain*                              Chain;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
