#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheK30

#include "Basic.hpp"

#include "DBDBots_classes.hpp"
#include "DBDInteraction_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "TheK30_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "StatSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NetworkUtilities_structs.hpp"
#include "AnimationUtilities_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "DBDGameplay_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "DBDCosmetic_classes.hpp"
#include "Competence_classes.hpp"


namespace SDK
{

// Class TheK30.GuardOrderBase
// 0x0010 (0x0790 - 0x0780)
class UGuardOrderBase : public UInteractionDefinition
{
public:
	bool                                          _shouldWaitForCurrentInteraction;                  // 0x0778(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _explodeInteractableAnimNotifyID;                  // 0x077C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardOrderBase">();
	}
	static class UGuardOrderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardOrderBase>();
	}
};
static_assert(alignof(UGuardOrderBase) == 0x000010, "Wrong alignment on UGuardOrderBase");
static_assert(sizeof(UGuardOrderBase) == 0x000790, "Wrong size on UGuardOrderBase");
static_assert(offsetof(UGuardOrderBase, _shouldWaitForCurrentInteraction) == 0x000778, "Member 'UGuardOrderBase::_shouldWaitForCurrentInteraction' has a wrong offset!");
static_assert(offsetof(UGuardOrderBase, _explodeInteractableAnimNotifyID) == 0x00077C, "Member 'UGuardOrderBase::_explodeInteractableAnimNotifyID' has a wrong offset!");

// Class TheK30.GuardBreakWall
// 0x0000 (0x0790 - 0x0790)
class UGuardBreakWall final : public UGuardOrderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardBreakWall">();
	}
	static class UGuardBreakWall* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardBreakWall>();
	}
};
static_assert(alignof(UGuardBreakWall) == 0x000010, "Wrong alignment on UGuardBreakWall");
static_assert(sizeof(UGuardBreakWall) == 0x000790, "Wrong size on UGuardBreakWall");

// Class TheK30.BTService_FindObject_GuardFlag
// 0x0000 (0x0220 - 0x0220)
class UBTService_FindObject_GuardFlag final : public UBTService_FindObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTService_FindObject_GuardFlag">();
	}
	static class UBTService_FindObject_GuardFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_FindObject_GuardFlag>();
	}
};
static_assert(alignof(UBTService_FindObject_GuardFlag) == 0x000008, "Wrong alignment on UBTService_FindObject_GuardFlag");
static_assert(sizeof(UBTService_FindObject_GuardFlag) == 0x000220, "Wrong size on UBTService_FindObject_GuardFlag");

// Class TheK30.K30Power
// 0x00B0 (0x06A8 - 0x05F8)
class AK30Power final : public AKillerPower
{
public:
	FMulticastInlineDelegateProperty_             PowerStateChanged;                                 // 0x05F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             GuardSwappedTo;                                    // 0x0608(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UPatrolTrailComponent*                  _patrolTrailComponent;                             // 0x0618(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGuardManagerComponent*                 _guardManagerComponent;                            // 0x0620(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDrawPatrolModeSwitcherComponent*       _drawPatrolModeSwitcherComponent;                  // 0x0628(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPostDrawPatrolHasteApplier            _postDrawPatrolHasteApplier;                       // 0x0630(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_668[0x40];                                     // 0x0668(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_SendPathNearlyEndingWarning();
	void Cosmetic_UpdateRemainingPathLength(float RemainingPathLengthPercent);
	void GuardSwappedTo__DelegateSignature(ESwapToState SwapTo);
	void PowerStateChanged__DelegateSignature(EPowerState PreviousState, EPowerState NewState);

	class UDrawPatrolPathInteraction* GetDrawPatrolPathInteraction() const;
	class UKnightOrderComponent* GetKnightOrderComponent() const;
	class UPatrolTrailComponent* GetPatrolTrailComponent() const;
	float GetRemainingPathLengthPercent() const;
	class USwapGuardTypeInteraction* GetSwapGuardTypeInteraction() const;
	bool IsDrawingPath() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K30Power">();
	}
	static class AK30Power* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK30Power>();
	}
};
static_assert(alignof(AK30Power) == 0x000008, "Wrong alignment on AK30Power");
static_assert(sizeof(AK30Power) == 0x0006A8, "Wrong size on AK30Power");
static_assert(offsetof(AK30Power, PowerStateChanged) == 0x0005F8, "Member 'AK30Power::PowerStateChanged' has a wrong offset!");
static_assert(offsetof(AK30Power, GuardSwappedTo) == 0x000608, "Member 'AK30Power::GuardSwappedTo' has a wrong offset!");
static_assert(offsetof(AK30Power, _patrolTrailComponent) == 0x000618, "Member 'AK30Power::_patrolTrailComponent' has a wrong offset!");
static_assert(offsetof(AK30Power, _guardManagerComponent) == 0x000620, "Member 'AK30Power::_guardManagerComponent' has a wrong offset!");
static_assert(offsetof(AK30Power, _drawPatrolModeSwitcherComponent) == 0x000628, "Member 'AK30Power::_drawPatrolModeSwitcherComponent' has a wrong offset!");
static_assert(offsetof(AK30Power, _postDrawPatrolHasteApplier) == 0x000630, "Member 'AK30Power::_postDrawPatrolHasteApplier' has a wrong offset!");

// Class TheK30.DrawPatrolModeSwitcherComponent
// 0x0288 (0x0330 - 0x00A8)
class alignas(0x10) UDrawPatrolModeSwitcherComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _pathCreationModeOverFadeInTime;                   // 0x00B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _enableInteractionAfterTeleportationDelay;         // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     _drawPathIndicatorClass;                           // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class APoseableHusk>              _huskClass;                                        // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFloatingCameraHandler                 _floatingCameraHandler;                            // 0x00F0(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDrawPatrolSnappingHandler             _drawPatrolSnappingHandler;                        // 0x01F0(0x0098)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class APoseableHusk*                          _husk;                                             // 0x0288(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 _drawPathIndicator;                                // 0x0290(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0x98];                                     // 0x0298(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Husk();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawPatrolModeSwitcherComponent">();
	}
	static class UDrawPatrolModeSwitcherComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPatrolModeSwitcherComponent>();
	}
};
static_assert(alignof(UDrawPatrolModeSwitcherComponent) == 0x000010, "Wrong alignment on UDrawPatrolModeSwitcherComponent");
static_assert(sizeof(UDrawPatrolModeSwitcherComponent) == 0x000330, "Wrong size on UDrawPatrolModeSwitcherComponent");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _pathCreationModeOverFadeInTime) == 0x0000B0, "Member 'UDrawPatrolModeSwitcherComponent::_pathCreationModeOverFadeInTime' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _enableInteractionAfterTeleportationDelay) == 0x0000D8, "Member 'UDrawPatrolModeSwitcherComponent::_enableInteractionAfterTeleportationDelay' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _drawPathIndicatorClass) == 0x0000E0, "Member 'UDrawPatrolModeSwitcherComponent::_drawPathIndicatorClass' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _huskClass) == 0x0000E8, "Member 'UDrawPatrolModeSwitcherComponent::_huskClass' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _floatingCameraHandler) == 0x0000F0, "Member 'UDrawPatrolModeSwitcherComponent::_floatingCameraHandler' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _drawPatrolSnappingHandler) == 0x0001F0, "Member 'UDrawPatrolModeSwitcherComponent::_drawPatrolSnappingHandler' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _husk) == 0x000288, "Member 'UDrawPatrolModeSwitcherComponent::_husk' has a wrong offset!");
static_assert(offsetof(UDrawPatrolModeSwitcherComponent, _drawPathIndicator) == 0x000290, "Member 'UDrawPatrolModeSwitcherComponent::_drawPathIndicator' has a wrong offset!");

// Class TheK30.DrawPatrolPathInteraction
// 0x0230 (0x0B50 - 0x0920)
class UDrawPatrolPathInteraction final : public UBasicChargeableInteraction
{
public:
	uint8                                         Pad_920[0x34];                                     // 0x0920(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	EDrawPatrolExitReason                         _exitReason;                                       // 0x0954(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_955[0x3];                                      // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSecondaryInteractionProperties        _giveOrderProperties;                              // 0x0958(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSecondaryInteractionProperties        _releaseInteractionProperties;                     // 0x0990(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSecondaryInteractionProperties        _cancelInteractionProperties;                      // 0x09C8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maximumInteractionDuration;                       // 0x0A00(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pathLengthWarningPercent;                         // 0x0A28(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pathDrawingDurationWarningPercent;                // 0x0A50(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _minSlopeToCheckStepUp;                            // 0x0A78(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _lookAtPreviewSpeed;                               // 0x0AA0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UClass>, class FText> _guardNames;                                       // 0x0AC8(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B18[0x38];                                     // 0x0B18(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawPatrolPathInteraction">();
	}
	static class UDrawPatrolPathInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPatrolPathInteraction>();
	}
};
static_assert(alignof(UDrawPatrolPathInteraction) == 0x000010, "Wrong alignment on UDrawPatrolPathInteraction");
static_assert(sizeof(UDrawPatrolPathInteraction) == 0x000B50, "Wrong size on UDrawPatrolPathInteraction");
static_assert(offsetof(UDrawPatrolPathInteraction, _exitReason) == 0x000954, "Member 'UDrawPatrolPathInteraction::_exitReason' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _giveOrderProperties) == 0x000958, "Member 'UDrawPatrolPathInteraction::_giveOrderProperties' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _releaseInteractionProperties) == 0x000990, "Member 'UDrawPatrolPathInteraction::_releaseInteractionProperties' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _cancelInteractionProperties) == 0x0009C8, "Member 'UDrawPatrolPathInteraction::_cancelInteractionProperties' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _maximumInteractionDuration) == 0x000A00, "Member 'UDrawPatrolPathInteraction::_maximumInteractionDuration' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _pathLengthWarningPercent) == 0x000A28, "Member 'UDrawPatrolPathInteraction::_pathLengthWarningPercent' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _pathDrawingDurationWarningPercent) == 0x000A50, "Member 'UDrawPatrolPathInteraction::_pathDrawingDurationWarningPercent' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _minSlopeToCheckStepUp) == 0x000A78, "Member 'UDrawPatrolPathInteraction::_minSlopeToCheckStepUp' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _lookAtPreviewSpeed) == 0x000AA0, "Member 'UDrawPatrolPathInteraction::_lookAtPreviewSpeed' has a wrong offset!");
static_assert(offsetof(UDrawPatrolPathInteraction, _guardNames) == 0x000AC8, "Member 'UDrawPatrolPathInteraction::_guardNames' has a wrong offset!");

// Class TheK30.GuardAttackableComponent
// 0x0028 (0x00D0 - 0x00A8)
class UGuardAttackableComponent final : public UAttackableComponent
{
public:
	struct FDBDTunableRowHandle                   _hitByCooldown;                                    // 0x00A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardAttackableComponent">();
	}
	static class UGuardAttackableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardAttackableComponent>();
	}
};
static_assert(alignof(UGuardAttackableComponent) == 0x000008, "Wrong alignment on UGuardAttackableComponent");
static_assert(sizeof(UGuardAttackableComponent) == 0x0000D0, "Wrong size on UGuardAttackableComponent");
static_assert(offsetof(UGuardAttackableComponent, _hitByCooldown) == 0x0000A8, "Member 'UGuardAttackableComponent::_hitByCooldown' has a wrong offset!");

// Class TheK30.TrailNode
// 0x0020 (0x02C0 - 0x02A0)
class ATrailNode final : public AActor
{
public:
	struct FVector                                _previousNodePosition;                             // 0x02A0(0x0018)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isPreparingForRemoval;                            // 0x02B8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_PrepareForRemoval();
	void OnPreviousNodePositionSet();
	void OnRep_IsPreparingForRemoval();
	void OnRep_PreviousNodePosition();

	bool IsFirstNode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrailNode">();
	}
	static class ATrailNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrailNode>();
	}
};
static_assert(alignof(ATrailNode) == 0x000008, "Wrong alignment on ATrailNode");
static_assert(sizeof(ATrailNode) == 0x0002C0, "Wrong size on ATrailNode");
static_assert(offsetof(ATrailNode, _previousNodePosition) == 0x0002A0, "Member 'ATrailNode::_previousNodePosition' has a wrong offset!");
static_assert(offsetof(ATrailNode, _isPreparingForRemoval) == 0x0002B8, "Member 'ATrailNode::_isPreparingForRemoval' has a wrong offset!");

// Class TheK30.GuardAttackComponent
// 0x0088 (0x0130 - 0x00A8)
class UGuardAttackComponent final : public UActorComponent
{
public:
	TSubclassOf<class UStatusEffect>              _killerInstinctEffectClass;                        // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _killerInstinctEffectDuration;                     // 0x00B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EDetectionZone                                _detectionZoneToUse;                               // 0x00D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class ACamperPlayer>>     _survivorsInZone;                                  // 0x00E0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardAttackComponent">();
	}
	static class UGuardAttackComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardAttackComponent>();
	}
};
static_assert(alignof(UGuardAttackComponent) == 0x000008, "Wrong alignment on UGuardAttackComponent");
static_assert(sizeof(UGuardAttackComponent) == 0x000130, "Wrong size on UGuardAttackComponent");
static_assert(offsetof(UGuardAttackComponent, _killerInstinctEffectClass) == 0x0000A8, "Member 'UGuardAttackComponent::_killerInstinctEffectClass' has a wrong offset!");
static_assert(offsetof(UGuardAttackComponent, _killerInstinctEffectDuration) == 0x0000B0, "Member 'UGuardAttackComponent::_killerInstinctEffectDuration' has a wrong offset!");
static_assert(offsetof(UGuardAttackComponent, _detectionZoneToUse) == 0x0000D8, "Member 'UGuardAttackComponent::_detectionZoneToUse' has a wrong offset!");
static_assert(offsetof(UGuardAttackComponent, _survivorsInZone) == 0x0000E0, "Member 'UGuardAttackComponent::_survivorsInZone' has a wrong offset!");

// Class TheK30.SwapGuardTypeInteraction
// 0x0010 (0x0790 - 0x0780)
class USwapGuardTypeInteraction final : public UInteractionDefinition
{
public:
	uint8                                         Pad_778[0x18];                                     // 0x0778(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SwapGuardTypeInteraction">();
	}
	static class USwapGuardTypeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwapGuardTypeInteraction>();
	}
};
static_assert(alignof(USwapGuardTypeInteraction) == 0x000010, "Wrong alignment on USwapGuardTypeInteraction");
static_assert(sizeof(USwapGuardTypeInteraction) == 0x000790, "Wrong size on USwapGuardTypeInteraction");

// Class TheK30.NavigationQueryFilter_Guard
// 0x0000 (0x0070 - 0x0070)
class UNavigationQueryFilter_Guard final : public UNavigationQueryFilter_Player
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationQueryFilter_Guard">();
	}
	static class UNavigationQueryFilter_Guard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavigationQueryFilter_Guard>();
	}
};
static_assert(alignof(UNavigationQueryFilter_Guard) == 0x000008, "Wrong alignment on UNavigationQueryFilter_Guard");
static_assert(sizeof(UNavigationQueryFilter_Guard) == 0x000070, "Wrong size on UNavigationQueryFilter_Guard");

// Class TheK30.GuardBreakPallet
// 0x0000 (0x0790 - 0x0790)
class UGuardBreakPallet final : public UGuardOrderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardBreakPallet">();
	}
	static class UGuardBreakPallet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardBreakPallet>();
	}
};
static_assert(alignof(UGuardBreakPallet) == 0x000010, "Wrong alignment on UGuardBreakPallet");
static_assert(sizeof(UGuardBreakPallet) == 0x000790, "Wrong size on UGuardBreakPallet");

// Class TheK30.SetUpLockerInteractionComponent
// 0x0010 (0x00B8 - 0x00A8)
class USetUpLockerInteractionComponent final : public UActorComponent
{
public:
	TSubclassOf<class UInteractionDefinition>     _interactionClass;                                 // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SetUpLockerInteractionComponent">();
	}
	static class USetUpLockerInteractionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetUpLockerInteractionComponent>();
	}
};
static_assert(alignof(USetUpLockerInteractionComponent) == 0x000008, "Wrong alignment on USetUpLockerInteractionComponent");
static_assert(sizeof(USetUpLockerInteractionComponent) == 0x0000B8, "Wrong size on USetUpLockerInteractionComponent");
static_assert(offsetof(USetUpLockerInteractionComponent, _interactionClass) == 0x0000A8, "Member 'USetUpLockerInteractionComponent::_interactionClass' has a wrong offset!");

// Class TheK30.GuardController
// 0x0078 (0x0A98 - 0x0A20)
class AGuardController final : public ADBDAIBTController
{
public:
	uint8                                         Pad_A20[0x8];                                      // 0x0A20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   _cannotHuntWhileIdleTags;                          // 0x0A28(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   _isPatrollingKey;                                  // 0x0A38(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _patrolDestinationKey;                             // 0x0A44(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _patrolUseDirectPathKey;                           // 0x0A50(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _isHuntingKey;                                     // 0x0A5C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntedSurvivorKey;                                // 0x0A68(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntDestinationKey;                               // 0x0A74(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntUseDirectPathKey;                             // 0x0A80(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   _huntShouldSearchLockerKey;                        // 0x0A8C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLoudNoiseTriggered(class AActor* Originator, class AActor* InstigatingActor, const struct FVector& Location, bool ShouldTrack, float* AudibleRange, bool IsQuickAction, bool IsDeceivingNoise);
	void OnTargetPerceptionUpdated(class AActor* Actor, const struct FAIStimulus& Stimulus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardController">();
	}
	static class AGuardController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardController>();
	}
};
static_assert(alignof(AGuardController) == 0x000008, "Wrong alignment on AGuardController");
static_assert(sizeof(AGuardController) == 0x000A98, "Wrong size on AGuardController");
static_assert(offsetof(AGuardController, _cannotHuntWhileIdleTags) == 0x000A28, "Member 'AGuardController::_cannotHuntWhileIdleTags' has a wrong offset!");
static_assert(offsetof(AGuardController, _isPatrollingKey) == 0x000A38, "Member 'AGuardController::_isPatrollingKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _patrolDestinationKey) == 0x000A44, "Member 'AGuardController::_patrolDestinationKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _patrolUseDirectPathKey) == 0x000A50, "Member 'AGuardController::_patrolUseDirectPathKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _isHuntingKey) == 0x000A5C, "Member 'AGuardController::_isHuntingKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntedSurvivorKey) == 0x000A68, "Member 'AGuardController::_huntedSurvivorKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntDestinationKey) == 0x000A74, "Member 'AGuardController::_huntDestinationKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntUseDirectPathKey) == 0x000A80, "Member 'AGuardController::_huntUseDirectPathKey' has a wrong offset!");
static_assert(offsetof(AGuardController, _huntShouldSearchLockerKey) == 0x000A8C, "Member 'AGuardController::_huntShouldSearchLockerKey' has a wrong offset!");

// Class TheK30.GuardCatalog
// 0x0010 (0x0048 - 0x0038)
class UGuardCatalog final : public UDataAsset
{
public:
	TArray<TSoftClassPtr<class UClass>>           Guards;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardCatalog">();
	}
	static class UGuardCatalog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardCatalog>();
	}
};
static_assert(alignof(UGuardCatalog) == 0x000008, "Wrong alignment on UGuardCatalog");
static_assert(sizeof(UGuardCatalog) == 0x000048, "Wrong size on UGuardCatalog");
static_assert(offsetof(UGuardCatalog, Guards) == 0x000038, "Member 'UGuardCatalog::Guards' has a wrong offset!");

// Class TheK30.GuardDamageGenerator
// 0x0000 (0x0790 - 0x0790)
class UGuardDamageGenerator final : public UGuardOrderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardDamageGenerator">();
	}
	static class UGuardDamageGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardDamageGenerator>();
	}
};
static_assert(alignof(UGuardDamageGenerator) == 0x000010, "Wrong alignment on UGuardDamageGenerator");
static_assert(sizeof(UGuardDamageGenerator) == 0x000790, "Wrong size on UGuardDamageGenerator");

// Class TheK30.GuardFlag
// 0x0168 (0x0408 - 0x02A0)
class AGuardFlag final : public AActor
{
public:
	class UPrimitiveComponent*                    _flagPickupHitbox;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FActivationState                       _activationState;                                  // 0x02A8(0x0010)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _flagPickupEnduranceEffectClass;                   // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flagPickupEnduranceDuration;                      // 0x02C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _flagPickupHasteEffectClass;                       // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flagPickupHasteDuration;                          // 0x02F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flagPickupHasteModifier;                          // 0x0318(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _baseFlagActivationTime;                           // 0x0340(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _activationTimeMultiplierCurve;                    // 0x03C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C8[0x38];                                     // 0x03C8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             _clientHuntedSurvivor;                             // 0x0400(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& HitResult);
	void Cosmetic_OnFlagActivationTimerCompleted();
	void Cosmetic_OnFlagDisappearDueToHuntEnding(class ADBDPlayer* PreviouslyHuntedSurvivor);
	void Cosmetic_OnFlagSpawned(float ActivationTimerDuration);
	void Cosmetic_OnSurvivorCapturedFlag(class ADBDPlayer* PreviouslyHuntedSurvivor);
	void Multicast_OnCamperCapturedFlag(class ADBDPlayer* HuntedSurvivor);
	void OnRep_ActivationState();

	float GetActivationTimeLeft() const;
	float GetFlagPickupEnduranceDuration() const;
	float GetFlagPickupHasteDuration() const;
	class ADBDPlayer* GetHuntedSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardFlag">();
	}
	static class AGuardFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardFlag>();
	}
};
static_assert(alignof(AGuardFlag) == 0x000008, "Wrong alignment on AGuardFlag");
static_assert(sizeof(AGuardFlag) == 0x000408, "Wrong size on AGuardFlag");
static_assert(offsetof(AGuardFlag, _flagPickupHitbox) == 0x0002A0, "Member 'AGuardFlag::_flagPickupHitbox' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _activationState) == 0x0002A8, "Member 'AGuardFlag::_activationState' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupEnduranceEffectClass) == 0x0002B8, "Member 'AGuardFlag::_flagPickupEnduranceEffectClass' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupEnduranceDuration) == 0x0002C0, "Member 'AGuardFlag::_flagPickupEnduranceDuration' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupHasteEffectClass) == 0x0002E8, "Member 'AGuardFlag::_flagPickupHasteEffectClass' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupHasteDuration) == 0x0002F0, "Member 'AGuardFlag::_flagPickupHasteDuration' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _flagPickupHasteModifier) == 0x000318, "Member 'AGuardFlag::_flagPickupHasteModifier' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _baseFlagActivationTime) == 0x000340, "Member 'AGuardFlag::_baseFlagActivationTime' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _activationTimeMultiplierCurve) == 0x0003C0, "Member 'AGuardFlag::_activationTimeMultiplierCurve' has a wrong offset!");
static_assert(offsetof(AGuardFlag, _clientHuntedSurvivor) == 0x000400, "Member 'AGuardFlag::_clientHuntedSurvivor' has a wrong offset!");

// Class TheK30.GuardFlagOUtlineUpdateStrategy
// 0x0020 (0x00F0 - 0x00D0)
class UGuardFlagOUtlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _killerColor;                                      // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           _survivorColor;                                    // 0x00E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardFlagOUtlineUpdateStrategy">();
	}
	static class UGuardFlagOUtlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardFlagOUtlineUpdateStrategy>();
	}
};
static_assert(alignof(UGuardFlagOUtlineUpdateStrategy) == 0x000008, "Wrong alignment on UGuardFlagOUtlineUpdateStrategy");
static_assert(sizeof(UGuardFlagOUtlineUpdateStrategy) == 0x0000F0, "Wrong size on UGuardFlagOUtlineUpdateStrategy");
static_assert(offsetof(UGuardFlagOUtlineUpdateStrategy, _killerColor) == 0x0000D0, "Member 'UGuardFlagOUtlineUpdateStrategy::_killerColor' has a wrong offset!");
static_assert(offsetof(UGuardFlagOUtlineUpdateStrategy, _survivorColor) == 0x0000E0, "Member 'UGuardFlagOUtlineUpdateStrategy::_survivorColor' has a wrong offset!");

// Class TheK30.GuardHuntComponent
// 0x0258 (0x0300 - 0x00A8)
class UGuardHuntComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnGuardPhaseProgressUpdate;                        // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x60];                                      // 0x00B8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxPathingDetourLength;                           // 0x0118(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceBeforeGoingToNextWaypoint;                // 0x011C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceBeforeGoingToNextWaypointOffNavmesh;      // 0x0120(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceFromLockerToClearWaypoints;               // 0x0124(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _underWaypointZDistance;                           // 0x0128(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _huntDurationBase;                                 // 0x0130(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTunableStat                           _huntDurationBonus;                                // 0x0158(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _huntDurationMultiplierCurve;                      // 0x01D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _drainHuntTimerRateMultiplier;                     // 0x01E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _isKillerCloseEnoughToApplyHuntTimerMultiplierDistance; // 0x0208(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _maximumHuntDuration;                              // 0x0230(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpeedBasedNetSyncedValue              _huntTimeLeft;                                     // 0x0238(0x0038)(Net, NativeAccessSpecifierPrivate)
	class ACamperPlayer*                          _huntedSurvivor;                                   // 0x0270(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _huntStartingLocation;                             // 0x0280(0x0018)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0x18];                                     // 0x0298(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _speedConsideredStuck;                             // 0x02B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _timeStuckToResetPathing;                          // 0x02B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x48];                                     // 0x02B8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGuardPhaseProgressUpdate__DelegateSignature(float CompletionProgress);
	void OnRep_HuntedSurvivor(class ACamperPlayer* PreviousChasedSurvivor);
	void OnRep_HuntStartingLocation();

	class ACamperPlayer* GetHuntedSurvivor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardHuntComponent">();
	}
	static class UGuardHuntComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardHuntComponent>();
	}
};
static_assert(alignof(UGuardHuntComponent) == 0x000008, "Wrong alignment on UGuardHuntComponent");
static_assert(sizeof(UGuardHuntComponent) == 0x000300, "Wrong size on UGuardHuntComponent");
static_assert(offsetof(UGuardHuntComponent, OnGuardPhaseProgressUpdate) == 0x0000A8, "Member 'UGuardHuntComponent::OnGuardPhaseProgressUpdate' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _maxPathingDetourLength) == 0x000118, "Member 'UGuardHuntComponent::_maxPathingDetourLength' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _distanceBeforeGoingToNextWaypoint) == 0x00011C, "Member 'UGuardHuntComponent::_distanceBeforeGoingToNextWaypoint' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _distanceBeforeGoingToNextWaypointOffNavmesh) == 0x000120, "Member 'UGuardHuntComponent::_distanceBeforeGoingToNextWaypointOffNavmesh' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _distanceFromLockerToClearWaypoints) == 0x000124, "Member 'UGuardHuntComponent::_distanceFromLockerToClearWaypoints' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _underWaypointZDistance) == 0x000128, "Member 'UGuardHuntComponent::_underWaypointZDistance' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntDurationBase) == 0x000130, "Member 'UGuardHuntComponent::_huntDurationBase' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntDurationBonus) == 0x000158, "Member 'UGuardHuntComponent::_huntDurationBonus' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntDurationMultiplierCurve) == 0x0001D8, "Member 'UGuardHuntComponent::_huntDurationMultiplierCurve' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _drainHuntTimerRateMultiplier) == 0x0001E0, "Member 'UGuardHuntComponent::_drainHuntTimerRateMultiplier' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _isKillerCloseEnoughToApplyHuntTimerMultiplierDistance) == 0x000208, "Member 'UGuardHuntComponent::_isKillerCloseEnoughToApplyHuntTimerMultiplierDistance' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _maximumHuntDuration) == 0x000230, "Member 'UGuardHuntComponent::_maximumHuntDuration' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntTimeLeft) == 0x000238, "Member 'UGuardHuntComponent::_huntTimeLeft' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntedSurvivor) == 0x000270, "Member 'UGuardHuntComponent::_huntedSurvivor' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _huntStartingLocation) == 0x000280, "Member 'UGuardHuntComponent::_huntStartingLocation' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _speedConsideredStuck) == 0x0002B0, "Member 'UGuardHuntComponent::_speedConsideredStuck' has a wrong offset!");
static_assert(offsetof(UGuardHuntComponent, _timeStuckToResetPathing) == 0x0002B4, "Member 'UGuardHuntComponent::_timeStuckToResetPathing' has a wrong offset!");

// Class TheK30.GuardPullSurvivorOutOfLocker
// 0x0080 (0x0830 - 0x07B0)
class UGuardPullSurvivorOutOfLocker final : public UBaseLockerInteraction
{
public:
	class ACamperPlayer*                          _targetSurvivor;                                   // 0x07A8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _healthySurvivorUpdateMontage;                     // 0x07B0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAnimationMontageDescriptor            _injuredSurvivorUpdateMontage;                     // 0x07D0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _pullOutOfLockerDuration;                          // 0x07F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _snapPositionDistanceOnPullOutHealthy;             // 0x0818(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _snapTime;                                         // 0x081C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_820[0x10];                                     // 0x0820(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardPullSurvivorOutOfLocker">();
	}
	static class UGuardPullSurvivorOutOfLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardPullSurvivorOutOfLocker>();
	}
};
static_assert(alignof(UGuardPullSurvivorOutOfLocker) == 0x000010, "Wrong alignment on UGuardPullSurvivorOutOfLocker");
static_assert(sizeof(UGuardPullSurvivorOutOfLocker) == 0x000830, "Wrong size on UGuardPullSurvivorOutOfLocker");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _targetSurvivor) == 0x0007A8, "Member 'UGuardPullSurvivorOutOfLocker::_targetSurvivor' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _healthySurvivorUpdateMontage) == 0x0007B0, "Member 'UGuardPullSurvivorOutOfLocker::_healthySurvivorUpdateMontage' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _injuredSurvivorUpdateMontage) == 0x0007D0, "Member 'UGuardPullSurvivorOutOfLocker::_injuredSurvivorUpdateMontage' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _pullOutOfLockerDuration) == 0x0007F0, "Member 'UGuardPullSurvivorOutOfLocker::_pullOutOfLockerDuration' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _snapPositionDistanceOnPullOutHealthy) == 0x000818, "Member 'UGuardPullSurvivorOutOfLocker::_snapPositionDistanceOnPullOutHealthy' has a wrong offset!");
static_assert(offsetof(UGuardPullSurvivorOutOfLocker, _snapTime) == 0x00081C, "Member 'UGuardPullSurvivorOutOfLocker::_snapTime' has a wrong offset!");

// Class TheK30.GuardHuntTeleport
// 0x0030 (0x07B0 - 0x0780)
class UGuardHuntTeleport final : public UInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _huntStartUpDuration;                              // 0x0778(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _huntStartUpDurationPathLengthMultiplier;          // 0x07A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardHuntTeleport">();
	}
	static class UGuardHuntTeleport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardHuntTeleport>();
	}
};
static_assert(alignof(UGuardHuntTeleport) == 0x000010, "Wrong alignment on UGuardHuntTeleport");
static_assert(sizeof(UGuardHuntTeleport) == 0x0007B0, "Wrong size on UGuardHuntTeleport");
static_assert(offsetof(UGuardHuntTeleport, _huntStartUpDuration) == 0x000778, "Member 'UGuardHuntTeleport::_huntStartUpDuration' has a wrong offset!");
static_assert(offsetof(UGuardHuntTeleport, _huntStartUpDurationPathLengthMultiplier) == 0x0007A0, "Member 'UGuardHuntTeleport::_huntStartUpDurationPathLengthMultiplier' has a wrong offset!");

// Class TheK30.NearUndestroyedPallet
// 0x0058 (0x0140 - 0x00E8)
class UNearUndestroyedPallet : public URangeBasedCondition
{
public:
	uint8                                         Pad_E8[0x58];                                      // 0x00E8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearUndestroyedPallet">();
	}
	static class UNearUndestroyedPallet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearUndestroyedPallet>();
	}
};
static_assert(alignof(UNearUndestroyedPallet) == 0x000008, "Wrong alignment on UNearUndestroyedPallet");
static_assert(sizeof(UNearUndestroyedPallet) == 0x000140, "Wrong size on UNearUndestroyedPallet");

// Class TheK30.NearFallenPallet
// 0x0000 (0x0140 - 0x0140)
class UNearFallenPallet final : public UNearUndestroyedPallet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearFallenPallet">();
	}
	static class UNearFallenPallet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearFallenPallet>();
	}
};
static_assert(alignof(UNearFallenPallet) == 0x000008, "Wrong alignment on UNearFallenPallet");
static_assert(sizeof(UNearFallenPallet) == 0x000140, "Wrong size on UNearFallenPallet");

// Class TheK30.GuardIdleComponent
// 0x0088 (0x0130 - 0x00A8)
class UGuardIdleComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UGuardVisionUpdater*                    _visionUpdater;                                    // 0x00C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _canIdle;                                          // 0x00C8(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _idleDuration;                                     // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x38];                                      // 0x00F8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_OnIdleStarted();
	void Multicast_OnIdleStopped(EIdlePostStopOperation Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardIdleComponent">();
	}
	static class UGuardIdleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardIdleComponent>();
	}
};
static_assert(alignof(UGuardIdleComponent) == 0x000008, "Wrong alignment on UGuardIdleComponent");
static_assert(sizeof(UGuardIdleComponent) == 0x000130, "Wrong size on UGuardIdleComponent");
static_assert(offsetof(UGuardIdleComponent, _visionUpdater) == 0x0000C0, "Member 'UGuardIdleComponent::_visionUpdater' has a wrong offset!");
static_assert(offsetof(UGuardIdleComponent, _canIdle) == 0x0000C8, "Member 'UGuardIdleComponent::_canIdle' has a wrong offset!");
static_assert(offsetof(UGuardIdleComponent, _idleDuration) == 0x0000D0, "Member 'UGuardIdleComponent::_idleDuration' has a wrong offset!");

// Class TheK30.GuardInteractable
// 0x0008 (0x03E8 - 0x03E0)
class AGuardInteractable final : public APlayerInteractable
{
public:
	class UInteractionDefinition*                 _startHuntInteraction;                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardInteractable">();
	}
	static class AGuardInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGuardInteractable>();
	}
};
static_assert(alignof(AGuardInteractable) == 0x000008, "Wrong alignment on AGuardInteractable");
static_assert(sizeof(AGuardInteractable) == 0x0003E8, "Wrong size on AGuardInteractable");
static_assert(offsetof(AGuardInteractable, _startHuntInteraction) == 0x0003E0, "Member 'AGuardInteractable::_startHuntInteraction' has a wrong offset!");

// Class TheK30.GuardManagerComponent
// 0x0088 (0x0130 - 0x00A8)
class UGuardManagerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuardInstanceContainer>        _guardInstanceContainers;                          // 0x00C0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UClass>, struct FTunableStat> _guardCooldownDurations;                           // 0x00D0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UGuardCatalog*                          _guardCatalog;                                     // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Guards();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardManagerComponent">();
	}
	static class UGuardManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardManagerComponent>();
	}
};
static_assert(alignof(UGuardManagerComponent) == 0x000008, "Wrong alignment on UGuardManagerComponent");
static_assert(sizeof(UGuardManagerComponent) == 0x000130, "Wrong size on UGuardManagerComponent");
static_assert(offsetof(UGuardManagerComponent, _guardInstanceContainers) == 0x0000C0, "Member 'UGuardManagerComponent::_guardInstanceContainers' has a wrong offset!");
static_assert(offsetof(UGuardManagerComponent, _guardCooldownDurations) == 0x0000D0, "Member 'UGuardManagerComponent::_guardCooldownDurations' has a wrong offset!");
static_assert(offsetof(UGuardManagerComponent, _guardCatalog) == 0x000120, "Member 'UGuardManagerComponent::_guardCatalog' has a wrong offset!");

// Class TheK30.GuardOutlineUpdateStrategy
// 0x0010 (0x00E0 - 0x00D0)
class UGuardOutlineUpdateStrategy final : public UOutlineUpdateStrategy
{
public:
	struct FLinearColor                           _killerColor;                                      // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardOutlineUpdateStrategy">();
	}
	static class UGuardOutlineUpdateStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardOutlineUpdateStrategy>();
	}
};
static_assert(alignof(UGuardOutlineUpdateStrategy) == 0x000008, "Wrong alignment on UGuardOutlineUpdateStrategy");
static_assert(sizeof(UGuardOutlineUpdateStrategy) == 0x0000E0, "Wrong size on UGuardOutlineUpdateStrategy");
static_assert(offsetof(UGuardOutlineUpdateStrategy, _killerColor) == 0x0000D0, "Member 'UGuardOutlineUpdateStrategy::_killerColor' has a wrong offset!");

// Class TheK30.GuardPatrolComponent
// 0x0138 (0x01E0 - 0x00A8)
class UGuardPatrolComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	ETrailDirection                               _currentDirection;                                 // 0x00C0(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _patrolPathLength;                                 // 0x00C4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPatrolState                                  _patrolState;                                      // 0x00C8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpeedBasedNetSyncedValue              _patrolTimeLeft;                                   // 0x00D0(0x0038)(Net, NativeAccessSpecifierPrivate)
	float                                         _patrolTotalDuration;                              // 0x0108(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _distanceBeforeHeadingToNextNode;                  // 0x010C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxDetourLength;                                  // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTunableStat                           _patrolDuration;                                   // 0x0118(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UGuardVisionUpdater*                    _visionUpdater;                                    // 0x0198(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x40];                                     // 0x01A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_PatrolState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuardPatrolComponent">();
	}
	static class UGuardPatrolComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuardPatrolComponent>();
	}
};
static_assert(alignof(UGuardPatrolComponent) == 0x000008, "Wrong alignment on UGuardPatrolComponent");
static_assert(sizeof(UGuardPatrolComponent) == 0x0001E0, "Wrong size on UGuardPatrolComponent");
static_assert(offsetof(UGuardPatrolComponent, _currentDirection) == 0x0000C0, "Member 'UGuardPatrolComponent::_currentDirection' has a wrong offset!");
