#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS32

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS32.S32P01.GetGeneratorRevealRange
// 0x0004 (0x0004 - 0x0000)
struct S32P01_GetGeneratorRevealRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S32P01_GetGeneratorRevealRange) == 0x000004, "Wrong alignment on S32P01_GetGeneratorRevealRange");
static_assert(sizeof(S32P01_GetGeneratorRevealRange) == 0x000004, "Wrong size on S32P01_GetGeneratorRevealRange");
static_assert(offsetof(S32P01_GetGeneratorRevealRange, ReturnValue) == 0x000000, "Member 'S32P01_GetGeneratorRevealRange::ReturnValue' has a wrong offset!");

// Function TheS32.S32P02.GetHealingProgressionIncreaseAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S32P02_GetHealingProgressionIncreaseAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S32P02_GetHealingProgressionIncreaseAtLevel) == 0x000004, "Wrong alignment on S32P02_GetHealingProgressionIncreaseAtLevel");
static_assert(sizeof(S32P02_GetHealingProgressionIncreaseAtLevel) == 0x000004, "Wrong size on S32P02_GetHealingProgressionIncreaseAtLevel");
static_assert(offsetof(S32P02_GetHealingProgressionIncreaseAtLevel, ReturnValue) == 0x000000, "Member 'S32P02_GetHealingProgressionIncreaseAtLevel::ReturnValue' has a wrong offset!");

// Function TheS32.S32P02.GetHitDistanceAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S32P02_GetHitDistanceAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S32P02_GetHitDistanceAtLevel) == 0x000004, "Wrong alignment on S32P02_GetHitDistanceAtLevel");
static_assert(sizeof(S32P02_GetHitDistanceAtLevel) == 0x000004, "Wrong size on S32P02_GetHitDistanceAtLevel");
static_assert(offsetof(S32P02_GetHitDistanceAtLevel, ReturnValue) == 0x000000, "Member 'S32P02_GetHitDistanceAtLevel::ReturnValue' has a wrong offset!");

// Function TheS32.S32P03.GetActivationTimeForLevel
// 0x0004 (0x0004 - 0x0000)
struct S32P03_GetActivationTimeForLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S32P03_GetActivationTimeForLevel) == 0x000004, "Wrong alignment on S32P03_GetActivationTimeForLevel");
static_assert(sizeof(S32P03_GetActivationTimeForLevel) == 0x000004, "Wrong size on S32P03_GetActivationTimeForLevel");
static_assert(offsetof(S32P03_GetActivationTimeForLevel, ReturnValue) == 0x000000, "Member 'S32P03_GetActivationTimeForLevel::ReturnValue' has a wrong offset!");

}

