#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS23

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS23.BuiltToLast.GetHideDurationByLevel
// 0x0004 (0x0004 - 0x0000)
struct BuiltToLast_GetHideDurationByLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuiltToLast_GetHideDurationByLevel) == 0x000004, "Wrong alignment on BuiltToLast_GetHideDurationByLevel");
static_assert(sizeof(BuiltToLast_GetHideDurationByLevel) == 0x000004, "Wrong size on BuiltToLast_GetHideDurationByLevel");
static_assert(offsetof(BuiltToLast_GetHideDurationByLevel, ReturnValue) == 0x000000, "Member 'BuiltToLast_GetHideDurationByLevel::ReturnValue' has a wrong offset!");

// Function TheS23.BuiltToLast.GetRefillPercentageByLevel
// 0x0004 (0x0004 - 0x0000)
struct BuiltToLast_GetRefillPercentageByLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuiltToLast_GetRefillPercentageByLevel) == 0x000004, "Wrong alignment on BuiltToLast_GetRefillPercentageByLevel");
static_assert(sizeof(BuiltToLast_GetRefillPercentageByLevel) == 0x000004, "Wrong size on BuiltToLast_GetRefillPercentageByLevel");
static_assert(offsetof(BuiltToLast_GetRefillPercentageByLevel, ReturnValue) == 0x000000, "Member 'BuiltToLast_GetRefillPercentageByLevel::ReturnValue' has a wrong offset!");

// Function TheS23.Visionary.GetCooldownAtLevel
// 0x0004 (0x0004 - 0x0000)
struct Visionary_GetCooldownAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Visionary_GetCooldownAtLevel) == 0x000004, "Wrong alignment on Visionary_GetCooldownAtLevel");
static_assert(sizeof(Visionary_GetCooldownAtLevel) == 0x000004, "Wrong size on Visionary_GetCooldownAtLevel");
static_assert(offsetof(Visionary_GetCooldownAtLevel, ReturnValue) == 0x000000, "Member 'Visionary_GetCooldownAtLevel::ReturnValue' has a wrong offset!");

// Function TheS23.Visionary.GetRangeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct Visionary_GetRangeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Visionary_GetRangeAtLevel) == 0x000004, "Wrong alignment on Visionary_GetRangeAtLevel");
static_assert(sizeof(Visionary_GetRangeAtLevel) == 0x000004, "Wrong size on Visionary_GetRangeAtLevel");
static_assert(offsetof(Visionary_GetRangeAtLevel, ReturnValue) == 0x000000, "Member 'Visionary_GetRangeAtLevel::ReturnValue' has a wrong offset!");

}

