#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS38

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDAnimation_classes.hpp"


namespace SDK
{

// Class TheS38.S38P01
// 0x00E8 (0x0508 - 0x0420)
class US38P01 final : public UPerk
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _exposedStatusEffectClass;                         // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _exposedEffect;                                    // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _exposedDuration;                                  // 0x0438(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _hasteStatusEffectClass;                           // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _hasteEffect;                                      // 0x0448(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteAmount;                                      // 0x0450(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteDuration;                                    // 0x0454(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _exhaustionEffectClass;                            // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _exhaustionEffect;                                 // 0x0460(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _exhaustionDuration[0x3];                          // 0x0468(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class ACollectable>>       _collectableClasses;                               // 0x0478(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FName>                           _unsupportedItemAddons;                            // 0x0488(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class US38P01Interaction>         _interactionBP;                                    // 0x0498(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _animationDuration;                                // 0x04A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A4[0x64];                                     // 0x04A4(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_GiveSecondaryPerkEffect();
	void Authority_OnAnimationFinish();
	void Authority_OnPerkActivated(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Multicast_OnAnimationStart();
	void Multicast_OnSecondaryPerkEffect(bool ShouldScream);

	const TArray<TSubclassOf<class ACollectable>> GetCollectableClasses() const;
	float GetExhaustionDurationAtLevel() const;
	float GetExposedDuration() const;
	float GetHasteAmount() const;
	float GetHasteDuration() const;
	const TArray<class FName> GetUnsupportedItemAddons() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P01">();
	}
	static class US38P01* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P01>();
	}
};
static_assert(alignof(US38P01) == 0x000008, "Wrong alignment on US38P01");
static_assert(sizeof(US38P01) == 0x000508, "Wrong size on US38P01");
static_assert(offsetof(US38P01, _exposedStatusEffectClass) == 0x000428, "Member 'US38P01::_exposedStatusEffectClass' has a wrong offset!");
static_assert(offsetof(US38P01, _exposedEffect) == 0x000430, "Member 'US38P01::_exposedEffect' has a wrong offset!");
static_assert(offsetof(US38P01, _exposedDuration) == 0x000438, "Member 'US38P01::_exposedDuration' has a wrong offset!");
static_assert(offsetof(US38P01, _hasteStatusEffectClass) == 0x000440, "Member 'US38P01::_hasteStatusEffectClass' has a wrong offset!");
static_assert(offsetof(US38P01, _hasteEffect) == 0x000448, "Member 'US38P01::_hasteEffect' has a wrong offset!");
static_assert(offsetof(US38P01, _hasteAmount) == 0x000450, "Member 'US38P01::_hasteAmount' has a wrong offset!");
static_assert(offsetof(US38P01, _hasteDuration) == 0x000454, "Member 'US38P01::_hasteDuration' has a wrong offset!");
static_assert(offsetof(US38P01, _exhaustionEffectClass) == 0x000458, "Member 'US38P01::_exhaustionEffectClass' has a wrong offset!");
static_assert(offsetof(US38P01, _exhaustionEffect) == 0x000460, "Member 'US38P01::_exhaustionEffect' has a wrong offset!");
static_assert(offsetof(US38P01, _exhaustionDuration) == 0x000468, "Member 'US38P01::_exhaustionDuration' has a wrong offset!");
static_assert(offsetof(US38P01, _collectableClasses) == 0x000478, "Member 'US38P01::_collectableClasses' has a wrong offset!");
static_assert(offsetof(US38P01, _unsupportedItemAddons) == 0x000488, "Member 'US38P01::_unsupportedItemAddons' has a wrong offset!");
static_assert(offsetof(US38P01, _interactionBP) == 0x000498, "Member 'US38P01::_interactionBP' has a wrong offset!");
static_assert(offsetof(US38P01, _animationDuration) == 0x0004A0, "Member 'US38P01::_animationDuration' has a wrong offset!");

// Class TheS38.S38P01Interaction
// 0x0010 (0x0790 - 0x0780)
class US38P01Interaction final : public UInteractionDefinition
{
public:
	uint8                                         Pad_778[0x18];                                     // 0x0778(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P01Interaction">();
	}
	static class US38P01Interaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P01Interaction>();
	}
};
static_assert(alignof(US38P01Interaction) == 0x000010, "Wrong alignment on US38P01Interaction");
static_assert(sizeof(US38P01Interaction) == 0x000790, "Wrong size on US38P01Interaction");

// Class TheS38.S38P02
// 0x00D0 (0x04F0 - 0x0420)
class US38P02 final : public UPerk
{
public:
	float                                         _percentChanceOfDoubleScream;                      // 0x0420(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _interactionsNotToInterrupt;                       // 0x0428(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UStatusEffect>              _perkStatusEffectClass;                            // 0x0448(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _perkStatusEffect;                                 // 0x0450(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _auraStatusEffectClass;                            // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _auraDuration[0x3];                                // 0x0460(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _extraAuraDurationPerExtraScream;                  // 0x046C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _screamDuration;                                   // 0x0470(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minRandomScreamDelay;                             // 0x0474(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _maxRandomScreamDelay;                             // 0x0478(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _maxScreamCount;                                   // 0x047C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _cooldownDuration;                                 // 0x0480(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _preventInteractionDuration;                       // 0x0484(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x68];                                     // 0x0488(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnIsApplicableChanged(class UGameplayModifierContainer* Container, bool Param_IsApplicable);
	void Multicast_MakeSurvivorScream(const int32 TimesToScream);
	void OnSurvivorScream();

	float GetAuraDurationAtLevel() const;
	float GetCooldownDuration() const;
	float GetExtraAuraDurationPerExtraScream() const;
	float GetMaxRandomScreamDelay() const;
	int32 GetMaxScreamCount() const;
	float GetMinRandomScreamDelay() const;
	float GetScreamDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P02">();
	}
	static class US38P02* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P02>();
	}
};
static_assert(alignof(US38P02) == 0x000008, "Wrong alignment on US38P02");
static_assert(sizeof(US38P02) == 0x0004F0, "Wrong size on US38P02");
static_assert(offsetof(US38P02, _percentChanceOfDoubleScream) == 0x000420, "Member 'US38P02::_percentChanceOfDoubleScream' has a wrong offset!");
static_assert(offsetof(US38P02, _interactionsNotToInterrupt) == 0x000428, "Member 'US38P02::_interactionsNotToInterrupt' has a wrong offset!");
static_assert(offsetof(US38P02, _perkStatusEffectClass) == 0x000448, "Member 'US38P02::_perkStatusEffectClass' has a wrong offset!");
static_assert(offsetof(US38P02, _perkStatusEffect) == 0x000450, "Member 'US38P02::_perkStatusEffect' has a wrong offset!");
static_assert(offsetof(US38P02, _auraStatusEffectClass) == 0x000458, "Member 'US38P02::_auraStatusEffectClass' has a wrong offset!");
static_assert(offsetof(US38P02, _auraDuration) == 0x000460, "Member 'US38P02::_auraDuration' has a wrong offset!");
static_assert(offsetof(US38P02, _extraAuraDurationPerExtraScream) == 0x00046C, "Member 'US38P02::_extraAuraDurationPerExtraScream' has a wrong offset!");
static_assert(offsetof(US38P02, _screamDuration) == 0x000470, "Member 'US38P02::_screamDuration' has a wrong offset!");
static_assert(offsetof(US38P02, _minRandomScreamDelay) == 0x000474, "Member 'US38P02::_minRandomScreamDelay' has a wrong offset!");
static_assert(offsetof(US38P02, _maxRandomScreamDelay) == 0x000478, "Member 'US38P02::_maxRandomScreamDelay' has a wrong offset!");
static_assert(offsetof(US38P02, _maxScreamCount) == 0x00047C, "Member 'US38P02::_maxScreamCount' has a wrong offset!");
static_assert(offsetof(US38P02, _cooldownDuration) == 0x000480, "Member 'US38P02::_cooldownDuration' has a wrong offset!");
static_assert(offsetof(US38P02, _preventInteractionDuration) == 0x000484, "Member 'US38P02::_preventInteractionDuration' has a wrong offset!");

// Class TheS38.S38P02StatusEffect
// 0x0010 (0x0390 - 0x0380)
class US38P02StatusEffect final : public UStatusEffect
{
public:
	class FName                                   _headJointName;                                    // 0x0380(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P02StatusEffect">();
	}
	static class US38P02StatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P02StatusEffect>();
	}
};
static_assert(alignof(US38P02StatusEffect) == 0x000008, "Wrong alignment on US38P02StatusEffect");
static_assert(sizeof(US38P02StatusEffect) == 0x000390, "Wrong size on US38P02StatusEffect");
static_assert(offsetof(US38P02StatusEffect, _headJointName) == 0x000380, "Member 'US38P02StatusEffect::_headJointName' has a wrong offset!");

// Class TheS38.S38P03
// 0x0030 (0x0450 - 0x0420)
class US38P03 final : public UPerk
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _onGroundEffectClass;                              // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteDuration[0x3];                               // 0x0430(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class US38P03Interaction>         _interactionBP;                                    // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractionDefinition*                 _perkInteraction;                                  // 0x0448(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnExitGatesPowered(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Authority_OnPerkActivated(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Authority_OnPickSelfUp(const struct FGameplayTag& GameplayTag, const struct FGameEventData& GameEventData);

	float GetHasteDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P03">();
	}
	static class US38P03* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P03>();
	}
};
static_assert(alignof(US38P03) == 0x000008, "Wrong alignment on US38P03");
static_assert(sizeof(US38P03) == 0x000450, "Wrong size on US38P03");
static_assert(offsetof(US38P03, _onGroundEffectClass) == 0x000428, "Member 'US38P03::_onGroundEffectClass' has a wrong offset!");
static_assert(offsetof(US38P03, _hasteDuration) == 0x000430, "Member 'US38P03::_hasteDuration' has a wrong offset!");
static_assert(offsetof(US38P03, _interactionBP) == 0x000440, "Member 'US38P03::_interactionBP' has a wrong offset!");
static_assert(offsetof(US38P03, _perkInteraction) == 0x000448, "Member 'US38P03::_perkInteraction' has a wrong offset!");

// Class TheS38.S38P03Interaction
// 0x0000 (0x0780 - 0x0780)
class US38P03Interaction final : public UInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P03Interaction">();
	}
	static class US38P03Interaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P03Interaction>();
	}
};
static_assert(alignof(US38P03Interaction) == 0x000010, "Wrong alignment on US38P03Interaction");
static_assert(sizeof(US38P03Interaction) == 0x000780, "Wrong size on US38P03Interaction");

// Class TheS38.S38P03OnGroundStatusEffect
// 0x0050 (0x03D0 - 0x0380)
class US38P03OnGroundStatusEffect final : public UStatusEffect
{
public:
	TSubclassOf<class UStatusEffect>              _hasteStatusEffectClass;                           // 0x0380(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hastePercentage;                                  // 0x0388(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatusEffect*                          _hasteStatusEffect;                                // 0x0390(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_398[0x38];                                     // 0x0398(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_HealSelf();
	void Authority_OnCamperHealthChange(ECamperDamageState OldDamageState, ECamperDamageState NewDamageState);
	void Authority_OnPickSelfUp(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S38P03OnGroundStatusEffect">();
	}
	static class US38P03OnGroundStatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<US38P03OnGroundStatusEffect>();
	}
};
static_assert(alignof(US38P03OnGroundStatusEffect) == 0x000008, "Wrong alignment on US38P03OnGroundStatusEffect");
static_assert(sizeof(US38P03OnGroundStatusEffect) == 0x0003D0, "Wrong size on US38P03OnGroundStatusEffect");
static_assert(offsetof(US38P03OnGroundStatusEffect, _hasteStatusEffectClass) == 0x000380, "Member 'US38P03OnGroundStatusEffect::_hasteStatusEffectClass' has a wrong offset!");
static_assert(offsetof(US38P03OnGroundStatusEffect, _hastePercentage) == 0x000388, "Member 'US38P03OnGroundStatusEffect::_hastePercentage' has a wrong offset!");
static_assert(offsetof(US38P03OnGroundStatusEffect, _hasteStatusEffect) == 0x000390, "Member 'US38P03OnGroundStatusEffect::_hasteStatusEffect' has a wrong offset!");

// Class TheS38.SurvivorPerkAnimInstance
// 0x0040 (0x0620 - 0x05E0)
class USurvivorPerkAnimInstance : public UBaseSurvivorAnimInstance
{
public:
	struct FGameplayTagContainer                  _tagsToTriggerAnimation;                           // 0x05E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           _animationSequenceTag;                             // 0x0600(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          _animationSequence;                                // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsInPerkInteraction;                               // 0x0618(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SurvivorPerkAnimInstance">();
	}
	static class USurvivorPerkAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorPerkAnimInstance>();
	}
};
static_assert(alignof(USurvivorPerkAnimInstance) == 0x000010, "Wrong alignment on USurvivorPerkAnimInstance");
static_assert(sizeof(USurvivorPerkAnimInstance) == 0x000620, "Wrong size on USurvivorPerkAnimInstance");
static_assert(offsetof(USurvivorPerkAnimInstance, _tagsToTriggerAnimation) == 0x0005E0, "Member 'USurvivorPerkAnimInstance::_tagsToTriggerAnimation' has a wrong offset!");
static_assert(offsetof(USurvivorPerkAnimInstance, _animationSequenceTag) == 0x000600, "Member 'USurvivorPerkAnimInstance::_animationSequenceTag' has a wrong offset!");
static_assert(offsetof(USurvivorPerkAnimInstance, _animationSequence) == 0x000610, "Member 'USurvivorPerkAnimInstance::_animationSequence' has a wrong offset!");
static_assert(offsetof(USurvivorPerkAnimInstance, IsInPerkInteraction) == 0x000618, "Member 'USurvivorPerkAnimInstance::IsInPerkInteraction' has a wrong offset!");

}

