#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS05

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS05.BalancedLanding.GetExhaustionDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct BalancedLanding_GetExhaustionDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BalancedLanding_GetExhaustionDurationAtLevel) == 0x000004, "Wrong alignment on BalancedLanding_GetExhaustionDurationAtLevel");
static_assert(sizeof(BalancedLanding_GetExhaustionDurationAtLevel) == 0x000004, "Wrong size on BalancedLanding_GetExhaustionDurationAtLevel");
static_assert(offsetof(BalancedLanding_GetExhaustionDurationAtLevel, ReturnValue) == 0x000000, "Member 'BalancedLanding_GetExhaustionDurationAtLevel::ReturnValue' has a wrong offset!");

// Function TheS05.BalancedLanding.GetSprintDuration
// 0x0004 (0x0004 - 0x0000)
struct BalancedLanding_GetSprintDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BalancedLanding_GetSprintDuration) == 0x000004, "Wrong alignment on BalancedLanding_GetSprintDuration");
static_assert(sizeof(BalancedLanding_GetSprintDuration) == 0x000004, "Wrong size on BalancedLanding_GetSprintDuration");
static_assert(offsetof(BalancedLanding_GetSprintDuration, ReturnValue) == 0x000000, "Member 'BalancedLanding_GetSprintDuration::ReturnValue' has a wrong offset!");

// Function TheS05.StreetwiseEffect.Authority_OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct StreetwiseEffect_Authority_OnInRangeChanged final
{
public:
	bool                                          InRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreetwiseEffect_Authority_OnInRangeChanged) == 0x000001, "Wrong alignment on StreetwiseEffect_Authority_OnInRangeChanged");
static_assert(sizeof(StreetwiseEffect_Authority_OnInRangeChanged) == 0x000001, "Wrong size on StreetwiseEffect_Authority_OnInRangeChanged");
static_assert(offsetof(StreetwiseEffect_Authority_OnInRangeChanged, InRange) == 0x000000, "Member 'StreetwiseEffect_Authority_OnInRangeChanged::InRange' has a wrong offset!");

}

