#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS33

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TheS33.S33P02.Local_EffectTriggered
// 0x0060 (0x0060 - 0x0000)
struct S33P02_Local_EffectTriggered final
{
public:
	struct FTransform                             Location;                                          // 0x0000(0x0060)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S33P02_Local_EffectTriggered) == 0x000010, "Wrong alignment on S33P02_Local_EffectTriggered");
static_assert(sizeof(S33P02_Local_EffectTriggered) == 0x000060, "Wrong size on S33P02_Local_EffectTriggered");
static_assert(offsetof(S33P02_Local_EffectTriggered, Location) == 0x000000, "Member 'S33P02_Local_EffectTriggered::Location' has a wrong offset!");

// Function TheS33.S33P02.GetStruggleProgressionAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S33P02_GetStruggleProgressionAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S33P02_GetStruggleProgressionAtLevel) == 0x000004, "Wrong alignment on S33P02_GetStruggleProgressionAtLevel");
static_assert(sizeof(S33P02_GetStruggleProgressionAtLevel) == 0x000004, "Wrong size on S33P02_GetStruggleProgressionAtLevel");
static_assert(offsetof(S33P02_GetStruggleProgressionAtLevel, ReturnValue) == 0x000000, "Member 'S33P02_GetStruggleProgressionAtLevel::ReturnValue' has a wrong offset!");

// Function TheS33.S33P03.GetSkillCheckBonusPercentPerTokenAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S33P03_GetSkillCheckBonusPercentPerTokenAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S33P03_GetSkillCheckBonusPercentPerTokenAtLevel) == 0x000004, "Wrong alignment on S33P03_GetSkillCheckBonusPercentPerTokenAtLevel");
static_assert(sizeof(S33P03_GetSkillCheckBonusPercentPerTokenAtLevel) == 0x000004, "Wrong size on S33P03_GetSkillCheckBonusPercentPerTokenAtLevel");
static_assert(offsetof(S33P03_GetSkillCheckBonusPercentPerTokenAtLevel, ReturnValue) == 0x000000, "Member 'S33P03_GetSkillCheckBonusPercentPerTokenAtLevel::ReturnValue' has a wrong offset!");

// Function TheS33.S33P03.GetSkillCheckCursorSpeedPerToken
// 0x0004 (0x0004 - 0x0000)
struct S33P03_GetSkillCheckCursorSpeedPerToken final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S33P03_GetSkillCheckCursorSpeedPerToken) == 0x000004, "Wrong alignment on S33P03_GetSkillCheckCursorSpeedPerToken");
static_assert(sizeof(S33P03_GetSkillCheckCursorSpeedPerToken) == 0x000004, "Wrong size on S33P03_GetSkillCheckCursorSpeedPerToken");
static_assert(offsetof(S33P03_GetSkillCheckCursorSpeedPerToken, ReturnValue) == 0x000000, "Member 'S33P03_GetSkillCheckCursorSpeedPerToken::ReturnValue' has a wrong offset!");

// Function TheS33.S33P03.GetSkillCheckTriggerPercentPerToken
// 0x0004 (0x0004 - 0x0000)
struct S33P03_GetSkillCheckTriggerPercentPerToken final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S33P03_GetSkillCheckTriggerPercentPerToken) == 0x000004, "Wrong alignment on S33P03_GetSkillCheckTriggerPercentPerToken");
static_assert(sizeof(S33P03_GetSkillCheckTriggerPercentPerToken) == 0x000004, "Wrong size on S33P03_GetSkillCheckTriggerPercentPerToken");
static_assert(offsetof(S33P03_GetSkillCheckTriggerPercentPerToken, ReturnValue) == 0x000000, "Member 'S33P03_GetSkillCheckTriggerPercentPerToken::ReturnValue' has a wrong offset!");

}

