#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS09

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class TheS09.Alert
// 0x0020 (0x0440 - 0x0420)
class UAlert final : public UPerk
{
public:
	float                                         _killerAuraRevealDuration[0x3];                    // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatusEffect*                          _alertKillerRevealEffect;                          // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _alertKillerRevealEffectClass;                     // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPerkActivate_Cosmetic();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Alert">();
	}
	static class UAlert* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlert>();
	}
};
static_assert(alignof(UAlert) == 0x000008, "Wrong alignment on UAlert");
static_assert(sizeof(UAlert) == 0x000440, "Wrong size on UAlert");
static_assert(offsetof(UAlert, _killerAuraRevealDuration) == 0x000420, "Member 'UAlert::_killerAuraRevealDuration' has a wrong offset!");
static_assert(offsetof(UAlert, _alertKillerRevealEffect) == 0x000430, "Member 'UAlert::_alertKillerRevealEffect' has a wrong offset!");
static_assert(offsetof(UAlert, _alertKillerRevealEffectClass) == 0x000438, "Member 'UAlert::_alertKillerRevealEffectClass' has a wrong offset!");

// Class TheS09.Lithe
// 0x0018 (0x0438 - 0x0420)
class ULithe final : public UPerk
{
public:
	TSubclassOf<class UStatusEffect>              _exhaustedStatusEffectClass;                       // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _movementSpeedStatusEffectClass;                   // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _movementSpeedPercentage;                          // 0x0430(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _movementSpeedDuration;                            // 0x0434(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	const float GetMovementSpeedDuration();
	const float GetMovementSpeedPercentage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Lithe">();
	}
	static class ULithe* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULithe>();
	}
};
static_assert(alignof(ULithe) == 0x000008, "Wrong alignment on ULithe");
static_assert(sizeof(ULithe) == 0x000438, "Wrong size on ULithe");
static_assert(offsetof(ULithe, _exhaustedStatusEffectClass) == 0x000420, "Member 'ULithe::_exhaustedStatusEffectClass' has a wrong offset!");
static_assert(offsetof(ULithe, _movementSpeedStatusEffectClass) == 0x000428, "Member 'ULithe::_movementSpeedStatusEffectClass' has a wrong offset!");
static_assert(offsetof(ULithe, _movementSpeedPercentage) == 0x000430, "Member 'ULithe::_movementSpeedPercentage' has a wrong offset!");
static_assert(offsetof(ULithe, _movementSpeedDuration) == 0x000434, "Member 'ULithe::_movementSpeedDuration' has a wrong offset!");

}

