#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS35

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS35.S35P01.GetCooldownDurationSeconds
// 0x0004 (0x0004 - 0x0000)
struct S35P01_GetCooldownDurationSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S35P01_GetCooldownDurationSeconds) == 0x000004, "Wrong alignment on S35P01_GetCooldownDurationSeconds");
static_assert(sizeof(S35P01_GetCooldownDurationSeconds) == 0x000004, "Wrong size on S35P01_GetCooldownDurationSeconds");
static_assert(offsetof(S35P01_GetCooldownDurationSeconds, ReturnValue) == 0x000000, "Member 'S35P01_GetCooldownDurationSeconds::ReturnValue' has a wrong offset!");

// Function TheS35.S35P01.GetFastVaultsTimeSecondsAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S35P01_GetFastVaultsTimeSecondsAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S35P01_GetFastVaultsTimeSecondsAtLevel) == 0x000004, "Wrong alignment on S35P01_GetFastVaultsTimeSecondsAtLevel");
static_assert(sizeof(S35P01_GetFastVaultsTimeSecondsAtLevel) == 0x000004, "Wrong size on S35P01_GetFastVaultsTimeSecondsAtLevel");
static_assert(offsetof(S35P01_GetFastVaultsTimeSecondsAtLevel, ReturnValue) == 0x000000, "Member 'S35P01_GetFastVaultsTimeSecondsAtLevel::ReturnValue' has a wrong offset!");

// Function TheS35.S35P02.GetHasteEffectDurationAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S35P02_GetHasteEffectDurationAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S35P02_GetHasteEffectDurationAtLevel) == 0x000004, "Wrong alignment on S35P02_GetHasteEffectDurationAtLevel");
static_assert(sizeof(S35P02_GetHasteEffectDurationAtLevel) == 0x000004, "Wrong size on S35P02_GetHasteEffectDurationAtLevel");
static_assert(offsetof(S35P02_GetHasteEffectDurationAtLevel, ReturnValue) == 0x000000, "Member 'S35P02_GetHasteEffectDurationAtLevel::ReturnValue' has a wrong offset!");

}

