#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS33

#include "Basic.hpp"

#include "DBDCompetence_classes.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class TheS33.ReassuranceCondition
// 0x0050 (0x0228 - 0x01D8)
class UReassuranceCondition final : public UIsInRangeOfHookedSurvivor
{
public:
	uint8                                         Pad_1D8[0x50];                                     // 0x01D8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReassuranceCondition">();
	}
	static class UReassuranceCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReassuranceCondition>();
	}
};
static_assert(alignof(UReassuranceCondition) == 0x000008, "Wrong alignment on UReassuranceCondition");
static_assert(sizeof(UReassuranceCondition) == 0x000228, "Wrong size on UReassuranceCondition");

// Class TheS33.S33P01
// 0x0018 (0x0438 - 0x0420)
class US33P01 final : public UPerk
{
public:
	TSubclassOf<class UStatusEffect>              _S33P01StatusEffect;                               // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _interactionProgressionAmount[0x3];                // 0x0428(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S33P01">();
	}
	static class US33P01* GetDefaultObj()
	{
		return GetDefaultObjImpl<US33P01>();
	}
};
static_assert(alignof(US33P01) == 0x000008, "Wrong alignment on US33P01");
static_assert(sizeof(US33P01) == 0x000438, "Wrong size on US33P01");
static_assert(offsetof(US33P01, _S33P01StatusEffect) == 0x000420, "Member 'US33P01::_S33P01StatusEffect' has a wrong offset!");
static_assert(offsetof(US33P01, _interactionProgressionAmount) == 0x000428, "Member 'US33P01::_interactionProgressionAmount' has a wrong offset!");

// Class TheS33.S33P01StatusEffect
// 0x0008 (0x0388 - 0x0380)
class US33P01StatusEffect final : public UStatusEffect
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S33P01StatusEffect">();
	}
	static class US33P01StatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<US33P01StatusEffect>();
	}
};
static_assert(alignof(US33P01StatusEffect) == 0x000008, "Wrong alignment on US33P01StatusEffect");
static_assert(sizeof(US33P01StatusEffect) == 0x000388, "Wrong size on US33P01StatusEffect");

// Class TheS33.S33P02
// 0x0048 (0x0468 - 0x0420)
class US33P02 final : public UPerk
{
public:
	float                                         _distanceRadius;                                   // 0x0420(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _struggleProgressionPausedDuration[0x3];           // 0x0424(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _S33P02StatusEffect;                               // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ACamperPlayer*>                  _reassuredSurvivors;                               // 0x0438(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x10];                                     // 0x0448(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class US33P02Interaction>         _S33P02Interaction;                                // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInteractionAttacherComponent*          _interactionAttacherComponent;                     // 0x0460(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Local_EffectTriggered(const struct FTransform& Location);
	void OnRep_ReassuredSurvivors();

	float GetStruggleProgressionAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S33P02">();
	}
	static class US33P02* GetDefaultObj()
	{
		return GetDefaultObjImpl<US33P02>();
	}
};
static_assert(alignof(US33P02) == 0x000008, "Wrong alignment on US33P02");
static_assert(sizeof(US33P02) == 0x000468, "Wrong size on US33P02");
static_assert(offsetof(US33P02, _distanceRadius) == 0x000420, "Member 'US33P02::_distanceRadius' has a wrong offset!");
static_assert(offsetof(US33P02, _struggleProgressionPausedDuration) == 0x000424, "Member 'US33P02::_struggleProgressionPausedDuration' has a wrong offset!");
static_assert(offsetof(US33P02, _S33P02StatusEffect) == 0x000430, "Member 'US33P02::_S33P02StatusEffect' has a wrong offset!");
static_assert(offsetof(US33P02, _reassuredSurvivors) == 0x000438, "Member 'US33P02::_reassuredSurvivors' has a wrong offset!");
static_assert(offsetof(US33P02, _S33P02Interaction) == 0x000458, "Member 'US33P02::_S33P02Interaction' has a wrong offset!");
static_assert(offsetof(US33P02, _interactionAttacherComponent) == 0x000460, "Member 'US33P02::_interactionAttacherComponent' has a wrong offset!");

// Class TheS33.S33P02Interaction
// 0x0000 (0x0780 - 0x0780)
class US33P02Interaction final : public UInteractionDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S33P02Interaction">();
	}
	static class US33P02Interaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<US33P02Interaction>();
	}
};
static_assert(alignof(US33P02Interaction) == 0x000010, "Wrong alignment on US33P02Interaction");
static_assert(sizeof(US33P02Interaction) == 0x000780, "Wrong size on US33P02Interaction");

// Class TheS33.S33p02StatusEffect
// 0x0008 (0x0388 - 0x0380)
class US33p02StatusEffect final : public UStatusEffect
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S33p02StatusEffect">();
	}
	static class US33p02StatusEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<US33p02StatusEffect>();
	}
};
static_assert(alignof(US33p02StatusEffect) == 0x000008, "Wrong alignment on US33p02StatusEffect");
static_assert(sizeof(US33p02StatusEffect) == 0x000388, "Wrong size on US33p02StatusEffect");

// Class TheS33.S33P03
// 0x0030 (0x0450 - 0x0420)
class US33P03 final : public UPerk
{
public:
	float                                         _skillCheckTriggerPercentPerToken;                 // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _skillCheckCursorSpeedPerToken;                    // 0x0424(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _skillCheckBonusPercentPerToken[0x3];              // 0x0428(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x1C];                                     // 0x0434(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetSkillCheckBonusPercentPerTokenAtLevel();
	float GetSkillCheckCursorSpeedPerToken();
	float GetSkillCheckTriggerPercentPerToken();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S33P03">();
	}
	static class US33P03* GetDefaultObj()
	{
		return GetDefaultObjImpl<US33P03>();
	}
};
static_assert(alignof(US33P03) == 0x000008, "Wrong alignment on US33P03");
static_assert(sizeof(US33P03) == 0x000450, "Wrong size on US33P03");
static_assert(offsetof(US33P03, _skillCheckTriggerPercentPerToken) == 0x000420, "Member 'US33P03::_skillCheckTriggerPercentPerToken' has a wrong offset!");
static_assert(offsetof(US33P03, _skillCheckCursorSpeedPerToken) == 0x000424, "Member 'US33P03::_skillCheckCursorSpeedPerToken' has a wrong offset!");
static_assert(offsetof(US33P03, _skillCheckBonusPercentPerToken) == 0x000428, "Member 'US33P03::_skillCheckBonusPercentPerToken' has a wrong offset!");

}

