#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS22

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class TheS22.BloodPact
// 0x0098 (0x04B8 - 0x0420)
class UBloodPact final : public UPerk
{
public:
	uint8                                         Pad_420[0x18];                                     // 0x0420(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _fullHealthStateOnly;                              // 0x0438(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _hasteEffectRange;                                 // 0x043C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteEffectMovementSpeedIncrease[0x3];            // 0x0440(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _bloodPactRevealEffect_Obsession;                  // 0x0450(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _bloodPactRevealEffect_Owner;                      // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _bloodPactHasteEffect;                             // 0x0460(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _decreaseObsessionChanceEffect;                    // 0x0468(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _ownerStatusEffect;                                // 0x0470(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _obsessionStatusEffect;                            // 0x0478(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _ownerHasteStatusEffect;                           // 0x0480(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _otherPlayerHasteStatusEffect;                     // 0x0488(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _otherPlayer;                                      // 0x0490(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_498[0x20];                                     // 0x0498(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnInRangeChanged(const bool InRange);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BloodPact">();
	}
	static class UBloodPact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBloodPact>();
	}
};
static_assert(alignof(UBloodPact) == 0x000008, "Wrong alignment on UBloodPact");
static_assert(sizeof(UBloodPact) == 0x0004B8, "Wrong size on UBloodPact");
static_assert(offsetof(UBloodPact, _fullHealthStateOnly) == 0x000438, "Member 'UBloodPact::_fullHealthStateOnly' has a wrong offset!");
static_assert(offsetof(UBloodPact, _hasteEffectRange) == 0x00043C, "Member 'UBloodPact::_hasteEffectRange' has a wrong offset!");
static_assert(offsetof(UBloodPact, _hasteEffectMovementSpeedIncrease) == 0x000440, "Member 'UBloodPact::_hasteEffectMovementSpeedIncrease' has a wrong offset!");
static_assert(offsetof(UBloodPact, _bloodPactRevealEffect_Obsession) == 0x000450, "Member 'UBloodPact::_bloodPactRevealEffect_Obsession' has a wrong offset!");
static_assert(offsetof(UBloodPact, _bloodPactRevealEffect_Owner) == 0x000458, "Member 'UBloodPact::_bloodPactRevealEffect_Owner' has a wrong offset!");
static_assert(offsetof(UBloodPact, _bloodPactHasteEffect) == 0x000460, "Member 'UBloodPact::_bloodPactHasteEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _decreaseObsessionChanceEffect) == 0x000468, "Member 'UBloodPact::_decreaseObsessionChanceEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _ownerStatusEffect) == 0x000470, "Member 'UBloodPact::_ownerStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _obsessionStatusEffect) == 0x000478, "Member 'UBloodPact::_obsessionStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _ownerHasteStatusEffect) == 0x000480, "Member 'UBloodPact::_ownerHasteStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _otherPlayerHasteStatusEffect) == 0x000488, "Member 'UBloodPact::_otherPlayerHasteStatusEffect' has a wrong offset!");
static_assert(offsetof(UBloodPact, _otherPlayer) == 0x000490, "Member 'UBloodPact::_otherPlayer' has a wrong offset!");

// Class TheS22.RepressedAlliance
// 0x0078 (0x0498 - 0x0420)
class URepressedAlliance final : public UPerk
{
public:
	float                                         _repairTimesNeededToActivate[0x3];                 // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _generatorBlockDuration;                           // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSecondaryInteractionProperties        _secondaryActionProperties;                        // 0x0430(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UInteractionDefinition*                 _currentRepairInteractionWithAbility;              // 0x0468(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_470[0x18];                                     // 0x0470(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AGenerator*                             _blockedGenerator;                                 // 0x0488(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0x8];                                      // 0x0490(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_BlockedGenerator(class AGenerator* OldGenerator);
	void OnRep_CurrentRepairInteractionWithAbility(class UInteractionDefinition* OldRepairInteraction);
	void Server_OnActionInputPressed(class AGenerator* Generator);

	float GetGeneratorBlockDuration() const;
	float GetRepairTimesNeededToActivateAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RepressedAlliance">();
	}
	static class URepressedAlliance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URepressedAlliance>();
	}
};
static_assert(alignof(URepressedAlliance) == 0x000008, "Wrong alignment on URepressedAlliance");
static_assert(sizeof(URepressedAlliance) == 0x000498, "Wrong size on URepressedAlliance");
static_assert(offsetof(URepressedAlliance, _repairTimesNeededToActivate) == 0x000420, "Member 'URepressedAlliance::_repairTimesNeededToActivate' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _generatorBlockDuration) == 0x00042C, "Member 'URepressedAlliance::_generatorBlockDuration' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _secondaryActionProperties) == 0x000430, "Member 'URepressedAlliance::_secondaryActionProperties' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _currentRepairInteractionWithAbility) == 0x000468, "Member 'URepressedAlliance::_currentRepairInteractionWithAbility' has a wrong offset!");
static_assert(offsetof(URepressedAlliance, _blockedGenerator) == 0x000488, "Member 'URepressedAlliance::_blockedGenerator' has a wrong offset!");

// Class TheS22.SoulGuard
// 0x0030 (0x0450 - 0x0420)
class USoulGuard final : public UPerk
{
public:
	float                                         _cooldownLevels[0x3];                              // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _enduranceEffectClass;                             // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _recover;                                          // 0x0438(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _enduranceEffectDuration[0x3];                     // 0x043C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnSurvivorHealed(const struct FCamperHealResult& HealResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoulGuard">();
	}
	static class USoulGuard* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoulGuard>();
	}
};
static_assert(alignof(USoulGuard) == 0x000008, "Wrong alignment on USoulGuard");
static_assert(sizeof(USoulGuard) == 0x000450, "Wrong size on USoulGuard");
static_assert(offsetof(USoulGuard, _cooldownLevels) == 0x000420, "Member 'USoulGuard::_cooldownLevels' has a wrong offset!");
static_assert(offsetof(USoulGuard, _enduranceEffectClass) == 0x000430, "Member 'USoulGuard::_enduranceEffectClass' has a wrong offset!");
static_assert(offsetof(USoulGuard, _recover) == 0x000438, "Member 'USoulGuard::_recover' has a wrong offset!");
static_assert(offsetof(USoulGuard, _enduranceEffectDuration) == 0x00043C, "Member 'USoulGuard::_enduranceEffectDuration' has a wrong offset!");

}

