#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS12

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NetworkUtilities_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class TheS12.DetectivesHunch
// 0x0268 (0x0688 - 0x0420)
class UDetectivesHunch final : public UPerk
{
public:
	TSet<TSoftClassPtr<class UClass>>             _interactableClasses;                              // 0x0420(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         _revealRanges[0x3];                                // 0x0470(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _revealDuration;                                   // 0x047C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class AActor*, struct FTimerHandle>      _actorToTimerMap;                                  // 0x0480(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D0[0x50];                                     // 0x04D0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectFastArray                       _revealedActors;                                   // 0x0520(0x0148)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_668[0x20];                                     // 0x0668(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetRevealDuration() const;
	float GetRevealRangeAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DetectivesHunch">();
	}
	static class UDetectivesHunch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDetectivesHunch>();
	}
};
static_assert(alignof(UDetectivesHunch) == 0x000008, "Wrong alignment on UDetectivesHunch");
static_assert(sizeof(UDetectivesHunch) == 0x000688, "Wrong size on UDetectivesHunch");
static_assert(offsetof(UDetectivesHunch, _interactableClasses) == 0x000420, "Member 'UDetectivesHunch::_interactableClasses' has a wrong offset!");
static_assert(offsetof(UDetectivesHunch, _revealRanges) == 0x000470, "Member 'UDetectivesHunch::_revealRanges' has a wrong offset!");
static_assert(offsetof(UDetectivesHunch, _revealDuration) == 0x00047C, "Member 'UDetectivesHunch::_revealDuration' has a wrong offset!");
static_assert(offsetof(UDetectivesHunch, _actorToTimerMap) == 0x000480, "Member 'UDetectivesHunch::_actorToTimerMap' has a wrong offset!");
static_assert(offsetof(UDetectivesHunch, _revealedActors) == 0x000520, "Member 'UDetectivesHunch::_revealedActors' has a wrong offset!");

}

