#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS25

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class TheS25.FastTrack
// 0x0018 (0x0438 - 0x0420)
class UFastTrack final : public UPerk
{
public:
	int32                                         _tokensToAdd[0x3];                                 // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0xC];                                      // 0x042C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnTokenCountDecreased();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FastTrack">();
	}
	static class UFastTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastTrack>();
	}
};
static_assert(alignof(UFastTrack) == 0x000008, "Wrong alignment on UFastTrack");
static_assert(sizeof(UFastTrack) == 0x000438, "Wrong size on UFastTrack");
static_assert(offsetof(UFastTrack, _tokensToAdd) == 0x000420, "Member 'UFastTrack::_tokensToAdd' has a wrong offset!");

// Class TheS25.SelfPreservation
// 0x0018 (0x0438 - 0x0420)
class USelfPreservation final : public UPerk
{
public:
	float                                         _hitDistanceToTriggerPerkEffect[0x3];              // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _selfPreservationEffectDuration[0x3];              // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetHitDistanceToTriggerPerkEffect() const;
	float GetSelfPreservationEffectDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelfPreservation">();
	}
	static class USelfPreservation* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfPreservation>();
	}
};
static_assert(alignof(USelfPreservation) == 0x000008, "Wrong alignment on USelfPreservation");
static_assert(sizeof(USelfPreservation) == 0x000438, "Wrong size on USelfPreservation");
static_assert(offsetof(USelfPreservation, _hitDistanceToTriggerPerkEffect) == 0x000420, "Member 'USelfPreservation::_hitDistanceToTriggerPerkEffect' has a wrong offset!");
static_assert(offsetof(USelfPreservation, _selfPreservationEffectDuration) == 0x00042C, "Member 'USelfPreservation::_selfPreservationEffectDuration' has a wrong offset!");

// Class TheS25.SmashHit
// 0x0030 (0x0450 - 0x0420)
class USmashHit final : public UPerk
{
public:
	float                                         _exhaustedTime[0x3];                               // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteTime;                                        // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _hasteValue;                                       // 0x0430(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _exhaustedEffect;                                  // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _hasteEffect;                                      // 0x0440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEnum*                                  StunTypeEnum;                                      // 0x0448(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmashHit">();
	}
	static class USmashHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmashHit>();
	}
};
static_assert(alignof(USmashHit) == 0x000008, "Wrong alignment on USmashHit");
static_assert(sizeof(USmashHit) == 0x000450, "Wrong size on USmashHit");
static_assert(offsetof(USmashHit, _exhaustedTime) == 0x000420, "Member 'USmashHit::_exhaustedTime' has a wrong offset!");
static_assert(offsetof(USmashHit, _hasteTime) == 0x00042C, "Member 'USmashHit::_hasteTime' has a wrong offset!");
static_assert(offsetof(USmashHit, _hasteValue) == 0x000430, "Member 'USmashHit::_hasteValue' has a wrong offset!");
static_assert(offsetof(USmashHit, _exhaustedEffect) == 0x000438, "Member 'USmashHit::_exhaustedEffect' has a wrong offset!");
static_assert(offsetof(USmashHit, _hasteEffect) == 0x000440, "Member 'USmashHit::_hasteEffect' has a wrong offset!");
static_assert(offsetof(USmashHit, StunTypeEnum) == 0x000448, "Member 'USmashHit::StunTypeEnum' has a wrong offset!");

}

