#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheShape

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheShape.SaveTheBestForLast.GetCooldownPerToken
// 0x0004 (0x0004 - 0x0000)
struct SaveTheBestForLast_GetCooldownPerToken final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SaveTheBestForLast_GetCooldownPerToken) == 0x000004, "Wrong alignment on SaveTheBestForLast_GetCooldownPerToken");
static_assert(sizeof(SaveTheBestForLast_GetCooldownPerToken) == 0x000004, "Wrong size on SaveTheBestForLast_GetCooldownPerToken");
static_assert(offsetof(SaveTheBestForLast_GetCooldownPerToken, ReturnValue) == 0x000000, "Member 'SaveTheBestForLast_GetCooldownPerToken::ReturnValue' has a wrong offset!");

// Function TheShape.ShapePounceAttackOpenSubstate.GetShapePounceAttackOpenDuration
// 0x0004 (0x0004 - 0x0000)
struct ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration) == 0x000004, "Wrong alignment on ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration");
static_assert(sizeof(ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration) == 0x000004, "Wrong size on ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration");
static_assert(offsetof(ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration, ReturnValue) == 0x000000, "Member 'ShapePounceAttackOpenSubstate_GetShapePounceAttackOpenDuration::ReturnValue' has a wrong offset!");

}

