#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS27

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "DBDInteraction_classes.hpp"


namespace SDK
{

// Class TheS27.BiteTheBullet
// 0x0008 (0x0428 - 0x0420)
class UBiteTheBullet final : public UPerk
{
public:
	TSubclassOf<class UBiteTheBulletEffect>       _effectClass;                                      // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BiteTheBullet">();
	}
	static class UBiteTheBullet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiteTheBullet>();
	}
};
static_assert(alignof(UBiteTheBullet) == 0x000008, "Wrong alignment on UBiteTheBullet");
static_assert(sizeof(UBiteTheBullet) == 0x000428, "Wrong size on UBiteTheBullet");
static_assert(offsetof(UBiteTheBullet, _effectClass) == 0x000420, "Member 'UBiteTheBullet::_effectClass' has a wrong offset!");

// Class TheS27.BiteTheBulletEffect
// 0x0008 (0x03F0 - 0x03E8)
class UBiteTheBulletEffect final : public UBaseLingeringStatusEffect
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BiteTheBulletEffect">();
	}
	static class UBiteTheBulletEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiteTheBulletEffect>();
	}
};
static_assert(alignof(UBiteTheBulletEffect) == 0x000008, "Wrong alignment on UBiteTheBulletEffect");
static_assert(sizeof(UBiteTheBulletEffect) == 0x0003F0, "Wrong size on UBiteTheBulletEffect");

// Class TheS27.Flashbang
// 0x0028 (0x0448 - 0x0420)
class UFlashbang final : public UPerk
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AGenerator*                             _generatorBeingRepaired;                           // 0x0430(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _generatorsRepairTargetProgression;                // 0x0438(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _generatorRepairPercentToCraftFlashbang[0x3];      // 0x043C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnRepairProgressApplied(float IndividualChargeAmount, float TotalChargeAmount, class AActor* ChargeInstigator, bool WasCoop, float DeltaTime);
	void Client_OnGeneratorRepairProgressionTargetAchieved();
	void Cosmetic_OnGeneratorRepairProgressionTargetAchieved();
	void OnRep_GeneratorsRepairProgress();

	float GetGeneratorRepairPercentToCraftFlashbangAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Flashbang">();
	}
	static class UFlashbang* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlashbang>();
	}
};
static_assert(alignof(UFlashbang) == 0x000008, "Wrong alignment on UFlashbang");
static_assert(sizeof(UFlashbang) == 0x000448, "Wrong size on UFlashbang");
static_assert(offsetof(UFlashbang, _generatorBeingRepaired) == 0x000430, "Member 'UFlashbang::_generatorBeingRepaired' has a wrong offset!");
static_assert(offsetof(UFlashbang, _generatorsRepairTargetProgression) == 0x000438, "Member 'UFlashbang::_generatorsRepairTargetProgression' has a wrong offset!");
static_assert(offsetof(UFlashbang, _generatorRepairPercentToCraftFlashbang) == 0x00043C, "Member 'UFlashbang::_generatorRepairPercentToCraftFlashbang' has a wrong offset!");

// Class TheS27.InClosetFlashbangItemCraftInteraction
// 0x0000 (0x07A0 - 0x07A0)
class UInClosetFlashbangItemCraftInteraction : public UItemCraftInteraction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InClosetFlashbangItemCraftInteraction">();
	}
	static class UInClosetFlashbangItemCraftInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInClosetFlashbangItemCraftInteraction>();
	}
};
static_assert(alignof(UInClosetFlashbangItemCraftInteraction) == 0x000010, "Wrong alignment on UInClosetFlashbangItemCraftInteraction");
static_assert(sizeof(UInClosetFlashbangItemCraftInteraction) == 0x0007A0, "Wrong size on UInClosetFlashbangItemCraftInteraction");

// Class TheS27.RookieSpirit
// 0x0010 (0x0430 - 0x0420)
class URookieSpirit final : public UPerk
{
public:
	int32                                         _numberOfGreatSkillChecksOnGeneratorRepair;        // 0x0420(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _numberOfGeneratorRepairGreatSkillChecksRequired[0x3]; // 0x0424(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleGeneratorIsDamagedChanged(class AGenerator* Generator, class ADBDPlayer* Player);
	void OnRep_NumberOfGreatSkillChecksOnGeneratorRepair();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RookieSpirit">();
	}
	static class URookieSpirit* GetDefaultObj()
	{
		return GetDefaultObjImpl<URookieSpirit>();
	}
};
static_assert(alignof(URookieSpirit) == 0x000008, "Wrong alignment on URookieSpirit");
static_assert(sizeof(URookieSpirit) == 0x000430, "Wrong size on URookieSpirit");
static_assert(offsetof(URookieSpirit, _numberOfGreatSkillChecksOnGeneratorRepair) == 0x000420, "Member 'URookieSpirit::_numberOfGreatSkillChecksOnGeneratorRepair' has a wrong offset!");
static_assert(offsetof(URookieSpirit, _numberOfGeneratorRepairGreatSkillChecksRequired) == 0x000424, "Member 'URookieSpirit::_numberOfGeneratorRepairGreatSkillChecksRequired' has a wrong offset!");

}

