#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS39

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function TheS39.S39P01.GetPerkCooldownTimeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S39P01_GetPerkCooldownTimeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P01_GetPerkCooldownTimeAtLevel) == 0x000004, "Wrong alignment on S39P01_GetPerkCooldownTimeAtLevel");
static_assert(sizeof(S39P01_GetPerkCooldownTimeAtLevel) == 0x000004, "Wrong size on S39P01_GetPerkCooldownTimeAtLevel");
static_assert(offsetof(S39P01_GetPerkCooldownTimeAtLevel, ReturnValue) == 0x000000, "Member 'S39P01_GetPerkCooldownTimeAtLevel::ReturnValue' has a wrong offset!");

// Function TheS39.S39P01.GetPerkEffectsDuration
// 0x0004 (0x0004 - 0x0000)
struct S39P01_GetPerkEffectsDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P01_GetPerkEffectsDuration) == 0x000004, "Wrong alignment on S39P01_GetPerkEffectsDuration");
static_assert(sizeof(S39P01_GetPerkEffectsDuration) == 0x000004, "Wrong size on S39P01_GetPerkEffectsDuration");
static_assert(offsetof(S39P01_GetPerkEffectsDuration, ReturnValue) == 0x000000, "Member 'S39P01_GetPerkEffectsDuration::ReturnValue' has a wrong offset!");

// Function TheS39.S39P02.Cosmetic_OnSlowEffectEnded
// 0x0008 (0x0008 - 0x0000)
struct S39P02_Cosmetic_OnSlowEffectEnded final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_Cosmetic_OnSlowEffectEnded) == 0x000008, "Wrong alignment on S39P02_Cosmetic_OnSlowEffectEnded");
static_assert(sizeof(S39P02_Cosmetic_OnSlowEffectEnded) == 0x000008, "Wrong size on S39P02_Cosmetic_OnSlowEffectEnded");
static_assert(offsetof(S39P02_Cosmetic_OnSlowEffectEnded, Player) == 0x000000, "Member 'S39P02_Cosmetic_OnSlowEffectEnded::Player' has a wrong offset!");

// Function TheS39.S39P02.Cosmetic_TrapActivated
// 0x0008 (0x0008 - 0x0000)
struct S39P02_Cosmetic_TrapActivated final
{
public:
	const class APallet*                          Pallet;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_Cosmetic_TrapActivated) == 0x000008, "Wrong alignment on S39P02_Cosmetic_TrapActivated");
static_assert(sizeof(S39P02_Cosmetic_TrapActivated) == 0x000008, "Wrong size on S39P02_Cosmetic_TrapActivated");
static_assert(offsetof(S39P02_Cosmetic_TrapActivated, Pallet) == 0x000000, "Member 'S39P02_Cosmetic_TrapActivated::Pallet' has a wrong offset!");

// Function TheS39.S39P02.Cosmetic_TrapRemoved
// 0x0010 (0x0010 - 0x0000)
struct S39P02_Cosmetic_TrapRemoved final
{
public:
	class AInteractable*                          Interactable;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrapRemovedReason                            RemovedReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S39P02_Cosmetic_TrapRemoved) == 0x000008, "Wrong alignment on S39P02_Cosmetic_TrapRemoved");
static_assert(sizeof(S39P02_Cosmetic_TrapRemoved) == 0x000010, "Wrong size on S39P02_Cosmetic_TrapRemoved");
static_assert(offsetof(S39P02_Cosmetic_TrapRemoved, Interactable) == 0x000000, "Member 'S39P02_Cosmetic_TrapRemoved::Interactable' has a wrong offset!");
static_assert(offsetof(S39P02_Cosmetic_TrapRemoved, RemovedReason) == 0x000008, "Member 'S39P02_Cosmetic_TrapRemoved::RemovedReason' has a wrong offset!");

// Function TheS39.S39P02.Cosmetic_TrapTriggered
// 0x0010 (0x0010 - 0x0000)
struct S39P02_Cosmetic_TrapTriggered final
{
public:
	const class AInteractable*                    Pallet;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ADBDPlayer*                       Triggerer;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_Cosmetic_TrapTriggered) == 0x000008, "Wrong alignment on S39P02_Cosmetic_TrapTriggered");
static_assert(sizeof(S39P02_Cosmetic_TrapTriggered) == 0x000010, "Wrong size on S39P02_Cosmetic_TrapTriggered");
static_assert(offsetof(S39P02_Cosmetic_TrapTriggered, Pallet) == 0x000000, "Member 'S39P02_Cosmetic_TrapTriggered::Pallet' has a wrong offset!");
static_assert(offsetof(S39P02_Cosmetic_TrapTriggered, Triggerer) == 0x000008, "Member 'S39P02_Cosmetic_TrapTriggered::Triggerer' has a wrong offset!");

// Function TheS39.S39P02.Multicast_Cosmetic_OnSlowEffectEnded
// 0x0008 (0x0008 - 0x0000)
struct S39P02_Multicast_Cosmetic_OnSlowEffectEnded final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_Multicast_Cosmetic_OnSlowEffectEnded) == 0x000008, "Wrong alignment on S39P02_Multicast_Cosmetic_OnSlowEffectEnded");
static_assert(sizeof(S39P02_Multicast_Cosmetic_OnSlowEffectEnded) == 0x000008, "Wrong size on S39P02_Multicast_Cosmetic_OnSlowEffectEnded");
static_assert(offsetof(S39P02_Multicast_Cosmetic_OnSlowEffectEnded, Player) == 0x000000, "Member 'S39P02_Multicast_Cosmetic_OnSlowEffectEnded::Player' has a wrong offset!");

// Function TheS39.S39P02.Multicast_Cosmetic_OnTrapActivated
// 0x0008 (0x0008 - 0x0000)
struct S39P02_Multicast_Cosmetic_OnTrapActivated final
{
public:
	const class APallet*                          Generator;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_Multicast_Cosmetic_OnTrapActivated) == 0x000008, "Wrong alignment on S39P02_Multicast_Cosmetic_OnTrapActivated");
static_assert(sizeof(S39P02_Multicast_Cosmetic_OnTrapActivated) == 0x000008, "Wrong size on S39P02_Multicast_Cosmetic_OnTrapActivated");
static_assert(offsetof(S39P02_Multicast_Cosmetic_OnTrapActivated, Generator) == 0x000000, "Member 'S39P02_Multicast_Cosmetic_OnTrapActivated::Generator' has a wrong offset!");

// Function TheS39.S39P02.Multicast_Cosmetic_OnTrapRemoved
// 0x0010 (0x0010 - 0x0000)
struct S39P02_Multicast_Cosmetic_OnTrapRemoved final
{
public:
	class AInteractable*                          Interactable;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrapRemovedReason                            RemovedReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S39P02_Multicast_Cosmetic_OnTrapRemoved) == 0x000008, "Wrong alignment on S39P02_Multicast_Cosmetic_OnTrapRemoved");
static_assert(sizeof(S39P02_Multicast_Cosmetic_OnTrapRemoved) == 0x000010, "Wrong size on S39P02_Multicast_Cosmetic_OnTrapRemoved");
static_assert(offsetof(S39P02_Multicast_Cosmetic_OnTrapRemoved, Interactable) == 0x000000, "Member 'S39P02_Multicast_Cosmetic_OnTrapRemoved::Interactable' has a wrong offset!");
static_assert(offsetof(S39P02_Multicast_Cosmetic_OnTrapRemoved, RemovedReason) == 0x000008, "Member 'S39P02_Multicast_Cosmetic_OnTrapRemoved::RemovedReason' has a wrong offset!");

// Function TheS39.S39P02.Multicast_Cosmetic_OnTrapTriggered
// 0x0010 (0x0010 - 0x0000)
struct S39P02_Multicast_Cosmetic_OnTrapTriggered final
{
public:
	const class AInteractable*                    Pallet;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ADBDPlayer*                       Triggerer;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_Multicast_Cosmetic_OnTrapTriggered) == 0x000008, "Wrong alignment on S39P02_Multicast_Cosmetic_OnTrapTriggered");
static_assert(sizeof(S39P02_Multicast_Cosmetic_OnTrapTriggered) == 0x000010, "Wrong size on S39P02_Multicast_Cosmetic_OnTrapTriggered");
static_assert(offsetof(S39P02_Multicast_Cosmetic_OnTrapTriggered, Pallet) == 0x000000, "Member 'S39P02_Multicast_Cosmetic_OnTrapTriggered::Pallet' has a wrong offset!");
static_assert(offsetof(S39P02_Multicast_Cosmetic_OnTrapTriggered, Triggerer) == 0x000008, "Member 'S39P02_Multicast_Cosmetic_OnTrapTriggered::Triggerer' has a wrong offset!");

// Function TheS39.S39P02.GetChemicalBombTrap
// 0x0008 (0x0008 - 0x0000)
struct S39P02_GetChemicalBombTrap final
{
public:
	class ATrapChemicalBomb*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_GetChemicalBombTrap) == 0x000008, "Wrong alignment on S39P02_GetChemicalBombTrap");
static_assert(sizeof(S39P02_GetChemicalBombTrap) == 0x000008, "Wrong size on S39P02_GetChemicalBombTrap");
static_assert(offsetof(S39P02_GetChemicalBombTrap, ReturnValue) == 0x000000, "Member 'S39P02_GetChemicalBombTrap::ReturnValue' has a wrong offset!");

// Function TheS39.S39P02.GetSlowTime
// 0x0004 (0x0004 - 0x0000)
struct S39P02_GetSlowTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P02_GetSlowTime) == 0x000004, "Wrong alignment on S39P02_GetSlowTime");
static_assert(sizeof(S39P02_GetSlowTime) == 0x000004, "Wrong size on S39P02_GetSlowTime");
static_assert(offsetof(S39P02_GetSlowTime, ReturnValue) == 0x000000, "Member 'S39P02_GetSlowTime::ReturnValue' has a wrong offset!");

// Function TheS39.S39P03.GetCooldownTimeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S39P03_GetCooldownTimeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S39P03_GetCooldownTimeAtLevel) == 0x000004, "Wrong alignment on S39P03_GetCooldownTimeAtLevel");
static_assert(sizeof(S39P03_GetCooldownTimeAtLevel) == 0x000004, "Wrong size on S39P03_GetCooldownTimeAtLevel");
static_assert(offsetof(S39P03_GetCooldownTimeAtLevel, ReturnValue) == 0x000000, "Member 'S39P03_GetCooldownTimeAtLevel::ReturnValue' has a wrong offset!");

}

