#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS12

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS12.DetectivesHunch.GetRevealDuration
// 0x0004 (0x0004 - 0x0000)
struct DetectivesHunch_GetRevealDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DetectivesHunch_GetRevealDuration) == 0x000004, "Wrong alignment on DetectivesHunch_GetRevealDuration");
static_assert(sizeof(DetectivesHunch_GetRevealDuration) == 0x000004, "Wrong size on DetectivesHunch_GetRevealDuration");
static_assert(offsetof(DetectivesHunch_GetRevealDuration, ReturnValue) == 0x000000, "Member 'DetectivesHunch_GetRevealDuration::ReturnValue' has a wrong offset!");

// Function TheS12.DetectivesHunch.GetRevealRangeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct DetectivesHunch_GetRevealRangeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DetectivesHunch_GetRevealRangeAtLevel) == 0x000004, "Wrong alignment on DetectivesHunch_GetRevealRangeAtLevel");
static_assert(sizeof(DetectivesHunch_GetRevealRangeAtLevel) == 0x000004, "Wrong size on DetectivesHunch_GetRevealRangeAtLevel");
static_assert(offsetof(DetectivesHunch_GetRevealRangeAtLevel, ReturnValue) == 0x000000, "Member 'DetectivesHunch_GetRevealRangeAtLevel::ReturnValue' has a wrong offset!");

}

