#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS29

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"
#include "DBDCompetence_classes.hpp"


namespace SDK
{

// Class TheS29.CorrectiveAction
// 0x00E8 (0x0508 - 0x0420)
class UCorrectiveAction final : public UPerk
{
public:
	float                                         _startingTokens[0x3];                              // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _correctiveActionStatusEffectClass;                // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _revealToSurvivorStatusEffectClass;                // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _revealSurvivorAuraDuration;                       // 0x0440(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ADBDPlayer*, class UStatusEffect*> _authority_playerStatusEffectMap;                  // 0x0448(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class ADBDPlayer*, class UPerk*>         _playersWithPerk;                                  // 0x0498(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E8[0x20];                                     // 0x04E8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CorrectiveAction">();
	}
	static class UCorrectiveAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCorrectiveAction>();
	}
};
static_assert(alignof(UCorrectiveAction) == 0x000008, "Wrong alignment on UCorrectiveAction");
static_assert(sizeof(UCorrectiveAction) == 0x000508, "Wrong size on UCorrectiveAction");
static_assert(offsetof(UCorrectiveAction, _startingTokens) == 0x000420, "Member 'UCorrectiveAction::_startingTokens' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _correctiveActionStatusEffectClass) == 0x000430, "Member 'UCorrectiveAction::_correctiveActionStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _revealToSurvivorStatusEffectClass) == 0x000438, "Member 'UCorrectiveAction::_revealToSurvivorStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _revealSurvivorAuraDuration) == 0x000440, "Member 'UCorrectiveAction::_revealSurvivorAuraDuration' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _authority_playerStatusEffectMap) == 0x000448, "Member 'UCorrectiveAction::_authority_playerStatusEffectMap' has a wrong offset!");
static_assert(offsetof(UCorrectiveAction, _playersWithPerk) == 0x000498, "Member 'UCorrectiveAction::_playersWithPerk' has a wrong offset!");

// Class TheS29.Overcome
// 0x0030 (0x0450 - 0x0420)
class UOvercome final : public UPerk
{
public:
	float                                         _exhaustionDuration[0x3];                          // 0x0420(0x0004)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _injuredModifiedMovementSpeedBurstDurationWindow;  // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _exhaustedEffectToImpose;                          // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _injuredModifiedMovementSpeedBurstStatusEffectToImpose; // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _exhaustedEffect;                                  // 0x0440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStatusEffect*                          _injuredModifiedMovementSpeedBurstStatusEffect;    // 0x0448(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetExhaustionDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Overcome">();
	}
	static class UOvercome* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOvercome>();
	}
};
static_assert(alignof(UOvercome) == 0x000008, "Wrong alignment on UOvercome");
static_assert(sizeof(UOvercome) == 0x000450, "Wrong size on UOvercome");
static_assert(offsetof(UOvercome, _exhaustionDuration) == 0x000420, "Member 'UOvercome::_exhaustionDuration' has a wrong offset!");
static_assert(offsetof(UOvercome, _injuredModifiedMovementSpeedBurstDurationWindow) == 0x00042C, "Member 'UOvercome::_injuredModifiedMovementSpeedBurstDurationWindow' has a wrong offset!");
static_assert(offsetof(UOvercome, _exhaustedEffectToImpose) == 0x000430, "Member 'UOvercome::_exhaustedEffectToImpose' has a wrong offset!");
static_assert(offsetof(UOvercome, _injuredModifiedMovementSpeedBurstStatusEffectToImpose) == 0x000438, "Member 'UOvercome::_injuredModifiedMovementSpeedBurstStatusEffectToImpose' has a wrong offset!");
static_assert(offsetof(UOvercome, _exhaustedEffect) == 0x000440, "Member 'UOvercome::_exhaustedEffect' has a wrong offset!");
static_assert(offsetof(UOvercome, _injuredModifiedMovementSpeedBurstStatusEffect) == 0x000448, "Member 'UOvercome::_injuredModifiedMovementSpeedBurstStatusEffect' has a wrong offset!");

// Class TheS29.S29P03
// 0x0010 (0x04E8 - 0x04D8)
class US29P03 final : public UBoonPerk
{
public:
	float                                         _recoverSpeedPercentage[0x3];                      // 0x04D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S29P03">();
	}
	static class US29P03* GetDefaultObj()
	{
		return GetDefaultObjImpl<US29P03>();
	}
};
static_assert(alignof(US29P03) == 0x000008, "Wrong alignment on US29P03");
static_assert(sizeof(US29P03) == 0x0004E8, "Wrong size on US29P03");
static_assert(offsetof(US29P03, _recoverSpeedPercentage) == 0x0004D8, "Member 'US29P03::_recoverSpeedPercentage' has a wrong offset!");

}

