#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS31

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// Class TheS31.S31P01
// 0x0018 (0x0438 - 0x0420)
class US31P01 final : public UPerk
{
public:
	float                                         _killerAuraRevealDuration[0x3];                    // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _timedAuraReveal;                                  // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetKillerAuraRevealDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S31P01">();
	}
	static class US31P01* GetDefaultObj()
	{
		return GetDefaultObjImpl<US31P01>();
	}
};
static_assert(alignof(US31P01) == 0x000008, "Wrong alignment on US31P01");
static_assert(sizeof(US31P01) == 0x000438, "Wrong size on US31P01");
static_assert(offsetof(US31P01, _killerAuraRevealDuration) == 0x000420, "Member 'US31P01::_killerAuraRevealDuration' has a wrong offset!");
static_assert(offsetof(US31P01, _timedAuraReveal) == 0x000430, "Member 'US31P01::_timedAuraReveal' has a wrong offset!");

// Class TheS31.S31P02
// 0x0028 (0x0448 - 0x0420)
class US31P02 final : public UPerk
{
public:
	float                                         _blindnessDurationPerLevel[0x3];                   // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _blindnessEffect;                                  // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           _itemFlag;                                         // 0x0438(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S31P02">();
	}
	static class US31P02* GetDefaultObj()
	{
		return GetDefaultObjImpl<US31P02>();
	}
};
static_assert(alignof(US31P02) == 0x000008, "Wrong alignment on US31P02");
static_assert(sizeof(US31P02) == 0x000448, "Wrong size on US31P02");
static_assert(offsetof(US31P02, _blindnessDurationPerLevel) == 0x000420, "Member 'US31P02::_blindnessDurationPerLevel' has a wrong offset!");
static_assert(offsetof(US31P02, _blindnessEffect) == 0x000430, "Member 'US31P02::_blindnessEffect' has a wrong offset!");
static_assert(offsetof(US31P02, _itemFlag) == 0x000438, "Member 'US31P02::_itemFlag' has a wrong offset!");

// Class TheS31.S31P03
// 0x0030 (0x0450 - 0x0420)
class US31P03 final : public UPerk
{
public:
	float                                         _genRepairSpeedBoostForDullTotem[0x3];             // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _genRepairSpeedBoostForHexTotem[0x3];              // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _effectClass;                                      // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x10];                                     // 0x0440(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S31P03">();
	}
	static class US31P03* GetDefaultObj()
	{
		return GetDefaultObjImpl<US31P03>();
	}
};
static_assert(alignof(US31P03) == 0x000008, "Wrong alignment on US31P03");
static_assert(sizeof(US31P03) == 0x000450, "Wrong size on US31P03");
static_assert(offsetof(US31P03, _genRepairSpeedBoostForDullTotem) == 0x000420, "Member 'US31P03::_genRepairSpeedBoostForDullTotem' has a wrong offset!");
static_assert(offsetof(US31P03, _genRepairSpeedBoostForHexTotem) == 0x00042C, "Member 'US31P03::_genRepairSpeedBoostForHexTotem' has a wrong offset!");
static_assert(offsetof(US31P03, _effectClass) == 0x000438, "Member 'US31P03::_effectClass' has a wrong offset!");

}

