#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS25

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS25.SelfPreservation.GetHitDistanceToTriggerPerkEffect
// 0x0004 (0x0004 - 0x0000)
struct SelfPreservation_GetHitDistanceToTriggerPerkEffect final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SelfPreservation_GetHitDistanceToTriggerPerkEffect) == 0x000004, "Wrong alignment on SelfPreservation_GetHitDistanceToTriggerPerkEffect");
static_assert(sizeof(SelfPreservation_GetHitDistanceToTriggerPerkEffect) == 0x000004, "Wrong size on SelfPreservation_GetHitDistanceToTriggerPerkEffect");
static_assert(offsetof(SelfPreservation_GetHitDistanceToTriggerPerkEffect, ReturnValue) == 0x000000, "Member 'SelfPreservation_GetHitDistanceToTriggerPerkEffect::ReturnValue' has a wrong offset!");

// Function TheS25.SelfPreservation.GetSelfPreservationEffectDuration
// 0x0004 (0x0004 - 0x0000)
struct SelfPreservation_GetSelfPreservationEffectDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SelfPreservation_GetSelfPreservationEffectDuration) == 0x000004, "Wrong alignment on SelfPreservation_GetSelfPreservationEffectDuration");
static_assert(sizeof(SelfPreservation_GetSelfPreservationEffectDuration) == 0x000004, "Wrong size on SelfPreservation_GetSelfPreservationEffectDuration");
static_assert(offsetof(SelfPreservation_GetSelfPreservationEffectDuration, ReturnValue) == 0x000000, "Member 'SelfPreservation_GetSelfPreservationEffectDuration::ReturnValue' has a wrong offset!");

}

