#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS37

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheS37.S37P01.GetChaseLingeringTimerAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S37P01_GetChaseLingeringTimerAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S37P01_GetChaseLingeringTimerAtLevel) == 0x000004, "Wrong alignment on S37P01_GetChaseLingeringTimerAtLevel");
static_assert(sizeof(S37P01_GetChaseLingeringTimerAtLevel) == 0x000004, "Wrong size on S37P01_GetChaseLingeringTimerAtLevel");
static_assert(offsetof(S37P01_GetChaseLingeringTimerAtLevel, ReturnValue) == 0x000000, "Member 'S37P01_GetChaseLingeringTimerAtLevel::ReturnValue' has a wrong offset!");

// Function TheS37.S37P01.GetKillerRevealedTimeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S37P01_GetKillerRevealedTimeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S37P01_GetKillerRevealedTimeAtLevel) == 0x000004, "Wrong alignment on S37P01_GetKillerRevealedTimeAtLevel");
static_assert(sizeof(S37P01_GetKillerRevealedTimeAtLevel) == 0x000004, "Wrong size on S37P01_GetKillerRevealedTimeAtLevel");
static_assert(offsetof(S37P01_GetKillerRevealedTimeAtLevel, ReturnValue) == 0x000000, "Member 'S37P01_GetKillerRevealedTimeAtLevel::ReturnValue' has a wrong offset!");

// Function TheS37.S37P02.GetEnduranceEffectTimerAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S37P02_GetEnduranceEffectTimerAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S37P02_GetEnduranceEffectTimerAtLevel) == 0x000004, "Wrong alignment on S37P02_GetEnduranceEffectTimerAtLevel");
static_assert(sizeof(S37P02_GetEnduranceEffectTimerAtLevel) == 0x000004, "Wrong size on S37P02_GetEnduranceEffectTimerAtLevel");
static_assert(offsetof(S37P02_GetEnduranceEffectTimerAtLevel, ReturnValue) == 0x000000, "Member 'S37P02_GetEnduranceEffectTimerAtLevel::ReturnValue' has a wrong offset!");

// Function TheS37.S37P02.GetHasteSpeedAmountAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S37P02_GetHasteSpeedAmountAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S37P02_GetHasteSpeedAmountAtLevel) == 0x000004, "Wrong alignment on S37P02_GetHasteSpeedAmountAtLevel");
static_assert(sizeof(S37P02_GetHasteSpeedAmountAtLevel) == 0x000004, "Wrong size on S37P02_GetHasteSpeedAmountAtLevel");
static_assert(offsetof(S37P02_GetHasteSpeedAmountAtLevel, ReturnValue) == 0x000000, "Member 'S37P02_GetHasteSpeedAmountAtLevel::ReturnValue' has a wrong offset!");

// Function TheS37.S37P03.GetRepairSpeedDebuffAmount
// 0x0004 (0x0004 - 0x0000)
struct S37P03_GetRepairSpeedDebuffAmount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S37P03_GetRepairSpeedDebuffAmount) == 0x000004, "Wrong alignment on S37P03_GetRepairSpeedDebuffAmount");
static_assert(sizeof(S37P03_GetRepairSpeedDebuffAmount) == 0x000004, "Wrong size on S37P03_GetRepairSpeedDebuffAmount");
static_assert(offsetof(S37P03_GetRepairSpeedDebuffAmount, ReturnValue) == 0x000000, "Member 'S37P03_GetRepairSpeedDebuffAmount::ReturnValue' has a wrong offset!");

// Function TheS37.S37P03.GetRepairSpeedDebuffTimeAtLevel
// 0x0004 (0x0004 - 0x0000)
struct S37P03_GetRepairSpeedDebuffTimeAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S37P03_GetRepairSpeedDebuffTimeAtLevel) == 0x000004, "Wrong alignment on S37P03_GetRepairSpeedDebuffTimeAtLevel");
static_assert(sizeof(S37P03_GetRepairSpeedDebuffTimeAtLevel) == 0x000004, "Wrong size on S37P03_GetRepairSpeedDebuffTimeAtLevel");
static_assert(offsetof(S37P03_GetRepairSpeedDebuffTimeAtLevel, ReturnValue) == 0x000000, "Member 'S37P03_GetRepairSpeedDebuffTimeAtLevel::ReturnValue' has a wrong offset!");

}

