#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS28

#include "Basic.hpp"

#include "DeadByDaylight_classes.hpp"
#include "DBDCompetence_classes.hpp"


namespace SDK
{

// Class TheS28.S28P01
// 0x0048 (0x0468 - 0x0420)
class US28P01 final : public UPerk
{
public:
	float                                         _auraRevealDuration[0x3];                          // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _auraRevealRange[0x3];                             // 0x042C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class US28P01AuraReveal>          _S28P01InteractionClass;                           // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChargeableComponent*                   _S28P01ChargeableComponent;                        // 0x0440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class US28P01AuraReveal*                      _S28P01Interaction;                                // 0x0448(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _isPerkActive;                                     // 0x0450(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractionAttacherComponent*          _interactionAttacherComponent;                     // 0x0458(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADBDPlayer*                             _playerOwner;                                      // 0x0460(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnS28P01InteractionStart(class ADBDPlayer* Player);
	void OnInteractionChargeChanged(class UChargeableComponent* ChargeableComponent, float TotalPercentComplete);
	void OnRep_InteractionAttacherComponent();

	float GetAuraRevealDuration() const;
	float GetAuraRevealRange() const;
	void OnRep_IsPerkActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S28P01">();
	}
	static class US28P01* GetDefaultObj()
	{
		return GetDefaultObjImpl<US28P01>();
	}
};
static_assert(alignof(US28P01) == 0x000008, "Wrong alignment on US28P01");
static_assert(sizeof(US28P01) == 0x000468, "Wrong size on US28P01");
static_assert(offsetof(US28P01, _auraRevealDuration) == 0x000420, "Member 'US28P01::_auraRevealDuration' has a wrong offset!");
static_assert(offsetof(US28P01, _auraRevealRange) == 0x00042C, "Member 'US28P01::_auraRevealRange' has a wrong offset!");
static_assert(offsetof(US28P01, _S28P01InteractionClass) == 0x000438, "Member 'US28P01::_S28P01InteractionClass' has a wrong offset!");
static_assert(offsetof(US28P01, _S28P01ChargeableComponent) == 0x000440, "Member 'US28P01::_S28P01ChargeableComponent' has a wrong offset!");
static_assert(offsetof(US28P01, _S28P01Interaction) == 0x000448, "Member 'US28P01::_S28P01Interaction' has a wrong offset!");
static_assert(offsetof(US28P01, _isPerkActive) == 0x000450, "Member 'US28P01::_isPerkActive' has a wrong offset!");
static_assert(offsetof(US28P01, _interactionAttacherComponent) == 0x000458, "Member 'US28P01::_interactionAttacherComponent' has a wrong offset!");
static_assert(offsetof(US28P01, _playerOwner) == 0x000460, "Member 'US28P01::_playerOwner' has a wrong offset!");

// Class TheS28.S28P01AuraReveal
// 0x0010 (0x08D0 - 0x08C0)
class US28P01AuraReveal final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x10];                                     // 0x08C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S28P01AuraReveal">();
	}
	static class US28P01AuraReveal* GetDefaultObj()
	{
		return GetDefaultObjImpl<US28P01AuraReveal>();
	}
};
static_assert(alignof(US28P01AuraReveal) == 0x000010, "Wrong alignment on US28P01AuraReveal");
static_assert(sizeof(US28P01AuraReveal) == 0x0008D0, "Wrong size on US28P01AuraReveal");

// Class TheS28.S28P02
// 0x0020 (0x04F8 - 0x04D8)
class US28P02 final : public UBoonPerk
{
public:
	float                                         _healingSpeedGainPercentage[0x3];                  // 0x04D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _healingSpeedIncreaseEffect;                       // 0x04E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _revealInjuredPlayersInBoonRangeEffectClass;       // 0x04F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetHealingSpeedGainPercentageAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S28P02">();
	}
	static class US28P02* GetDefaultObj()
	{
		return GetDefaultObjImpl<US28P02>();
	}
};
static_assert(alignof(US28P02) == 0x000008, "Wrong alignment on US28P02");
static_assert(sizeof(US28P02) == 0x0004F8, "Wrong size on US28P02");
static_assert(offsetof(US28P02, _healingSpeedGainPercentage) == 0x0004D8, "Member 'US28P02::_healingSpeedGainPercentage' has a wrong offset!");
static_assert(offsetof(US28P02, _healingSpeedIncreaseEffect) == 0x0004E8, "Member 'US28P02::_healingSpeedIncreaseEffect' has a wrong offset!");
static_assert(offsetof(US28P02, _revealInjuredPlayersInBoonRangeEffectClass) == 0x0004F0, "Member 'US28P02::_revealInjuredPlayersInBoonRangeEffectClass' has a wrong offset!");

// Class TheS28.S28P03
// 0x0010 (0x04E8 - 0x04D8)
class US28P03 final : public UBoonPerk
{
public:
	float                                         _lingerDuration[0x3];                              // 0x04D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const float GetLingerDurationAtLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S28P03">();
	}
	static class US28P03* GetDefaultObj()
	{
		return GetDefaultObjImpl<US28P03>();
	}
};
static_assert(alignof(US28P03) == 0x000008, "Wrong alignment on US28P03");
static_assert(sizeof(US28P03) == 0x0004E8, "Wrong size on US28P03");
static_assert(offsetof(US28P03, _lingerDuration) == 0x0004D8, "Member 'US28P03::_lingerDuration' has a wrong offset!");

}

