#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheS22

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function TheS22.BloodPact.Authority_OnInRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct BloodPact_Authority_OnInRangeChanged final
{
public:
	bool                                          InRange;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BloodPact_Authority_OnInRangeChanged) == 0x000001, "Wrong alignment on BloodPact_Authority_OnInRangeChanged");
static_assert(sizeof(BloodPact_Authority_OnInRangeChanged) == 0x000001, "Wrong size on BloodPact_Authority_OnInRangeChanged");
static_assert(offsetof(BloodPact_Authority_OnInRangeChanged, InRange) == 0x000000, "Member 'BloodPact_Authority_OnInRangeChanged::InRange' has a wrong offset!");

// Function TheS22.RepressedAlliance.OnRep_BlockedGenerator
// 0x0008 (0x0008 - 0x0000)
struct RepressedAlliance_OnRep_BlockedGenerator final
{
public:
	class AGenerator*                             OldGenerator;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RepressedAlliance_OnRep_BlockedGenerator) == 0x000008, "Wrong alignment on RepressedAlliance_OnRep_BlockedGenerator");
static_assert(sizeof(RepressedAlliance_OnRep_BlockedGenerator) == 0x000008, "Wrong size on RepressedAlliance_OnRep_BlockedGenerator");
static_assert(offsetof(RepressedAlliance_OnRep_BlockedGenerator, OldGenerator) == 0x000000, "Member 'RepressedAlliance_OnRep_BlockedGenerator::OldGenerator' has a wrong offset!");

// Function TheS22.RepressedAlliance.OnRep_CurrentRepairInteractionWithAbility
// 0x0008 (0x0008 - 0x0000)
struct RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility final
{
public:
	class UInteractionDefinition*                 OldRepairInteraction;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility) == 0x000008, "Wrong alignment on RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility");
static_assert(sizeof(RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility) == 0x000008, "Wrong size on RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility");
static_assert(offsetof(RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility, OldRepairInteraction) == 0x000000, "Member 'RepressedAlliance_OnRep_CurrentRepairInteractionWithAbility::OldRepairInteraction' has a wrong offset!");

// Function TheS22.RepressedAlliance.Server_OnActionInputPressed
// 0x0008 (0x0008 - 0x0000)
struct RepressedAlliance_Server_OnActionInputPressed final
{
public:
	class AGenerator*                             Generator;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RepressedAlliance_Server_OnActionInputPressed) == 0x000008, "Wrong alignment on RepressedAlliance_Server_OnActionInputPressed");
static_assert(sizeof(RepressedAlliance_Server_OnActionInputPressed) == 0x000008, "Wrong size on RepressedAlliance_Server_OnActionInputPressed");
static_assert(offsetof(RepressedAlliance_Server_OnActionInputPressed, Generator) == 0x000000, "Member 'RepressedAlliance_Server_OnActionInputPressed::Generator' has a wrong offset!");

// Function TheS22.RepressedAlliance.GetGeneratorBlockDuration
// 0x0004 (0x0004 - 0x0000)
struct RepressedAlliance_GetGeneratorBlockDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RepressedAlliance_GetGeneratorBlockDuration) == 0x000004, "Wrong alignment on RepressedAlliance_GetGeneratorBlockDuration");
static_assert(sizeof(RepressedAlliance_GetGeneratorBlockDuration) == 0x000004, "Wrong size on RepressedAlliance_GetGeneratorBlockDuration");
static_assert(offsetof(RepressedAlliance_GetGeneratorBlockDuration, ReturnValue) == 0x000000, "Member 'RepressedAlliance_GetGeneratorBlockDuration::ReturnValue' has a wrong offset!");

// Function TheS22.RepressedAlliance.GetRepairTimesNeededToActivateAtLevel
// 0x0004 (0x0004 - 0x0000)
struct RepressedAlliance_GetRepairTimesNeededToActivateAtLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RepressedAlliance_GetRepairTimesNeededToActivateAtLevel) == 0x000004, "Wrong alignment on RepressedAlliance_GetRepairTimesNeededToActivateAtLevel");
static_assert(sizeof(RepressedAlliance_GetRepairTimesNeededToActivateAtLevel) == 0x000004, "Wrong size on RepressedAlliance_GetRepairTimesNeededToActivateAtLevel");
static_assert(offsetof(RepressedAlliance_GetRepairTimesNeededToActivateAtLevel, ReturnValue) == 0x000000, "Member 'RepressedAlliance_GetRepairTimesNeededToActivateAtLevel::ReturnValue' has a wrong offset!");

// Function TheS22.SoulGuard.Authority_OnSurvivorHealed
// 0x0018 (0x0018 - 0x0000)
struct SoulGuard_Authority_OnSurvivorHealed final
{
public:
	struct FCamperHealResult                      HealResult;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SoulGuard_Authority_OnSurvivorHealed) == 0x000008, "Wrong alignment on SoulGuard_Authority_OnSurvivorHealed");
static_assert(sizeof(SoulGuard_Authority_OnSurvivorHealed) == 0x000018, "Wrong size on SoulGuard_Authority_OnSurvivorHealed");
static_assert(offsetof(SoulGuard_Authority_OnSurvivorHealed, HealResult) == 0x000000, "Member 'SoulGuard_Authority_OnSurvivorHealed::HealResult' has a wrong offset!");

}

