#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheTwins

#include "Basic.hpp"

#include "DBDGameplay_classes.hpp"
#include "DBDCompetence_classes.hpp"
#include "DBDInteraction_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "SystemUtilities_structs.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "DBDBots_classes.hpp"
#include "StatSystem_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDAnimation_classes.hpp"
#include "TheTwins_structs.hpp"
#include "Competence_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDAttack_classes.hpp"


namespace SDK
{

// Class TheTwins.Addon_K22Power_10
// 0x0008 (0x0300 - 0x02F8)
class UAddon_K22Power_10 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _hemorrhageStatusEffectClass;                      // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_10">();
	}
	static class UAddon_K22Power_10* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_10>();
	}
};
static_assert(alignof(UAddon_K22Power_10) == 0x000008, "Wrong alignment on UAddon_K22Power_10");
static_assert(sizeof(UAddon_K22Power_10) == 0x000300, "Wrong size on UAddon_K22Power_10");
static_assert(offsetof(UAddon_K22Power_10, _hemorrhageStatusEffectClass) == 0x0002F8, "Member 'UAddon_K22Power_10::_hemorrhageStatusEffectClass' has a wrong offset!");

// Class TheTwins.TwinFirstPersonViewComponent
// 0x0020 (0x0110 - 0x00F0)
class UTwinFirstPersonViewComponent final : public UFirstPersonViewComponent
{
public:
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinFirstPersonViewComponent">();
	}
	static class UTwinFirstPersonViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinFirstPersonViewComponent>();
	}
};
static_assert(alignof(UTwinFirstPersonViewComponent) == 0x000008, "Wrong alignment on UTwinFirstPersonViewComponent");
static_assert(sizeof(UTwinFirstPersonViewComponent) == 0x000110, "Wrong size on UTwinFirstPersonViewComponent");

// Class TheTwins.Addon_K22Power_11
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_11 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorRemoveTwinMaxChargeAdditiveEffect;        // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _increaseRemoveTwinTime;                           // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_11">();
	}
	static class UAddon_K22Power_11* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_11>();
	}
};
static_assert(alignof(UAddon_K22Power_11) == 0x000008, "Wrong alignment on UAddon_K22Power_11");
static_assert(sizeof(UAddon_K22Power_11) == 0x000308, "Wrong size on UAddon_K22Power_11");
static_assert(offsetof(UAddon_K22Power_11, _survivorRemoveTwinMaxChargeAdditiveEffect) == 0x0002F8, "Member 'UAddon_K22Power_11::_survivorRemoveTwinMaxChargeAdditiveEffect' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_11, _increaseRemoveTwinTime) == 0x000300, "Member 'UAddon_K22Power_11::_increaseRemoveTwinTime' has a wrong offset!");

// Class TheTwins.TwinHuskAnimInstance
// 0x0020 (0x0370 - 0x0350)
class UTwinHuskAnimInstance final : public UAnimInstance
{
public:
	bool                                          _isDeadFromSurvivorBack;                           // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  _owningPawn;                                       // 0x0358(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTwinHuskStateComponent*                _twinHuskStateComponent;                           // 0x0360(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinHuskAnimInstance">();
	}
	static class UTwinHuskAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinHuskAnimInstance>();
	}
};
static_assert(alignof(UTwinHuskAnimInstance) == 0x000010, "Wrong alignment on UTwinHuskAnimInstance");
static_assert(sizeof(UTwinHuskAnimInstance) == 0x000370, "Wrong size on UTwinHuskAnimInstance");
static_assert(offsetof(UTwinHuskAnimInstance, _isDeadFromSurvivorBack) == 0x000350, "Member 'UTwinHuskAnimInstance::_isDeadFromSurvivorBack' has a wrong offset!");
static_assert(offsetof(UTwinHuskAnimInstance, _owningPawn) == 0x000358, "Member 'UTwinHuskAnimInstance::_owningPawn' has a wrong offset!");
static_assert(offsetof(UTwinHuskAnimInstance, _twinHuskStateComponent) == 0x000360, "Member 'UTwinHuskAnimInstance::_twinHuskStateComponent' has a wrong offset!");

// Class TheTwins.Addon_K22Power_14
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_14 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _brokenStatusEffectClass;                          // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _brokenDuration;                                   // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_14">();
	}
	static class UAddon_K22Power_14* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_14>();
	}
};
static_assert(alignof(UAddon_K22Power_14) == 0x000008, "Wrong alignment on UAddon_K22Power_14");
static_assert(sizeof(UAddon_K22Power_14) == 0x000308, "Wrong size on UAddon_K22Power_14");
static_assert(offsetof(UAddon_K22Power_14, _brokenStatusEffectClass) == 0x0002F8, "Member 'UAddon_K22Power_14::_brokenStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_14, _brokenDuration) == 0x000300, "Member 'UAddon_K22Power_14::_brokenDuration' has a wrong offset!");

// Class TheTwins.TwinHuskStateComponent
// 0x0008 (0x00B0 - 0x00A8)
class UTwinHuskStateComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsDeadFromSurvivorBack() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinHuskStateComponent">();
	}
	static class UTwinHuskStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinHuskStateComponent>();
	}
};
static_assert(alignof(UTwinHuskStateComponent) == 0x000008, "Wrong alignment on UTwinHuskStateComponent");
static_assert(sizeof(UTwinHuskStateComponent) == 0x0000B0, "Wrong size on UTwinHuskStateComponent");

// Class TheTwins.Addon_K22Power_16
// 0x0000 (0x02F8 - 0x02F8)
class UAddon_K22Power_16 final : public UOnEventBaseAddon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_16">();
	}
	static class UAddon_K22Power_16* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_16>();
	}
};
static_assert(alignof(UAddon_K22Power_16) == 0x000008, "Wrong alignment on UAddon_K22Power_16");
static_assert(sizeof(UAddon_K22Power_16) == 0x0002F8, "Wrong size on UAddon_K22Power_16");

// Class TheTwins.BaseTwinInspectLocker
// 0x0030 (0x07E0 - 0x07B0)
class UBaseTwinInspectLocker : public UBaseLockerInteraction
{
public:
	struct FDBDTunableRowHandle                   _inspectInteractionTime;                           // 0x07A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D0[0x10];                                     // 0x07D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseTwinInspectLocker">();
	}
	static class UBaseTwinInspectLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseTwinInspectLocker>();
	}
};
static_assert(alignof(UBaseTwinInspectLocker) == 0x000010, "Wrong alignment on UBaseTwinInspectLocker");
static_assert(sizeof(UBaseTwinInspectLocker) == 0x0007E0, "Wrong size on UBaseTwinInspectLocker");
static_assert(offsetof(UBaseTwinInspectLocker, _inspectInteractionTime) == 0x0007A8, "Member 'UBaseTwinInspectLocker::_inspectInteractionTime' has a wrong offset!");

// Class TheTwins.TwinInspectEmptyLocker
// 0x0000 (0x07E0 - 0x07E0)
class UTwinInspectEmptyLocker final : public UBaseTwinInspectLocker
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinInspectEmptyLocker">();
	}
	static class UTwinInspectEmptyLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinInspectEmptyLocker>();
	}
};
static_assert(alignof(UTwinInspectEmptyLocker) == 0x000010, "Wrong alignment on UTwinInspectEmptyLocker");
static_assert(sizeof(UTwinInspectEmptyLocker) == 0x0007E0, "Wrong size on UTwinInspectEmptyLocker");

// Class TheTwins.Addon_K22Power_17
// 0x0038 (0x0330 - 0x02F8)
class UAddon_K22Power_17 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _twinDormantObliviousEffectClass;                  // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _lingerDuration;                                   // 0x0308(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void Authority_OnTwinSet(class AConjoinedTwin* Twin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_17">();
	}
	static class UAddon_K22Power_17* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_17>();
	}
};
static_assert(alignof(UAddon_K22Power_17) == 0x000008, "Wrong alignment on UAddon_K22Power_17");
static_assert(sizeof(UAddon_K22Power_17) == 0x000330, "Wrong size on UAddon_K22Power_17");
static_assert(offsetof(UAddon_K22Power_17, _twinDormantObliviousEffectClass) == 0x000300, "Member 'UAddon_K22Power_17::_twinDormantObliviousEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_17, _lingerDuration) == 0x000308, "Member 'UAddon_K22Power_17::_lingerDuration' has a wrong offset!");

// Class TheTwins.TwinInspectOccupiedLocker
// 0x0000 (0x07E0 - 0x07E0)
class UTwinInspectOccupiedLocker final : public UBaseTwinInspectLocker
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinInspectOccupiedLocker">();
	}
	static class UTwinInspectOccupiedLocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinInspectOccupiedLocker>();
	}
};
static_assert(alignof(UTwinInspectOccupiedLocker) == 0x000010, "Wrong alignment on UTwinInspectOccupiedLocker");
static_assert(sizeof(UTwinInspectOccupiedLocker) == 0x0007E0, "Wrong size on UTwinInspectOccupiedLocker");

// Class TheTwins.Addon_K22Power_18
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_18 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _timedRevealToKillerStatusEffectClass;             // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _auraRevealedDuration;                             // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_18">();
	}
	static class UAddon_K22Power_18* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_18>();
	}
};
static_assert(alignof(UAddon_K22Power_18) == 0x000008, "Wrong alignment on UAddon_K22Power_18");
static_assert(sizeof(UAddon_K22Power_18) == 0x000308, "Wrong size on UAddon_K22Power_18");
static_assert(offsetof(UAddon_K22Power_18, _timedRevealToKillerStatusEffectClass) == 0x0002F8, "Member 'UAddon_K22Power_18::_timedRevealToKillerStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_18, _auraRevealedDuration) == 0x000300, "Member 'UAddon_K22Power_18::_auraRevealedDuration' has a wrong offset!");

// Class TheTwins.TwinJumpAttack
// 0x0150 (0x0570 - 0x0420)
class UTwinJumpAttack final : public UPounceAttack
{
public:
	bool                                          _wasLastAttackSuccessful;                          // 0x0420(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _jumpVelocity;                                     // 0x0428(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            _jumpAngleCurve;                                   // 0x0450(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x48];                                     // 0x0458(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _upDownObstructionAnglePrecision;                  // 0x04A0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _leftRightObstructionAnglePrecision;               // 0x04C8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _authorizedLandingHeight;                          // 0x04F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x9];                                      // 0x0518(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _shouldTwinHaveJumpObjectType;                     // 0x0521(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_522[0x4E];                                     // 0x0522(0x004E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_Debug_PrintLandingLocationDebug(const bool FoundProjectedPoint, const bool FoundPath);
	void Cosmetic_OnIsForbiddenLandingLocationChanged(bool IsForbiddenLocation, class AConjoinedTwin* Twin);
	void Cosmetic_OnJumpCooldownChanged(bool IsInJumpCooldown, class AConjoinedTwin* OwningTwin);
	void Cosmetic_OnJumpLanded(class AConjoinedTwin* OwningTwin);
	void Cosmetic_OnJumpObstructed(class AConjoinedTwin* OwningTwin);
	void Cosmetic_OnJumpStarted(class AConjoinedTwin* OwningTwin);
	void Cosmetic_OnSuccessfulJumpAttack(class AConjoinedTwin* OwningTwin);
	void Cosmetic_OnUnSuccessfulJumpAttack(class AConjoinedTwin* OwningTwin);
	void Multicast_AttachToSurvivor(class ADBDPlayer* SurvivorToAttachTo);
	void Multicast_DestroyTwinOnWrongLanding();
	void Multicast_SetIsForbiddenLandingLocation(bool IsForbiddenLocation);
	void OnRep_ShouldTwinHaveJumpObjectType();
	void Server_OnJumpStartTwin();
	void Server_StopJump();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpAttack">();
	}
	static class UTwinJumpAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpAttack>();
	}
};
static_assert(alignof(UTwinJumpAttack) == 0x000010, "Wrong alignment on UTwinJumpAttack");
static_assert(sizeof(UTwinJumpAttack) == 0x000570, "Wrong size on UTwinJumpAttack");
static_assert(offsetof(UTwinJumpAttack, _wasLastAttackSuccessful) == 0x000420, "Member 'UTwinJumpAttack::_wasLastAttackSuccessful' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttack, _jumpVelocity) == 0x000428, "Member 'UTwinJumpAttack::_jumpVelocity' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttack, _jumpAngleCurve) == 0x000450, "Member 'UTwinJumpAttack::_jumpAngleCurve' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttack, _upDownObstructionAnglePrecision) == 0x0004A0, "Member 'UTwinJumpAttack::_upDownObstructionAnglePrecision' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttack, _leftRightObstructionAnglePrecision) == 0x0004C8, "Member 'UTwinJumpAttack::_leftRightObstructionAnglePrecision' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttack, _authorizedLandingHeight) == 0x0004F0, "Member 'UTwinJumpAttack::_authorizedLandingHeight' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttack, _shouldTwinHaveJumpObjectType) == 0x000521, "Member 'UTwinJumpAttack::_shouldTwinHaveJumpObjectType' has a wrong offset!");

// Class TheTwins.Addon_K22Power_19
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_19 final : public UOnEventBaseAddon
{
public:
	float                                         _undetectableDuration;                             // 0x02F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _undetectableEffectClass;                          // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_19">();
	}
	static class UAddon_K22Power_19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_19>();
	}
};
static_assert(alignof(UAddon_K22Power_19) == 0x000008, "Wrong alignment on UAddon_K22Power_19");
static_assert(sizeof(UAddon_K22Power_19) == 0x000308, "Wrong size on UAddon_K22Power_19");
static_assert(offsetof(UAddon_K22Power_19, _undetectableDuration) == 0x0002F8, "Member 'UAddon_K22Power_19::_undetectableDuration' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_19, _undetectableEffectClass) == 0x000300, "Member 'UAddon_K22Power_19::_undetectableEffectClass' has a wrong offset!");

// Class TheTwins.TwinJumpAttackOpenSubstate
// 0x0108 (0x0238 - 0x0130)
class UTwinJumpAttackOpenSubstate final : public UPounceAttackOpenSubstate
{
public:
	uint8                                         Pad_130[0x108];                                    // 0x0130(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Local_OnTwinCapsuleHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void Local_OnTwinOverlapEnter(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpAttackOpenSubstate">();
	}
	static class UTwinJumpAttackOpenSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpAttackOpenSubstate>();
	}
};
static_assert(alignof(UTwinJumpAttackOpenSubstate) == 0x000008, "Wrong alignment on UTwinJumpAttackOpenSubstate");
static_assert(sizeof(UTwinJumpAttackOpenSubstate) == 0x000238, "Wrong size on UTwinJumpAttackOpenSubstate");

// Class TheTwins.Addon_K22Power_20
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_20 final : public UOnEventBaseAddon
{
public:
	float                                         _exposedDuration;                                  // 0x02F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              _exposedEffect;                                    // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_20">();
	}
	static class UAddon_K22Power_20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_20>();
	}
};
static_assert(alignof(UAddon_K22Power_20) == 0x000008, "Wrong alignment on UAddon_K22Power_20");
static_assert(sizeof(UAddon_K22Power_20) == 0x000308, "Wrong size on UAddon_K22Power_20");
static_assert(offsetof(UAddon_K22Power_20, _exposedDuration) == 0x0002F8, "Member 'UAddon_K22Power_20::_exposedDuration' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_20, _exposedEffect) == 0x000300, "Member 'UAddon_K22Power_20::_exposedEffect' has a wrong offset!");

// Class TheTwins.TwinJumpAttackSuccessSubstate
// 0x0050 (0x0168 - 0x0118)
class UTwinJumpAttackSuccessSubstate final : public UPounceAttackSuccessSubstate
{
public:
	struct FDBDTunableRowHandle                   _jumpSucceedAttachedCooldownTime;                  // 0x0118(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _jumpSucceedNotAttachedCooldownTime;               // 0x0140(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpAttackSuccessSubstate">();
	}
	static class UTwinJumpAttackSuccessSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpAttackSuccessSubstate>();
	}
};
static_assert(alignof(UTwinJumpAttackSuccessSubstate) == 0x000008, "Wrong alignment on UTwinJumpAttackSuccessSubstate");
static_assert(sizeof(UTwinJumpAttackSuccessSubstate) == 0x000168, "Wrong size on UTwinJumpAttackSuccessSubstate");
static_assert(offsetof(UTwinJumpAttackSuccessSubstate, _jumpSucceedAttachedCooldownTime) == 0x000118, "Member 'UTwinJumpAttackSuccessSubstate::_jumpSucceedAttachedCooldownTime' has a wrong offset!");
static_assert(offsetof(UTwinJumpAttackSuccessSubstate, _jumpSucceedNotAttachedCooldownTime) == 0x000140, "Member 'UTwinJumpAttackSuccessSubstate::_jumpSucceedNotAttachedCooldownTime' has a wrong offset!");

// Class TheTwins.Addon_K22Power_8
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_8 final : public USpawnEffectsOnAllSurvivorsBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _survivorDestroyTwinMaxChargeAdditiveEffectClass;  // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _increaseDestroyTwinTime;                          // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_8">();
	}
	static class UAddon_K22Power_8* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_8>();
	}
};
static_assert(alignof(UAddon_K22Power_8) == 0x000008, "Wrong alignment on UAddon_K22Power_8");
static_assert(sizeof(UAddon_K22Power_8) == 0x000308, "Wrong size on UAddon_K22Power_8");
static_assert(offsetof(UAddon_K22Power_8, _survivorDestroyTwinMaxChargeAdditiveEffectClass) == 0x0002F8, "Member 'UAddon_K22Power_8::_survivorDestroyTwinMaxChargeAdditiveEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_8, _increaseDestroyTwinTime) == 0x000300, "Member 'UAddon_K22Power_8::_increaseDestroyTwinTime' has a wrong offset!");

// Class TheTwins.TwinJumpAttackMissSubstate
// 0x0000 (0x0120 - 0x0120)
class UTwinJumpAttackMissSubstate final : public UPounceAttackMissSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpAttackMissSubstate">();
	}
	static class UTwinJumpAttackMissSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpAttackMissSubstate>();
	}
};
static_assert(alignof(UTwinJumpAttackMissSubstate) == 0x000008, "Wrong alignment on UTwinJumpAttackMissSubstate");
static_assert(sizeof(UTwinJumpAttackMissSubstate) == 0x000120, "Wrong size on UTwinJumpAttackMissSubstate");

// Class TheTwins.Addon_K22Power_9
// 0x0010 (0x0308 - 0x02F8)
class UAddon_K22Power_9 final : public UOnEventBaseAddon
{
public:
	TSubclassOf<class UStatusEffect>              _blindnessStatusEffectClass;                       // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _blindnessDuration;                                // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Addon_K22Power_9">();
	}
	static class UAddon_K22Power_9* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddon_K22Power_9>();
	}
};
static_assert(alignof(UAddon_K22Power_9) == 0x000008, "Wrong alignment on UAddon_K22Power_9");
static_assert(sizeof(UAddon_K22Power_9) == 0x000308, "Wrong size on UAddon_K22Power_9");
static_assert(offsetof(UAddon_K22Power_9, _blindnessStatusEffectClass) == 0x0002F8, "Member 'UAddon_K22Power_9::_blindnessStatusEffectClass' has a wrong offset!");
static_assert(offsetof(UAddon_K22Power_9, _blindnessDuration) == 0x000300, "Member 'UAddon_K22Power_9::_blindnessDuration' has a wrong offset!");

// Class TheTwins.TwinJumpAttackObstructSubstate
// 0x0000 (0x0128 - 0x0128)
class UTwinJumpAttackObstructSubstate final : public UPounceAttackObstructSubstate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpAttackObstructSubstate">();
	}
	static class UTwinJumpAttackObstructSubstate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpAttackObstructSubstate>();
	}
};
static_assert(alignof(UTwinJumpAttackObstructSubstate) == 0x000008, "Wrong alignment on UTwinJumpAttackObstructSubstate");
static_assert(sizeof(UTwinJumpAttackObstructSubstate) == 0x000128, "Wrong size on UTwinJumpAttackObstructSubstate");

// Class TheTwins.AISkill_FindInteractable_CrushTwin
// 0x0158 (0x0460 - 0x0308)
class UAISkill_FindInteractable_CrushTwin final : public UAISkill_FindInteractable
{
public:
	uint8                                         Pad_308[0x10];                                     // 0x0308(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAITunableParameter                    _crushVictorGoalWeight;                            // 0x0318(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAITunableParameter                    _recoveringTimeEstimationErrorMin;                 // 0x0378(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAITunableParameter                    _recoveringTimeEstimationErrorMax;                 // 0x03D8(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _destroyTwinMaxCharge;                             // 0x0438(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_FindInteractable_CrushTwin">();
	}
	static class UAISkill_FindInteractable_CrushTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_FindInteractable_CrushTwin>();
	}
};
static_assert(alignof(UAISkill_FindInteractable_CrushTwin) == 0x000008, "Wrong alignment on UAISkill_FindInteractable_CrushTwin");
static_assert(sizeof(UAISkill_FindInteractable_CrushTwin) == 0x000460, "Wrong size on UAISkill_FindInteractable_CrushTwin");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _crushVictorGoalWeight) == 0x000318, "Member 'UAISkill_FindInteractable_CrushTwin::_crushVictorGoalWeight' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _recoveringTimeEstimationErrorMin) == 0x000378, "Member 'UAISkill_FindInteractable_CrushTwin::_recoveringTimeEstimationErrorMin' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _recoveringTimeEstimationErrorMax) == 0x0003D8, "Member 'UAISkill_FindInteractable_CrushTwin::_recoveringTimeEstimationErrorMax' has a wrong offset!");
static_assert(offsetof(UAISkill_FindInteractable_CrushTwin, _destroyTwinMaxCharge) == 0x000438, "Member 'UAISkill_FindInteractable_CrushTwin::_destroyTwinMaxCharge' has a wrong offset!");

// Class TheTwins.TwinJumpAudioMutedEffect
// 0x0000 (0x0380 - 0x0380)
class UTwinJumpAudioMutedEffect final : public UStatusEffect
{
public:
	void Cosmetic_OnTwinMuted();
	void Cosmetic_OnTwinUnmuted();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpAudioMutedEffect">();
	}
	static class UTwinJumpAudioMutedEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpAudioMutedEffect>();
	}
};
static_assert(alignof(UTwinJumpAudioMutedEffect) == 0x000008, "Wrong alignment on UTwinJumpAudioMutedEffect");
static_assert(sizeof(UTwinJumpAudioMutedEffect) == 0x000380, "Wrong size on UTwinJumpAudioMutedEffect");

// Class TheTwins.AISkill_Interaction_RemoveTwin
// 0x0028 (0x02A8 - 0x0280)
class UAISkill_Interaction_RemoveTwin final : public UAISkill_Interaction
{
public:
	struct FDBDTunableRowHandle                   _removeTwinMaxCharge;                              // 0x0280(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISkill_Interaction_RemoveTwin">();
	}
	static class UAISkill_Interaction_RemoveTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISkill_Interaction_RemoveTwin>();
	}
};
static_assert(alignof(UAISkill_Interaction_RemoveTwin) == 0x000008, "Wrong alignment on UAISkill_Interaction_RemoveTwin");
static_assert(sizeof(UAISkill_Interaction_RemoveTwin) == 0x0002A8, "Wrong size on UAISkill_Interaction_RemoveTwin");
static_assert(offsetof(UAISkill_Interaction_RemoveTwin, _removeTwinMaxCharge) == 0x000280, "Member 'UAISkill_Interaction_RemoveTwin::_removeTwinMaxCharge' has a wrong offset!");

// Class TheTwins.TwinJumpTargetVisibleEffect
// 0x0018 (0x0398 - 0x0380)
class UTwinJumpTargetVisibleEffect final : public UStatusEffect
{
public:
	TSubclassOf<class AActor>                     _twinJumpTargetObject;                             // 0x0380(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 _twinJumpTarget;                                   // 0x0388(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USelectiveVisibilityComponent*          _jumpTargetVisibility;                             // 0x0390(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnHideTargetPosition();
	void OnJumpTargetTick(const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwinJumpTargetVisibleEffect">();
	}
	static class UTwinJumpTargetVisibleEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwinJumpTargetVisibleEffect>();
	}
};
static_assert(alignof(UTwinJumpTargetVisibleEffect) == 0x000008, "Wrong alignment on UTwinJumpTargetVisibleEffect");
static_assert(sizeof(UTwinJumpTargetVisibleEffect) == 0x000398, "Wrong size on UTwinJumpTargetVisibleEffect");
static_assert(offsetof(UTwinJumpTargetVisibleEffect, _twinJumpTargetObject) == 0x000380, "Member 'UTwinJumpTargetVisibleEffect::_twinJumpTargetObject' has a wrong offset!");
static_assert(offsetof(UTwinJumpTargetVisibleEffect, _twinJumpTarget) == 0x000388, "Member 'UTwinJumpTargetVisibleEffect::_twinJumpTarget' has a wrong offset!");
static_assert(offsetof(UTwinJumpTargetVisibleEffect, _jumpTargetVisibility) == 0x000390, "Member 'UTwinJumpTargetVisibleEffect::_jumpTargetVisibility' has a wrong offset!");

// Class TheTwins.PossessPlayer
// 0x0030 (0x08F0 - 0x08C0)
class UPossessPlayer : public UChargeableInteractionDefinition
{
public:
	struct FDBDTunableRowHandle                   _possessThePlayerMaxCharge;                        // 0x08C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8E8[0x8];                                      // 0x08E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnPossessCancelled(class ADBDPlayer* Player);
	void Cosmetic_OnPossessStart(class ADBDPlayer* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PossessPlayer">();
	}
	static class UPossessPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPossessPlayer>();
	}
};
static_assert(alignof(UPossessPlayer) == 0x000010, "Wrong alignment on UPossessPlayer");
static_assert(sizeof(UPossessPlayer) == 0x0008F0, "Wrong size on UPossessPlayer");
static_assert(offsetof(UPossessPlayer, _possessThePlayerMaxCharge) == 0x0008C0, "Member 'UPossessPlayer::_possessThePlayerMaxCharge' has a wrong offset!");

// Class TheTwins.PossessTheConjoinedTwin
// 0x0070 (0x0960 - 0x08F0)
class UPossessTheConjoinedTwin : public UPossessPlayer
{
public:
	uint8                                         Pad_8F0[0x70];                                     // 0x08F0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPowerCollected(class ADBDPlayer* Collector);
	void OnTwinSet(class AConjoinedTwin* Twin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PossessTheConjoinedTwin">();
	}
	static class UPossessTheConjoinedTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPossessTheConjoinedTwin>();
	}
};
static_assert(alignof(UPossessTheConjoinedTwin) == 0x000010, "Wrong alignment on UPossessTheConjoinedTwin");
static_assert(sizeof(UPossessTheConjoinedTwin) == 0x000960, "Wrong size on UPossessTheConjoinedTwin");

// Class TheTwins.AutoPossessTheConjoinedTwin
// 0x0000 (0x0960 - 0x0960)
class UAutoPossessTheConjoinedTwin final : public UPossessTheConjoinedTwin
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoPossessTheConjoinedTwin">();
	}
	static class UAutoPossessTheConjoinedTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoPossessTheConjoinedTwin>();
	}
};
static_assert(alignof(UAutoPossessTheConjoinedTwin) == 0x000010, "Wrong alignment on UAutoPossessTheConjoinedTwin");
static_assert(sizeof(UAutoPossessTheConjoinedTwin) == 0x000960, "Wrong size on UAutoPossessTheConjoinedTwin");

// Class TheTwins.BeingPossessedInteraction
// 0x0090 (0x0950 - 0x08C0)
class UBeingPossessedInteraction : public UChargeableInteractionDefinition
{
public:
	class UCurveFloat*                            _wakeUpSpeedCurve;                                 // 0x08C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                           _beingPossessedMaxCharge;                          // 0x08C8(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeingPossessedInteraction">();
	}
	static class UBeingPossessedInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeingPossessedInteraction>();
	}
};
static_assert(alignof(UBeingPossessedInteraction) == 0x000010, "Wrong alignment on UBeingPossessedInteraction");
static_assert(sizeof(UBeingPossessedInteraction) == 0x000950, "Wrong size on UBeingPossessedInteraction");
static_assert(offsetof(UBeingPossessedInteraction, _wakeUpSpeedCurve) == 0x0008C0, "Member 'UBeingPossessedInteraction::_wakeUpSpeedCurve' has a wrong offset!");
static_assert(offsetof(UBeingPossessedInteraction, _beingPossessedMaxCharge) == 0x0008C8, "Member 'UBeingPossessedInteraction::_beingPossessedMaxCharge' has a wrong offset!");

// Class TheTwins.BrotherBlindFlashlightableLightingStrategy
// 0x0018 (0x0068 - 0x0050)
class UBrotherBlindFlashlightableLightingStrategy final : public UBlindFlashlightableLightingStrategy
{
public:
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrotherBlindFlashlightableLightingStrategy">();
	}
	static class UBrotherBlindFlashlightableLightingStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrotherBlindFlashlightableLightingStrategy>();
	}
};
static_assert(alignof(UBrotherBlindFlashlightableLightingStrategy) == 0x000008, "Wrong alignment on UBrotherBlindFlashlightableLightingStrategy");
static_assert(sizeof(UBrotherBlindFlashlightableLightingStrategy) == 0x000068, "Wrong size on UBrotherBlindFlashlightableLightingStrategy");

// Class TheTwins.ChargeTwinJumpInteraction
// 0x0150 (0x0A10 - 0x08C0)
class UChargeTwinJumpInteraction final : public UChargeableInteractionDefinition
{
public:
	uint8                                         Pad_8C0[0x48];                                     // 0x08C0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _chargeJumpMaxCharge;                              // 0x0908(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMax;                          // 0x0930(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _interactionViewPitchMin;                          // 0x0958(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_980[0x30];                                     // 0x0980(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _cancelCooldownTime;                               // 0x09B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9D8[0x38];                                     // 0x09D8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cosmetic_OnJumpReadyChanged(class ADBDPlayer* Twin, const bool Ready);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChargeTwinJumpInteraction">();
	}
	static class UChargeTwinJumpInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChargeTwinJumpInteraction>();
	}
};
static_assert(alignof(UChargeTwinJumpInteraction) == 0x000010, "Wrong alignment on UChargeTwinJumpInteraction");
static_assert(sizeof(UChargeTwinJumpInteraction) == 0x000A10, "Wrong size on UChargeTwinJumpInteraction");
static_assert(offsetof(UChargeTwinJumpInteraction, _chargeJumpMaxCharge) == 0x000908, "Member 'UChargeTwinJumpInteraction::_chargeJumpMaxCharge' has a wrong offset!");
static_assert(offsetof(UChargeTwinJumpInteraction, _interactionViewPitchMax) == 0x000930, "Member 'UChargeTwinJumpInteraction::_interactionViewPitchMax' has a wrong offset!");
static_assert(offsetof(UChargeTwinJumpInteraction, _interactionViewPitchMin) == 0x000958, "Member 'UChargeTwinJumpInteraction::_interactionViewPitchMin' has a wrong offset!");
static_assert(offsetof(UChargeTwinJumpInteraction, _cancelCooldownTime) == 0x0009B0, "Member 'UChargeTwinJumpInteraction::_cancelCooldownTime' has a wrong offset!");

// Class TheTwins.ConjoinedTwin
// 0x0200 (0x1740 - 0x1540)
class AConjoinedTwin final : public ADBDPlayer
{
public:
	class URangeToActorsTrackerComponent*         _restrictedPossessionAreaTracker;                  // 0x1540(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTwinOutlineUpdateStrategy*             _twinOutlineUpdateStrategy;                        // 0x1548(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           _twinLullabyAudioComponent;                        // 0x1550(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKillerBlindingFXComponent*             _twinBlindingFX;                                   // 0x1558(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TwinNoiseRange;                                    // 0x1560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1564[0x4];                                     // 0x1564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizedAudioComponent*              _customizedAudio;                                  // 0x1568(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDBDAttackerComponent*                  _attackerComponent;                                // 0x1570(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _maxWalkSpeed;                                     // 0x1578(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UHitValidatorComponent*                 _hitValidator;                                     // 0x15A0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitValidatorConfigurator*              _hitValidationConfigurator;                        // 0x15A8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _gravityScale;                                     // 0x15B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAnimationMontageSlave*                 _animationFollower;                                // 0x15D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15E0[0x20];                                    // 0x15E0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _revealDurationOnAttached;                         // 0x1600(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UTwinFirstPersonViewComponent*          _firstPersonViewComponent;                         // 0x1628(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFlashlightableComponent*               _eyesFlashlightable;                               // 0x1630(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlindFlashlightTargetFXComponent*      _blindFlashlightTargetFXComponent;                 // 0x1638(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URangedExplosiveEffectHandlerComponent* _rangedExplosiveEffectHandlerComponent;            // 0x1640(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1648[0x8];                                     // 0x1648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFastTimer                             _flashlightBlindEvasionScoreTimer;                 // 0x1650(0x0030)(Transient, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _flashlightEvasionScoreCooldown;                   // 0x1680(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _hideFootstepsEffect;                              // 0x16A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsBloodhoundEffect;                            // 0x16B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsRevealKillerAuraEffect;                      // 0x16B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsDormantKillerInstinctEffect;                 // 0x16C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsRevealAuraOnAttachedToSurvivorEffect;        // 0x16C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _twinsRevealAuraOnRecallReadyEffect;               // 0x16D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              _timeDeafenedOnTriggerEffect;                      // 0x16D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTwinPossessNegationEffectComponent*    _twinPossessNegationEffectComponent;               // 0x16E0(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16E8[0x58];                                    // 0x16E8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnFirecrackerInRangeBegin(const struct FRangedExplosiveEffectData& EffectData);
	void Cosmetic_OnOnGroundUncontrolledChanged(bool OnGroundAndUncontrolled);
	void OnFinishedPlayingEvent(const struct FGameplayTag& GameEventType, const struct FGameEventData& GameEventData);
	void Server_SendAttackInput(bool Pressed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConjoinedTwin">();
	}
	static class AConjoinedTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConjoinedTwin>();
	}
};
static_assert(alignof(AConjoinedTwin) == 0x000010, "Wrong alignment on AConjoinedTwin");
static_assert(sizeof(AConjoinedTwin) == 0x001740, "Wrong size on AConjoinedTwin");
static_assert(offsetof(AConjoinedTwin, _restrictedPossessionAreaTracker) == 0x001540, "Member 'AConjoinedTwin::_restrictedPossessionAreaTracker' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinOutlineUpdateStrategy) == 0x001548, "Member 'AConjoinedTwin::_twinOutlineUpdateStrategy' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinLullabyAudioComponent) == 0x001550, "Member 'AConjoinedTwin::_twinLullabyAudioComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinBlindingFX) == 0x001558, "Member 'AConjoinedTwin::_twinBlindingFX' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, TwinNoiseRange) == 0x001560, "Member 'AConjoinedTwin::TwinNoiseRange' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _customizedAudio) == 0x001568, "Member 'AConjoinedTwin::_customizedAudio' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _attackerComponent) == 0x001570, "Member 'AConjoinedTwin::_attackerComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _maxWalkSpeed) == 0x001578, "Member 'AConjoinedTwin::_maxWalkSpeed' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _hitValidator) == 0x0015A0, "Member 'AConjoinedTwin::_hitValidator' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _hitValidationConfigurator) == 0x0015A8, "Member 'AConjoinedTwin::_hitValidationConfigurator' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _gravityScale) == 0x0015B0, "Member 'AConjoinedTwin::_gravityScale' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _animationFollower) == 0x0015D8, "Member 'AConjoinedTwin::_animationFollower' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _revealDurationOnAttached) == 0x001600, "Member 'AConjoinedTwin::_revealDurationOnAttached' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _firstPersonViewComponent) == 0x001628, "Member 'AConjoinedTwin::_firstPersonViewComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _eyesFlashlightable) == 0x001630, "Member 'AConjoinedTwin::_eyesFlashlightable' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _blindFlashlightTargetFXComponent) == 0x001638, "Member 'AConjoinedTwin::_blindFlashlightTargetFXComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _rangedExplosiveEffectHandlerComponent) == 0x001640, "Member 'AConjoinedTwin::_rangedExplosiveEffectHandlerComponent' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _flashlightBlindEvasionScoreTimer) == 0x001650, "Member 'AConjoinedTwin::_flashlightBlindEvasionScoreTimer' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _flashlightEvasionScoreCooldown) == 0x001680, "Member 'AConjoinedTwin::_flashlightEvasionScoreCooldown' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _hideFootstepsEffect) == 0x0016A8, "Member 'AConjoinedTwin::_hideFootstepsEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsBloodhoundEffect) == 0x0016B0, "Member 'AConjoinedTwin::_twinsBloodhoundEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsRevealKillerAuraEffect) == 0x0016B8, "Member 'AConjoinedTwin::_twinsRevealKillerAuraEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsDormantKillerInstinctEffect) == 0x0016C0, "Member 'AConjoinedTwin::_twinsDormantKillerInstinctEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsRevealAuraOnAttachedToSurvivorEffect) == 0x0016C8, "Member 'AConjoinedTwin::_twinsRevealAuraOnAttachedToSurvivorEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinsRevealAuraOnRecallReadyEffect) == 0x0016D0, "Member 'AConjoinedTwin::_twinsRevealAuraOnRecallReadyEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _timeDeafenedOnTriggerEffect) == 0x0016D8, "Member 'AConjoinedTwin::_timeDeafenedOnTriggerEffect' has a wrong offset!");
static_assert(offsetof(AConjoinedTwin, _twinPossessNegationEffectComponent) == 0x0016E0, "Member 'AConjoinedTwin::_twinPossessNegationEffectComponent' has a wrong offset!");

// Class TheTwins.ConjoinedTwinAnimInstance
// 0x00E0 (0x06C0 - 0x05E0)
class UConjoinedTwinAnimInstance final : public UPlayerAnimInstance
{
public:
	class AConjoinedTwin*                         _owningConjoinedTwin;                              // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _firstPersonView;                                  // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _forwardVelocity;                                  // 0x05E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _lateralVelocity;                                  // 0x05E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionAnimation                         _interactionType;                                  // 0x05EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isInAir;                                          // 0x05ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isIdle;                                           // 0x05EE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5EF[0x1];                                      // 0x05EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _idleTime;                                         // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttacking;                                      // 0x05F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDAttackerComponent*                  _attackerComponent;                                // 0x05F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTwinAttachmentComponent*               _twinAttachmentComponent;                          // 0x0600(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTwinLockerBlockerComponent*            _twinLockerBlockerComponent;                       // 0x0608(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animYaw;                                          // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animPitch;                                        // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isSpectator;                                      // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _animDirection;                                    // 0x061C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _animSpeed;                                        // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isAttachedToSister;                               // 0x0624(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
