#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TheWraith

#include "Basic.hpp"


namespace SDK::Params
{

// Function TheWraith.WraithPower.IsCloaking
// 0x0001 (0x0001 - 0x0000)
struct WraithPower_IsCloaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WraithPower_IsCloaking) == 0x000001, "Wrong alignment on WraithPower_IsCloaking");
static_assert(sizeof(WraithPower_IsCloaking) == 0x000001, "Wrong size on WraithPower_IsCloaking");
static_assert(offsetof(WraithPower_IsCloaking, ReturnValue) == 0x000000, "Member 'WraithPower_IsCloaking::ReturnValue' has a wrong offset!");

// Function TheWraith.WraithPower.IsUncloaking
// 0x0001 (0x0001 - 0x0000)
struct WraithPower_IsUncloaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WraithPower_IsUncloaking) == 0x000001, "Wrong alignment on WraithPower_IsUncloaking");
static_assert(sizeof(WraithPower_IsUncloaking) == 0x000001, "Wrong size on WraithPower_IsUncloaking");
static_assert(offsetof(WraithPower_IsUncloaking, ReturnValue) == 0x000000, "Member 'WraithPower_IsUncloaking::ReturnValue' has a wrong offset!");

}

