#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TileBase01

#include "Basic.hpp"


namespace SDK::Params
{

// Function TileBase01.TileBase01_C.ExecuteUbergraph_TileBase01
// 0x0070 (0x0070 - 0x0000)
struct TileBase01_C_ExecuteUbergraph_TileBase01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDGameState*                          K2Node_DynamicCast_AsDBDGame_State;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameLevelLoaded_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTileSpawnPoint*                        K2Node_CustomEvent_SpawnPoint;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedObject;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_CustomEvent_Generators;                     // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGenerator*                             K2Node_DynamicCast_AsGenerator;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileBase01_C_ExecuteUbergraph_TileBase01) == 0x000008, "Wrong alignment on TileBase01_C_ExecuteUbergraph_TileBase01");
static_assert(sizeof(TileBase01_C_ExecuteUbergraph_TileBase01) == 0x000070, "Wrong size on TileBase01_C_ExecuteUbergraph_TileBase01");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, EntryPoint) == 0x000000, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::EntryPoint' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_DynamicCast_AsDBDGame_State) == 0x000020, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_DynamicCast_AsDBDGame_State' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_GetGameLevelLoaded_ReturnValue) == 0x000029, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_GetGameLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_CustomEvent_SpawnPoint) == 0x000030, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_CustomEvent_SpawnPoint' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_CustomEvent_SpawnedObject) == 0x000038, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_CustomEvent_SpawnedObject' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_CustomEvent_Generators) == 0x000040, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_CustomEvent_Generators' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_Array_Get_Item) == 0x000050, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_DynamicCast_AsGenerator) == 0x000058, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_DynamicCast_AsGenerator' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TileBase01_C_ExecuteUbergraph_TileBase01, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'TileBase01_C_ExecuteUbergraph_TileBase01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TileBase01.TileBase01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TileBase01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileBase01_C_ReceiveTick) == 0x000004, "Wrong alignment on TileBase01_C_ReceiveTick");
static_assert(sizeof(TileBase01_C_ReceiveTick) == 0x000004, "Wrong size on TileBase01_C_ReceiveTick");
static_assert(offsetof(TileBase01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TileBase01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function TileBase01.TileBase01_C.SelectSpawnPoint
// 0x0010 (0x0010 - 0x0000)
struct TileBase01_C_SelectSpawnPoint final
{
public:
	TArray<class UTileSpawnPoint*>                Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(TileBase01_C_SelectSpawnPoint) == 0x000008, "Wrong alignment on TileBase01_C_SelectSpawnPoint");
static_assert(sizeof(TileBase01_C_SelectSpawnPoint) == 0x000010, "Wrong size on TileBase01_C_SelectSpawnPoint");
static_assert(offsetof(TileBase01_C_SelectSpawnPoint, Array) == 0x000000, "Member 'TileBase01_C_SelectSpawnPoint::Array' has a wrong offset!");

// Function TileBase01.TileBase01_C.SetGeneratorDrivenObjects
// 0x0010 (0x0010 - 0x0000)
struct TileBase01_C_SetGeneratorDrivenObjects final
{
public:
	class UTileSpawnPoint*                        SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedObject;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TileBase01_C_SetGeneratorDrivenObjects) == 0x000008, "Wrong alignment on TileBase01_C_SetGeneratorDrivenObjects");
static_assert(sizeof(TileBase01_C_SetGeneratorDrivenObjects) == 0x000010, "Wrong size on TileBase01_C_SetGeneratorDrivenObjects");
static_assert(offsetof(TileBase01_C_SetGeneratorDrivenObjects, SpawnPoint) == 0x000000, "Member 'TileBase01_C_SetGeneratorDrivenObjects::SpawnPoint' has a wrong offset!");
static_assert(offsetof(TileBase01_C_SetGeneratorDrivenObjects, SpawnedObject) == 0x000008, "Member 'TileBase01_C_SetGeneratorDrivenObjects::SpawnedObject' has a wrong offset!");

// Function TileBase01.TileBase01_C.SetGeneratorDrivenScoreEvent
// 0x0010 (0x0010 - 0x0000)
struct TileBase01_C_SetGeneratorDrivenScoreEvent final
{
public:
	TArray<class AActor*>                         Generators;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TileBase01_C_SetGeneratorDrivenScoreEvent) == 0x000008, "Wrong alignment on TileBase01_C_SetGeneratorDrivenScoreEvent");
static_assert(sizeof(TileBase01_C_SetGeneratorDrivenScoreEvent) == 0x000010, "Wrong size on TileBase01_C_SetGeneratorDrivenScoreEvent");
static_assert(offsetof(TileBase01_C_SetGeneratorDrivenScoreEvent, Generators) == 0x000000, "Member 'TileBase01_C_SetGeneratorDrivenScoreEvent::Generators' has a wrong offset!");

// Function TileBase01.TileBase01_C.SetupGeneratorDrivenElements
// 0x0018 (0x0018 - 0x0000)
struct TileBase01_C_SetupGeneratorDrivenElements final
{
public:
	class AActor*                                 GeneratorSpawnPoint;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UChildActorComponent*>           GeneratorDrivenElements;                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(TileBase01_C_SetupGeneratorDrivenElements) == 0x000008, "Wrong alignment on TileBase01_C_SetupGeneratorDrivenElements");
static_assert(sizeof(TileBase01_C_SetupGeneratorDrivenElements) == 0x000018, "Wrong size on TileBase01_C_SetupGeneratorDrivenElements");
static_assert(offsetof(TileBase01_C_SetupGeneratorDrivenElements, GeneratorSpawnPoint) == 0x000000, "Member 'TileBase01_C_SetupGeneratorDrivenElements::GeneratorSpawnPoint' has a wrong offset!");
static_assert(offsetof(TileBase01_C_SetupGeneratorDrivenElements, GeneratorDrivenElements) == 0x000008, "Member 'TileBase01_C_SetupGeneratorDrivenElements::GeneratorDrivenElements' has a wrong offset!");

}

