#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrapperKill

#include "Basic.hpp"


namespace SDK::Params
{

// Function TrapperKill.TrapperKill_C.OnInteractionExitEnd
// 0x0008 (0x0008 - 0x0000)
struct TrapperKill_C_OnInteractionExitEnd final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapperKill_C_OnInteractionExitEnd) == 0x000008, "Wrong alignment on TrapperKill_C_OnInteractionExitEnd");
static_assert(sizeof(TrapperKill_C_OnInteractionExitEnd) == 0x000008, "Wrong size on TrapperKill_C_OnInteractionExitEnd");
static_assert(offsetof(TrapperKill_C_OnInteractionExitEnd, Player) == 0x000000, "Member 'TrapperKill_C_OnInteractionExitEnd::Player' has a wrong offset!");

// Function TrapperKill.TrapperKill_C.OnInteractionCompletionStateChanged
// 0x0010 (0x0010 - 0x0000)
struct TrapperKill_C_OnInteractionCompletionStateChanged final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Complete;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapperKill_C_OnInteractionCompletionStateChanged) == 0x000008, "Wrong alignment on TrapperKill_C_OnInteractionCompletionStateChanged");
static_assert(sizeof(TrapperKill_C_OnInteractionCompletionStateChanged) == 0x000010, "Wrong size on TrapperKill_C_OnInteractionCompletionStateChanged");
static_assert(offsetof(TrapperKill_C_OnInteractionCompletionStateChanged, Player) == 0x000000, "Member 'TrapperKill_C_OnInteractionCompletionStateChanged::Player' has a wrong offset!");
static_assert(offsetof(TrapperKill_C_OnInteractionCompletionStateChanged, Complete) == 0x000008, "Member 'TrapperKill_C_OnInteractionCompletionStateChanged::Complete' has a wrong offset!");

// Function TrapperKill.TrapperKill_C.ExecuteUbergraph_TrapperKill
// 0x0030 (0x0030 - 0x0000)
struct TrapperKill_C_ExecuteUbergraph_TrapperKill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_complete;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterInventoryComponent*           CallFunc_GetCharacterInventoryComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterInventoryComponent*           CallFunc_GetCharacterInventoryComponent_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapperKill_C_ExecuteUbergraph_TrapperKill) == 0x000008, "Wrong alignment on TrapperKill_C_ExecuteUbergraph_TrapperKill");
static_assert(sizeof(TrapperKill_C_ExecuteUbergraph_TrapperKill) == 0x000030, "Wrong size on TrapperKill_C_ExecuteUbergraph_TrapperKill");
static_assert(offsetof(TrapperKill_C_ExecuteUbergraph_TrapperKill, EntryPoint) == 0x000000, "Member 'TrapperKill_C_ExecuteUbergraph_TrapperKill::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrapperKill_C_ExecuteUbergraph_TrapperKill, K2Node_Event_player) == 0x000008, "Member 'TrapperKill_C_ExecuteUbergraph_TrapperKill::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(TrapperKill_C_ExecuteUbergraph_TrapperKill, K2Node_Event_player_1) == 0x000010, "Member 'TrapperKill_C_ExecuteUbergraph_TrapperKill::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(TrapperKill_C_ExecuteUbergraph_TrapperKill, K2Node_Event_complete) == 0x000018, "Member 'TrapperKill_C_ExecuteUbergraph_TrapperKill::K2Node_Event_complete' has a wrong offset!");
static_assert(offsetof(TrapperKill_C_ExecuteUbergraph_TrapperKill, CallFunc_GetCharacterInventoryComponent_ReturnValue) == 0x000020, "Member 'TrapperKill_C_ExecuteUbergraph_TrapperKill::CallFunc_GetCharacterInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapperKill_C_ExecuteUbergraph_TrapperKill, CallFunc_GetCharacterInventoryComponent_ReturnValue_1) == 0x000028, "Member 'TrapperKill_C_ExecuteUbergraph_TrapperKill::CallFunc_GetCharacterInventoryComponent_ReturnValue_1' has a wrong offset!");

}

