#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Unhook

#include "Basic.hpp"

#include "DeadByDaylight_structs.hpp"


namespace SDK::Params
{

// Function Unhook.Unhook_C.AddSnapPoint
// 0x0010 (0x0010 - 0x0000)
struct Unhook_C_AddSnapPoint final
{
public:
	class USceneComponent*                        SnapPoint;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Unhook_C_AddSnapPoint) == 0x000008, "Wrong alignment on Unhook_C_AddSnapPoint");
static_assert(sizeof(Unhook_C_AddSnapPoint) == 0x000010, "Wrong size on Unhook_C_AddSnapPoint");
static_assert(offsetof(Unhook_C_AddSnapPoint, SnapPoint) == 0x000000, "Member 'Unhook_C_AddSnapPoint::SnapPoint' has a wrong offset!");
static_assert(offsetof(Unhook_C_AddSnapPoint, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'Unhook_C_AddSnapPoint::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function Unhook.Unhook_C.GetHook
// 0x0020 (0x0020 - 0x0000)
struct Unhook_C_GetHook final
{
public:
	class AMeatHook*                              Hook;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AInteractable*                          CallFunc_GetInteractable_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMeatHook*                              K2Node_DynamicCast_AsMeat_Hook;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Unhook_C_GetHook) == 0x000008, "Wrong alignment on Unhook_C_GetHook");
static_assert(sizeof(Unhook_C_GetHook) == 0x000020, "Wrong size on Unhook_C_GetHook");
static_assert(offsetof(Unhook_C_GetHook, Hook) == 0x000000, "Member 'Unhook_C_GetHook::Hook' has a wrong offset!");
static_assert(offsetof(Unhook_C_GetHook, CallFunc_GetInteractable_ReturnValue) == 0x000008, "Member 'Unhook_C_GetHook::CallFunc_GetInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(Unhook_C_GetHook, K2Node_DynamicCast_AsMeat_Hook) == 0x000010, "Member 'Unhook_C_GetHook::K2Node_DynamicCast_AsMeat_Hook' has a wrong offset!");
static_assert(offsetof(Unhook_C_GetHook, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Unhook_C_GetHook::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Unhook.Unhook_C.ComparePriorityToInteraction
// 0x0010 (0x0010 - 0x0000)
struct Unhook_C_ComparePriorityToInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInteractionComparisonPriority                ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionComparisonPriority                Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionComparisonPriority                Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionComparisonPriority                K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Unhook_C_ComparePriorityToInteraction) == 0x000008, "Wrong alignment on Unhook_C_ComparePriorityToInteraction");
static_assert(sizeof(Unhook_C_ComparePriorityToInteraction) == 0x000010, "Wrong size on Unhook_C_ComparePriorityToInteraction");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, Interaction) == 0x000000, "Member 'Unhook_C_ComparePriorityToInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, ReturnValue) == 0x000008, "Member 'Unhook_C_ComparePriorityToInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, Temp_bool_Variable) == 0x000009, "Member 'Unhook_C_ComparePriorityToInteraction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, Temp_byte_Variable) == 0x00000A, "Member 'Unhook_C_ComparePriorityToInteraction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, CallFunc_HasTag_ReturnValue) == 0x00000B, "Member 'Unhook_C_ComparePriorityToInteraction::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, Temp_byte_Variable_1) == 0x00000C, "Member 'Unhook_C_ComparePriorityToInteraction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Unhook_C_ComparePriorityToInteraction, K2Node_Select_Default) == 0x00000D, "Member 'Unhook_C_ComparePriorityToInteraction::K2Node_Select_Default' has a wrong offset!");

// Function Unhook.Unhook_C.CanOverrideInteraction
// 0x0010 (0x0010 - 0x0000)
struct Unhook_C_CanOverrideInteraction final
{
public:
	const class UInteractionDefinition*           Interaction;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Unhook_C_CanOverrideInteraction) == 0x000008, "Wrong alignment on Unhook_C_CanOverrideInteraction");
static_assert(sizeof(Unhook_C_CanOverrideInteraction) == 0x000010, "Wrong size on Unhook_C_CanOverrideInteraction");
static_assert(offsetof(Unhook_C_CanOverrideInteraction, Interaction) == 0x000000, "Member 'Unhook_C_CanOverrideInteraction::Interaction' has a wrong offset!");
static_assert(offsetof(Unhook_C_CanOverrideInteraction, ReturnValue) == 0x000008, "Member 'Unhook_C_CanOverrideInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(Unhook_C_CanOverrideInteraction, Ret) == 0x000009, "Member 'Unhook_C_CanOverrideInteraction::Ret' has a wrong offset!");
static_assert(offsetof(Unhook_C_CanOverrideInteraction, K2Node_SwitchString_CmpSuccess) == 0x00000A, "Member 'Unhook_C_CanOverrideInteraction::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

