#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultDefinition

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function VaultDefinition.VaultDefinition_C.IsInteractionPossibleClient
// 0x0028 (0x0028 - 0x0000)
struct VaultDefinition_C_IsInteractionPossibleClient final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunning_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindowVaultable_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWindow*                                K2Node_DynamicCast_AsWindow;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultDefinition_C_IsInteractionPossibleClient) == 0x000008, "Wrong alignment on VaultDefinition_C_IsInteractionPossibleClient");
static_assert(sizeof(VaultDefinition_C_IsInteractionPossibleClient) == 0x000028, "Wrong size on VaultDefinition_C_IsInteractionPossibleClient");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, Player) == 0x000000, "Member 'VaultDefinition_C_IsInteractionPossibleClient::Player' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, InteractionType) == 0x000008, "Member 'VaultDefinition_C_IsInteractionPossibleClient::InteractionType' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, ReturnValue) == 0x000009, "Member 'VaultDefinition_C_IsInteractionPossibleClient::ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, Ret) == 0x00000A, "Member 'VaultDefinition_C_IsInteractionPossibleClient::Ret' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, CallFunc_IsRunning_ReturnValue) == 0x00000B, "Member 'VaultDefinition_C_IsInteractionPossibleClient::CallFunc_IsRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, CallFunc_IsWindowVaultable_ReturnValue) == 0x00000C, "Member 'VaultDefinition_C_IsInteractionPossibleClient::CallFunc_IsWindowVaultable_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'VaultDefinition_C_IsInteractionPossibleClient::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'VaultDefinition_C_IsInteractionPossibleClient::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'VaultDefinition_C_IsInteractionPossibleClient::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, K2Node_DynamicCast_AsWindow) == 0x000018, "Member 'VaultDefinition_C_IsInteractionPossibleClient::K2Node_DynamicCast_AsWindow' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleClient, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'VaultDefinition_C_IsInteractionPossibleClient::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function VaultDefinition.VaultDefinition_C.IsInteractionPossibleBP
// 0x0050 (0x0050 - 0x0000)
struct VaultDefinition_C_IsInteractionPossibleBP final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInDropStagger;                                   // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinHeightDelta_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectStateProvider>  CallFunc_HasStateTag_objectStateProvider_CastInput; // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasStateTag_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          K2Node_DynamicCast_AsCamper_Player;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWindow*                                K2Node_DynamicCast_AsWindow;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindowVaultBlockedFor_ReturnValue;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultDefinition_C_IsInteractionPossibleBP) == 0x000008, "Wrong alignment on VaultDefinition_C_IsInteractionPossibleBP");
static_assert(sizeof(VaultDefinition_C_IsInteractionPossibleBP) == 0x000050, "Wrong size on VaultDefinition_C_IsInteractionPossibleBP");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, Player) == 0x000000, "Member 'VaultDefinition_C_IsInteractionPossibleBP::Player' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, InteractionType) == 0x000008, "Member 'VaultDefinition_C_IsInteractionPossibleBP::InteractionType' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, ReturnValue) == 0x000009, "Member 'VaultDefinition_C_IsInteractionPossibleBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, IsInDropStagger) == 0x00000A, "Member 'VaultDefinition_C_IsInteractionPossibleBP::IsInDropStagger' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_IsWithinHeightDelta_ReturnValue) == 0x00000B, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_IsWithinHeightDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_HasStateTag_objectStateProvider_CastInput) == 0x000010, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_HasStateTag_objectStateProvider_CastInput' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_HasStateTag_ReturnValue) == 0x000020, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_HasStateTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, K2Node_DynamicCast_AsCamper_Player) == 0x000028, "Member 'VaultDefinition_C_IsInteractionPossibleBP::K2Node_DynamicCast_AsCamper_Player' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'VaultDefinition_C_IsInteractionPossibleBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, K2Node_DynamicCast_AsWindow) == 0x000040, "Member 'VaultDefinition_C_IsInteractionPossibleBP::K2Node_DynamicCast_AsWindow' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'VaultDefinition_C_IsInteractionPossibleBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_IsWindowVaultBlockedFor_ReturnValue) == 0x000049, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_IsWindowVaultBlockedFor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004A, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultDefinition_C_IsInteractionPossibleBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'VaultDefinition_C_IsInteractionPossibleBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

