#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultFastDefinition

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VaultFastDefinition.VaultFastDefinition_C.OnInteractionEnterStart
// 0x0010 (0x0010 - 0x0000)
struct VaultFastDefinition_C_OnInteractionEnterStart final
{
public:
	class ADBDPlayer*                             Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ActualSnapTime;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultFastDefinition_C_OnInteractionEnterStart) == 0x000008, "Wrong alignment on VaultFastDefinition_C_OnInteractionEnterStart");
static_assert(sizeof(VaultFastDefinition_C_OnInteractionEnterStart) == 0x000010, "Wrong size on VaultFastDefinition_C_OnInteractionEnterStart");
static_assert(offsetof(VaultFastDefinition_C_OnInteractionEnterStart, Player) == 0x000000, "Member 'VaultFastDefinition_C_OnInteractionEnterStart::Player' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_OnInteractionEnterStart, ActualSnapTime) == 0x000008, "Member 'VaultFastDefinition_C_OnInteractionEnterStart::ActualSnapTime' has a wrong offset!");

// Function VaultFastDefinition.VaultFastDefinition_C.ExecuteUbergraph_VaultFastDefinition
// 0x0120 (0x0120 - 0x0000)
struct VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTunableValue_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFormattedNumberString_ReturnValue;     // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ADBDPlayer*                             K2Node_Event_player;                               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_actualSnapTime;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAverageVelocity_ReturnValue;           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetXYVector_ReturnValue;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCamperMovementComponent*               K2Node_DynamicCast_AsCamper_Movement_Component;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetFormattedNumberString_ReturnValue_1;   // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_MaxSpeedForNormalization_Debug_ImplicitCast; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MaxSpeedForNormalization_Debug_ImplicitCast_1; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition) == 0x000008, "Wrong alignment on VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition");
static_assert(sizeof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition) == 0x000120, "Wrong size on VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, EntryPoint) == 0x000000, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::EntryPoint' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_GetTunableValue_ReturnValue) == 0x000004, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_GetTunableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_GetForwardVector_ReturnValue) == 0x000008, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_GetFormattedNumberString_ReturnValue) == 0x000020, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_GetFormattedNumberString_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, K2Node_Event_player) == 0x000030, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, K2Node_Event_actualSnapTime) == 0x000038, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::K2Node_Event_actualSnapTime' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_GetAverageVelocity_ReturnValue) == 0x000060, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_GetAverageVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_GetXYVector_ReturnValue) == 0x000088, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_GetXYVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, K2Node_DynamicCast_AsCamper_Movement_Component) == 0x0000A0, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::K2Node_DynamicCast_AsCamper_Movement_Component' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000C0, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000C8, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_GetFormattedNumberString_ReturnValue_1) == 0x0000D0, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_GetFormattedNumberString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E0, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F0, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Divide_FloatFloat_B_ImplicitCast) == 0x000100, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Divide_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, K2Node_VariableSet_MaxSpeedForNormalization_Debug_ImplicitCast) == 0x000108, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::K2Node_VariableSet_MaxSpeedForNormalization_Debug_ImplicitCast' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, K2Node_VariableSet_MaxSpeedForNormalization_Debug_ImplicitCast_1) == 0x000110, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::K2Node_VariableSet_MaxSpeedForNormalization_Debug_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition, CallFunc_Divide_FloatFloat_A_ImplicitCast) == 0x000118, "Member 'VaultFastDefinition_C_ExecuteUbergraph_VaultFastDefinition::CallFunc_Divide_FloatFloat_A_ImplicitCast' has a wrong offset!");

// Function VaultFastDefinition.VaultFastDefinition_C.IsInteractionPossibleClient
// 0x0030 (0x0030 - 0x0000)
struct VaultFastDefinition_C_IsInteractionPossibleClient final
{
public:
	const class ADBDPlayer*                       Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputInteractionType                         InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRunVaultEnabled_ReturnValue;           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunning_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindowVaultable_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWindow*                                K2Node_DynamicCast_AsWindow;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultFastDefinition_C_IsInteractionPossibleClient) == 0x000008, "Wrong alignment on VaultFastDefinition_C_IsInteractionPossibleClient");
static_assert(sizeof(VaultFastDefinition_C_IsInteractionPossibleClient) == 0x000030, "Wrong size on VaultFastDefinition_C_IsInteractionPossibleClient");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, Player) == 0x000000, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::Player' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, InteractionType) == 0x000008, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::InteractionType' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, ReturnValue) == 0x000009, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, Ret) == 0x00000A, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::Ret' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_GetRunVaultEnabled_ReturnValue) == 0x00000B, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_GetRunVaultEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_IsRunning_ReturnValue) == 0x00000C, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_IsRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_IsWindowVaultable_ReturnValue) == 0x00000D, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_IsWindowVaultable_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00000E, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_BooleanAND_ReturnValue_1) == 0x000010, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, K2Node_DynamicCast_AsWindow) == 0x000020, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::K2Node_DynamicCast_AsWindow' has a wrong offset!");
static_assert(offsetof(VaultFastDefinition_C_IsInteractionPossibleClient, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'VaultFastDefinition_C_IsInteractionPossibleClient::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

