#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VFX_Function_Lib_Character

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VFX_Function_Lib_Character.VFX_Function_Lib_Character_C.MaskFPV_Hidden
// 0x0098 (0x0098 - 0x0000)
struct VFX_Function_Lib_Character_C_MaskFPV_Hidden final
{
public:
	class ADBDPlayer*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomizedSkeletalMesh*                CallFunc_GetCustomizedSkeletalMesh_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponents_ReturnValue;                // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyObserved_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0048(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0080(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_Character_C_MaskFPV_Hidden) == 0x000008, "Wrong alignment on VFX_Function_Lib_Character_C_MaskFPV_Hidden");
static_assert(sizeof(VFX_Function_Lib_Character_C_MaskFPV_Hidden) == 0x000098, "Wrong size on VFX_Function_Lib_Character_C_MaskFPV_Hidden");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Character) == 0x000000, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Character' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, __WorldContext) == 0x000008, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_GetCustomizedSkeletalMesh_ReturnValue) == 0x000010, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_GetCustomizedSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_GetComponents_ReturnValue) == 0x000018, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_GetComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_IsLocallyObserved_ReturnValue) == 0x000028, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_IsLocallyObserved_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_bool_True_if_break_was_hit_Variable) == 0x000030, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_int_Array_Index_Variable) == 0x000034, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_name_Variable) == 0x000048, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Array_Get_Item) == 0x000058, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_GetChildrenComponents_Children) == 0x000060, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_BooleanAND_ReturnValue) == 0x00007D, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Array_Contains_ReturnValue) == 0x00007E, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_name_Variable_1) == 0x000080, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Array_Contains_ReturnValue_1) == 0x000090, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Less_IntInt_ReturnValue_1) == 0x000091, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MaskFPV_Hidden, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'VFX_Function_Lib_Character_C_MaskFPV_Hidden::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function VFX_Function_Lib_Character.VFX_Function_Lib_Character_C.ManageInteractiveMist
// 0x0020 (0x0020 - 0x0000)
struct VFX_Function_Lib_Character_C_ManageInteractiveMist final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        MistActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_Character_C_ManageInteractiveMist) == 0x000008, "Wrong alignment on VFX_Function_Lib_Character_C_ManageInteractiveMist");
static_assert(sizeof(VFX_Function_Lib_Character_C_ManageInteractiveMist) == 0x000020, "Wrong size on VFX_Function_Lib_Character_C_ManageInteractiveMist");
static_assert(offsetof(VFX_Function_Lib_Character_C_ManageInteractiveMist, Pawn) == 0x000000, "Member 'VFX_Function_Lib_Character_C_ManageInteractiveMist::Pawn' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_ManageInteractiveMist, MistActor) == 0x000008, "Member 'VFX_Function_Lib_Character_C_ManageInteractiveMist::MistActor' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_ManageInteractiveMist, __WorldContext) == 0x000010, "Member 'VFX_Function_Lib_Character_C_ManageInteractiveMist::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_ManageInteractiveMist, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'VFX_Function_Lib_Character_C_ManageInteractiveMist::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function VFX_Function_Lib_Character.VFX_Function_Lib_Character_C.MakeCharacter_Visible
// 0x0078 (0x0078 - 0x0000)
struct VFX_Function_Lib_Character_C_MakeCharacter_Visible final
{
public:
	class ADBDPlayer*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomizedSkeletalMesh*                CallFunc_GetCustomizedSkeletalMesh_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponents_ReturnValue;                // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_Character_C_MakeCharacter_Visible) == 0x000008, "Wrong alignment on VFX_Function_Lib_Character_C_MakeCharacter_Visible");
static_assert(sizeof(VFX_Function_Lib_Character_C_MakeCharacter_Visible) == 0x000078, "Wrong size on VFX_Function_Lib_Character_C_MakeCharacter_Visible");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, Character) == 0x000000, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::Character' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, __WorldContext) == 0x000008, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_GetCustomizedSkeletalMesh_ReturnValue) == 0x000010, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_GetCustomizedSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_GetComponents_ReturnValue) == 0x000020, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_GetComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Array_Get_Item) == 0x000048, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_GetChildrenComponents_Children) == 0x000050, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, Temp_int_Loop_Counter_Variable_1) == 0x00006C, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Visible, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Visible::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function VFX_Function_Lib_Character.VFX_Function_Lib_Character_C.MakeCharacter_Invisible
// 0x0078 (0x0078 - 0x0000)
struct VFX_Function_Lib_Character_C_MakeCharacter_Invisible final
{
public:
	class ADBDPlayer*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomizedSkeletalMesh*                CallFunc_GetCustomizedSkeletalMesh_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponents_ReturnValue;                // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible) == 0x000008, "Wrong alignment on VFX_Function_Lib_Character_C_MakeCharacter_Invisible");
static_assert(sizeof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible) == 0x000078, "Wrong size on VFX_Function_Lib_Character_C_MakeCharacter_Invisible");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, Character) == 0x000000, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::Character' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, __WorldContext) == 0x000008, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_GetCustomizedSkeletalMesh_ReturnValue) == 0x000010, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_GetCustomizedSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_GetComponents_ReturnValue) == 0x000020, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_GetComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Array_Get_Item) == 0x000048, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_GetChildrenComponents_Children) == 0x000050, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, Temp_int_Loop_Counter_Variable_1) == 0x00006C, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_MakeCharacter_Invisible, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'VFX_Function_Lib_Character_C_MakeCharacter_Invisible::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function VFX_Function_Lib_Character.VFX_Function_Lib_Character_C.SpawnFootstepVFX
// 0x0160 (0x0160 - 0x0000)
struct VFX_Function_Lib_Character_C_SpawnFootstepVFX final
{
public:
	bool                                          Run;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACamperPlayer*                          CamperCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Bloody_Footprints;                                 // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Footprint_Socket;                                  // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Surface_Type;                                      // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRunning;                                         // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Flip;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bloody_Foot_Decal;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         SurfaceType;                                       // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Template;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   FootSocketName;                                    // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetRightFootSurfaceType_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetLeftFootSurfaceType_ReturnValue;       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_2;       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_Character_C_SpawnFootstepVFX) == 0x000008, "Wrong alignment on VFX_Function_Lib_Character_C_SpawnFootstepVFX");
static_assert(sizeof(VFX_Function_Lib_Character_C_SpawnFootstepVFX) == 0x000160, "Wrong size on VFX_Function_Lib_Character_C_SpawnFootstepVFX");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Run) == 0x000000, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Run' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Left) == 0x000001, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Left' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CamperCharacter) == 0x000008, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CamperCharacter' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, __WorldContext) == 0x000010, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Bloody_Footprints) == 0x000018, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Bloody_Footprints' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Footprint_Socket) == 0x00001C, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Footprint_Socket' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Surface_Type) == 0x000028, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Surface_Type' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, IsRunning) == 0x00002C, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::IsRunning' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Flip) == 0x000030, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Flip' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Bloody_Foot_Decal) == 0x000038, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Bloody_Foot_Decal' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, SurfaceType) == 0x000039, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::SurfaceType' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, Template) == 0x000040, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::Template' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, FootSocketName) == 0x000048, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::FootSocketName' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000054, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_GetRightFootSurfaceType_ReturnValue) == 0x000059, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_GetRightFootSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_GetLeftFootSurfaceType_ReturnValue) == 0x00005A, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_GetLeftFootSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00005B, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_GetSocketRotation_ReturnValue) == 0x000060, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_BreakRotator_Roll) == 0x000078, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_BreakRotator_Pitch) == 0x00007C, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_BreakRotator_Yaw) == 0x000080, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_GetSocketLocation_ReturnValue) == 0x000088, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_MakeRotator_ReturnValue) == 0x0000A0, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0000D0, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D8, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_MakeRotator_ReturnValue_1) == 0x0000E0, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000F8, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x000100, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_MakeRotator_ReturnValue_2) == 0x000108, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_SpawnDecalAtLocation_ReturnValue_2) == 0x000120, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_SpawnDecalAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_RandomBool_ReturnValue) == 0x000128, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_BooleanAND_ReturnValue) == 0x000129, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_RandomBool_ReturnValue_1) == 0x00012A, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_BooleanAND_ReturnValue_1) == 0x00012B, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00012C, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, K2Node_SwitchInteger_CmpSuccess) == 0x000130, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000138, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000150, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepVFX, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepVFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function VFX_Function_Lib_Character.VFX_Function_Lib_Character_C.SpawnFootstepKillerVFX
// 0x0168 (0x0168 - 0x0000)
struct VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX final
{
public:
	bool                                          Run;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         SlasherPlayer;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRunning;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Socket_Rotation_Modifier;                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Footstep_Decal_Life;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Footstep_Fade_Delay;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Foot_Socket_Killer_Name;                           // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Template;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Surface_Type;                                      // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetRightFootSurfaceType_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetLeftFootSurfaceType_ReturnValue;       // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_2;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_3;       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast;       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast_1;     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX) == 0x000008, "Wrong alignment on VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX");
static_assert(sizeof(VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX) == 0x000168, "Wrong size on VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX");
static_assert(offsetof(VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX, Run) == 0x000000, "Member 'VFX_Function_Lib_Character_C_SpawnFootstepKillerVFX::Run' has a wrong offset!");
