#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VFX_Function_Lib_AnimNotifies

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VFX_Function_Lib_AnimNotifies.VFX_Function_Lib_AnimNotifies_C.HandleKillerNotifies_Trickster
// 0x00D0 (0x00D0 - 0x0000)
struct VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         MySlasher;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_Class;                                       // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRightKniveVisible;                               // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeftKnifeVisible;                                // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_K23_C>     K2Node_DynamicCast_AsBPI_Effect_K23;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_K23_C>     K2Node_DynamicCast_AsBPI_Effect_K23_1;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_K23_C>     K2Node_DynamicCast_AsBPI_Effect_K23_2;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_K23_C>     K2Node_DynamicCast_AsBPI_Effect_K23_3;             // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_K23_C>     K2Node_DynamicCast_AsBPI_Effect_K23_4;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITricksterCharacterVFXInterface> K2Node_DynamicCast_AsTrickster_Character_VFXInterface; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITricksterCharacterVFXInterface> K2Node_DynamicCast_AsTrickster_Character_VFXInterface_1; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster) == 0x000008, "Wrong alignment on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster");
static_assert(sizeof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster) == 0x0000D0, "Wrong size on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, Selection) == 0x000000, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::Selection' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, MySlasher) == 0x000010, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::MySlasher' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, __WorldContext) == 0x000018, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, ReturnValue) == 0x000020, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, Param_Class) == 0x000021, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::Param_Class' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, IsRightKniveVisible) == 0x000022, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::IsRightKniveVisible' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, IsLeftKnifeVisible) == 0x000023, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::IsLeftKnifeVisible' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsBPI_Effect_K23) == 0x000028, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsBPI_Effect_K23' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsBPI_Effect_K23_1) == 0x000040, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsBPI_Effect_K23_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsBPI_Effect_K23_2) == 0x000058, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsBPI_Effect_K23_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsBPI_Effect_K23_3) == 0x000070, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsBPI_Effect_K23_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsBPI_Effect_K23_4) == 0x000088, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsBPI_Effect_K23_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess_4) == 0x000098, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsTrickster_Character_VFXInterface) == 0x0000A0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsTrickster_Character_VFXInterface' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess_5) == 0x0000B0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_AsTrickster_Character_VFXInterface_1) == 0x0000B8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_AsTrickster_Character_VFXInterface_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_DynamicCast_bSuccess_6) == 0x0000C8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster, K2Node_SwitchName_CmpSuccess) == 0x0000C9, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trickster::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function VFX_Function_Lib_AnimNotifies.VFX_Function_Lib_AnimNotifies_C.HandleKillerNotifies_Trapper
// 0x0008 (0x0008 - 0x0000)
struct VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper) == 0x000008, "Wrong alignment on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper");
static_assert(sizeof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper) == 0x000008, "Wrong size on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper, __WorldContext) == 0x000000, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Trapper::__WorldContext' has a wrong offset!");

// Function VFX_Function_Lib_AnimNotifies.VFX_Function_Lib_AnimNotifies_C.HandleKillerNotifies_Oni
// 0x0150 (0x0150 - 0x0000)
struct VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Get_Killer1;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selection;                                         // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Get_Killer;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         My_Slasher;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General;           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_1;         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_2;         // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_3;         // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_4;         // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_5;         // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         CallFunc_GetKiller_ReturnValue;                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_6;         // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         CallFunc_GetKiller_ReturnValue_1;                  // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_7;         // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         CallFunc_GetKiller_ReturnValue_2;                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_8;         // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_9;         // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni) == 0x000008, "Wrong alignment on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni");
static_assert(sizeof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni) == 0x000150, "Wrong size on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, Target) == 0x000000, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::Target' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, Get_Killer1) == 0x000008, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::Get_Killer1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, Selection) == 0x000010, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::Selection' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, __WorldContext) == 0x000020, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, ReturnValue) == 0x000028, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, Get_Killer) == 0x000030, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::Get_Killer' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, My_Slasher) == 0x000038, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::My_Slasher' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General) == 0x000048, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_1) == 0x000060, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_2) == 0x000078, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_3) == 0x000090, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_4) == 0x0000A8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_4) == 0x0000B8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_5) == 0x0000C0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_5' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_5) == 0x0000D0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, CallFunc_GetKiller_ReturnValue) == 0x0000D8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::CallFunc_GetKiller_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_6) == 0x0000E0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_6' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_6) == 0x0000F0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, CallFunc_GetKiller_ReturnValue_1) == 0x0000F8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::CallFunc_GetKiller_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_7) == 0x000100, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_7' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_7) == 0x000110, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, CallFunc_GetKiller_ReturnValue_2) == 0x000118, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::CallFunc_GetKiller_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_8) == 0x000120, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_8' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_8) == 0x000130, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_AsBPI_Effect_General_9) == 0x000138, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_AsBPI_Effect_General_9' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni, K2Node_DynamicCast_bSuccess_9) == 0x000148, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Oni::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");

// Function VFX_Function_Lib_AnimNotifies.VFX_Function_Lib_AnimNotifies_C.HandleKillerNotifies_WallBreak
// 0x02C0 (0x02C0 - 0x0000)
struct VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldContextObject;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_Value;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         My_Slasher;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ASlasherPlayer*                         CallFunc_GetKiller_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_2;       // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_4;        // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_3;       // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_4;       // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak) == 0x000008, "Wrong alignment on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak");
static_assert(sizeof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak) == 0x0002C0, "Wrong size on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, Selection) == 0x000000, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::Selection' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, WorldContextObject) == 0x000010, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::WorldContextObject' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, __WorldContext) == 0x000018, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::__WorldContext' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, Return_Value) == 0x000020, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::Return_Value' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, My_Slasher) == 0x000028, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::My_Slasher' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_GetKiller_ReturnValue) == 0x000030, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_GetKiller_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Roll) == 0x000050, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Pitch) == 0x000054, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Yaw) == 0x000058, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_MakeRotator_ReturnValue) == 0x000068, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_GetSocketLocation_ReturnValue) == 0x000080, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, K2Node_SwitchName_CmpSuccess) == 0x000098, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0000B8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000C0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Roll_1) == 0x0000D8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Pitch_1) == 0x0000DC, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Yaw_1) == 0x0000E0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_IsValid_ReturnValue_1) == 0x0000E4, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000E8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_MakeRotator_ReturnValue_1) == 0x0000F0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000108, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x000138, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x000140, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Roll_2) == 0x000158, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Pitch_2) == 0x00015C, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Yaw_2) == 0x000160, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_IsValid_ReturnValue_2) == 0x000164, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000168, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_MakeRotator_ReturnValue_2) == 0x000170, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000188, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001A0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x0001B8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_SpawnDecalAtLocation_ReturnValue_2) == 0x0001D0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_SpawnDecalAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Roll_3) == 0x0001D8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Pitch_3) == 0x0001DC, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Yaw_3) == 0x0001E0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0001E4, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_IsValid_ReturnValue_3) == 0x0001E8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_MakeRotator_ReturnValue_3) == 0x0001F0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_GetSocketLocation_ReturnValue_3) == 0x000208, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000220, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_K2_GetActorRotation_ReturnValue_4) == 0x000238, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_K2_GetActorRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_SpawnDecalAtLocation_ReturnValue_3) == 0x000250, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_SpawnDecalAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Roll_4) == 0x000258, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Roll_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Pitch_4) == 0x00025C, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Pitch_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_BreakRotator_Yaw_4) == 0x000260, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_BreakRotator_Yaw_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000264, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_IsValid_ReturnValue_4) == 0x000268, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_MakeRotator_ReturnValue_4) == 0x000270, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_GetSocketLocation_ReturnValue_4) == 0x000288, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_GetSocketLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0002A0, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak, CallFunc_SpawnDecalAtLocation_ReturnValue_4) == 0x0002B8, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_WallBreak::CallFunc_SpawnDecalAtLocation_ReturnValue_4' has a wrong offset!");

// Function VFX_Function_Lib_AnimNotifies.VFX_Function_Lib_AnimNotifies_C.HandleKillerNotifies_Blight
// 0x0058 (0x0058 - 0x0000)
struct VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight final
{
public:
	class ASlasherPlayer*                         My_Slasher1;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlasherPlayer*                         My_Slasher;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Effect_General_C> K2Node_DynamicCast_AsBPI_Effect_General_1;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight) == 0x000008, "Wrong alignment on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight");
static_assert(sizeof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight) == 0x000058, "Wrong size on VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight, My_Slasher1) == 0x000000, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight::My_Slasher1' has a wrong offset!");
static_assert(offsetof(VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight, __WorldContext) == 0x000008, "Member 'VFX_Function_Lib_AnimNotifies_C_HandleKillerNotifies_Blight::__WorldContext' has a wrong offset!");
