#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VFXUtilities

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class VFXUtilities.BaseVFX
// 0x0008 (0x02A8 - 0x02A0)
class ABaseVFX : public AActor
{
public:
	bool                                          _shouldLoadOnServer;                               // 0x02A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseVFX">();
	}
	static class ABaseVFX* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseVFX>();
	}
};
static_assert(alignof(ABaseVFX) == 0x000008, "Wrong alignment on ABaseVFX");
static_assert(sizeof(ABaseVFX) == 0x0002A8, "Wrong size on ABaseVFX");
static_assert(offsetof(ABaseVFX, _shouldLoadOnServer) == 0x0002A0, "Member 'ABaseVFX::_shouldLoadOnServer' has a wrong offset!");

// Class VFXUtilities.VFXUtilities
// 0x0000 (0x0030 - 0x0030)
class UVFXUtilities final : public UBlueprintFunctionLibrary
{
public:
	static void SetParticleSystemActive(class UFXSystemComponent* ParticleSystem, bool Active, bool Reset);
	static void SetParticleSystemsActive(const TSet<class UFXSystemComponent*>& ParticleSystems, bool Active, bool Reset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VFXUtilities">();
	}
	static class UVFXUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVFXUtilities>();
	}
};
static_assert(alignof(UVFXUtilities) == 0x000008, "Wrong alignment on UVFXUtilities");
static_assert(sizeof(UVFXUtilities) == 0x000030, "Wrong size on UVFXUtilities");

}

