#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomizationItemGridContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomizationItemGridContainer.WBP_CustomizationItemGridContainer_C.ExecuteUbergraph_WBP_CustomizationItemGridContainer
// 0x0198 (0x0198 - 0x0000)
struct WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrientation                                  Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrientation                                  Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnalogInputEvent                      K2Node_Event_InAnalogInputEvent;                   // 0x0018(0x0050)(ConstParm)
	struct FKeyEvent                              CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue; // 0x0068(0x0048)()
	float                                         CallFunc_GetAnalogValue_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x00B8(0x0020)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_4;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_5;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_6;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_7;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreCustomizationItemSlotWrapper*      K2Node_DynamicCast_AsCore_Customization_Item_Slot_Wrapper; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DivideWithRemainder_remainder;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DivideWithRemainder_ReturnValue;          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer) == 0x000008, "Wrong alignment on WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer");
static_assert(sizeof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer) == 0x000198, "Wrong size on WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, EntryPoint) == 0x000000, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, Temp_byte_Variable) == 0x000004, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, Temp_int_Variable) == 0x000008, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_Event_InAnalogInputEvent) == 0x000018, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_Event_InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue) == 0x000068, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_GetAnalogValue_ReturnValue) == 0x0000B0, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_GetAnalogValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_GetKey_ReturnValue) == 0x0000B8, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0000DC, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_SwitchEnum_CmpSuccess) == 0x0000E5, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000E6, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000E7, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000E8, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x0000F0, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x0000F8, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_3) == 0x000100, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_4) == 0x000108, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_5) == 0x000110, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_6) == 0x000118, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsOverlaySlot_ReturnValue_7) == 0x000120, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsOverlaySlot_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Create_ReturnValue) == 0x000128, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_DynamicCast_AsCore_Customization_Item_Slot_Wrapper) == 0x000130, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_DynamicCast_AsCore_Customization_Item_Slot_Wrapper' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x000140, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_AddChild_ReturnValue) == 0x000148, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Add_IntInt_ReturnValue_2) == 0x000150, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_GetAllChildren_ReturnValue) == 0x000158, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000168, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Array_Get_Item) == 0x000170, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000178, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_RemoveChild_ReturnValue) == 0x000179, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_ObjectIsA_ReturnValue) == 0x00017A, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Array_Length_ReturnValue) == 0x00017C, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000180, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000184, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_MakeLiteralByte_ReturnValue) == 0x000185, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_DivideWithRemainder_remainder) == 0x000188, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_DivideWithRemainder_remainder' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, CallFunc_DivideWithRemainder_ReturnValue) == 0x00018C, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::CallFunc_DivideWithRemainder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_Select_Default) == 0x000190, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer, K2Node_Select_Default_1) == 0x000194, "Member 'WBP_CustomizationItemGridContainer_C_ExecuteUbergraph_WBP_CustomizationItemGridContainer::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_CustomizationItemGridContainer.WBP_CustomizationItemGridContainer_C.HandleAnalogInputEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent final
{
public:
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent) == 0x000008, "Wrong alignment on WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent");
static_assert(sizeof(WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent) == 0x000050, "Wrong size on WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent, InAnalogInputEvent) == 0x000000, "Member 'WBP_CustomizationItemGridContainer_C_HandleAnalogInputEvent::InAnalogInputEvent' has a wrong offset!");

// Function WBP_CustomizationItemGridContainer.WBP_CustomizationItemGridContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CustomizationItemGridContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomizationItemGridContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CustomizationItemGridContainer_C_PreConstruct");
static_assert(sizeof(WBP_CustomizationItemGridContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_CustomizationItemGridContainer_C_PreConstruct");
static_assert(offsetof(WBP_CustomizationItemGridContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CustomizationItemGridContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

