#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStartSequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreStartSequence.WBP_CoreStartSequence_C
// 0x0058 (0x0430 - 0x03D8)
class UWBP_CoreStartSequence_C final : public UCoreStartSequenceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              FakeImage;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_2;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Blue;                                              // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Green;                                             // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           YELLOW;                                            // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TURN_OFF();
	void ShowStartSequence(const struct FStartSequenceViewData& Data);
	void HideStartSequence();
	void ExecuteUbergraph_WBP_CoreStartSequence(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreStartSequence_C">();
	}
	static class UWBP_CoreStartSequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreStartSequence_C>();
	}
};
static_assert(alignof(UWBP_CoreStartSequence_C) == 0x000008, "Wrong alignment on UWBP_CoreStartSequence_C");
static_assert(sizeof(UWBP_CoreStartSequence_C) == 0x000430, "Wrong size on UWBP_CoreStartSequence_C");
static_assert(offsetof(UWBP_CoreStartSequence_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_CoreStartSequence_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, FadeOut) == 0x0003E0, "Member 'UWBP_CoreStartSequence_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, FadeIn) == 0x0003E8, "Member 'UWBP_CoreStartSequence_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, FakeImage) == 0x0003F0, "Member 'UWBP_CoreStartSequence_C::FakeImage' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, RetainerBox_2) == 0x0003F8, "Member 'UWBP_CoreStartSequence_C::RetainerBox_2' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, Blue) == 0x000400, "Member 'UWBP_CoreStartSequence_C::Blue' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, Green) == 0x000410, "Member 'UWBP_CoreStartSequence_C::Green' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStartSequence_C, YELLOW) == 0x000420, "Member 'UWBP_CoreStartSequence_C::YELLOW' has a wrong offset!");

}

