#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCompetenceContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreCompetenceContainer.WBP_CoreCompetenceContainer_C.ExecuteUbergraph_WBP_CoreCompetenceContainer
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCorePerkWidget*>                K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UCoreSkillWidget*>               K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer) == 0x000008, "Wrong alignment on WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer");
static_assert(sizeof(WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer) == 0x000028, "Wrong size on WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer");
static_assert(offsetof(WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer, EntryPoint) == 0x000000, "Member 'WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer, K2Node_MakeArray_Array_1) == 0x000018, "Member 'WBP_CoreCompetenceContainer_C_ExecuteUbergraph_WBP_CoreCompetenceContainer::K2Node_MakeArray_Array_1' has a wrong offset!");

}

