#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInputPrompt

#include "Basic.hpp"

#include "DBDUIViewsCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.ExecuteUbergraph_WBP_CoreInputPrompt
// 0x0148 (0x0148 - 0x0000)
struct WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTable_DataTable;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTable_IsFound;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputPromptDataRow                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0080)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetInputKey_ReturnValue;                  // 0x00D8(0x0020)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetInputKey_ReturnValue_1;                // 0x00F8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyControlModePairValid_ReturnValue; // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible;                            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt) == 0x000008, "Wrong alignment on WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt");
static_assert(sizeof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt) == 0x000148, "Wrong size on WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, EntryPoint) == 0x000000, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetDataTable_DataTable) == 0x000020, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetDataTable_DataTable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetDataTable_IsFound) == 0x000028, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetDataTable_IsFound' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D0, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_Less_IntInt_ReturnValue) == 0x0000D1, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_BooleanAND_ReturnValue) == 0x0000D2, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetInputKey_ReturnValue) == 0x0000D8, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetInputKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_GetInputKey_ReturnValue_1) == 0x0000F8, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_GetInputKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000118, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_IsInputKeyControlModePairValid_ReturnValue) == 0x000119, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_IsInputKeyControlModePairValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, K2Node_Event_isEnabled) == 0x00011A, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_Not_PreBool_ReturnValue_1) == 0x00011B, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, CallFunc_BooleanOR_ReturnValue) == 0x00011C, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, K2Node_MakeStruct_LinearColor) == 0x000120, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, K2Node_MakeStruct_LinearColor_1) == 0x000130, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt, K2Node_Event_isVisible) == 0x000140, "Member 'WBP_CoreInputPrompt_C_ExecuteUbergraph_WBP_CoreInputPrompt::K2Node_Event_isVisible' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.GetDataTable
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreInputPrompt_C_GetDataTable final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFound;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_GetDataTable) == 0x000008, "Wrong alignment on WBP_CoreInputPrompt_C_GetDataTable");
static_assert(sizeof(WBP_CoreInputPrompt_C_GetDataTable) == 0x000020, "Wrong size on WBP_CoreInputPrompt_C_GetDataTable");
static_assert(offsetof(WBP_CoreInputPrompt_C_GetDataTable, DataTable) == 0x000000, "Member 'WBP_CoreInputPrompt_C_GetDataTable::DataTable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_GetDataTable, IsFound) == 0x000008, "Member 'WBP_CoreInputPrompt_C_GetDataTable::IsFound' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_GetDataTable, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_CoreInputPrompt_C_GetDataTable::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_GetDataTable, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_CoreInputPrompt_C_GetDataTable::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.HandlePromptDataRow
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_CoreInputPrompt_C_HandlePromptDataRow final
{
public:
	struct FInputPromptDataRow                    PromptDataRow;                                     // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Temp_text_Variable;                                // 0x0080(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x00A0(0x0018)()
	struct FKey                                   CallFunc_GetInputKey_ReturnValue;                  // 0x00B8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_HandlePromptDataRow) == 0x000008, "Wrong alignment on WBP_CoreInputPrompt_C_HandlePromptDataRow");
static_assert(sizeof(WBP_CoreInputPrompt_C_HandlePromptDataRow) == 0x0000E0, "Wrong size on WBP_CoreInputPrompt_C_HandlePromptDataRow");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, PromptDataRow) == 0x000000, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::PromptDataRow' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, Temp_text_Variable) == 0x000080, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, Temp_bool_Variable) == 0x000098, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, Temp_byte_Variable) == 0x000099, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, Temp_byte_Variable_1) == 0x00009A, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, Temp_bool_Variable_1) == 0x00009B, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, K2Node_Select_Default) == 0x00009C, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, K2Node_Select_Default_1) == 0x0000A0, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, CallFunc_GetInputKey_ReturnValue) == 0x0000B8, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::CallFunc_GetInputKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandlePromptDataRow, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0000D8, "Member 'WBP_CoreInputPrompt_C_HandlePromptDataRow::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.HandleUnfoundPrompt
// 0x0090 (0x0090 - 0x0000)
struct WBP_CoreInputPrompt_C_HandleUnfoundPrompt final
{
public:
	class FText                                   CallFunc_GetInputShortDisplayName_ReturnValue;     // 0x0000(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0058(0x0038)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_HandleUnfoundPrompt) == 0x000008, "Wrong alignment on WBP_CoreInputPrompt_C_HandleUnfoundPrompt");
static_assert(sizeof(WBP_CoreInputPrompt_C_HandleUnfoundPrompt) == 0x000090, "Wrong size on WBP_CoreInputPrompt_C_HandleUnfoundPrompt");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandleUnfoundPrompt, CallFunc_GetInputShortDisplayName_ReturnValue) == 0x000000, "Member 'WBP_CoreInputPrompt_C_HandleUnfoundPrompt::CallFunc_GetInputShortDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandleUnfoundPrompt, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'WBP_CoreInputPrompt_C_HandleUnfoundPrompt::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandleUnfoundPrompt, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'WBP_CoreInputPrompt_C_HandleUnfoundPrompt::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_HandleUnfoundPrompt, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x000058, "Member 'WBP_CoreInputPrompt_C_HandleUnfoundPrompt::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreInputPrompt_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreInputPrompt_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreInputPrompt_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreInputPrompt_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreInputPrompt_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreInputPrompt_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreInputPrompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreInputPrompt_C_PreConstruct");
static_assert(sizeof(WBP_CoreInputPrompt_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreInputPrompt_C_PreConstruct");
static_assert(offsetof(WBP_CoreInputPrompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreInputPrompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.SetBetaFeatureOverlayVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible) == 0x000001, "Wrong alignment on WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible");
static_assert(sizeof(WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible) == 0x000001, "Wrong size on WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible");
static_assert(offsetof(WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible, Param_IsVisible) == 0x000000, "Member 'WBP_CoreInputPrompt_C_SetBetaFeatureOverlayVisible::Param_IsVisible' has a wrong offset!");

// Function WBP_CoreInputPrompt.WBP_CoreInputPrompt_C.SetIconTexture
// 0x0058 (0x0058 - 0x0000)
struct WBP_CoreInputPrompt_C_SetIconTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_C_SetIconTexture) == 0x000008, "Wrong alignment on WBP_CoreInputPrompt_C_SetIconTexture");
static_assert(sizeof(WBP_CoreInputPrompt_C_SetIconTexture) == 0x000058, "Wrong size on WBP_CoreInputPrompt_C_SetIconTexture");
static_assert(offsetof(WBP_CoreInputPrompt_C_SetIconTexture, IconTexture) == 0x000000, "Member 'WBP_CoreInputPrompt_C_SetIconTexture::IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_SetIconTexture, CallFunc_Array_Find_ReturnValue) == 0x000038, "Member 'WBP_CoreInputPrompt_C_SetIconTexture::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_SetIconTexture, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'WBP_CoreInputPrompt_C_SetIconTexture::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_SetIconTexture, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CoreInputPrompt_C_SetIconTexture::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_C_SetIconTexture, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WBP_CoreInputPrompt_C_SetIconTexture::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

