#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K35

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K35.WBP_K35_C
// 0x0020 (0x0358 - 0x0338)
class UWBP_K35_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              HuntGauge;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DEBUG_KillerSeeProgression;                        // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_KillerSeeDepletion;                          // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 IsRemovingKillerEffectColor;                       // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 IsNotRemovingKillerEffectColor;                    // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void ExecuteUbergraph_WBP_K35(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K35_C">();
	}
	static class UWBP_K35_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K35_C>();
	}
};
static_assert(alignof(UWBP_K35_C) == 0x000008, "Wrong alignment on UWBP_K35_C");
static_assert(sizeof(UWBP_K35_C) == 0x000358, "Wrong size on UWBP_K35_C");
static_assert(offsetof(UWBP_K35_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K35_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K35_C, HuntGauge) == 0x000340, "Member 'UWBP_K35_C::HuntGauge' has a wrong offset!");
static_assert(offsetof(UWBP_K35_C, DEBUG_KillerSeeProgression) == 0x000348, "Member 'UWBP_K35_C::DEBUG_KillerSeeProgression' has a wrong offset!");
static_assert(offsetof(UWBP_K35_C, DEBUG_KillerSeeDepletion) == 0x000349, "Member 'UWBP_K35_C::DEBUG_KillerSeeDepletion' has a wrong offset!");
static_assert(offsetof(UWBP_K35_C, IsRemovingKillerEffectColor) == 0x00034C, "Member 'UWBP_K35_C::IsRemovingKillerEffectColor' has a wrong offset!");
static_assert(offsetof(UWBP_K35_C, IsNotRemovingKillerEffectColor) == 0x000350, "Member 'UWBP_K35_C::IsNotRemovingKillerEffectColor' has a wrong offset!");

}

