#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K32

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K32.WBP_K32_C
// 0x0068 (0x03A0 - 0x0338)
class UWBP_K32_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Battery3Depletion;                                 // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battery2Depletion;                                 // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battery1Depletion;                                 // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battery3Idle;                                      // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battery2Idle;                                      // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battery1Idle;                                      // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClawTrapOpening;                                   // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FullProgress;                                      // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InProgress;                                        // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlickeringRadar;                                   // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              DarkBackground;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DEBUG_KillerSeeProgression;                        // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_KillerSeeDepletion;                          // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void ExecuteUbergraph_WBP_K32(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K32_C">();
	}
	static class UWBP_K32_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K32_C>();
	}
};
static_assert(alignof(UWBP_K32_C) == 0x000008, "Wrong alignment on UWBP_K32_C");
static_assert(sizeof(UWBP_K32_C) == 0x0003A0, "Wrong size on UWBP_K32_C");
static_assert(offsetof(UWBP_K32_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K32_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, Battery3Depletion) == 0x000340, "Member 'UWBP_K32_C::Battery3Depletion' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, Battery2Depletion) == 0x000348, "Member 'UWBP_K32_C::Battery2Depletion' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, Battery1Depletion) == 0x000350, "Member 'UWBP_K32_C::Battery1Depletion' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, Battery3Idle) == 0x000358, "Member 'UWBP_K32_C::Battery3Idle' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, Battery2Idle) == 0x000360, "Member 'UWBP_K32_C::Battery2Idle' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, Battery1Idle) == 0x000368, "Member 'UWBP_K32_C::Battery1Idle' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, ClawTrapOpening) == 0x000370, "Member 'UWBP_K32_C::ClawTrapOpening' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, FullProgress) == 0x000378, "Member 'UWBP_K32_C::FullProgress' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, InProgress) == 0x000380, "Member 'UWBP_K32_C::InProgress' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, FlickeringRadar) == 0x000388, "Member 'UWBP_K32_C::FlickeringRadar' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, DarkBackground) == 0x000390, "Member 'UWBP_K32_C::DarkBackground' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, DEBUG_KillerSeeProgression) == 0x000398, "Member 'UWBP_K32_C::DEBUG_KillerSeeProgression' has a wrong offset!");
static_assert(offsetof(UWBP_K32_C, DEBUG_KillerSeeDepletion) == 0x000399, "Member 'UWBP_K32_C::DEBUG_KillerSeeDepletion' has a wrong offset!");

}

