#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSearchBarButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreSearchBarButton.WBP_CoreSearchBarButton_C
// 0x0050 (0x0438 - 0x03E8)
class UWBP_CoreSearchBarButton_C final : public UCoreSearchBarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              ClearIcon;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        In_Desired_Width;                                  // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredColor;                                      // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextBoxHoveredOpacity;                             // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextBoxUnhoveredOpacity;                           // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreSearchBarButton(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void Set_Colors(const struct FLinearColor& IconsColors);
	void Update_Visuals(bool Param_IsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreSearchBarButton_C">();
	}
	static class UWBP_CoreSearchBarButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreSearchBarButton_C>();
	}
};
static_assert(alignof(UWBP_CoreSearchBarButton_C) == 0x000008, "Wrong alignment on UWBP_CoreSearchBarButton_C");
static_assert(sizeof(UWBP_CoreSearchBarButton_C) == 0x000438, "Wrong size on UWBP_CoreSearchBarButton_C");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, UberGraphFrame) == 0x0003E8, "Member 'UWBP_CoreSearchBarButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, ClearIcon) == 0x0003F0, "Member 'UWBP_CoreSearchBarButton_C::ClearIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, Root) == 0x0003F8, "Member 'UWBP_CoreSearchBarButton_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, In_Desired_Width) == 0x000400, "Member 'UWBP_CoreSearchBarButton_C::In_Desired_Width' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, DefaultColor) == 0x000408, "Member 'UWBP_CoreSearchBarButton_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, HoveredColor) == 0x000418, "Member 'UWBP_CoreSearchBarButton_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, TextBoxHoveredOpacity) == 0x000428, "Member 'UWBP_CoreSearchBarButton_C::TextBoxHoveredOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSearchBarButton_C, TextBoxUnhoveredOpacity) == 0x000430, "Member 'UWBP_CoreSearchBarButton_C::TextBoxUnhoveredOpacity' has a wrong offset!");

}

