#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K16

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K16.WBP_K16_C
// 0x0030 (0x0368 - 0x0338)
class UWBP_K16_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StalkingGhostOnlyIntro;                            // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StalkingExposedIntro;                              // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              StalkingFill;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              StalkingLines;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StalkingOverlay;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void SetGhostVisibility(bool IsLocalKiller, bool IsExposed, bool Param_IsVisible);
	void SetGhostData(bool IsLocalKiller, class UGhostfaceStatusData* KillerData);
	void ExecuteUbergraph_WBP_K16(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K16_C">();
	}
	static class UWBP_K16_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K16_C>();
	}
};
static_assert(alignof(UWBP_K16_C) == 0x000008, "Wrong alignment on UWBP_K16_C");
static_assert(sizeof(UWBP_K16_C) == 0x000368, "Wrong size on UWBP_K16_C");
static_assert(offsetof(UWBP_K16_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K16_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K16_C, StalkingGhostOnlyIntro) == 0x000340, "Member 'UWBP_K16_C::StalkingGhostOnlyIntro' has a wrong offset!");
static_assert(offsetof(UWBP_K16_C, StalkingExposedIntro) == 0x000348, "Member 'UWBP_K16_C::StalkingExposedIntro' has a wrong offset!");
static_assert(offsetof(UWBP_K16_C, StalkingFill) == 0x000350, "Member 'UWBP_K16_C::StalkingFill' has a wrong offset!");
static_assert(offsetof(UWBP_K16_C, StalkingLines) == 0x000358, "Member 'UWBP_K16_C::StalkingLines' has a wrong offset!");
static_assert(offsetof(UWBP_K16_C, StalkingOverlay) == 0x000360, "Member 'UWBP_K16_C::StalkingOverlay' has a wrong offset!");

}

