#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreLoadoutTooltipWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreLoadoutTooltipWidget.WBP_CoreLoadoutTooltipWidget_C.ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget
// 0x000C (0x000C - 0x0000)
struct WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_level;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget) == 0x000004, "Wrong alignment on WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget");
static_assert(sizeof(WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget) == 0x00000C, "Wrong size on WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget");
static_assert(offsetof(WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget, EntryPoint) == 0x000000, "Member 'WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget, K2Node_Event_level) == 0x000004, "Member 'WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget::K2Node_Event_level' has a wrong offset!");
static_assert(offsetof(WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'WBP_CoreLoadoutTooltipWidget_C_ExecuteUbergraph_WBP_CoreLoadoutTooltipWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CoreLoadoutTooltipWidget.WBP_CoreLoadoutTooltipWidget_C.SetLoadoutTooltipPerkLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel) == 0x000004, "Wrong alignment on WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel");
static_assert(sizeof(WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel) == 0x000004, "Wrong size on WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel");
static_assert(offsetof(WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel, Level) == 0x000000, "Member 'WBP_CoreLoadoutTooltipWidget_C_SetLoadoutTooltipPerkLevel::Level' has a wrong offset!");

}

