#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInputPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreInputPrompt.WBP_CoreInputPrompt_C
// 0x00C0 (0x0438 - 0x0378)
class UWBP_CoreInputPrompt_C final : public UCoreInputPromptWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               BetaFeatureOverlay;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          BetaFeatureTB;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              HighlightIMG;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                LeftSpacerForRect;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              PromptIcon;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                RightSpacerForRect;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EControlMode, class UDataTable*>         ControlModeDataMap;                                // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsPromptFound;                                     // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DefaultMouseKBIcon;                                // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          PaddingAlignment;                                  // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PaddingValue;                                      // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      WideIcons;                                         // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void DisplayPrompt();
	void ExecuteUbergraph_WBP_CoreInputPrompt(int32 EntryPoint);
	void GetDataTable(class UDataTable** DataTable, bool* IsFound);
	void HandlePromptDataRow(struct FInputPromptDataRow& PromptDataRow);
	void HandleUnfoundPrompt();
	void OnEnabledChanged(bool Param_IsEnabled);
	void PreConstruct(bool IsDesignTime);
	void SetBetaFeatureOverlayVisible(bool Param_IsVisible);
	void SetIconTexture(TSoftObjectPtr<class UTexture2D>& IconTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreInputPrompt_C">();
	}
	static class UWBP_CoreInputPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreInputPrompt_C>();
	}
};
static_assert(alignof(UWBP_CoreInputPrompt_C) == 0x000008, "Wrong alignment on UWBP_CoreInputPrompt_C");
static_assert(sizeof(UWBP_CoreInputPrompt_C) == 0x000438, "Wrong size on UWBP_CoreInputPrompt_C");
static_assert(offsetof(UWBP_CoreInputPrompt_C, UberGraphFrame) == 0x000378, "Member 'UWBP_CoreInputPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, BetaFeatureOverlay) == 0x000380, "Member 'UWBP_CoreInputPrompt_C::BetaFeatureOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, BetaFeatureTB) == 0x000388, "Member 'UWBP_CoreInputPrompt_C::BetaFeatureTB' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, HighlightIMG) == 0x000390, "Member 'UWBP_CoreInputPrompt_C::HighlightIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, LeftSpacerForRect) == 0x000398, "Member 'UWBP_CoreInputPrompt_C::LeftSpacerForRect' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, PromptIcon) == 0x0003A0, "Member 'UWBP_CoreInputPrompt_C::PromptIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, RightSpacerForRect) == 0x0003A8, "Member 'UWBP_CoreInputPrompt_C::RightSpacerForRect' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, TextLabel) == 0x0003B0, "Member 'UWBP_CoreInputPrompt_C::TextLabel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, ControlModeDataMap) == 0x0003B8, "Member 'UWBP_CoreInputPrompt_C::ControlModeDataMap' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, IsPromptFound) == 0x000408, "Member 'UWBP_CoreInputPrompt_C::IsPromptFound' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, DefaultMouseKBIcon) == 0x000410, "Member 'UWBP_CoreInputPrompt_C::DefaultMouseKBIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, PaddingAlignment) == 0x000418, "Member 'UWBP_CoreInputPrompt_C::PaddingAlignment' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, PaddingValue) == 0x000420, "Member 'UWBP_CoreInputPrompt_C::PaddingValue' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInputPrompt_C, WideIcons) == 0x000428, "Member 'UWBP_CoreInputPrompt_C::WideIcons' has a wrong offset!");

}

