#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCharacterTooltip

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCharacterTooltip.WBP_CoreCharacterTooltip_C.ExecuteUbergraph_WBP_CoreCharacterTooltip
// 0x0090 (0x0090 - 0x0000)
struct WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterTooltipViewData              K2Node_Event_characterViewData;                    // 0x0008(0x0088)(ConstParm)
};
static_assert(alignof(WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip) == 0x000008, "Wrong alignment on WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip");
static_assert(sizeof(WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip) == 0x000090, "Wrong size on WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip, EntryPoint) == 0x000000, "Member 'WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip, K2Node_Event_characterViewData) == 0x000008, "Member 'WBP_CoreCharacterTooltip_C_ExecuteUbergraph_WBP_CoreCharacterTooltip::K2Node_Event_characterViewData' has a wrong offset!");

// Function WBP_CoreCharacterTooltip.WBP_CoreCharacterTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCharacterTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCharacterTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreCharacterTooltip_C_PreConstruct");
static_assert(sizeof(WBP_CoreCharacterTooltip_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreCharacterTooltip_C_PreConstruct");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreCharacterTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreCharacterTooltip.WBP_CoreCharacterTooltip_C.SetCharacterData
// 0x0090 (0x0090 - 0x0000)
struct WBP_CoreCharacterTooltip_C_SetCharacterData final
{
public:
	struct FCharacterTooltipViewData              Character_Tooltip_Data;                            // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCharacterTooltip_C_SetCharacterData) == 0x000008, "Wrong alignment on WBP_CoreCharacterTooltip_C_SetCharacterData");
static_assert(sizeof(WBP_CoreCharacterTooltip_C_SetCharacterData) == 0x000090, "Wrong size on WBP_CoreCharacterTooltip_C_SetCharacterData");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_SetCharacterData, Character_Tooltip_Data) == 0x000000, "Member 'WBP_CoreCharacterTooltip_C_SetCharacterData::Character_Tooltip_Data' has a wrong offset!");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_SetCharacterData, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'WBP_CoreCharacterTooltip_C_SetCharacterData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_SetCharacterData, CallFunc_BooleanAND_ReturnValue) == 0x000089, "Member 'WBP_CoreCharacterTooltip_C_SetCharacterData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreCharacterTooltip.WBP_CoreCharacterTooltip_C.SetTooltipData
// 0x0088 (0x0088 - 0x0000)
struct WBP_CoreCharacterTooltip_C_SetTooltipData final
{
public:
	struct FCharacterTooltipViewData              CharacterViewData;                                 // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreCharacterTooltip_C_SetTooltipData) == 0x000008, "Wrong alignment on WBP_CoreCharacterTooltip_C_SetTooltipData");
static_assert(sizeof(WBP_CoreCharacterTooltip_C_SetTooltipData) == 0x000088, "Wrong size on WBP_CoreCharacterTooltip_C_SetTooltipData");
static_assert(offsetof(WBP_CoreCharacterTooltip_C_SetTooltipData, CharacterViewData) == 0x000000, "Member 'WBP_CoreCharacterTooltip_C_SetTooltipData::CharacterViewData' has a wrong offset!");

}

