#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K25

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K25.WBP_K25_C
// 0x0050 (0x0388 - 0x0338)
class UWBP_K25_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CenobiteLament_Rotation;                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              CenobiteChainHuntBase;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              CenobiteChainHuntFill;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CenobiteChaintHuntGroup;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              CenobiteLamentBase;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              CenobiteLamentFill;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CenobiteLamentGroup;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ChainHuntGroup_ScaleBox;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UK25StatusData*                         CacheData;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void SetCenobiteVisibility(EPlayerStatus PlayerStatus, class UK25StatusData* KillerData);
	void SetCenobiteData(EPlayerStatus PlayerStatus, class UK25StatusData* KillerData);
	void ExecuteUbergraph_WBP_K25(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K25_C">();
	}
	static class UWBP_K25_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K25_C>();
	}
};
static_assert(alignof(UWBP_K25_C) == 0x000008, "Wrong alignment on UWBP_K25_C");
static_assert(sizeof(UWBP_K25_C) == 0x000388, "Wrong size on UWBP_K25_C");
static_assert(offsetof(UWBP_K25_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K25_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteLament_Rotation) == 0x000340, "Member 'UWBP_K25_C::CenobiteLament_Rotation' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteChainHuntBase) == 0x000348, "Member 'UWBP_K25_C::CenobiteChainHuntBase' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteChainHuntFill) == 0x000350, "Member 'UWBP_K25_C::CenobiteChainHuntFill' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteChaintHuntGroup) == 0x000358, "Member 'UWBP_K25_C::CenobiteChaintHuntGroup' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteLamentBase) == 0x000360, "Member 'UWBP_K25_C::CenobiteLamentBase' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteLamentFill) == 0x000368, "Member 'UWBP_K25_C::CenobiteLamentFill' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CenobiteLamentGroup) == 0x000370, "Member 'UWBP_K25_C::CenobiteLamentGroup' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, ChainHuntGroup_ScaleBox) == 0x000378, "Member 'UWBP_K25_C::ChainHuntGroup_ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_K25_C, CacheData) == 0x000380, "Member 'UWBP_K25_C::CacheData' has a wrong offset!");

}

