#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreRewardWrapperAnimation

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreRewardWrapperAnimation.WBP_CoreRewardWrapperAnimation_C.ExecuteUbergraph_WBP_CoreRewardWrapperAnimation
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CoreCharacterReward_C*             CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CoreCurrencyProgressionReward_C*   CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CoreCustomizationReward_C*         CallFunc_Create_ReturnValue_2;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsSmall;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_TimeOnTextFadeOut;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation) == 0x000008, "Wrong alignment on WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation");
static_assert(sizeof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation) == 0x0000B8, "Wrong size on WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, EntryPoint) == 0x000000, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, Temp_byte_Variable) == 0x000020, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, Temp_bool_Variable) == 0x000021, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, Temp_bool_Variable_1) == 0x000022, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, Temp_bool_Variable_2) == 0x000023, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, Temp_bool_Variable_3) == 0x000024, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, Temp_bool_Variable_4) == 0x000025, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_Create_ReturnValue_2) == 0x000030, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_CustomEvent_Delay) == 0x000038, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000040, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000048, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_CustomEvent_bIsSmall) == 0x000051, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_CustomEvent_bIsSmall' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000058, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000060, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_Event_IsDesignTime) == 0x000069, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_CustomEvent_TimeOnTextFadeOut) == 0x000070, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_CustomEvent_TimeOnTextFadeOut' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_AddChild_ReturnValue_1) == 0x000088, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_AddChild_ReturnValue_2) == 0x000090, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, K2Node_Select_Default) == 0x0000AC, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation, CallFunc_Delay_Duration_ImplicitCast) == 0x0000B0, "Member 'WBP_CoreRewardWrapperAnimation_C_ExecuteUbergraph_WBP_CoreRewardWrapperAnimation::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_CoreRewardWrapperAnimation.WBP_CoreRewardWrapperAnimation_C.OnSetSmallTemplate
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate final
{
public:
	bool                                          bIsSmall;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate) == 0x000001, "Wrong alignment on WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate");
static_assert(sizeof(WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate) == 0x000001, "Wrong size on WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate, bIsSmall) == 0x000000, "Member 'WBP_CoreRewardWrapperAnimation_C_OnSetSmallTemplate::bIsSmall' has a wrong offset!");

// Function WBP_CoreRewardWrapperAnimation.WBP_CoreRewardWrapperAnimation_C.PlayClaimedAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim final
{
public:
	double                                        TimeOnTextFadeOut;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim) == 0x000008, "Wrong alignment on WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim");
static_assert(sizeof(WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim) == 0x000008, "Wrong size on WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim, TimeOnTextFadeOut) == 0x000000, "Member 'WBP_CoreRewardWrapperAnimation_C_PlayClaimedAnim::TimeOnTextFadeOut' has a wrong offset!");

// Function WBP_CoreRewardWrapperAnimation.WBP_CoreRewardWrapperAnimation_C.PlayTextFadeOutAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim) == 0x000008, "Wrong alignment on WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim");
static_assert(sizeof(WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim) == 0x000008, "Wrong size on WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim, Delay) == 0x000000, "Member 'WBP_CoreRewardWrapperAnimation_C_PlayTextFadeOutAnim::Delay' has a wrong offset!");

// Function WBP_CoreRewardWrapperAnimation.WBP_CoreRewardWrapperAnimation_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreRewardWrapperAnimation_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreRewardWrapperAnimation_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreRewardWrapperAnimation_C_PreConstruct");
static_assert(sizeof(WBP_CoreRewardWrapperAnimation_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreRewardWrapperAnimation_C_PreConstruct");
static_assert(offsetof(WBP_CoreRewardWrapperAnimation_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreRewardWrapperAnimation_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

