#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialHighlight

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialHighlight.WBP_TutorialHighlight_C
// 0x0028 (0x02D0 - 0x02A8)
class UWBP_TutorialHighlight_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       TutorialHighlight;                                 // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Smoke;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              SmokeGlow;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              WhiteCircle;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              WhiteCircle_1;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Show_Highlight_Animation(bool Param_IsVisible, bool LayoutSpace);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialHighlight_C">();
	}
	static class UWBP_TutorialHighlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialHighlight_C>();
	}
};
static_assert(alignof(UWBP_TutorialHighlight_C) == 0x000008, "Wrong alignment on UWBP_TutorialHighlight_C");
static_assert(sizeof(UWBP_TutorialHighlight_C) == 0x0002D0, "Wrong size on UWBP_TutorialHighlight_C");
static_assert(offsetof(UWBP_TutorialHighlight_C, TutorialHighlight) == 0x0002A8, "Member 'UWBP_TutorialHighlight_C::TutorialHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialHighlight_C, Smoke) == 0x0002B0, "Member 'UWBP_TutorialHighlight_C::Smoke' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialHighlight_C, SmokeGlow) == 0x0002B8, "Member 'UWBP_TutorialHighlight_C::SmokeGlow' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialHighlight_C, WhiteCircle) == 0x0002C0, "Member 'UWBP_TutorialHighlight_C::WhiteCircle' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialHighlight_C, WhiteCircle_1) == 0x0002C8, "Member 'UWBP_TutorialHighlight_C::WhiteCircle_1' has a wrong offset!");

}

