#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreIconButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreIconButton.WBP_CoreIconButton_C
// 0x0068 (0x0548 - 0x04E0)
class UWBP_CoreIconButton_C final : public UCoreIconButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              ButtonBG;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PressedColor;                                      // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredColor;                                      // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledColor;                                     // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Background_IMG_Dynamic_Material;                   // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconDesiredSize;                                   // 0x0538(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreIconButton(int32 EntryPoint);
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnHovered();
	void OnPressed();
	void OnReleased();
	void OnUnhovered();
	void PreConstruct(bool IsDesignTime);
	void SetColors(const struct FLinearColor& BackgroundColor, const struct FLinearColor& IconColor);
	void UpdateVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreIconButton_C">();
	}
	static class UWBP_CoreIconButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreIconButton_C>();
	}
};
static_assert(alignof(UWBP_CoreIconButton_C) == 0x000008, "Wrong alignment on UWBP_CoreIconButton_C");
static_assert(sizeof(UWBP_CoreIconButton_C) == 0x000548, "Wrong size on UWBP_CoreIconButton_C");
static_assert(offsetof(UWBP_CoreIconButton_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_CoreIconButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, ButtonBG) == 0x0004E8, "Member 'UWBP_CoreIconButton_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, DefaultColor) == 0x0004F0, "Member 'UWBP_CoreIconButton_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, PressedColor) == 0x000500, "Member 'UWBP_CoreIconButton_C::PressedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, HoveredColor) == 0x000510, "Member 'UWBP_CoreIconButton_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, DisabledColor) == 0x000520, "Member 'UWBP_CoreIconButton_C::DisabledColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, Background_IMG_Dynamic_Material) == 0x000530, "Member 'UWBP_CoreIconButton_C::Background_IMG_Dynamic_Material' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconButton_C, IconDesiredSize) == 0x000538, "Member 'UWBP_CoreIconButton_C::IconDesiredSize' has a wrong offset!");

}

