#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHUD_EventSpring2024_ObjectiveItem

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.UpdateCharges
// 0x0058 (0x0058 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges final
{
public:
	int32                                         NewChargeCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DefaultChargesColor;                               // 0x0004(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            MaxChargesColor;                                   // 0x0018(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges) == 0x000058, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, NewChargeCount) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::NewChargeCount' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, DefaultChargesColor) == 0x000004, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::DefaultChargesColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, MaxChargesColor) == 0x000018, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::MaxChargesColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000049, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00004A, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00004B, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00004C, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_BooleanOR_ReturnValue) == 0x00004D, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004E, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_BooleanOR_ReturnValue_1) == 0x00004F, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_BooleanOR_ReturnValue_2) == 0x000050, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges, CallFunc_BooleanOR_ReturnValue_3) == 0x000051, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_UpdateCharges::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.ShouldResetGaugePercentage
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage final
{
public:
	int32                                         OldCharges;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldMaxCharges;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCharges;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewMaxCharges;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldResetGauge;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage) == 0x000018, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, OldCharges) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::OldCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, OldMaxCharges) == 0x000004, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::OldMaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, NewCharges) == 0x000008, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::NewCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, NewMaxCharges) == 0x00000C, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::NewMaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, ShouldResetGauge) == 0x000010, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::ShouldResetGauge' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000012, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000013, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetWidgetState
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState final
{
public:
	EEventObjectiveItemState                      EventItemState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState) == 0x000001, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState) == 0x000001, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState, EventItemState) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetState::EventItemState' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetWidgetData
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData final
{
public:
	EEventObjectiveItemState                      EventItemState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Charges;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCharges;                                        // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargePercent;                                     // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData) == 0x000010, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData, EventItemState) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData::EventItemState' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData, Charges) == 0x000004, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData::Charges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData, MaxCharges) == 0x000008, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData::MaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData, ChargePercent) == 0x00000C, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetWidgetData::ChargePercent' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetPickUpPutDownAvailable
// 0x0050 (0x0050 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable final
{
public:
	bool                                          IsPickupAvailable;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPutdownAvailable;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ArrowImage;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable) == 0x000050, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, IsPickupAvailable) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::IsPickupAvailable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, IsPutdownAvailable) == 0x000001, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::IsPutdownAvailable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, ArrowImage) == 0x000008, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::ArrowImage' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, Temp_bool_Variable) == 0x000010, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, Temp_object_Variable) == 0x000018, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, Temp_object_Variable_1) == 0x000020, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, Temp_byte_Variable) == 0x000029, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, K2Node_Select_Default) == 0x000030, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, Temp_byte_Variable_1) == 0x000038, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, CallFunc_BooleanOR_ReturnValue) == 0x000039, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, CallFunc_SelectFloat_ReturnValue) == 0x000040, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, K2Node_Select_Default_1) == 0x000048, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x00004C, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetPickUpPutDownAvailable::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetInputKey
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey final
{
public:
	struct FKey                                   InputKey;                                          // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey) == 0x000020, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey, InputKey) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetInputKey::InputKey' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetCooldownPercentage
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage final
{
public:
	float                                         CooldownPercent;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage) == 0x000004, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage, CooldownPercent) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldownPercentage::CooldownPercent' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetCooldown
// 0x0005 (0x0005 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown final
{
public:
	bool                                          IsOnCooldown;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown) == 0x000001, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown) == 0x000005, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown, IsOnCooldown) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown::IsOnCooldown' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown, Temp_bool_Variable) == 0x000001, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown, Temp_byte_Variable) == 0x000002, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown, K2Node_Select_Default) == 0x000004, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetCooldown::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.SetAvailableCharges
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges final
{
public:
	int32                                         Charges;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCharges;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges) == 0x000008, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges, Charges) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges::Charges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges, MaxCharges) == 0x000004, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_SetAvailableCharges::MaxCharges' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.Set Red Background
// 0x0044 (0x0044 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background final
{
public:
	bool                                          IsRed;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Red;                                               // 0x0004(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            Grey;                                              // 0x0018(0x0014)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0014)()
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background) == 0x000044, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background, IsRed) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background::IsRed' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background, Red) == 0x000004, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background::Red' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background, Grey) == 0x000018, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background::Grey' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background, Temp_bool_Variable) == 0x00002C, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background, K2Node_Select_Default) == 0x000030, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_Set_Red_Background::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.InitWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget final
{
public:
	bool                                          IsLocalKiller;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget) == 0x000001, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget) == 0x000001, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget, IsLocalKiller) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_InitWidget::IsLocalKiller' has a wrong offset!");

// Function WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C.ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem
// 0x0060 (0x0060 - 0x0000)
struct WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_charges_1;                            // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_maxCharges_1;                         // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_cooldownPercent;                      // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventObjectiveItemState                      K2Node_Event_eventItemState;                       // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_charges;                              // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_maxCharges;                           // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_chargePercent;                        // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isLocalKiller;                        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldResetGaugePercentage_ShouldResetGauge; // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventObjectiveItemState                      K2Node_Event_eventItemState_1;                     // 0x003D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_inputKey;                             // 0x0040(0x0020)(ConstParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem");
static_assert(sizeof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem) == 0x000060, "Wrong size on WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem");
static_assert(offsetof(WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem, EntryPoint) == 0x000000, "Member 'WBP_CoreHUD_EventSpring2024_ObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem::EntryPoint' has a wrong offset!");
