#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerRank

#include "Basic.hpp"

#include "DBDUIViewsCore_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CorePlayerRank.WBP_CorePlayerRank_C.ExecuteUbergraph_WBP_CorePlayerRank
// 0x0180 (0x0180 - 0x0000)
struct WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRankViewData                          K2Node_Event_data;                                 // 0x0008(0x0028)(ConstParm)
	struct FCoreRankWidgetConfiguration           CallFunc_GetConfiguration_ReturnValue;             // 0x0030(0x00F0)()
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDBDTooltipManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDTooltipManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0140(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank) == 0x000008, "Wrong alignment on WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank");
static_assert(sizeof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank) == 0x000180, "Wrong size on WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, EntryPoint) == 0x000000, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, K2Node_Event_data) == 0x000008, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_GetConfiguration_ReturnValue) == 0x000030, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_GetConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_Map_Length_ReturnValue) == 0x000120, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_Map_Length_ReturnValue_1) == 0x000124, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_Map_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000128, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_Multiply_IntInt_ReturnValue) == 0x000130, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000138, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000140, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, K2Node_Event_IsDesignTime) == 0x000178, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000179, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank, CallFunc_Greater_IntInt_ReturnValue) == 0x00017A, "Member 'WBP_CorePlayerRank_C_ExecuteUbergraph_WBP_CorePlayerRank::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CorePlayerRank.WBP_CorePlayerRank_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePlayerRank_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerRank_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CorePlayerRank_C_PreConstruct");
static_assert(sizeof(WBP_CorePlayerRank_C_PreConstruct) == 0x000001, "Wrong size on WBP_CorePlayerRank_C_PreConstruct");
static_assert(offsetof(WBP_CorePlayerRank_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CorePlayerRank_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CorePlayerRank.WBP_CorePlayerRank_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct WBP_CorePlayerRank_C_SetData final
{
public:
	struct FRankViewData                          Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CorePlayerRank_C_SetData) == 0x000008, "Wrong alignment on WBP_CorePlayerRank_C_SetData");
static_assert(sizeof(WBP_CorePlayerRank_C_SetData) == 0x000028, "Wrong size on WBP_CorePlayerRank_C_SetData");
static_assert(offsetof(WBP_CorePlayerRank_C_SetData, Data) == 0x000000, "Member 'WBP_CorePlayerRank_C_SetData::Data' has a wrong offset!");

}

