#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileMenuCustomizationWidget

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ProfileMenuCustomizationWidget.WBP_ProfileMenuCustomizationWidget_C.ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget
// 0x0038 (0x0038 - 0x0000)
struct WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationItemPreviewAreaViewData  K2Node_Event_viewData;                             // 0x0010(0x0020)(ConstParm)
	bool                                          K2Node_Event_noCustomizationEquipped;              // 0x0030(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget) == 0x000008, "Wrong alignment on WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget");
static_assert(sizeof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget) == 0x000038, "Wrong size on WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, EntryPoint) == 0x000000, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_byte_Variable) == 0x000004, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000006, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_bool_Variable) == 0x000007, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_byte_Variable_1) == 0x000008, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_byte_Variable_2) == 0x000009, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_bool_Variable_1) == 0x00000A, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_byte_Variable_3) == 0x00000B, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_byte_Variable_4) == 0x00000C, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, K2Node_Event_viewData) == 0x000010, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::K2Node_Event_viewData' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, K2Node_Event_noCustomizationEquipped) == 0x000030, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::K2Node_Event_noCustomizationEquipped' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, K2Node_Select_Default) == 0x000031, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, K2Node_Select_Default_1) == 0x000032, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_byte_Variable_5) == 0x000033, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, Temp_bool_Variable_2) == 0x000034, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget, K2Node_Select_Default_2) == 0x000035, "Member 'WBP_ProfileMenuCustomizationWidget_C_ExecuteUbergraph_WBP_ProfileMenuCustomizationWidget::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_ProfileMenuCustomizationWidget.WBP_ProfileMenuCustomizationWidget_C.SetPreviewAreaData
// 0x0028 (0x0028 - 0x0000)
struct WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData final
{
public:
	struct FCustomizationItemPreviewAreaViewData  ViewData;                                          // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          NoCustomizationEquipped;                           // 0x0020(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData) == 0x000008, "Wrong alignment on WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData");
static_assert(sizeof(WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData) == 0x000028, "Wrong size on WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData, ViewData) == 0x000000, "Member 'WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData, NoCustomizationEquipped) == 0x000020, "Member 'WBP_ProfileMenuCustomizationWidget_C_SetPreviewAreaData::NoCustomizationEquipped' has a wrong offset!");

// Function WBP_ProfileMenuCustomizationWidget.WBP_ProfileMenuCustomizationWidget_C.SetScrollPrompt
// 0x0008 (0x0008 - 0x0000)
struct WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt final
{
public:
	class UCoreKeyListenerInputPromptWidget*      DisplayPrompt;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt) == 0x000008, "Wrong alignment on WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt");
static_assert(sizeof(WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt) == 0x000008, "Wrong size on WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt");
static_assert(offsetof(WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt, DisplayPrompt) == 0x000000, "Member 'WBP_ProfileMenuCustomizationWidget_C_SetScrollPrompt::DisplayPrompt' has a wrong offset!");

}

