#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAuricCells

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreAuricCells.WBP_CoreAuricCells_C.SetTaxIncludedData
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreAuricCells_C_SetTaxIncludedData final
{
public:
	class FString                                 TaxIncludeMessage;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_CoreAuricCells_C_SetTaxIncludedData) == 0x000008, "Wrong alignment on WBP_CoreAuricCells_C_SetTaxIncludedData");
static_assert(sizeof(WBP_CoreAuricCells_C_SetTaxIncludedData) == 0x000028, "Wrong size on WBP_CoreAuricCells_C_SetTaxIncludedData");
static_assert(offsetof(WBP_CoreAuricCells_C_SetTaxIncludedData, TaxIncludeMessage) == 0x000000, "Member 'WBP_CoreAuricCells_C_SetTaxIncludedData::TaxIncludeMessage' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_SetTaxIncludedData, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_CoreAuricCells_C_SetTaxIncludedData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CoreAuricCells.WBP_CoreAuricCells_C.SetData
// 0x0088 (0x0088 - 0x0000)
struct WBP_CoreAuricCells_C_SetData final
{
public:
	struct FAuricCellsViewData                    ViewData;                                          // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreAuricCells_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreAuricCells_C_SetData");
static_assert(sizeof(WBP_CoreAuricCells_C_SetData) == 0x000088, "Wrong size on WBP_CoreAuricCells_C_SetData");
static_assert(offsetof(WBP_CoreAuricCells_C_SetData, ViewData) == 0x000000, "Member 'WBP_CoreAuricCells_C_SetData::ViewData' has a wrong offset!");

// Function WBP_CoreAuricCells.WBP_CoreAuricCells_C.SetContentVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreAuricCells_C_SetContentVisibility final
{
public:
	bool                                          HasBundles;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAuricCells_C_SetContentVisibility) == 0x000001, "Wrong alignment on WBP_CoreAuricCells_C_SetContentVisibility");
static_assert(sizeof(WBP_CoreAuricCells_C_SetContentVisibility) == 0x000001, "Wrong size on WBP_CoreAuricCells_C_SetContentVisibility");
static_assert(offsetof(WBP_CoreAuricCells_C_SetContentVisibility, HasBundles) == 0x000000, "Member 'WBP_CoreAuricCells_C_SetContentVisibility::HasBundles' has a wrong offset!");

// Function WBP_CoreAuricCells.WBP_CoreAuricCells_C.Has Any First Purchase Reward
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward final
{
public:
	TArray<struct FAuricCellsBundleViewData>      Param_Bundles;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          HasFirstPurchaseReward;                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAuricCellsBundleViewData              CallFunc_Array_Get_Item;                           // 0x0020(0x0098)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward) == 0x000008, "Wrong alignment on WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward");
static_assert(sizeof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward) == 0x0000C0, "Wrong size on WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, Param_Bundles) == 0x000000, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::Param_Bundles' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, HasFirstPurchaseReward) == 0x000010, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::HasFirstPurchaseReward' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_CoreAuricCells_C_Has_Any_First_Purchase_Reward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CoreAuricCells.WBP_CoreAuricCells_C.ExecuteUbergraph_WBP_CoreAuricCells
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuricCellsViewData                    K2Node_Event_viewData;                             // 0x0008(0x0088)(ConstParm)
	bool                                          CallFunc_Has_Any_First_Purchase_Reward_HasFirstPurchaseReward; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells) == 0x000008, "Wrong alignment on WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells");
static_assert(sizeof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells) == 0x0000A0, "Wrong size on WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells");
static_assert(offsetof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells, EntryPoint) == 0x000000, "Member 'WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells, K2Node_Event_viewData) == 0x000008, "Member 'WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells::K2Node_Event_viewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells, CallFunc_Has_Any_First_Purchase_Reward_HasFirstPurchaseReward) == 0x000090, "Member 'WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells::CallFunc_Has_Any_First_Purchase_Reward_HasFirstPurchaseReward' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'WBP_CoreAuricCells_C_ExecuteUbergraph_WBP_CoreAuricCells::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

