#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreItemBundle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreItemBundle.WBP_CoreItemBundle_C
// 0x01B8 (0x04E0 - 0x0328)
class UWBP_CoreItemBundle_C final : public UCoreItemBundleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CoreAddon_C*                       Addon1;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAddon_C*                       Addon2;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreItem_C*                        Item;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLongPressEvent;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FItemBundleViewData                    ItemBundleViewData;                                // 0x0358(0x0180)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AddonScale;                                        // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetData(const struct FItemBundleViewData& Param_ItemBundleViewData);
	void SetActivateState(bool IsActive);
	void PreConstruct(bool IsDesignTime);
	void OnLongPressEvent__DelegateSignature();
	void IsEmpty(bool* Param_IsEmpty);
	void ExecuteUbergraph_WBP_CoreItemBundle(int32 EntryPoint);
	void ClearData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreItemBundle_C">();
	}
	static class UWBP_CoreItemBundle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreItemBundle_C>();
	}
};
static_assert(alignof(UWBP_CoreItemBundle_C) == 0x000008, "Wrong alignment on UWBP_CoreItemBundle_C");
static_assert(sizeof(UWBP_CoreItemBundle_C) == 0x0004E0, "Wrong size on UWBP_CoreItemBundle_C");
static_assert(offsetof(UWBP_CoreItemBundle_C, UberGraphFrame) == 0x000328, "Member 'UWBP_CoreItemBundle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItemBundle_C, Addon1) == 0x000330, "Member 'UWBP_CoreItemBundle_C::Addon1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItemBundle_C, Addon2) == 0x000338, "Member 'UWBP_CoreItemBundle_C::Addon2' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItemBundle_C, Item) == 0x000340, "Member 'UWBP_CoreItemBundle_C::Item' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItemBundle_C, OnLongPressEvent) == 0x000348, "Member 'UWBP_CoreItemBundle_C::OnLongPressEvent' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItemBundle_C, ItemBundleViewData) == 0x000358, "Member 'UWBP_CoreItemBundle_C::ItemBundleViewData' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItemBundle_C, AddonScale) == 0x0004D8, "Member 'UWBP_CoreItemBundle_C::AddonScale' has a wrong offset!");

}

