#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerProfile

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CorePlayerProfile.WBP_CorePlayerProfile_C.TryGetAnimatedWidget
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_CorePlayerProfile_C_TryGetAnimatedWidget final
{
public:
	struct FPlayerCardViewData                    ViewData;                                          // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_CorePlayerCardContainer_C*         ParentWidget;                                      // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget) == 0x000008, "Wrong alignment on WBP_CorePlayerProfile_C_TryGetAnimatedWidget");
static_assert(sizeof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget) == 0x0000D8, "Wrong size on WBP_CorePlayerProfile_C_TryGetAnimatedWidget");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, ViewData) == 0x000000, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, ParentWidget) == 0x0000A8, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::ParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, Success) == 0x0000B0, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::Success' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000B1, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0000B8, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, CallFunc_IsValidClass_ReturnValue) == 0x0000C0, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget) == 0x0000C8, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_TryGetAnimatedWidget, K2Node_ClassDynamicCast_bSuccess) == 0x0000D0, "Member 'WBP_CorePlayerProfile_C_TryGetAnimatedWidget::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CorePlayerProfile.WBP_CorePlayerProfile_C.SetProfileVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePlayerProfile_C_SetProfileVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerProfile_C_SetProfileVisibility) == 0x000001, "Wrong alignment on WBP_CorePlayerProfile_C_SetProfileVisibility");
static_assert(sizeof(WBP_CorePlayerProfile_C_SetProfileVisibility) == 0x000001, "Wrong size on WBP_CorePlayerProfile_C_SetProfileVisibility");
static_assert(offsetof(WBP_CorePlayerProfile_C_SetProfileVisibility, Param_IsVisible) == 0x000000, "Member 'WBP_CorePlayerProfile_C_SetProfileVisibility::Param_IsVisible' has a wrong offset!");

// Function WBP_CorePlayerProfile.WBP_CorePlayerProfile_C.SetPlayerCardBannerOpacity
// 0x0004 (0x0004 - 0x0000)
struct WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity final
{
public:
	float                                         Opacity;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity) == 0x000004, "Wrong alignment on WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity");
static_assert(sizeof(WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity) == 0x000004, "Wrong size on WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity");
static_assert(offsetof(WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity, Opacity) == 0x000000, "Member 'WBP_CorePlayerProfile_C_SetPlayerCardBannerOpacity::Opacity' has a wrong offset!");

// Function WBP_CorePlayerProfile.WBP_CorePlayerProfile_C.SetPlayerCardAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePlayerProfile_C_SetPlayerCardAnimation final
{
public:
	bool                                          Param_IsAnimationPlaying;                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerProfile_C_SetPlayerCardAnimation) == 0x000001, "Wrong alignment on WBP_CorePlayerProfile_C_SetPlayerCardAnimation");
static_assert(sizeof(WBP_CorePlayerProfile_C_SetPlayerCardAnimation) == 0x000001, "Wrong size on WBP_CorePlayerProfile_C_SetPlayerCardAnimation");
static_assert(offsetof(WBP_CorePlayerProfile_C_SetPlayerCardAnimation, Param_IsAnimationPlaying) == 0x000000, "Member 'WBP_CorePlayerProfile_C_SetPlayerCardAnimation::Param_IsAnimationPlaying' has a wrong offset!");

// Function WBP_CorePlayerProfile.WBP_CorePlayerProfile_C.SetBadgeBannerData
// 0x0158 (0x0158 - 0x0000)
struct WBP_CorePlayerProfile_C_SetBadgeBannerData final
{
public:
	struct FPlayerCardViewData                    Badge;                                             // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPlayerCardViewData                    Banner;                                            // 0x00A8(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ShowBanner;                                        // 0x0150(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerProfile_C_SetBadgeBannerData) == 0x000008, "Wrong alignment on WBP_CorePlayerProfile_C_SetBadgeBannerData");
static_assert(sizeof(WBP_CorePlayerProfile_C_SetBadgeBannerData) == 0x000158, "Wrong size on WBP_CorePlayerProfile_C_SetBadgeBannerData");
static_assert(offsetof(WBP_CorePlayerProfile_C_SetBadgeBannerData, Badge) == 0x000000, "Member 'WBP_CorePlayerProfile_C_SetBadgeBannerData::Badge' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_SetBadgeBannerData, Banner) == 0x0000A8, "Member 'WBP_CorePlayerProfile_C_SetBadgeBannerData::Banner' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_SetBadgeBannerData, ShowBanner) == 0x000150, "Member 'WBP_CorePlayerProfile_C_SetBadgeBannerData::ShowBanner' has a wrong offset!");

// Function WBP_CorePlayerProfile.WBP_CorePlayerProfile_C.ExecuteUbergraph_WBP_CorePlayerProfile
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_opacity;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerCardAnimationViewInterface> K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerCardAnimationViewInterface> K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface_1; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCardViewData                    K2Node_Event_badge;                                // 0x0040(0x00A8)(ConstParm)
	struct FPlayerCardViewData                    K2Node_Event_banner;                               // 0x00E8(0x00A8)(ConstParm)
	bool                                          K2Node_Event_showBanner;                           // 0x0190(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetAnimatedWidget_success;             // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetAnimatedWidget_success_1;           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CorePlayerCardButton_C*            K2Node_DynamicCast_AsWBP_Core_Player_Card_Button;  // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isAnimationPlaying;                   // 0x01A1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetOpacity_Opacity_ImplicitCast;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile) == 0x000008, "Wrong alignment on WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile");
static_assert(sizeof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile) == 0x0001B0, "Wrong size on WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, EntryPoint) == 0x000000, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_Event_opacity) == 0x000004, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_Event_opacity' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface) == 0x000010, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface_1) == 0x000028, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_Event_badge) == 0x000040, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_Event_badge' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_Event_banner) == 0x0000E8, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_Event_banner' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_Event_showBanner) == 0x000190, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_Event_showBanner' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, CallFunc_TryGetAnimatedWidget_success) == 0x000191, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::CallFunc_TryGetAnimatedWidget_success' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, CallFunc_TryGetAnimatedWidget_success_1) == 0x000192, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::CallFunc_TryGetAnimatedWidget_success_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_DynamicCast_AsWBP_Core_Player_Card_Button) == 0x000198, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_DynamicCast_AsWBP_Core_Player_Card_Button' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, K2Node_Event_isAnimationPlaying) == 0x0001A1, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::K2Node_Event_isAnimationPlaying' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, CallFunc_IsValid_ReturnValue_1) == 0x0001A2, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile, CallFunc_SetOpacity_Opacity_ImplicitCast) == 0x0001A8, "Member 'WBP_CorePlayerProfile_C_ExecuteUbergraph_WBP_CorePlayerProfile::CallFunc_SetOpacity_Opacity_ImplicitCast' has a wrong offset!");

}

