#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileMenuTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ProfileMenuTab.WBP_ProfileMenuTab_C.ExecuteUbergraph_WBP_ProfileMenuTab
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKey_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isSelected;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_withAnimation;                        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDBDTooltipManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Event_skinMaterial;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_1;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_2;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLabelTooltip_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_2;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLabelTooltip_ReturnValue_1;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0064(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab) == 0x000008, "Wrong alignment on WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab");
static_assert(sizeof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab) == 0x0000A0, "Wrong size on WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, EntryPoint) == 0x000000, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_GetKey_ReturnValue) == 0x000004, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, K2Node_Event_isSelected) == 0x000009, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::K2Node_Event_isSelected' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, K2Node_Event_withAnimation) == 0x00000A, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::K2Node_Event_withAnimation' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_GetValidValue_ReturnValue) == 0x00000B, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, K2Node_Event_isEnabled) == 0x00000C, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, K2Node_SwitchEnum_CmpSuccess) == 0x00000D, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_IsEnabled_ReturnValue) == 0x00000E, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_IsSelected_ReturnValue) == 0x00000F, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, K2Node_Event_skinMaterial) == 0x000018, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::K2Node_Event_skinMaterial' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_IsSelected_ReturnValue_1) == 0x000020, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_IsSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_ToOpacity_ReturnValue) == 0x000030, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_ToOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_Create_ReturnValue_1) == 0x000038, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_ToOpacity_ReturnValue_1) == 0x000040, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_ToOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_Create_ReturnValue_2) == 0x000048, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_HasLabelTooltip_ReturnValue) == 0x000050, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_HasLabelTooltip_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_ToOpacity_ReturnValue_2) == 0x000058, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_ToOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_HasLabelTooltip_ReturnValue_1) == 0x000060, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_HasLabelTooltip_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000064, "Member 'WBP_ProfileMenuTab_C_ExecuteUbergraph_WBP_ProfileMenuTab::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");

// Function WBP_ProfileMenuTab.WBP_ProfileMenuTab_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ProfileMenuTab_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuTab_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_ProfileMenuTab_C_OnEnabledChanged");
static_assert(sizeof(WBP_ProfileMenuTab_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_ProfileMenuTab_C_OnEnabledChanged");
static_assert(offsetof(WBP_ProfileMenuTab_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_ProfileMenuTab_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_ProfileMenuTab.WBP_ProfileMenuTab_C.OnSelectedChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_ProfileMenuTab_C_OnSelectedChanged final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithAnimation;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuTab_C_OnSelectedChanged) == 0x000001, "Wrong alignment on WBP_ProfileMenuTab_C_OnSelectedChanged");
static_assert(sizeof(WBP_ProfileMenuTab_C_OnSelectedChanged) == 0x000002, "Wrong size on WBP_ProfileMenuTab_C_OnSelectedChanged");
static_assert(offsetof(WBP_ProfileMenuTab_C_OnSelectedChanged, Param_IsSelected) == 0x000000, "Member 'WBP_ProfileMenuTab_C_OnSelectedChanged::Param_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuTab_C_OnSelectedChanged, WithAnimation) == 0x000001, "Member 'WBP_ProfileMenuTab_C_OnSelectedChanged::WithAnimation' has a wrong offset!");

// Function WBP_ProfileMenuTab.WBP_ProfileMenuTab_C.UpdateBackgroundSkin
// 0x0008 (0x0008 - 0x0000)
struct WBP_ProfileMenuTab_C_UpdateBackgroundSkin final
{
public:
	class UMaterialInterface*                     SkinMaterial;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuTab_C_UpdateBackgroundSkin) == 0x000008, "Wrong alignment on WBP_ProfileMenuTab_C_UpdateBackgroundSkin");
static_assert(sizeof(WBP_ProfileMenuTab_C_UpdateBackgroundSkin) == 0x000008, "Wrong size on WBP_ProfileMenuTab_C_UpdateBackgroundSkin");
static_assert(offsetof(WBP_ProfileMenuTab_C_UpdateBackgroundSkin, SkinMaterial) == 0x000000, "Member 'WBP_ProfileMenuTab_C_UpdateBackgroundSkin::SkinMaterial' has a wrong offset!");

}

