#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCustomizationReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C
// 0x0038 (0x0730 - 0x06F8)
class UWBP_CoreCustomizationReward_C final : public UCoreCustomizationRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              ItemIMG;                                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              KillSwitchOverlay;                                 // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreOwnedTag_C*                    OwnedTag;                                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RarityIMG;                                         // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              UnbreakableSetTagIcon;                             // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              VisceralOverlay;                                   // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreCustomizationReward(int32 EntryPoint);
	void SetCustomizationRewardData(const struct FCustomizationRewardViewData& CustomizationRewardViewData);
	void SetKillSwitchOverlay(const bool Param_IsEnabled);
	void SetOwnedTag(const bool IsOwned);
	void SetRarity(EItemRarity Rarity);
	void SetUnbreakableSetTag(const bool IsUnbreakable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreCustomizationReward_C">();
	}
	static class UWBP_CoreCustomizationReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreCustomizationReward_C>();
	}
};
static_assert(alignof(UWBP_CoreCustomizationReward_C) == 0x000008, "Wrong alignment on UWBP_CoreCustomizationReward_C");
static_assert(sizeof(UWBP_CoreCustomizationReward_C) == 0x000730, "Wrong size on UWBP_CoreCustomizationReward_C");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, UberGraphFrame) == 0x0006F8, "Member 'UWBP_CoreCustomizationReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, ItemIMG) == 0x000700, "Member 'UWBP_CoreCustomizationReward_C::ItemIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, KillSwitchOverlay) == 0x000708, "Member 'UWBP_CoreCustomizationReward_C::KillSwitchOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, OwnedTag) == 0x000710, "Member 'UWBP_CoreCustomizationReward_C::OwnedTag' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, RarityIMG) == 0x000718, "Member 'UWBP_CoreCustomizationReward_C::RarityIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, UnbreakableSetTagIcon) == 0x000720, "Member 'UWBP_CoreCustomizationReward_C::UnbreakableSetTagIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationReward_C, VisceralOverlay) == 0x000728, "Member 'UWBP_CoreCustomizationReward_C::VisceralOverlay' has a wrong offset!");

}

