#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreItemBundle

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreItemBundle.WBP_CoreItemBundle_C.SetData
// 0x0180 (0x0180 - 0x0000)
struct WBP_CoreItemBundle_C_SetData final
{
public:
	struct FItemBundleViewData                    Param_ItemBundleViewData;                          // 0x0000(0x0180)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreItemBundle_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreItemBundle_C_SetData");
static_assert(sizeof(WBP_CoreItemBundle_C_SetData) == 0x000180, "Wrong size on WBP_CoreItemBundle_C_SetData");
static_assert(offsetof(WBP_CoreItemBundle_C_SetData, Param_ItemBundleViewData) == 0x000000, "Member 'WBP_CoreItemBundle_C_SetData::Param_ItemBundleViewData' has a wrong offset!");

// Function WBP_CoreItemBundle.WBP_CoreItemBundle_C.SetActivateState
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreItemBundle_C_SetActivateState final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemBundle_C_SetActivateState) == 0x000001, "Wrong alignment on WBP_CoreItemBundle_C_SetActivateState");
static_assert(sizeof(WBP_CoreItemBundle_C_SetActivateState) == 0x000001, "Wrong size on WBP_CoreItemBundle_C_SetActivateState");
static_assert(offsetof(WBP_CoreItemBundle_C_SetActivateState, IsActive) == 0x000000, "Member 'WBP_CoreItemBundle_C_SetActivateState::IsActive' has a wrong offset!");

// Function WBP_CoreItemBundle.WBP_CoreItemBundle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreItemBundle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemBundle_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreItemBundle_C_PreConstruct");
static_assert(sizeof(WBP_CoreItemBundle_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreItemBundle_C_PreConstruct");
static_assert(offsetof(WBP_CoreItemBundle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreItemBundle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreItemBundle.WBP_CoreItemBundle_C.IsEmpty
// 0x0002 (0x0002 - 0x0000)
struct WBP_CoreItemBundle_C_IsEmpty final
{
public:
	bool                                          Param_IsEmpty;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_IsEmpty;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemBundle_C_IsEmpty) == 0x000001, "Wrong alignment on WBP_CoreItemBundle_C_IsEmpty");
static_assert(sizeof(WBP_CoreItemBundle_C_IsEmpty) == 0x000002, "Wrong size on WBP_CoreItemBundle_C_IsEmpty");
static_assert(offsetof(WBP_CoreItemBundle_C_IsEmpty, Param_IsEmpty) == 0x000000, "Member 'WBP_CoreItemBundle_C_IsEmpty::Param_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_IsEmpty, CallFunc_IsEmpty_IsEmpty) == 0x000001, "Member 'WBP_CoreItemBundle_C_IsEmpty::CallFunc_IsEmpty_IsEmpty' has a wrong offset!");

// Function WBP_CoreItemBundle.WBP_CoreItemBundle_C.ExecuteUbergraph_WBP_CoreItemBundle
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBundleViewData                    K2Node_Event_itemBundleViewData;                   // 0x0008(0x0180)(ConstParm)
	TScriptInterface<class IItemViewInterface>    K2Node_DynamicCast_AsItem_View_Interface;          // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAddonViewInterface>   K2Node_DynamicCast_AsAddon_View_Interface;         // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAddonViewInterface>   K2Node_DynamicCast_AsAddon_View_Interface_1;       // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IItemViewInterface>    K2Node_DynamicCast_AsItem_View_Interface_1;        // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_IsEmpty;                          // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateScale_scale_ImplicitCast;           // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateScale_scale_ImplicitCast_1;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle) == 0x000008, "Wrong alignment on WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle");
static_assert(sizeof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle) == 0x0001F0, "Wrong size on WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, EntryPoint) == 0x000000, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_Event_itemBundleViewData) == 0x000008, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_Event_itemBundleViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_AsItem_View_Interface) == 0x000188, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_AsItem_View_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_AsAddon_View_Interface) == 0x0001A0, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_AsAddon_View_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_AsAddon_View_Interface_1) == 0x0001B8, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_AsAddon_View_Interface_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_bSuccess_2) == 0x0001C8, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_AsItem_View_Interface_1) == 0x0001D0, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_AsItem_View_Interface_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_DynamicCast_bSuccess_3) == 0x0001E0, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, CallFunc_IsEmpty_IsEmpty) == 0x0001E1, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::CallFunc_IsEmpty_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, K2Node_Event_IsDesignTime) == 0x0001E2, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, CallFunc_UpdateScale_scale_ImplicitCast) == 0x0001E4, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::CallFunc_UpdateScale_scale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle, CallFunc_UpdateScale_scale_ImplicitCast_1) == 0x0001E8, "Member 'WBP_CoreItemBundle_C_ExecuteUbergraph_WBP_CoreItemBundle::CallFunc_UpdateScale_scale_ImplicitCast_1' has a wrong offset!");

}

