#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillUnlockedNotification

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkillUnlockedNotification.WBP_SkillUnlockedNotification_C.Show
// 0x0050 (0x0050 - 0x0000)
struct WBP_SkillUnlockedNotification_C_Show final
{
public:
	struct FSkillUnlockedNotificationViewData     SkillUnlockedNotificationData;                     // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SkillUnlockedNotification_C_Show) == 0x000008, "Wrong alignment on WBP_SkillUnlockedNotification_C_Show");
static_assert(sizeof(WBP_SkillUnlockedNotification_C_Show) == 0x000050, "Wrong size on WBP_SkillUnlockedNotification_C_Show");
static_assert(offsetof(WBP_SkillUnlockedNotification_C_Show, SkillUnlockedNotificationData) == 0x000000, "Member 'WBP_SkillUnlockedNotification_C_Show::SkillUnlockedNotificationData' has a wrong offset!");

// Function WBP_SkillUnlockedNotification.WBP_SkillUnlockedNotification_C.ExecuteUbergraph_WBP_SkillUnlockedNotification
// 0x0068 (0x0068 - 0x0000)
struct WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSkillUnlockedNotificationViewData     K2Node_Event_skillUnlockedNotificationData;        // 0x0010(0x0050)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification) == 0x000008, "Wrong alignment on WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification");
static_assert(sizeof(WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification) == 0x000068, "Wrong size on WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification");
static_assert(offsetof(WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification, EntryPoint) == 0x000000, "Member 'WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification, K2Node_Event_skillUnlockedNotificationData) == 0x000010, "Member 'WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification::K2Node_Event_skillUnlockedNotificationData' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_SkillUnlockedNotification_C_ExecuteUbergraph_WBP_SkillUnlockedNotification::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

