#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K22

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K22.WBP_K22_C
// 0x0030 (0x0368 - 0x0338)
class UWBP_K22_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TwinsAnimation;                                    // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              HandIconLeft;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              HandIconRight;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           TwinsMaskRetainer;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTwinsStatusData*                       CacheData;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetTwinsVisibility(bool Param_IsVisible);
	void SetTwinsData(class UTwinsStatusData* KillerData);
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void ExecuteUbergraph_WBP_K22(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K22_C">();
	}
	static class UWBP_K22_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K22_C>();
	}
};
static_assert(alignof(UWBP_K22_C) == 0x000008, "Wrong alignment on UWBP_K22_C");
static_assert(sizeof(UWBP_K22_C) == 0x000368, "Wrong size on UWBP_K22_C");
static_assert(offsetof(UWBP_K22_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K22_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K22_C, TwinsAnimation) == 0x000340, "Member 'UWBP_K22_C::TwinsAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_K22_C, HandIconLeft) == 0x000348, "Member 'UWBP_K22_C::HandIconLeft' has a wrong offset!");
static_assert(offsetof(UWBP_K22_C, HandIconRight) == 0x000350, "Member 'UWBP_K22_C::HandIconRight' has a wrong offset!");
static_assert(offsetof(UWBP_K22_C, TwinsMaskRetainer) == 0x000358, "Member 'UWBP_K22_C::TwinsMaskRetainer' has a wrong offset!");
static_assert(offsetof(UWBP_K22_C, CacheData) == 0x000360, "Member 'UWBP_K22_C::CacheData' has a wrong offset!");

}

