#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStandardButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreStandardButton.WBP_CoreStandardButton_C.ExecuteUbergraph_WBP_CoreStandardButton
// 0x0098 (0x0098 - 0x0000)
struct WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Event_newAlignment;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_2;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_3;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EButtonWidgetVisibility                       K2Node_Event_previousVisibility;                   // 0x0088(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonWidgetVisibility                       K2Node_Event_newVisibility;                        // 0x0089(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton) == 0x000008, "Wrong alignment on WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton");
static_assert(sizeof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton) == 0x000098, "Wrong size on WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, EntryPoint) == 0x000000, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_IsEnabled_ReturnValue) == 0x000004, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000038, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_MakeStruct_Margin_1) == 0x000040, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_Event_newAlignment) == 0x000068, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_Event_newAlignment' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_Event_isEnabled) == 0x00006A, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x000070, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_SlotAsGridSlot_ReturnValue_2) == 0x000078, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_SlotAsGridSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, CallFunc_SlotAsGridSlot_ReturnValue_3) == 0x000080, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::CallFunc_SlotAsGridSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_Event_previousVisibility) == 0x000088, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_Event_previousVisibility' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_Event_newVisibility) == 0x000089, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_Event_newVisibility' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_MakeStruct_Left_ImplicitCast) == 0x00008C, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton, K2Node_MakeStruct_Right_ImplicitCast) == 0x000090, "Member 'WBP_CoreStandardButton_C_ExecuteUbergraph_WBP_CoreStandardButton::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");

// Function WBP_CoreStandardButton.WBP_CoreStandardButton_C.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStandardButton_C_OnAlignmentChanged final
{
public:
	ETextJustify                                  NewAlignment;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStandardButton_C_OnAlignmentChanged) == 0x000001, "Wrong alignment on WBP_CoreStandardButton_C_OnAlignmentChanged");
static_assert(sizeof(WBP_CoreStandardButton_C_OnAlignmentChanged) == 0x000001, "Wrong size on WBP_CoreStandardButton_C_OnAlignmentChanged");
static_assert(offsetof(WBP_CoreStandardButton_C_OnAlignmentChanged, NewAlignment) == 0x000000, "Member 'WBP_CoreStandardButton_C_OnAlignmentChanged::NewAlignment' has a wrong offset!");

// Function WBP_CoreStandardButton.WBP_CoreStandardButton_C.OnButtonVisibilityChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_CoreStandardButton_C_OnButtonVisibilityChanged final
{
public:
	EButtonWidgetVisibility                       PreviousVisibility;                                // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonWidgetVisibility                       NewVisibility;                                     // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStandardButton_C_OnButtonVisibilityChanged) == 0x000001, "Wrong alignment on WBP_CoreStandardButton_C_OnButtonVisibilityChanged");
static_assert(sizeof(WBP_CoreStandardButton_C_OnButtonVisibilityChanged) == 0x000002, "Wrong size on WBP_CoreStandardButton_C_OnButtonVisibilityChanged");
static_assert(offsetof(WBP_CoreStandardButton_C_OnButtonVisibilityChanged, PreviousVisibility) == 0x000000, "Member 'WBP_CoreStandardButton_C_OnButtonVisibilityChanged::PreviousVisibility' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_OnButtonVisibilityChanged, NewVisibility) == 0x000001, "Member 'WBP_CoreStandardButton_C_OnButtonVisibilityChanged::NewVisibility' has a wrong offset!");

// Function WBP_CoreStandardButton.WBP_CoreStandardButton_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStandardButton_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStandardButton_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreStandardButton_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreStandardButton_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreStandardButton_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreStandardButton_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreStandardButton_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreStandardButton.WBP_CoreStandardButton_C.Reset Visuals
// 0x0060 (0x0060 - 0x0000)
struct WBP_CoreStandardButton_C_Reset_Visuals final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SmokeMaterial;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RedTraitMaterial;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x002C(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStandardButton_C_Reset_Visuals) == 0x000008, "Wrong alignment on WBP_CoreStandardButton_C_Reset_Visuals");
static_assert(sizeof(WBP_CoreStandardButton_C_Reset_Visuals) == 0x000060, "Wrong size on WBP_CoreStandardButton_C_Reset_Visuals");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::Param_IsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, SmokeMaterial) == 0x000008, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::SmokeMaterial' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, RedTraitMaterial) == 0x000010, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::RedTraitMaterial' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, K2Node_MakeStruct_SlateColor_1) == 0x00002C, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStandardButton_C_Reset_Visuals, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000058, "Member 'WBP_CoreStandardButton_C_Reset_Visuals::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

}

