#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreGenericPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreGenericPopup.WBP_CoreGenericPopup_C
// 0x0038 (0x03B8 - 0x0380)
class UWBP_CoreGenericPopup_C final : public UCoreGenericPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIn;                                       // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Bg;                                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           Mask;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDScrollBox*                          MessageScrollBox;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              PriorityHeader;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreGenericPopup(int32 EntryPoint);
	void HandleAnalogInputEvent(const struct FAnalogInputEvent& InAnalogInputEvent);
	void Hide();
	void SetHeaderColor(class UBasePopupViewData* Data);
	void Show(class UBasePopupViewData* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreGenericPopup_C">();
	}
	static class UWBP_CoreGenericPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreGenericPopup_C>();
	}
};
static_assert(alignof(UWBP_CoreGenericPopup_C) == 0x000008, "Wrong alignment on UWBP_CoreGenericPopup_C");
static_assert(sizeof(UWBP_CoreGenericPopup_C) == 0x0003B8, "Wrong size on UWBP_CoreGenericPopup_C");
static_assert(offsetof(UWBP_CoreGenericPopup_C, UberGraphFrame) == 0x000380, "Member 'UWBP_CoreGenericPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericPopup_C, Anim_FadeOut) == 0x000388, "Member 'UWBP_CoreGenericPopup_C::Anim_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericPopup_C, Anim_FadeIn) == 0x000390, "Member 'UWBP_CoreGenericPopup_C::Anim_FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericPopup_C, Bg) == 0x000398, "Member 'UWBP_CoreGenericPopup_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericPopup_C, Mask) == 0x0003A0, "Member 'UWBP_CoreGenericPopup_C::Mask' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericPopup_C, MessageScrollBox) == 0x0003A8, "Member 'UWBP_CoreGenericPopup_C::MessageScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericPopup_C, PriorityHeader) == 0x0003B0, "Member 'UWBP_CoreGenericPopup_C::PriorityHeader' has a wrong offset!");

}

