#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHUD_EventSpring2024_ObjectiveItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "UMG_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreHUD_EventSpring2024_ObjectiveItem.WBP_CoreHUD_EventSpring2024_ObjectiveItem_C
// 0x00A8 (0x0410 - 0x0368)
class UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C final : public UCoreHudEventObjectiveItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EndGameReward;                                     // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Background;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Border;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ChargesContainer;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              CooldownGauge;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFXWidget_C*                            EndGameVFX;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Icon;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ImageChargesBG;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_C*                 InputPrompt;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ObjectiveSeparator;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          TextChargeCount;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           IconInactiveColor;                                 // 0x03C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconActiveColor;                                   // 0x03D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconRewardColor;                                   // 0x03E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               IconMaterial;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ChargeMaterial;                                    // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CooldownMaterial;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCharges(int32 NewChargeCount);
	void ShouldResetGaugePercentage(int32 OldCharges, int32 OldMaxCharges, int32 NewCharges, int32 NewMaxCharges, bool* ShouldResetGauge);
	void SetWidgetState(const EEventObjectiveItemState EventItemState);
	void SetWidgetData(const EEventObjectiveItemState EventItemState, const int32 Charges, const int32 MaxCharges, const float ChargePercent);
	void SetPickUpPutDownAvailable(bool IsPickupAvailable, bool IsPutdownAvailable);
	void SetInputKey(const struct FKey& InputKey);
	void SetCooldownPercentage(const float CooldownPercent);
	void SetCooldown(bool IsOnCooldown);
	void SetAvailableCharges(const int32 Charges, const int32 MaxCharges);
	void Set_Red_Background(bool IsRed);
	void InitWidget(bool IsLocalKiller);
	void ExecuteUbergraph_WBP_CoreHUD_EventSpring2024_ObjectiveItem(int32 EntryPoint);
	void Construct();
	void ClearData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreHUD_EventSpring2024_ObjectiveItem_C">();
	}
	static class UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C>();
	}
};
static_assert(alignof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C) == 0x000008, "Wrong alignment on UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C");
static_assert(sizeof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C) == 0x000410, "Wrong size on UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, UberGraphFrame) == 0x000368, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, EndGameReward) == 0x000370, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::EndGameReward' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, Background) == 0x000378, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, Border) == 0x000380, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, ChargesContainer) == 0x000388, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::ChargesContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, CooldownGauge) == 0x000390, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::CooldownGauge' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, EndGameVFX) == 0x000398, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::EndGameVFX' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, Icon) == 0x0003A0, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, ImageChargesBG) == 0x0003A8, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::ImageChargesBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, InputPrompt) == 0x0003B0, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::InputPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, ObjectiveSeparator) == 0x0003B8, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::ObjectiveSeparator' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, TextChargeCount) == 0x0003C0, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::TextChargeCount' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, IconInactiveColor) == 0x0003C8, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::IconInactiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, IconActiveColor) == 0x0003D8, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::IconActiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, IconRewardColor) == 0x0003E8, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::IconRewardColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, IconMaterial) == 0x0003F8, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, ChargeMaterial) == 0x000400, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::ChargeMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C, CooldownMaterial) == 0x000408, "Member 'UWBP_CoreHUD_EventSpring2024_ObjectiveItem_C::CooldownMaterial' has a wrong offset!");

}

