#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreDirectionalMiniGameItem_SkullMerchant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreDirectionalMiniGameItem_SkullMerchant.WBP_CoreDirectionalMiniGameItem_SkullMerchant_C
// 0x0070 (0x03A8 - 0x0338)
class UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C final : public UCoreHudDirectionalMiniGameItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GoodEnding;                                        // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WrongEnding;                                       // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle;                                              // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoodInput;                                         // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WrongInput;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Background;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Border;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Icon;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EDirectionalInputKey                          CachedDirection;                                   // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SuccessColor;                                      // 0x0384(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BorderMaterial;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               IconMaterial;                                      // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateResult(bool IsSuccessful);
	void RotateIcon(EDirectionalInputKey Direction);
	void ExecuteUbergraph_WBP_CoreDirectionalMiniGameItem_SkullMerchant(int32 EntryPoint);
	void RevealDirection(bool WithAnimation);
	void ResetIcon();
	void PreConstruct(bool IsDesignTime);
	void Init(EDirectionalInputKey Direction);
	void Finished_F7D67A0D44DC901D62D10A978C9409AA();
	void Finished_3F29ECFE4BD68C58D1718C92504DCB5E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreDirectionalMiniGameItem_SkullMerchant_C">();
	}
	static class UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C>();
	}
};
static_assert(alignof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C) == 0x000008, "Wrong alignment on UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C");
static_assert(sizeof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C) == 0x0003A8, "Wrong size on UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, UberGraphFrame) == 0x000338, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, GoodEnding) == 0x000340, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::GoodEnding' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, WrongEnding) == 0x000348, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::WrongEnding' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, Idle) == 0x000350, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::Idle' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, GoodInput) == 0x000358, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::GoodInput' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, WrongInput) == 0x000360, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::WrongInput' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, Background) == 0x000368, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, Border) == 0x000370, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, Icon) == 0x000378, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, CachedDirection) == 0x000380, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::CachedDirection' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, SuccessColor) == 0x000384, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::SuccessColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, BorderMaterial) == 0x000398, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::BorderMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C, IconMaterial) == 0x0003A0, "Member 'UWBP_CoreDirectionalMiniGameItem_SkullMerchant_C::IconMaterial' has a wrong offset!");

}

