#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Core_TestBuildFlag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Core_TestBuildFlag.WBP_Core_TestBuildFlag_C
// 0x0018 (0x0378 - 0x0360)
class UWBP_Core_TestBuildFlag_C final : public UCoreTestBuildFlagWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              TestBuildFlagBackground;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TestBuildFlagBackgroundSizeBox;                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateTestFlagPosition(ETestBuildFlagPosition TestBuildFlagPosition);
	void SetMainMenuVisuals();
	void SetLobbyVisuals();
	void SetHudVisuals();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Core_TestBuildFlag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Core_TestBuildFlag_C">();
	}
	static class UWBP_Core_TestBuildFlag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Core_TestBuildFlag_C>();
	}
};
static_assert(alignof(UWBP_Core_TestBuildFlag_C) == 0x000008, "Wrong alignment on UWBP_Core_TestBuildFlag_C");
static_assert(sizeof(UWBP_Core_TestBuildFlag_C) == 0x000378, "Wrong size on UWBP_Core_TestBuildFlag_C");
static_assert(offsetof(UWBP_Core_TestBuildFlag_C, UberGraphFrame) == 0x000360, "Member 'UWBP_Core_TestBuildFlag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Core_TestBuildFlag_C, TestBuildFlagBackground) == 0x000368, "Member 'UWBP_Core_TestBuildFlag_C::TestBuildFlagBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Core_TestBuildFlag_C, TestBuildFlagBackgroundSizeBox) == 0x000370, "Member 'UWBP_Core_TestBuildFlag_C::TestBuildFlagBackgroundSizeBox' has a wrong offset!");

}

