#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileMenuTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ProfileMenuTab.WBP_ProfileMenuTab_C
// 0x0048 (0x0548 - 0x0500)
class UWBP_ProfileMenuTab_C final : public UCoreTabWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             ContentGrid;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Icon;                                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              IconBg;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreOnHoverBorder_C*               OnHoverBorder;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Rollover;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              SelectedBG;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Triangle;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ProfileMenuTab(int32 EntryPoint);
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnHovered();
	void OnSelectedChanged(bool Param_IsSelected, bool WithAnimation);
	void OnUnhovered();
	void PostInit();
	void UpdateBackgroundSkin(class UMaterialInterface* SkinMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ProfileMenuTab_C">();
	}
	static class UWBP_ProfileMenuTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ProfileMenuTab_C>();
	}
};
static_assert(alignof(UWBP_ProfileMenuTab_C) == 0x000008, "Wrong alignment on UWBP_ProfileMenuTab_C");
static_assert(sizeof(UWBP_ProfileMenuTab_C) == 0x000548, "Wrong size on UWBP_ProfileMenuTab_C");
static_assert(offsetof(UWBP_ProfileMenuTab_C, UberGraphFrame) == 0x000500, "Member 'UWBP_ProfileMenuTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, ContentGrid) == 0x000508, "Member 'UWBP_ProfileMenuTab_C::ContentGrid' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, Icon) == 0x000510, "Member 'UWBP_ProfileMenuTab_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, IconBg) == 0x000518, "Member 'UWBP_ProfileMenuTab_C::IconBg' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, OnHoverBorder) == 0x000520, "Member 'UWBP_ProfileMenuTab_C::OnHoverBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, Rollover) == 0x000528, "Member 'UWBP_ProfileMenuTab_C::Rollover' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, SelectedBG) == 0x000530, "Member 'UWBP_ProfileMenuTab_C::SelectedBG' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, Triangle) == 0x000538, "Member 'UWBP_ProfileMenuTab_C::Triangle' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuTab_C, Texture) == 0x000540, "Member 'UWBP_ProfileMenuTab_C::Texture' has a wrong offset!");

}

