#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreArrowButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreArrowButton.WBP_CoreArrowButton_C
// 0x0068 (0x0508 - 0x04A0)
class UWBP_CoreArrowButton_C final : public UCoreButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArrowIMG;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PressedColor;                                      // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredColor;                                      // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledColor;                                     // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnUnhovered();
	void OnReleased();
	void OnPressed();
	void OnHovered();
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnClicked();
	void OnAlignmentChanged(ETextJustify NewAlignment);
	void ExecuteUbergraph_WBP_CoreArrowButton(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreArrowButton_C">();
	}
	static class UWBP_CoreArrowButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreArrowButton_C>();
	}
};
static_assert(alignof(UWBP_CoreArrowButton_C) == 0x000008, "Wrong alignment on UWBP_CoreArrowButton_C");
static_assert(sizeof(UWBP_CoreArrowButton_C) == 0x000508, "Wrong size on UWBP_CoreArrowButton_C");
static_assert(offsetof(UWBP_CoreArrowButton_C, UberGraphFrame) == 0x0004A0, "Member 'UWBP_CoreArrowButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, Default) == 0x0004A8, "Member 'UWBP_CoreArrowButton_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, Hover) == 0x0004B0, "Member 'UWBP_CoreArrowButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, ArrowIMG) == 0x0004B8, "Member 'UWBP_CoreArrowButton_C::ArrowIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, Container) == 0x0004C0, "Member 'UWBP_CoreArrowButton_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, DefaultColor) == 0x0004C8, "Member 'UWBP_CoreArrowButton_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, PressedColor) == 0x0004D8, "Member 'UWBP_CoreArrowButton_C::PressedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, HoveredColor) == 0x0004E8, "Member 'UWBP_CoreArrowButton_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreArrowButton_C, DisabledColor) == 0x0004F8, "Member 'UWBP_CoreArrowButton_C::DisabledColor' has a wrong offset!");

}

