#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInteractionPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreInteractionPrompt.WBP_CoreInteractionPrompt_C
// 0x0050 (0x0318 - 0x02C8)
class UWBP_CoreInteractionPrompt_C final : public UCoreInteractionPromptWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CoreInputPrompt_AlternateTwoButtons_C* AlternateTwoButtons;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_HoldButton_C*      HoldButton;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_MashButton_C*      MashButton;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_MovementButtons_C* MovementButtons;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_MovementThumbstick_C* MovementThumbstick;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_PressButton_C*     PressButton;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_WiggleThumbstick_C* WiggleThumbstick;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCoreInteractionPromptActionWidget*     ActivePrompt;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SetMovementButtons(const struct FKey& InputKey3, const struct FKey& InputKey4);
	void SetData(const struct FInteractionPromptViewData& Data);
	void SetActiveWidget(EInteractionPromptType Type);
	void ExecuteUbergraph_WBP_CoreInteractionPrompt(int32 EntryPoint);
	void ClearData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreInteractionPrompt_C">();
	}
	static class UWBP_CoreInteractionPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreInteractionPrompt_C>();
	}
};
static_assert(alignof(UWBP_CoreInteractionPrompt_C) == 0x000008, "Wrong alignment on UWBP_CoreInteractionPrompt_C");
static_assert(sizeof(UWBP_CoreInteractionPrompt_C) == 0x000318, "Wrong size on UWBP_CoreInteractionPrompt_C");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, UberGraphFrame) == 0x0002C8, "Member 'UWBP_CoreInteractionPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, AlternateTwoButtons) == 0x0002D0, "Member 'UWBP_CoreInteractionPrompt_C::AlternateTwoButtons' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, HoldButton) == 0x0002D8, "Member 'UWBP_CoreInteractionPrompt_C::HoldButton' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, MashButton) == 0x0002E0, "Member 'UWBP_CoreInteractionPrompt_C::MashButton' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, MovementButtons) == 0x0002E8, "Member 'UWBP_CoreInteractionPrompt_C::MovementButtons' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, MovementThumbstick) == 0x0002F0, "Member 'UWBP_CoreInteractionPrompt_C::MovementThumbstick' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, PressButton) == 0x0002F8, "Member 'UWBP_CoreInteractionPrompt_C::PressButton' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, Switcher) == 0x000300, "Member 'UWBP_CoreInteractionPrompt_C::Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, WiggleThumbstick) == 0x000308, "Member 'UWBP_CoreInteractionPrompt_C::WiggleThumbstick' has a wrong offset!");
static_assert(offsetof(UWBP_CoreInteractionPrompt_C, ActivePrompt) == 0x000310, "Member 'UWBP_CoreInteractionPrompt_C::ActivePrompt' has a wrong offset!");

}

