#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreMenuOffering

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreMenuOffering.WBP_CoreMenuOffering_C.SetHiddenOffering
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreMenuOffering_C_SetHiddenOffering final
{
public:
	bool                                          IsHidden;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreMenuOffering_C_SetHiddenOffering) == 0x000001, "Wrong alignment on WBP_CoreMenuOffering_C_SetHiddenOffering");
static_assert(sizeof(WBP_CoreMenuOffering_C_SetHiddenOffering) == 0x000001, "Wrong size on WBP_CoreMenuOffering_C_SetHiddenOffering");
static_assert(offsetof(WBP_CoreMenuOffering_C_SetHiddenOffering, IsHidden) == 0x000000, "Member 'WBP_CoreMenuOffering_C_SetHiddenOffering::IsHidden' has a wrong offset!");

// Function WBP_CoreMenuOffering.WBP_CoreMenuOffering_C.ExecuteUbergraph_WBP_CoreMenuOffering
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isHidden;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering) == 0x000004, "Wrong alignment on WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering");
static_assert(sizeof(WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering) == 0x000008, "Wrong size on WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering");
static_assert(offsetof(WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering, EntryPoint) == 0x000000, "Member 'WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering, K2Node_Event_isHidden) == 0x000004, "Member 'WBP_CoreMenuOffering_C_ExecuteUbergraph_WBP_CoreMenuOffering::K2Node_Event_isHidden' has a wrong offset!");

}

