#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileMenuRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C
// 0x0068 (0x03E0 - 0x0378)
class UWBP_ProfileMenuRoot_C final : public UCoreProfileMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              BackgroundFog;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              BackgroundFog_1;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              BackgroundFog_2;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              BackgroundFog_4;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProfileMenuCustomizationWidget_C*  BadgeMenuWidget;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProfileMenuCustomizationWidget_C*  BannerMenuWidget;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Bg;                                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MenuTabsSwitcher;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              NoMoveSmoke;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SPACER1;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProfileMenuStatsWidget_C*          StatsMenuWidget;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProfileMenuTitle_C*                TitleSection;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ProfileMenuRoot(int32 EntryPoint);
	void SetMenuState(EProfileMenuState MenuState);
	void SetScrollPrompts();
	void SetSubtitle(const class FText& Subtitle);
	void SettingsInputSwitcherEvent();
	void SetTitle(const class FText& Title);

	TScriptInterface<class IProfileMenuCustomizationViewInterface> GetProfileMenuBadgeInterface() const;
	TScriptInterface<class IProfileMenuCustomizationViewInterface> GetProfileMenuBannerInterface() const;
	TScriptInterface<class IProfileMenuStatsViewInterface> GetProfileMenuStatsInterface() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ProfileMenuRoot_C">();
	}
	static class UWBP_ProfileMenuRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ProfileMenuRoot_C>();
	}
};
static_assert(alignof(UWBP_ProfileMenuRoot_C) == 0x000008, "Wrong alignment on UWBP_ProfileMenuRoot_C");
static_assert(sizeof(UWBP_ProfileMenuRoot_C) == 0x0003E0, "Wrong size on UWBP_ProfileMenuRoot_C");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, UberGraphFrame) == 0x000378, "Member 'UWBP_ProfileMenuRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, BackgroundFog) == 0x000380, "Member 'UWBP_ProfileMenuRoot_C::BackgroundFog' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, BackgroundFog_1) == 0x000388, "Member 'UWBP_ProfileMenuRoot_C::BackgroundFog_1' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, BackgroundFog_2) == 0x000390, "Member 'UWBP_ProfileMenuRoot_C::BackgroundFog_2' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, BackgroundFog_4) == 0x000398, "Member 'UWBP_ProfileMenuRoot_C::BackgroundFog_4' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, BadgeMenuWidget) == 0x0003A0, "Member 'UWBP_ProfileMenuRoot_C::BadgeMenuWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, BannerMenuWidget) == 0x0003A8, "Member 'UWBP_ProfileMenuRoot_C::BannerMenuWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, Bg) == 0x0003B0, "Member 'UWBP_ProfileMenuRoot_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, MenuTabsSwitcher) == 0x0003B8, "Member 'UWBP_ProfileMenuRoot_C::MenuTabsSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, NoMoveSmoke) == 0x0003C0, "Member 'UWBP_ProfileMenuRoot_C::NoMoveSmoke' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, SPACER1) == 0x0003C8, "Member 'UWBP_ProfileMenuRoot_C::SPACER1' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, StatsMenuWidget) == 0x0003D0, "Member 'UWBP_ProfileMenuRoot_C::StatsMenuWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileMenuRoot_C, TitleSection) == 0x0003D8, "Member 'UWBP_ProfileMenuRoot_C::TitleSection' has a wrong offset!");

}

