#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCurrencyProgressionReward

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCurrencyProgressionReward.WBP_CoreCurrencyProgressionReward_C.ExecuteUbergraph_WBP_CoreCurrencyProgressionReward
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyProgressionRewardViewData     K2Node_Event_currencyProgressionRewardViewData;    // 0x0008(0x01B8)(ConstParm)
	class FText                                   CallFunc_GetBeautifiedNumericText_ReturnValue;     // 0x01C0(0x0018)()
};
static_assert(alignof(WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward) == 0x000008, "Wrong alignment on WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward");
static_assert(sizeof(WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward) == 0x0001D8, "Wrong size on WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward");
static_assert(offsetof(WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward, EntryPoint) == 0x000000, "Member 'WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward, K2Node_Event_currencyProgressionRewardViewData) == 0x000008, "Member 'WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward::K2Node_Event_currencyProgressionRewardViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward, CallFunc_GetBeautifiedNumericText_ReturnValue) == 0x0001C0, "Member 'WBP_CoreCurrencyProgressionReward_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionReward::CallFunc_GetBeautifiedNumericText_ReturnValue' has a wrong offset!");

// Function WBP_CoreCurrencyProgressionReward.WBP_CoreCurrencyProgressionReward_C.SetCurrencyProgressionRewardData
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData final
{
public:
	struct FCurrencyProgressionRewardViewData     CurrencyProgressionRewardViewData;                 // 0x0000(0x01B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData) == 0x000008, "Wrong alignment on WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData");
static_assert(sizeof(WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData) == 0x0001B8, "Wrong size on WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData");
static_assert(offsetof(WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData, CurrencyProgressionRewardViewData) == 0x000000, "Member 'WBP_CoreCurrencyProgressionReward_C_SetCurrencyProgressionRewardData::CurrencyProgressionRewardViewData' has a wrong offset!");

}

