#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreWatermark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreWatermark.WBP_CoreWatermark_C
// 0x0068 (0x03C8 - 0x0360)
class UWBP_CoreWatermark_C final : public UCoreWatermarkWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText1;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText10;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText11;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText2;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText3;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText4;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText5;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText6;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText7;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText8;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          WatermarkDBDText9;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreWatermark(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreWatermark_C">();
	}
	static class UWBP_CoreWatermark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreWatermark_C>();
	}
};
static_assert(alignof(UWBP_CoreWatermark_C) == 0x000008, "Wrong alignment on UWBP_CoreWatermark_C");
static_assert(sizeof(UWBP_CoreWatermark_C) == 0x0003C8, "Wrong size on UWBP_CoreWatermark_C");
static_assert(offsetof(UWBP_CoreWatermark_C, UberGraphFrame) == 0x000360, "Member 'UWBP_CoreWatermark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, CanvasPanel) == 0x000368, "Member 'UWBP_CoreWatermark_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText1) == 0x000370, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText10) == 0x000378, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText10' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText11) == 0x000380, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText11' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText2) == 0x000388, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText2' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText3) == 0x000390, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText3' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText4) == 0x000398, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText4' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText5) == 0x0003A0, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText5' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText6) == 0x0003A8, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText6' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText7) == 0x0003B0, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText7' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText8) == 0x0003B8, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText8' has a wrong offset!");
static_assert(offsetof(UWBP_CoreWatermark_C, WatermarkDBDText9) == 0x0003C0, "Member 'UWBP_CoreWatermark_C::WatermarkDBDText9' has a wrong offset!");

}

