#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreBinkVideoPlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreBinkVideoPlayerWidget.WBP_CoreBinkVideoPlayerWidget_C
// 0x0018 (0x0418 - 0x0400)
class UWBP_CoreBinkVideoPlayerWidget_C final : public UCoreBinkVideoPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              BottomSmokeFX_1;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SkipAnimationCanvasPanel;                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreBinkVideoPlayerWidget(int32 EntryPoint);
	class UBinkMediaPlayer* GetBinkVideoPlayer();
	void SetSkipInputSwitcherVisibility(bool Param_IsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreBinkVideoPlayerWidget_C">();
	}
	static class UWBP_CoreBinkVideoPlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreBinkVideoPlayerWidget_C>();
	}
};
static_assert(alignof(UWBP_CoreBinkVideoPlayerWidget_C) == 0x000008, "Wrong alignment on UWBP_CoreBinkVideoPlayerWidget_C");
static_assert(sizeof(UWBP_CoreBinkVideoPlayerWidget_C) == 0x000418, "Wrong size on UWBP_CoreBinkVideoPlayerWidget_C");
static_assert(offsetof(UWBP_CoreBinkVideoPlayerWidget_C, UberGraphFrame) == 0x000400, "Member 'UWBP_CoreBinkVideoPlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreBinkVideoPlayerWidget_C, BottomSmokeFX_1) == 0x000408, "Member 'UWBP_CoreBinkVideoPlayerWidget_C::BottomSmokeFX_1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreBinkVideoPlayerWidget_C, SkipAnimationCanvasPanel) == 0x000410, "Member 'UWBP_CoreBinkVideoPlayerWidget_C::SkipAnimationCanvasPanel' has a wrong offset!");

}

