#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreItemPickup

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreItemPickup.WBP_CoreItemPickup_C.SetRegularItems
// 0x0420 (0x0420 - 0x0000)
struct WBP_CoreItemPickup_C_SetRegularItems final
{
public:
	struct FItemPickupViewData                    PickupItemData;                                    // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FItemPickupViewData                    CurrentItemData;                                   // 0x01D0(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x03D0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x03E8(0x0018)()
	TScriptInterface<class IItemBundleViewInterface> CallFunc_SetData_self_CastInput;                   // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IItemBundleViewInterface> CallFunc_SetData_self_CastInput_1;                 // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemPickup_C_SetRegularItems) == 0x000008, "Wrong alignment on WBP_CoreItemPickup_C_SetRegularItems");
static_assert(sizeof(WBP_CoreItemPickup_C_SetRegularItems) == 0x000420, "Wrong size on WBP_CoreItemPickup_C_SetRegularItems");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, PickupItemData) == 0x000000, "Member 'WBP_CoreItemPickup_C_SetRegularItems::PickupItemData' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CurrentItemData) == 0x0001D0, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CurrentItemData' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CallFunc_Conv_StringToText_ReturnValue) == 0x0003A0, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003B8, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0003D0, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0003E8, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CallFunc_SetData_self_CastInput) == 0x000400, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CallFunc_SetData_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetRegularItems, CallFunc_SetData_self_CastInput_1) == 0x000410, "Member 'WBP_CoreItemPickup_C_SetRegularItems::CallFunc_SetData_self_CastInput_1' has a wrong offset!");

// Function WBP_CoreItemPickup.WBP_CoreItemPickup_C.SetK36Items
// 0x0460 (0x0460 - 0x0000)
struct WBP_CoreItemPickup_C_SetK36Items final
{
public:
	struct FItemPickupViewData                    PickupK36Data;                                     // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FItemPickupViewData                    CurrentK36Data;                                    // 0x01D0(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03A0(0x0018)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03E8(0x0018)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_2;                 // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0418(0x0018)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_3;                 // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0448(0x0018)()
};
static_assert(alignof(WBP_CoreItemPickup_C_SetK36Items) == 0x000008, "Wrong alignment on WBP_CoreItemPickup_C_SetK36Items");
static_assert(sizeof(WBP_CoreItemPickup_C_SetK36Items) == 0x000460, "Wrong size on WBP_CoreItemPickup_C_SetK36Items");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, PickupK36Data) == 0x000000, "Member 'WBP_CoreItemPickup_C_SetK36Items::PickupK36Data' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CurrentK36Data) == 0x0001D0, "Member 'WBP_CoreItemPickup_C_SetK36Items::CurrentK36Data' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_StringToText_ReturnValue) == 0x0003A0, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0003B8, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0003C0, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_AsTexture_2D) == 0x0003C8, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_bSuccess) == 0x0003D0, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_AsTexture_2D_1) == 0x0003D8, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_bSuccess_1) == 0x0003E0, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003E8, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000400, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_AsTexture_2D_2) == 0x000408, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_AsTexture_2D_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_bSuccess_2) == 0x000410, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000418, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x000430, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_AsTexture_2D_3) == 0x000438, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_AsTexture_2D_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, K2Node_DynamicCast_bSuccess_3) == 0x000440, "Member 'WBP_CoreItemPickup_C_SetK36Items::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetK36Items, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000448, "Member 'WBP_CoreItemPickup_C_SetK36Items::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");

// Function WBP_CoreItemPickup.WBP_CoreItemPickup_C.SetData
// 0x03A0 (0x03A0 - 0x0000)
struct WBP_CoreItemPickup_C_SetData final
{
public:
	struct FItemPickupViewData                    ItemToPickUpData;                                  // 0x0000(0x01D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FItemPickupViewData                    Param_CurrentItem;                                 // 0x01D0(0x01D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreItemPickup_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreItemPickup_C_SetData");
static_assert(sizeof(WBP_CoreItemPickup_C_SetData) == 0x0003A0, "Wrong size on WBP_CoreItemPickup_C_SetData");
static_assert(offsetof(WBP_CoreItemPickup_C_SetData, ItemToPickUpData) == 0x000000, "Member 'WBP_CoreItemPickup_C_SetData::ItemToPickUpData' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_SetData, Param_CurrentItem) == 0x0001D0, "Member 'WBP_CoreItemPickup_C_SetData::Param_CurrentItem' has a wrong offset!");

// Function WBP_CoreItemPickup.WBP_CoreItemPickup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreItemPickup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemPickup_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreItemPickup_C_PreConstruct");
static_assert(sizeof(WBP_CoreItemPickup_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreItemPickup_C_PreConstruct");
static_assert(offsetof(WBP_CoreItemPickup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreItemPickup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreItemPickup.WBP_CoreItemPickup_C.ExecuteUbergraph_WBP_CoreItemPickup
// 0x03B0 (0x03B0 - 0x0000)
struct WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemPickupViewData                    K2Node_Event_itemToPickUpData;                     // 0x0008(0x01D0)(ConstParm)
	struct FItemPickupViewData                    K2Node_Event_currentItem;                          // 0x01D8(0x01D0)(ConstParm)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x1];                                      // 0x03AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateScale_scale_ImplicitCast;           // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup) == 0x000008, "Wrong alignment on WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup");
static_assert(sizeof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup) == 0x0003B0, "Wrong size on WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, EntryPoint) == 0x000000, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, K2Node_Event_itemToPickUpData) == 0x000008, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::K2Node_Event_itemToPickUpData' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, K2Node_Event_currentItem) == 0x0001D8, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::K2Node_Event_currentItem' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0003A8, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, CallFunc_Not_PreBool_ReturnValue) == 0x0003A9, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, K2Node_Event_IsDesignTime) == 0x0003AA, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup, CallFunc_UpdateScale_scale_ImplicitCast) == 0x0003AC, "Member 'WBP_CoreItemPickup_C_ExecuteUbergraph_WBP_CoreItemPickup::CallFunc_UpdateScale_scale_ImplicitCast' has a wrong offset!");

}

