#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCircularProgressBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCircularProgressBar.WBP_CoreCircularProgressBar_C.SetFillAmount
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreCircularProgressBar_C_SetFillAmount final
{
public:
	class UImage*                                 ImageWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FillAmountf;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCircularProgressBar_C_SetFillAmount) == 0x000008, "Wrong alignment on WBP_CoreCircularProgressBar_C_SetFillAmount");
static_assert(sizeof(WBP_CoreCircularProgressBar_C_SetFillAmount) == 0x000020, "Wrong size on WBP_CoreCircularProgressBar_C_SetFillAmount");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFillAmount, ImageWidget) == 0x000000, "Member 'WBP_CoreCircularProgressBar_C_SetFillAmount::ImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFillAmount, FillAmountf) == 0x000008, "Member 'WBP_CoreCircularProgressBar_C_SetFillAmount::FillAmountf' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFillAmount, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_CoreCircularProgressBar_C_SetFillAmount::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFillAmount, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_CoreCircularProgressBar_C_SetFillAmount::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CoreCircularProgressBar.WBP_CoreCircularProgressBar_C.SetFill
// 0x0038 (0x0038 - 0x0000)
struct WBP_CoreCircularProgressBar_C_SetFill final
{
public:
	class UImage*                                 ImageWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Percent;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TheImage;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCircularProgressBar_C_SetFill) == 0x000008, "Wrong alignment on WBP_CoreCircularProgressBar_C_SetFill");
static_assert(sizeof(WBP_CoreCircularProgressBar_C_SetFill) == 0x000038, "Wrong size on WBP_CoreCircularProgressBar_C_SetFill");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFill, ImageWidget) == 0x000000, "Member 'WBP_CoreCircularProgressBar_C_SetFill::ImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFill, Percent) == 0x000008, "Member 'WBP_CoreCircularProgressBar_C_SetFill::Percent' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFill, Color) == 0x000010, "Member 'WBP_CoreCircularProgressBar_C_SetFill::Color' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFill, TheImage) == 0x000020, "Member 'WBP_CoreCircularProgressBar_C_SetFill::TheImage' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFill, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_CoreCircularProgressBar_C_SetFill::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetFill, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000030, "Member 'WBP_CoreCircularProgressBar_C_SetFill::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CoreCircularProgressBar.WBP_CoreCircularProgressBar_C.SetBase
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreCircularProgressBar_C_SetBase final
{
public:
	class UImage*                                 ImageWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TheImage;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCircularProgressBar_C_SetBase) == 0x000008, "Wrong alignment on WBP_CoreCircularProgressBar_C_SetBase");
static_assert(sizeof(WBP_CoreCircularProgressBar_C_SetBase) == 0x000028, "Wrong size on WBP_CoreCircularProgressBar_C_SetBase");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetBase, ImageWidget) == 0x000000, "Member 'WBP_CoreCircularProgressBar_C_SetBase::ImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetBase, Color) == 0x000008, "Member 'WBP_CoreCircularProgressBar_C_SetBase::Color' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetBase, TheImage) == 0x000018, "Member 'WBP_CoreCircularProgressBar_C_SetBase::TheImage' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_SetBase, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_CoreCircularProgressBar_C_SetBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CoreCircularProgressBar.WBP_CoreCircularProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCircularProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCircularProgressBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreCircularProgressBar_C_PreConstruct");
static_assert(sizeof(WBP_CoreCircularProgressBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreCircularProgressBar_C_PreConstruct");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreCircularProgressBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreCircularProgressBar.WBP_CoreCircularProgressBar_C.ExecuteUbergraph_WBP_CoreCircularProgressBar
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar) == 0x000004, "Wrong alignment on WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar");
static_assert(sizeof(WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar) == 0x000010, "Wrong size on WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar, EntryPoint) == 0x000000, "Member 'WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000008, "Member 'WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00000C, "Member 'WBP_CoreCircularProgressBar_C_ExecuteUbergraph_WBP_CoreCircularProgressBar::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

}

