#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCharacterReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreCharacterReward.WBP_CoreCharacterReward_C
// 0x0048 (0x0640 - 0x05F8)
class UWBP_CoreCharacterReward_C final : public UCoreCharacterRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              ItemIMG;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              KillSwitchOverlay;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              LegacyPrestigePortraitIMG;                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RoleIMG;                                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           SurvivorColor;                                     // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           KillerColor;                                       // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreCharacterReward(int32 EntryPoint);
	void SetCharacterRewardData(const struct FCharacterRewardViewData& CharacterRewardViewData);
	void SetKillSwitchOverlay(const bool Param_IsEnabled);
	void SetLegacyPrestigePortrait(const bool IsLegacyPrestigePortraitEnabled);
	void SetRole(EPlayerRole PlayerRole);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreCharacterReward_C">();
	}
	static class UWBP_CoreCharacterReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreCharacterReward_C>();
	}
};
static_assert(alignof(UWBP_CoreCharacterReward_C) == 0x000008, "Wrong alignment on UWBP_CoreCharacterReward_C");
static_assert(sizeof(UWBP_CoreCharacterReward_C) == 0x000640, "Wrong size on UWBP_CoreCharacterReward_C");
static_assert(offsetof(UWBP_CoreCharacterReward_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_CoreCharacterReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCharacterReward_C, ItemIMG) == 0x000600, "Member 'UWBP_CoreCharacterReward_C::ItemIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCharacterReward_C, KillSwitchOverlay) == 0x000608, "Member 'UWBP_CoreCharacterReward_C::KillSwitchOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCharacterReward_C, LegacyPrestigePortraitIMG) == 0x000610, "Member 'UWBP_CoreCharacterReward_C::LegacyPrestigePortraitIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCharacterReward_C, RoleIMG) == 0x000618, "Member 'UWBP_CoreCharacterReward_C::RoleIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCharacterReward_C, SurvivorColor) == 0x000620, "Member 'UWBP_CoreCharacterReward_C::SurvivorColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCharacterReward_C, KillerColor) == 0x000630, "Member 'UWBP_CoreCharacterReward_C::KillerColor' has a wrong offset!");

}

