#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreTutorialObjectiveItem

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreTutorialObjectiveItem.WBP_CoreTutorialObjectiveItem_C.SetObjectiveCompleted
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted final
{
public:
	bool                                          RemoveAfterCompletion;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted) == 0x000001, "Wrong alignment on WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted");
static_assert(sizeof(WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted) == 0x000001, "Wrong size on WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted, RemoveAfterCompletion) == 0x000000, "Member 'WBP_CoreTutorialObjectiveItem_C_SetObjectiveCompleted::RemoveAfterCompletion' has a wrong offset!");

// Function WBP_CoreTutorialObjectiveItem.WBP_CoreTutorialObjectiveItem_C.SetInputPrompt
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CoreTutorialObjectiveItem_C_SetInputPrompt final
{
public:
	struct FInteractionPromptViewData             InteractionPromptViewData;                         // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_CoreInteractionPrompt_C*           PromptWidget;                                      // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreTutorialObjectiveItem_C_SetInputPrompt) == 0x000008, "Wrong alignment on WBP_CoreTutorialObjectiveItem_C_SetInputPrompt");
static_assert(sizeof(WBP_CoreTutorialObjectiveItem_C_SetInputPrompt) == 0x0000C0, "Wrong size on WBP_CoreTutorialObjectiveItem_C_SetInputPrompt");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_SetInputPrompt, InteractionPromptViewData) == 0x000000, "Member 'WBP_CoreTutorialObjectiveItem_C_SetInputPrompt::InteractionPromptViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_SetInputPrompt, PromptWidget) == 0x0000B0, "Member 'WBP_CoreTutorialObjectiveItem_C_SetInputPrompt::PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_SetInputPrompt, CallFunc_Key_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_CoreTutorialObjectiveItem_C_SetInputPrompt::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CoreTutorialObjectiveItem.WBP_CoreTutorialObjectiveItem_C.Set Text Wrapping
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping) == 0x000001, "Wrong alignment on WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping");
static_assert(sizeof(WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping) == 0x000003, "Wrong size on WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping, CallFunc_IsVisible_ReturnValue_1) == 0x000001, "Member 'WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_CoreTutorialObjectiveItem_C_Set_Text_Wrapping::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreTutorialObjectiveItem.WBP_CoreTutorialObjectiveItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreTutorialObjectiveItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreTutorialObjectiveItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreTutorialObjectiveItem_C_PreConstruct");
static_assert(sizeof(WBP_CoreTutorialObjectiveItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreTutorialObjectiveItem_C_PreConstruct");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreTutorialObjectiveItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreTutorialObjectiveItem.WBP_CoreTutorialObjectiveItem_C.InitObjective
// 0x0170 (0x0170 - 0x0000)
struct WBP_CoreTutorialObjectiveItem_C_InitObjective final
{
public:
	struct FTutorialObjectivesViewData            InteractionsViewData;                              // 0x0000(0x0170)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreTutorialObjectiveItem_C_InitObjective) == 0x000008, "Wrong alignment on WBP_CoreTutorialObjectiveItem_C_InitObjective");
static_assert(sizeof(WBP_CoreTutorialObjectiveItem_C_InitObjective) == 0x000170, "Wrong size on WBP_CoreTutorialObjectiveItem_C_InitObjective");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_InitObjective, InteractionsViewData) == 0x000000, "Member 'WBP_CoreTutorialObjectiveItem_C_InitObjective::InteractionsViewData' has a wrong offset!");

// Function WBP_CoreTutorialObjectiveItem.WBP_CoreTutorialObjectiveItem_C.ExecuteUbergraph_WBP_CoreTutorialObjectiveItem
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTutorialObjectivesViewData            K2Node_Event_interactionsViewData;                 // 0x0040(0x0170)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B8(0x0018)()
	bool                                          K2Node_Event_removeAfterCompletion;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem) == 0x000008, "Wrong alignment on WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem");
static_assert(sizeof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem) == 0x0001D8, "Wrong size on WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, EntryPoint) == 0x000000, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, K2Node_Event_interactionsViewData) == 0x000040, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::K2Node_Event_interactionsViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, K2Node_Event_IsDesignTime) == 0x0001B0, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B8, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem, K2Node_Event_removeAfterCompletion) == 0x0001D0, "Member 'WBP_CoreTutorialObjectiveItem_C_ExecuteUbergraph_WBP_CoreTutorialObjectiveItem::K2Node_Event_removeAfterCompletion' has a wrong offset!");

}

