#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProcessingPopup

#include "Basic.hpp"

#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ProcessingPopup.WBP_ProcessingPopup_C
// 0x0018 (0x0360 - 0x0348)
class UWBP_ProcessingPopup_C final : public UProcessingPopupWidget
{
public:
	class UDBDImage*                              Bg;                                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingWheel_C*                    LoadingWheel;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              TitleBG;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ProcessingPopup_C">();
	}
	static class UWBP_ProcessingPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ProcessingPopup_C>();
	}
};
static_assert(alignof(UWBP_ProcessingPopup_C) == 0x000008, "Wrong alignment on UWBP_ProcessingPopup_C");
static_assert(sizeof(UWBP_ProcessingPopup_C) == 0x000360, "Wrong size on UWBP_ProcessingPopup_C");
static_assert(offsetof(UWBP_ProcessingPopup_C, Bg) == 0x000348, "Member 'UWBP_ProcessingPopup_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_ProcessingPopup_C, LoadingWheel) == 0x000350, "Member 'UWBP_ProcessingPopup_C::LoadingWheel' has a wrong offset!");
static_assert(offsetof(UWBP_ProcessingPopup_C, TitleBG) == 0x000358, "Member 'UWBP_ProcessingPopup_C::TitleBG' has a wrong offset!");

}

