#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAuricCellsBundle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreAuricCellsBundle.WBP_CoreAuricCellsBundle_C
// 0x0040 (0x0570 - 0x0530)
class UWBP_CoreAuricCellsBundle_C final : public UCoreAuricCellsBundleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              BorderIMG;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              HighlightBorderIMG;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RewardHighlightBackground;                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RewardHighlightIcon;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreRewardPopup_VFXWidget_C*       VFX_AuricCell;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BorderDefault;                                     // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BorderHighlight;                                   // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetupAsReward();
	void SetRewardHighlight(bool RewardHighlight);
	void ExecuteUbergraph_WBP_CoreAuricCellsBundle(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreAuricCellsBundle_C">();
	}
	static class UWBP_CoreAuricCellsBundle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreAuricCellsBundle_C>();
	}
};
static_assert(alignof(UWBP_CoreAuricCellsBundle_C) == 0x000008, "Wrong alignment on UWBP_CoreAuricCellsBundle_C");
static_assert(sizeof(UWBP_CoreAuricCellsBundle_C) == 0x000570, "Wrong size on UWBP_CoreAuricCellsBundle_C");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, UberGraphFrame) == 0x000530, "Member 'UWBP_CoreAuricCellsBundle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, BorderIMG) == 0x000538, "Member 'UWBP_CoreAuricCellsBundle_C::BorderIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, HighlightBorderIMG) == 0x000540, "Member 'UWBP_CoreAuricCellsBundle_C::HighlightBorderIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, RewardHighlightBackground) == 0x000548, "Member 'UWBP_CoreAuricCellsBundle_C::RewardHighlightBackground' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, RewardHighlightIcon) == 0x000550, "Member 'UWBP_CoreAuricCellsBundle_C::RewardHighlightIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, VFX_AuricCell) == 0x000558, "Member 'UWBP_CoreAuricCellsBundle_C::VFX_AuricCell' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, BorderDefault) == 0x000560, "Member 'UWBP_CoreAuricCellsBundle_C::BorderDefault' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsBundle_C, BorderHighlight) == 0x000568, "Member 'UWBP_CoreAuricCellsBundle_C::BorderHighlight' has a wrong offset!");

}

