#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStoreCustomizationItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.ExecuteUbergraph_WBP_CoreStoreCustomizationItem
// 0x0078 (0x0078 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPriceTagViewData>              CallFunc_Debug_MakePriceTagArray_PriceTagArray;    // 0x0008(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isNew;                                // 0x0019(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStoreCustomizationItemViewData*        K2Node_Event_data;                                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasNotification_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAvailable_ReturnValue;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBuyable_ReturnValue;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBuyable_ReturnValue_1;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAvailable_ReturnValue_1;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOutfitInfoViewData                    K2Node_MakeStruct_OutfitInfoViewData;              // 0x0030(0x0048)()
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem) == 0x000078, "Wrong size on WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, EntryPoint) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_Debug_MakePriceTagArray_PriceTagArray) == 0x000008, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_Debug_MakePriceTagArray_PriceTagArray' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, K2Node_Event_isNew) == 0x000019, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::K2Node_Event_isNew' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_IsTagEnabled_ReturnValue) == 0x00001A, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, K2Node_Event_data) == 0x000020, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_GetHasNotification_ReturnValue) == 0x000029, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_GetHasNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_GetIsAvailable_ReturnValue) == 0x00002A, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_GetIsAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_GetIsBuyable_ReturnValue) == 0x00002B, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_GetIsBuyable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_GetIsBuyable_ReturnValue_1) == 0x00002C, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_GetIsBuyable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, CallFunc_GetIsAvailable_ReturnValue_1) == 0x00002D, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::CallFunc_GetIsAvailable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem, K2Node_MakeStruct_OutfitInfoViewData) == 0x000030, "Member 'WBP_CoreStoreCustomizationItem_C_ExecuteUbergraph_WBP_CoreStoreCustomizationItem::K2Node_MakeStruct_OutfitInfoViewData' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.GetRealSize
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_GetRealSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_GetRealSize) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_GetRealSize");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_GetRealSize) == 0x000010, "Wrong size on WBP_CoreStoreCustomizationItem_C_GetRealSize");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_GetRealSize, ReturnValue) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_GetRealSize::ReturnValue' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_PreConstruct");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreStoreCustomizationItem_C_PreConstruct");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.Set Disabled State Overlay
// 0x0002 (0x0002 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDisabledItemOption                           DisabledOption;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay) == 0x000002, "Wrong size on WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay::Param_IsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay, DisabledOption) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_Set_Disabled_State_Overlay::DisabledOption' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetEquippedTag
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetEquippedTag final
{
public:
	bool                                          IsEquipped;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetEquippedTag) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetEquippedTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetEquippedTag) == 0x000001, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetEquippedTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEquippedTag, IsEquipped) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetEquippedTag::IsEquipped' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetEventCheckmarkTag
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag) == 0x000003, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag, IsOwned) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag, CallFunc_IsTagEnabled_ReturnValue) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_CoreStoreCustomizationItem_C_SetEventCheckmarkTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetEventPointsTag
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetEventPointsTag final
{
public:
	bool                                          GrantsMilestonePointOnUnlock;                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetEventPointsTag) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetEventPointsTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetEventPointsTag) == 0x000003, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetEventPointsTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEventPointsTag, GrantsMilestonePointOnUnlock) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetEventPointsTag::GrantsMilestonePointOnUnlock' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEventPointsTag, CallFunc_IsTagEnabled_ReturnValue) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_SetEventPointsTag::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetEventPointsTag, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_CoreStoreCustomizationItem_C_SetEventPointsTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetLockedOverlay
// 0x0058 (0x0058 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetLockedOverlay final
{
public:
	bool                                          IsAvailable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBuyable;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOutfitInfoViewData                    OutfitInfo;                                        // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetLockedOverlay");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay) == 0x000058, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetLockedOverlay");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, IsAvailable) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::IsAvailable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, IsOwned) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, IsBuyable) == 0x000002, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::IsBuyable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, OutfitInfo) == 0x000008, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::OutfitInfo' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_IsTagEnabled_ReturnValue) == 0x000050, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_BooleanNAND_ReturnValue) == 0x000052, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_Not_PreBool_ReturnValue_1) == 0x000053, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_BooleanAND_ReturnValue_1) == 0x000055, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_BooleanAND_ReturnValue_2) == 0x000056, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetLockedOverlay, CallFunc_BooleanAND_ReturnValue_3) == 0x000057, "Member 'WBP_CoreStoreCustomizationItem_C_SetLockedOverlay::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetNotificationTag
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetNotificationTag final
{
public:
	bool                                          IsNew;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetNotificationTag) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetNotificationTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetNotificationTag) == 0x000001, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetNotificationTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetNotificationTag, IsNew) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetNotificationTag::IsNew' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetOwnedTag
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetOwnedTag final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetOwnedTag) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetOwnedTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetOwnedTag) == 0x000003, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetOwnedTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetOwnedTag, IsOwned) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetOwnedTag::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetOwnedTag, CallFunc_IsTagEnabled_ReturnValue) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_SetOwnedTag::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetOwnedTag, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_CoreStoreCustomizationItem_C_SetOwnedTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetPriceTags
// 0x0120 (0x0120 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetPriceTags final
{
public:
	bool                                          IsBuyable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingSmallTemplate;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPriceTagViewData>              PriceTags;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FOutfitInfoViewData                    OutfitInfo;                                        // 0x0018(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPriceTagViewData                      CallFunc_Array_Get_Item;                           // 0x0080(0x0050)()
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default;                             // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCorePriceTagWidget*                    CallFunc_CreatePriceTagWidget_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateScale_scale_ImplicitCast;           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateScale_scale_ImplicitCast_1;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetPriceTags) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetPriceTags");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetPriceTags) == 0x000120, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetPriceTags");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, IsBuyable) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::IsBuyable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, IsUsingSmallTemplate) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::IsUsingSmallTemplate' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, PriceTags) == 0x000008, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::PriceTags' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, OutfitInfo) == 0x000018, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::OutfitInfo' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_BooleanNAND_ReturnValue) == 0x000064, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_IsTagEnabled_ReturnValue) == 0x00006D, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_BooleanAND_ReturnValue) == 0x00006E, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_BooleanAND_ReturnValue_1) == 0x00006F, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_BooleanAND_ReturnValue_2) == 0x000070, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_SelectInt_ReturnValue) == 0x0000D0, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_Array_Length_ReturnValue_1) == 0x0000D4, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_SlotAsGridSlot_ReturnValue) == 0x0000E0, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, Temp_bool_Variable) == 0x0000E8, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, Temp_byte_Variable) == 0x0000E9, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, K2Node_Select_Default) == 0x0000EC, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, Temp_byte_Variable_1) == 0x0000FC, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_CreatePriceTagWidget_ReturnValue) == 0x000100, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_CreatePriceTagWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x000108, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, Temp_bool_Variable_1) == 0x000111, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, K2Node_Select_Default_1) == 0x000112, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_UpdateScale_scale_ImplicitCast) == 0x000114, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_UpdateScale_scale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetPriceTags, CallFunc_UpdateScale_scale_ImplicitCast_1) == 0x000118, "Member 'WBP_CoreStoreCustomizationItem_C_SetPriceTags::CallFunc_UpdateScale_scale_ImplicitCast_1' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetRarity
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetRarity final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIDataManager*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetCustomizationRarityMaterial_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetRarity) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetRarity");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetRarity) == 0x000018, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetRarity");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetRarity, Rarity) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetRarity::Rarity' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetRarity, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'WBP_CoreStoreCustomizationItem_C_SetRarity::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetRarity, CallFunc_GetCustomizationRarityMaterial_ReturnValue) == 0x000010, "Member 'WBP_CoreStoreCustomizationItem_C_SetRarity::CallFunc_GetCustomizationRarityMaterial_ReturnValue' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetStoreCustomizationItemData
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData final
{
public:
	class UStoreCustomizationItemViewData*        Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData) == 0x000008, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData, Data) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetStoreCustomizationItemData::Data' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetTimerFlags
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetTimerFlags final
{
public:
	struct FTimerFlagViewData                     LimitedTimeFlagViewData;                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FTimerFlagViewData                     DiscountTimeFlagViewData;                          // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsOwned;                                           // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTimerFlagViewData>             K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDBDTimeUtilities*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerFlagViewData                     CallFunc_Array_Get_Item;                           // 0x0090(0x0030)()
	bool                                          CallFunc_IsDateAfterCurrentDateWithEpsilon_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoreTimerFlagWidget*                   CallFunc_CreateTimerFlagWidget_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetTimerFlags");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags) == 0x0000E8, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetTimerFlags");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, LimitedTimeFlagViewData) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::LimitedTimeFlagViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, DiscountTimeFlagViewData) == 0x000030, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::DiscountTimeFlagViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, IsOwned) == 0x000060, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000080, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, Temp_int_Array_Index_Variable) == 0x000088, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_IsTagEnabled_ReturnValue) == 0x00008C, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_IsDateAfterCurrentDateWithEpsilon_ReturnValue) == 0x0000C0, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_IsDateAfterCurrentDateWithEpsilon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_BooleanAND_ReturnValue) == 0x0000C1, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C8, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_Less_IntInt_ReturnValue) == 0x0000C9, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_CreateTimerFlagWidget_ReturnValue) == 0x0000D0, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_CreateTimerFlagWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000D8, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetTimerFlags, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_CoreStoreCustomizationItem_C_SetTimerFlags::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetUnavailableTag
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetUnavailableTag final
{
public:
	bool                                          IsAvailable;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagEnabled_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag) == 0x000008, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetUnavailableTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag) == 0x000028, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetUnavailableTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, IsAvailable) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::IsAvailable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, Temp_bool_Variable) == 0x000001, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, Temp_real_Variable) == 0x000008, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, CallFunc_IsTagEnabled_ReturnValue) == 0x000010, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::CallFunc_IsTagEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, K2Node_Select_Default) == 0x000018, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnavailableTag, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000020, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnavailableTag::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C.SetUnbreakableSetTag
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag final
{
public:
	bool                                          IsUnbreakable;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag) == 0x000001, "Wrong alignment on WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag");
static_assert(sizeof(WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag) == 0x000001, "Wrong size on WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag");
static_assert(offsetof(WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag, IsUnbreakable) == 0x000000, "Member 'WBP_CoreStoreCustomizationItem_C_SetUnbreakableSetTag::IsUnbreakable' has a wrong offset!");

}

