#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStoreCustomizationItem

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreStoreCustomizationItem.WBP_CoreStoreCustomizationItem_C
// 0x00D8 (0x0630 - 0x0558)
class UWBP_CoreStoreCustomizationItem_C final : public UCoreStoreCustomizationItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             ContentGridPanel;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DisabledStateOverlay_C*            DisabledStateOverlay;                              // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              EquippedTagIcon;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              EventCheckmarkTagIcon;                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              EventPointsTagIcon;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FlagsVerticalBox;                                  // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ItemIMG;                                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LockedOverlay_C*                   LockedOverlay;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreNotifications_C*               NotificationTag;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreOwnedTag_C*                    OwnedTag;                                          // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              PriceBackground;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RarityIMG;                                         // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                REAL_SIZE;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              UnbreakableSetTagIcon;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              VisceralOverlay;                                   // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        SmallPriceTagScale;                                // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BigPriceTagScale;                                  // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                PriceTagContainerPaddingSmall;                     // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                PriceTagContainerPaddingBig;                       // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                PriceTagPaddingSmall;                              // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                PriceTagPaddingBig;                                // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        UnavailableOpacity;                                // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreStoreCustomizationItem(int32 EntryPoint);
	struct FVector2D GetRealSize();
	void PreConstruct(bool IsDesignTime);
	void Set_Disabled_State_Overlay(const bool Param_IsEnabled, EDisabledItemOption DisabledOption);
	void SetEquippedTag(bool IsEquipped);
	void SetEventCheckmarkTag(bool IsOwned);
	void SetEventPointsTag(bool GrantsMilestonePointOnUnlock);
	void SetLockedOverlay(bool IsAvailable, bool IsOwned, bool IsBuyable, const struct FOutfitInfoViewData& OutfitInfo);
	void SetNotificationTag(const bool IsNew);
	void SetOwnedTag(const bool IsOwned);
	void SetPriceTags(bool IsBuyable, bool IsUsingSmallTemplate, TArray<struct FPriceTagViewData>& PriceTags, const struct FOutfitInfoViewData& OutfitInfo);
	void SetRarity(EItemRarity Rarity);
	void SetStoreCustomizationItemData(class UStoreCustomizationItemViewData* Data);
	void SetTimerFlags(const struct FTimerFlagViewData& LimitedTimeFlagViewData, const struct FTimerFlagViewData& DiscountTimeFlagViewData, bool IsOwned);
	void SetUnavailableTag(const bool IsAvailable);
	void SetUnbreakableSetTag(const bool IsUnbreakable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreStoreCustomizationItem_C">();
	}
	static class UWBP_CoreStoreCustomizationItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreStoreCustomizationItem_C>();
	}
};
static_assert(alignof(UWBP_CoreStoreCustomizationItem_C) == 0x000008, "Wrong alignment on UWBP_CoreStoreCustomizationItem_C");
static_assert(sizeof(UWBP_CoreStoreCustomizationItem_C) == 0x000630, "Wrong size on UWBP_CoreStoreCustomizationItem_C");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, UberGraphFrame) == 0x000558, "Member 'UWBP_CoreStoreCustomizationItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, ContentGridPanel) == 0x000560, "Member 'UWBP_CoreStoreCustomizationItem_C::ContentGridPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, DisabledStateOverlay) == 0x000568, "Member 'UWBP_CoreStoreCustomizationItem_C::DisabledStateOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, EquippedTagIcon) == 0x000570, "Member 'UWBP_CoreStoreCustomizationItem_C::EquippedTagIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, EventCheckmarkTagIcon) == 0x000578, "Member 'UWBP_CoreStoreCustomizationItem_C::EventCheckmarkTagIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, EventPointsTagIcon) == 0x000580, "Member 'UWBP_CoreStoreCustomizationItem_C::EventPointsTagIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, FlagsVerticalBox) == 0x000588, "Member 'UWBP_CoreStoreCustomizationItem_C::FlagsVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, ItemIMG) == 0x000590, "Member 'UWBP_CoreStoreCustomizationItem_C::ItemIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, LockedOverlay) == 0x000598, "Member 'UWBP_CoreStoreCustomizationItem_C::LockedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, NotificationTag) == 0x0005A0, "Member 'UWBP_CoreStoreCustomizationItem_C::NotificationTag' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, OwnedTag) == 0x0005A8, "Member 'UWBP_CoreStoreCustomizationItem_C::OwnedTag' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, PriceBackground) == 0x0005B0, "Member 'UWBP_CoreStoreCustomizationItem_C::PriceBackground' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, RarityIMG) == 0x0005B8, "Member 'UWBP_CoreStoreCustomizationItem_C::RarityIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, REAL_SIZE) == 0x0005C0, "Member 'UWBP_CoreStoreCustomizationItem_C::REAL_SIZE' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, UnbreakableSetTagIcon) == 0x0005C8, "Member 'UWBP_CoreStoreCustomizationItem_C::UnbreakableSetTagIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, VisceralOverlay) == 0x0005D0, "Member 'UWBP_CoreStoreCustomizationItem_C::VisceralOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, SmallPriceTagScale) == 0x0005D8, "Member 'UWBP_CoreStoreCustomizationItem_C::SmallPriceTagScale' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, BigPriceTagScale) == 0x0005E0, "Member 'UWBP_CoreStoreCustomizationItem_C::BigPriceTagScale' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, PriceTagContainerPaddingSmall) == 0x0005E8, "Member 'UWBP_CoreStoreCustomizationItem_C::PriceTagContainerPaddingSmall' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, PriceTagContainerPaddingBig) == 0x0005F8, "Member 'UWBP_CoreStoreCustomizationItem_C::PriceTagContainerPaddingBig' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, PriceTagPaddingSmall) == 0x000608, "Member 'UWBP_CoreStoreCustomizationItem_C::PriceTagPaddingSmall' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, PriceTagPaddingBig) == 0x000618, "Member 'UWBP_CoreStoreCustomizationItem_C::PriceTagPaddingBig' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStoreCustomizationItem_C, UnavailableOpacity) == 0x000628, "Member 'UWBP_CoreStoreCustomizationItem_C::UnavailableOpacity' has a wrong offset!");

}

