#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K11

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K11.WBP_K11_C
// 0x0040 (0x0378 - 0x0338)
class UWBP_K11_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReverseBearTrapLevel02;                            // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReverseBearTrapLevel01;                            // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ReverseBearTrapOverlay;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              TimerFill;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              TimerHand;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              TimerWhite;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPigStatusData*                         CacheData;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetPigVisual(bool Is_Local_Killer, EReverseBearTrapUIState Reverse_Beartrap_state);
	void SetPigData(bool Is_Local_Killer, class UPigStatusData* KillerData);
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void ExecuteUbergraph_WBP_K11(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K11_C">();
	}
	static class UWBP_K11_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K11_C>();
	}
};
static_assert(alignof(UWBP_K11_C) == 0x000008, "Wrong alignment on UWBP_K11_C");
static_assert(sizeof(UWBP_K11_C) == 0x000378, "Wrong size on UWBP_K11_C");
static_assert(offsetof(UWBP_K11_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K11_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, ReverseBearTrapLevel02) == 0x000340, "Member 'UWBP_K11_C::ReverseBearTrapLevel02' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, ReverseBearTrapLevel01) == 0x000348, "Member 'UWBP_K11_C::ReverseBearTrapLevel01' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, ReverseBearTrapOverlay) == 0x000350, "Member 'UWBP_K11_C::ReverseBearTrapOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, TimerFill) == 0x000358, "Member 'UWBP_K11_C::TimerFill' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, TimerHand) == 0x000360, "Member 'UWBP_K11_C::TimerHand' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, TimerWhite) == 0x000368, "Member 'UWBP_K11_C::TimerWhite' has a wrong offset!");
static_assert(offsetof(UWBP_K11_C, CacheData) == 0x000370, "Member 'UWBP_K11_C::CacheData' has a wrong offset!");

}

