#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePower.WBP_CorePower_C
// 0x02D8 (0x0630 - 0x0358)
class UWBP_CorePower_C final : public UCorePowerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Recharge;                                          // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RevealIndicator;                                   // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               HighlightPanel;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ImageBG;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInteractionPrompt_C*           InteractionPrompt;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              IsRechargeableImage;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LayoutPowerIconScale;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OPACITYCONTAINER;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PowerProgressFlash;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              PowerTimerGague;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteBox;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ActiveColor;                                       // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProgressColor;                                     // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIconChanged;                                     // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPowerViewData                         Power_View_Data;                                   // 0x03E0(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPowerViewData                         PowerViewDataCached;                               // 0x0508(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateInputPrompt();
	void SetStackCount();
	void SetRechargeableIcon();
	void SetProgressBar();
	void SetInputVisibility();
	void SetData(const struct FPowerViewData& PowerViewData);
	void SetActiveState(bool IsActive);
	void SelectProgressBarColor(EProgressValueDisplayColor ProgressValueDisplayColor, struct FLinearColor* ProgressBarColor);
	void IconUpdateAnimation();
	void Get_Power_Data(struct FPowerViewData* NewParam);
	void ExecuteUbergraph_WBP_CorePower(int32 EntryPoint);
	void ClearData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePower_C">();
	}
	static class UWBP_CorePower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePower_C>();
	}
};
static_assert(alignof(UWBP_CorePower_C) == 0x000008, "Wrong alignment on UWBP_CorePower_C");
static_assert(sizeof(UWBP_CorePower_C) == 0x000630, "Wrong size on UWBP_CorePower_C");
static_assert(offsetof(UWBP_CorePower_C, UberGraphFrame) == 0x000358, "Member 'UWBP_CorePower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, Recharge) == 0x000360, "Member 'UWBP_CorePower_C::Recharge' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, RevealIndicator) == 0x000368, "Member 'UWBP_CorePower_C::RevealIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, HighlightPanel) == 0x000370, "Member 'UWBP_CorePower_C::HighlightPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, ImageBG) == 0x000378, "Member 'UWBP_CorePower_C::ImageBG' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, InteractionPrompt) == 0x000380, "Member 'UWBP_CorePower_C::InteractionPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, IsRechargeableImage) == 0x000388, "Member 'UWBP_CorePower_C::IsRechargeableImage' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, LayoutPowerIconScale) == 0x000390, "Member 'UWBP_CorePower_C::LayoutPowerIconScale' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, OPACITYCONTAINER) == 0x000398, "Member 'UWBP_CorePower_C::OPACITYCONTAINER' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, PowerProgressFlash) == 0x0003A0, "Member 'UWBP_CorePower_C::PowerProgressFlash' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, PowerTimerGague) == 0x0003A8, "Member 'UWBP_CorePower_C::PowerTimerGague' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, WhiteBox) == 0x0003B0, "Member 'UWBP_CorePower_C::WhiteBox' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, ActiveColor) == 0x0003B8, "Member 'UWBP_CorePower_C::ActiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, ProgressColor) == 0x0003C8, "Member 'UWBP_CorePower_C::ProgressColor' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, IsIconChanged) == 0x0003D8, "Member 'UWBP_CorePower_C::IsIconChanged' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, Power_View_Data) == 0x0003E0, "Member 'UWBP_CorePower_C::Power_View_Data' has a wrong offset!");
static_assert(offsetof(UWBP_CorePower_C, PowerViewDataCached) == 0x000508, "Member 'UWBP_CorePower_C::PowerViewDataCached' has a wrong offset!");

}

