#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCurrencyProgressionTooltip

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCurrencyProgressionTooltip.WBP_CoreCurrencyProgressionTooltip_C.ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip
// 0x0070 (0x0070 - 0x0000)
struct WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyExpirationLabelViewData       K2Node_MakeStruct_CurrencyExpirationLabelViewData; // 0x0028(0x0020)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CoreCurrencyExpirationLabel_C*     CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_Exp_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip) == 0x000008, "Wrong alignment on WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip");
static_assert(sizeof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip) == 0x000070, "Wrong size on WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, EntryPoint) == 0x000000, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, Temp_int_Variable) == 0x000008, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, K2Node_MakeStruct_CurrencyExpirationLabelViewData) == 0x000028, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::K2Node_MakeStruct_CurrencyExpirationLabelViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000058, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_MultiplyMultiply_FloatFloat_Exp_ImplicitCast) == 0x000060, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_MultiplyMultiply_FloatFloat_Exp_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip, CallFunc_FTrunc_A_ImplicitCast) == 0x000068, "Member 'WBP_CoreCurrencyProgressionTooltip_C_ExecuteUbergraph_WBP_CoreCurrencyProgressionTooltip::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_CoreCurrencyProgressionTooltip.WBP_CoreCurrencyProgressionTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCurrencyProgressionTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCurrencyProgressionTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreCurrencyProgressionTooltip_C_PreConstruct");
static_assert(sizeof(WBP_CoreCurrencyProgressionTooltip_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreCurrencyProgressionTooltip_C_PreConstruct");
static_assert(offsetof(WBP_CoreCurrencyProgressionTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreCurrencyProgressionTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

