#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreLeaningArrowsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreLeaningArrowsWidget.WBP_CoreLeaningArrowsWidget_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_CoreLeaningArrowsWidget_C final : public UCoreLeaningArrowsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              GhostLeft;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              GhostRight;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreArrowButton_C*                 LeftArrow;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreArrowButton_C*                 RightArrow;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetData(const ELeanState& LeanState);
	void ExecuteUbergraph_WBP_CoreLeaningArrowsWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreLeaningArrowsWidget_C">();
	}
	static class UWBP_CoreLeaningArrowsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreLeaningArrowsWidget_C>();
	}
};
static_assert(alignof(UWBP_CoreLeaningArrowsWidget_C) == 0x000008, "Wrong alignment on UWBP_CoreLeaningArrowsWidget_C");
static_assert(sizeof(UWBP_CoreLeaningArrowsWidget_C) == 0x000368, "Wrong size on UWBP_CoreLeaningArrowsWidget_C");
static_assert(offsetof(UWBP_CoreLeaningArrowsWidget_C, UberGraphFrame) == 0x000340, "Member 'UWBP_CoreLeaningArrowsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreLeaningArrowsWidget_C, GhostLeft) == 0x000348, "Member 'UWBP_CoreLeaningArrowsWidget_C::GhostLeft' has a wrong offset!");
static_assert(offsetof(UWBP_CoreLeaningArrowsWidget_C, GhostRight) == 0x000350, "Member 'UWBP_CoreLeaningArrowsWidget_C::GhostRight' has a wrong offset!");
static_assert(offsetof(UWBP_CoreLeaningArrowsWidget_C, LeftArrow) == 0x000358, "Member 'UWBP_CoreLeaningArrowsWidget_C::LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_CoreLeaningArrowsWidget_C, RightArrow) == 0x000360, "Member 'UWBP_CoreLeaningArrowsWidget_C::RightArrow' has a wrong offset!");

}

