#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePlayerLevel.WBP_CorePlayerLevel_C
// 0x0020 (0x04C0 - 0x04A0)
class UWBP_CorePlayerLevel_C final : public UCorePlayerLevelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              LevelBG;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          LevelTB;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          PrestigeTB;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AnimateLevelUp();
	void Destruct();
	void ExecuteUbergraph_WBP_CorePlayerLevel(int32 EntryPoint);
	void OnHovered();
	void OnUnhovered();
	void PreConstruct(bool IsDesignTime);
	void SetData(const struct FPlayerLevelViewData& ViewData);
	void SetDataFromViewData(int32 Value, int32 Value2);
	void SetViewData(const struct FPlayerLevelViewData& PlayerLevelViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePlayerLevel_C">();
	}
	static class UWBP_CorePlayerLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePlayerLevel_C>();
	}
};
static_assert(alignof(UWBP_CorePlayerLevel_C) == 0x000008, "Wrong alignment on UWBP_CorePlayerLevel_C");
static_assert(sizeof(UWBP_CorePlayerLevel_C) == 0x0004C0, "Wrong size on UWBP_CorePlayerLevel_C");
static_assert(offsetof(UWBP_CorePlayerLevel_C, UberGraphFrame) == 0x0004A0, "Member 'UWBP_CorePlayerLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerLevel_C, LevelBG) == 0x0004A8, "Member 'UWBP_CorePlayerLevel_C::LevelBG' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerLevel_C, LevelTB) == 0x0004B0, "Member 'UWBP_CorePlayerLevel_C::LevelTB' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerLevel_C, PrestigeTB) == 0x0004B8, "Member 'UWBP_CorePlayerLevel_C::PrestigeTB' has a wrong offset!");

}

