#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCurrencyExpirationLabel

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCurrencyExpirationLabel.WBP_CoreCurrencyExpirationLabel_C.ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel
// 0x0040 (0x0040 - 0x0000)
struct WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyExpirationLabelViewData       K2Node_Event_viewData;                             // 0x0008(0x0020)(ConstParm)
	class FText                                   CallFunc_GetBeautifiedNumericText_ReturnValue;     // 0x0028(0x0018)()
};
static_assert(alignof(WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel) == 0x000008, "Wrong alignment on WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel");
static_assert(sizeof(WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel) == 0x000040, "Wrong size on WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel");
static_assert(offsetof(WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel, EntryPoint) == 0x000000, "Member 'WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel, K2Node_Event_viewData) == 0x000008, "Member 'WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel::K2Node_Event_viewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel, CallFunc_GetBeautifiedNumericText_ReturnValue) == 0x000028, "Member 'WBP_CoreCurrencyExpirationLabel_C_ExecuteUbergraph_WBP_CoreCurrencyExpirationLabel::CallFunc_GetBeautifiedNumericText_ReturnValue' has a wrong offset!");

// Function WBP_CoreCurrencyExpirationLabel.WBP_CoreCurrencyExpirationLabel_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreCurrencyExpirationLabel_C_SetData final
{
public:
	struct FCurrencyExpirationLabelViewData       ViewData;                                          // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreCurrencyExpirationLabel_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreCurrencyExpirationLabel_C_SetData");
static_assert(sizeof(WBP_CoreCurrencyExpirationLabel_C_SetData) == 0x000020, "Wrong size on WBP_CoreCurrencyExpirationLabel_C_SetData");
static_assert(offsetof(WBP_CoreCurrencyExpirationLabel_C_SetData, ViewData) == 0x000000, "Member 'WBP_CoreCurrencyExpirationLabel_C_SetData::ViewData' has a wrong offset!");

}

