#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePowerBundle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePowerBundle.WBP_CorePowerBundle_C
// 0x0030 (0x03A0 - 0x0370)
class UWBP_CorePowerBundle_C final : public UCorePowerBundleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLongPressEvent;                                  // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        AddonScale;                                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetActiveState(bool IsActive);
	void Set_Dynamic_Power_Data_List(TArray<struct FPowerViewData>& PowerViewDataList, class UHorizontalBox* WidgetContainer);
	void PreConstruct(bool IsDesignTime);
	void OnLongPressEvent__DelegateSignature();
	void HidePowersCarry(bool IsCarrying);
	void ExecuteUbergraph_WBP_CorePowerBundle(int32 EntryPoint);
	void ClearData();
	void SetMainPowerData(const struct FPowerViewData& MainPowerViewData);
	void SetData(const struct FPowerBundleViewData& PowerBundleViewData);
	void SetAddonData(struct FAddonViewData& AddonOneData, struct FAddonViewData& AddonTwoData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePowerBundle_C">();
	}
	static class UWBP_CorePowerBundle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePowerBundle_C>();
	}
};
static_assert(alignof(UWBP_CorePowerBundle_C) == 0x000008, "Wrong alignment on UWBP_CorePowerBundle_C");
static_assert(sizeof(UWBP_CorePowerBundle_C) == 0x0003A0, "Wrong size on UWBP_CorePowerBundle_C");
static_assert(offsetof(UWBP_CorePowerBundle_C, UberGraphFrame) == 0x000370, "Member 'UWBP_CorePowerBundle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePowerBundle_C, FadeOut) == 0x000378, "Member 'UWBP_CorePowerBundle_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_CorePowerBundle_C, VerticalBox_0) == 0x000380, "Member 'UWBP_CorePowerBundle_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_CorePowerBundle_C, OnLongPressEvent) == 0x000388, "Member 'UWBP_CorePowerBundle_C::OnLongPressEvent' has a wrong offset!");
static_assert(offsetof(UWBP_CorePowerBundle_C, AddonScale) == 0x000398, "Member 'UWBP_CorePowerBundle_C::AddonScale' has a wrong offset!");

}

