#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCustomizationReward

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C.ExecuteUbergraph_WBP_CoreCustomizationReward
// 0x0218 (0x0218 - 0x0000)
struct WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationRewardViewData           K2Node_Event_customizationRewardViewData;          // 0x0008(0x0210)(ConstParm)
};
static_assert(alignof(WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward) == 0x000008, "Wrong alignment on WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward");
static_assert(sizeof(WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward) == 0x000218, "Wrong size on WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward");
static_assert(offsetof(WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward, EntryPoint) == 0x000000, "Member 'WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward, K2Node_Event_customizationRewardViewData) == 0x000008, "Member 'WBP_CoreCustomizationReward_C_ExecuteUbergraph_WBP_CoreCustomizationReward::K2Node_Event_customizationRewardViewData' has a wrong offset!");

// Function WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C.SetCustomizationRewardData
// 0x0210 (0x0210 - 0x0000)
struct WBP_CoreCustomizationReward_C_SetCustomizationRewardData final
{
public:
	struct FCustomizationRewardViewData           CustomizationRewardViewData;                       // 0x0000(0x0210)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreCustomizationReward_C_SetCustomizationRewardData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationReward_C_SetCustomizationRewardData");
static_assert(sizeof(WBP_CoreCustomizationReward_C_SetCustomizationRewardData) == 0x000210, "Wrong size on WBP_CoreCustomizationReward_C_SetCustomizationRewardData");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetCustomizationRewardData, CustomizationRewardViewData) == 0x000000, "Member 'WBP_CoreCustomizationReward_C_SetCustomizationRewardData::CustomizationRewardViewData' has a wrong offset!");

// Function WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C.SetKillSwitchOverlay
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCustomizationReward_C_SetKillSwitchOverlay final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationReward_C_SetKillSwitchOverlay) == 0x000001, "Wrong alignment on WBP_CoreCustomizationReward_C_SetKillSwitchOverlay");
static_assert(sizeof(WBP_CoreCustomizationReward_C_SetKillSwitchOverlay) == 0x000001, "Wrong size on WBP_CoreCustomizationReward_C_SetKillSwitchOverlay");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetKillSwitchOverlay, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreCustomizationReward_C_SetKillSwitchOverlay::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C.SetOwnedTag
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCustomizationReward_C_SetOwnedTag final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationReward_C_SetOwnedTag) == 0x000001, "Wrong alignment on WBP_CoreCustomizationReward_C_SetOwnedTag");
static_assert(sizeof(WBP_CoreCustomizationReward_C_SetOwnedTag) == 0x000001, "Wrong size on WBP_CoreCustomizationReward_C_SetOwnedTag");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetOwnedTag, IsOwned) == 0x000000, "Member 'WBP_CoreCustomizationReward_C_SetOwnedTag::IsOwned' has a wrong offset!");

// Function WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C.SetRarity
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreCustomizationReward_C_SetRarity final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIDataManager*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetCustomizationRarityMaterial_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationReward_C_SetRarity) == 0x000008, "Wrong alignment on WBP_CoreCustomizationReward_C_SetRarity");
static_assert(sizeof(WBP_CoreCustomizationReward_C_SetRarity) == 0x000018, "Wrong size on WBP_CoreCustomizationReward_C_SetRarity");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetRarity, Rarity) == 0x000000, "Member 'WBP_CoreCustomizationReward_C_SetRarity::Rarity' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetRarity, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'WBP_CoreCustomizationReward_C_SetRarity::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetRarity, CallFunc_GetCustomizationRarityMaterial_ReturnValue) == 0x000010, "Member 'WBP_CoreCustomizationReward_C_SetRarity::CallFunc_GetCustomizationRarityMaterial_ReturnValue' has a wrong offset!");

// Function WBP_CoreCustomizationReward.WBP_CoreCustomizationReward_C.SetUnbreakableSetTag
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCustomizationReward_C_SetUnbreakableSetTag final
{
public:
	bool                                          IsUnbreakable;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationReward_C_SetUnbreakableSetTag) == 0x000001, "Wrong alignment on WBP_CoreCustomizationReward_C_SetUnbreakableSetTag");
static_assert(sizeof(WBP_CoreCustomizationReward_C_SetUnbreakableSetTag) == 0x000001, "Wrong size on WBP_CoreCustomizationReward_C_SetUnbreakableSetTag");
static_assert(offsetof(WBP_CoreCustomizationReward_C_SetUnbreakableSetTag, IsUnbreakable) == 0x000000, "Member 'WBP_CoreCustomizationReward_C_SetUnbreakableSetTag::IsUnbreakable' has a wrong offset!");

}

