#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K24

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K24.WBP_K24_C
// 0x0020 (0x0358 - 0x0338)
class UWBP_K24_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              Contaminated;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Contaminated_BG;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContaminationGroup;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void SetContaminationData(EPlayerStatus& PlayerStatus, class UK24StatusData* KillerData);
	void ExecuteUbergraph_WBP_K24(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K24_C">();
	}
	static class UWBP_K24_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K24_C>();
	}
};
static_assert(alignof(UWBP_K24_C) == 0x000008, "Wrong alignment on UWBP_K24_C");
static_assert(sizeof(UWBP_K24_C) == 0x000358, "Wrong size on UWBP_K24_C");
static_assert(offsetof(UWBP_K24_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K24_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K24_C, Contaminated) == 0x000340, "Member 'UWBP_K24_C::Contaminated' has a wrong offset!");
static_assert(offsetof(UWBP_K24_C, Contaminated_BG) == 0x000348, "Member 'UWBP_K24_C::Contaminated_BG' has a wrong offset!");
static_assert(offsetof(UWBP_K24_C, ContaminationGroup) == 0x000350, "Member 'UWBP_K24_C::ContaminationGroup' has a wrong offset!");

}

