#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSelectionArrowInputSwitcher

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreSelectionArrowInputSwitcher.WBP_CoreSelectionArrowInputSwitcher_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct");
static_assert(sizeof(WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreSelectionArrowInputSwitcher.WBP_CoreSelectionArrowInputSwitcher_C.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged final
{
public:
	ETextJustify                                  NewAlignment;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged) == 0x000001, "Wrong alignment on WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged");
static_assert(sizeof(WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged) == 0x000001, "Wrong size on WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged, NewAlignment) == 0x000000, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_OnAlignmentChanged::NewAlignment' has a wrong offset!");

// Function WBP_CoreSelectionArrowInputSwitcher.WBP_CoreSelectionArrowInputSwitcher_C.ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher
// 0x0060 (0x0060 - 0x0000)
struct WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Event_newAlignment;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0018(0x0018)()
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher) == 0x000008, "Wrong alignment on WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher");
static_assert(sizeof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher) == 0x000060, "Wrong size on WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, EntryPoint) == 0x000000, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000008, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, K2Node_Event_newAlignment) == 0x000010, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::K2Node_Event_newAlignment' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, K2Node_Event_IsDesignTime) == 0x000012, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, CallFunc_GetEmptyText_ReturnValue) == 0x000018, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x000030, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000038, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher, CallFunc_MakeVector2D_ReturnValue_1) == 0x000050, "Member 'WBP_CoreSelectionArrowInputSwitcher_C_ExecuteUbergraph_WBP_CoreSelectionArrowInputSwitcher::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

}

