#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSortButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreSortButton.WBP_CoreSortButton_C
// 0x0058 (0x04F8 - 0x04A0)
class UWBP_CoreSortButton_C final : public UCoreButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              IconIMG;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PressedColor;                                      // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredColor;                                      // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledColor;                                     // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Background_IMG_Dynamic_Material;                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreSortButton(int32 EntryPoint);
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnHovered();
	void OnPressed();
	void OnReleased();
	void OnUnhovered();
	void SetColors(const struct FLinearColor& BackgroundColor, const struct FLinearColor& IconColor);
	void UpdateVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreSortButton_C">();
	}
	static class UWBP_CoreSortButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreSortButton_C>();
	}
};
static_assert(alignof(UWBP_CoreSortButton_C) == 0x000008, "Wrong alignment on UWBP_CoreSortButton_C");
static_assert(sizeof(UWBP_CoreSortButton_C) == 0x0004F8, "Wrong size on UWBP_CoreSortButton_C");
static_assert(offsetof(UWBP_CoreSortButton_C, UberGraphFrame) == 0x0004A0, "Member 'UWBP_CoreSortButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSortButton_C, IconIMG) == 0x0004A8, "Member 'UWBP_CoreSortButton_C::IconIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSortButton_C, DefaultColor) == 0x0004B0, "Member 'UWBP_CoreSortButton_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSortButton_C, PressedColor) == 0x0004C0, "Member 'UWBP_CoreSortButton_C::PressedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSortButton_C, HoveredColor) == 0x0004D0, "Member 'UWBP_CoreSortButton_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSortButton_C, DisabledColor) == 0x0004E0, "Member 'UWBP_CoreSortButton_C::DisabledColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSortButton_C, Background_IMG_Dynamic_Material) == 0x0004F0, "Member 'UWBP_CoreSortButton_C::Background_IMG_Dynamic_Material' has a wrong offset!");

}

