#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GlobalProcessingIconWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GlobalProcessingIconWidget.WBP_GlobalProcessingIconWidget_C.ExecuteUbergraph_WBP_GlobalProcessingIconWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible_1;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget) == 0x000004, "Wrong alignment on WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget");
static_assert(sizeof(WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget) == 0x000008, "Wrong size on WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget, EntryPoint) == 0x000000, "Member 'WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget, K2Node_Event_isVisible_1) == 0x000004, "Member 'WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget::K2Node_Event_isVisible_1' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget, K2Node_Event_isVisible) == 0x000005, "Member 'WBP_GlobalProcessingIconWidget_C_ExecuteUbergraph_WBP_GlobalProcessingIconWidget::K2Node_Event_isVisible' has a wrong offset!");

// Function WBP_GlobalProcessingIconWidget.WBP_GlobalProcessingIconWidget_C.SetGlobalLoadingIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility) == 0x000001, "Wrong alignment on WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility");
static_assert(sizeof(WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility) == 0x000001, "Wrong size on WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility, Param_IsVisible) == 0x000000, "Member 'WBP_GlobalProcessingIconWidget_C_SetGlobalLoadingIconVisibility::Param_IsVisible' has a wrong offset!");

// Function WBP_GlobalProcessingIconWidget.WBP_GlobalProcessingIconWidget_C.SetGlobalSavingIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility) == 0x000001, "Wrong alignment on WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility");
static_assert(sizeof(WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility) == 0x000001, "Wrong size on WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility, Param_IsVisible) == 0x000000, "Member 'WBP_GlobalProcessingIconWidget_C_SetGlobalSavingIconVisibility::Param_IsVisible' has a wrong offset!");

// Function WBP_GlobalProcessingIconWidget.WBP_GlobalProcessingIconWidget_C.SetProcessingIconVisibility
// 0x0048 (0x0048 - 0x0000)
struct WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility final
{
public:
	class UWidget*                                Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsVisible;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToOpacity_targetValue_ImplicitCast;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Create_duration_ImplicitCast;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Create_delay_ImplicitCast;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility) == 0x000008, "Wrong alignment on WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility");
static_assert(sizeof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility) == 0x000048, "Wrong size on WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, Icon) == 0x000000, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::Icon' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, Param_IsVisible) == 0x000008, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_SelectFloat_ReturnValue_2) == 0x000020, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_ToOpacity_ReturnValue) == 0x000030, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_ToOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_ToOpacity_targetValue_ImplicitCast) == 0x000038, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_ToOpacity_targetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_Create_duration_ImplicitCast) == 0x00003C, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_Create_duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility, CallFunc_Create_delay_ImplicitCast) == 0x000040, "Member 'WBP_GlobalProcessingIconWidget_C_SetProcessingIconVisibility::CallFunc_Create_delay_ImplicitCast' has a wrong offset!");

}

