#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCustomizationTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.DebugPreviewOutfitParts
// 0x0088 (0x0088 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrientation                                  Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DivideWithRemainder_remainder;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DivideWithRemainder_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrientation                                  Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CoreCustomizationReward_C*         K2Node_DynamicCast_AsWBP_Core_Customization_Reward; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts) == 0x000088, "Wrong size on WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, Temp_byte_Variable) == 0x000009, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000A, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, Temp_int_Variable) == 0x00000C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_DivideWithRemainder_remainder) == 0x000014, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_DivideWithRemainder_remainder' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_DivideWithRemainder_ReturnValue) == 0x000018, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_DivideWithRemainder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, K2Node_Select_Default) == 0x00001C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, Temp_byte_Variable_1) == 0x000024, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, K2Node_Select_Default_1) == 0x000028, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, K2Node_DynamicCast_AsWBP_Core_Customization_Reward) == 0x000040, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::K2Node_DynamicCast_AsWBP_Core_Customization_Reward' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x000050, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_RemoveChild_ReturnValue) == 0x00007C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000080, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts, CallFunc_ObjectIsA_ReturnValue) == 0x000084, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewOutfitParts::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.DebugPreviewPriceTags
// 0x0088 (0x0088 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CorePriceTag_C*                    K2Node_DynamicCast_AsWBP_Core_Price_Tag;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags) == 0x000088, "Wrong size on WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, Temp_int_Variable) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, K2Node_DynamicCast_AsWBP_Core_Price_Tag) == 0x000038, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::K2Node_DynamicCast_AsWBP_Core_Price_Tag' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_GetAllChildren_ReturnValue) == 0x000048, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_RemoveChild_ReturnValue) == 0x00006C, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000070, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_ObjectIsA_ReturnValue) == 0x000074, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000078, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000080, "Member 'WBP_CoreCustomizationTooltip_C_DebugPreviewPriceTags::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.ExecuteUbergraph_WBP_CoreCustomizationTooltip
// 0x0140 (0x0140 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationTooltipViewData          K2Node_Event_customizationViewData;                // 0x0008(0x0130)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip) == 0x000140, "Wrong size on WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip, EntryPoint) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip, K2Node_Event_customizationViewData) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip::K2Node_Event_customizationViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip, K2Node_Event_IsDesignTime) == 0x000138, "Member 'WBP_CoreCustomizationTooltip_C_ExecuteUbergraph_WBP_CoreCustomizationTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreCustomizationTooltip_C_PreConstruct");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreCustomizationTooltip_C_PreConstruct");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.Set Status Text Color
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color final
{
public:
	bool                                          Equipped;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Owned;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_Locked;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color) == 0x000001, "Wrong alignment on WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color) == 0x000003, "Wrong size on WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color, Equipped) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color::Equipped' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color, Owned) == 0x000001, "Member 'WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color::Owned' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color, Param_Locked) == 0x000002, "Member 'WBP_CoreCustomizationTooltip_C_Set_Status_Text_Color::Param_Locked' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetCustomizationData
// 0x0130 (0x0130 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetCustomizationData final
{
public:
	struct FCustomizationTooltipViewData          Customization_Tooltip_Data;                        // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetCustomizationData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetCustomizationData");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetCustomizationData) == 0x000130, "Wrong size on WBP_CoreCustomizationTooltip_C_SetCustomizationData");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetCustomizationData, Customization_Tooltip_Data) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetCustomizationData::Customization_Tooltip_Data' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetEventHeader
// 0x0030 (0x0030 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetEventHeader final
{
public:
	class FString                                 EventBannerLabel;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIDataManager*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetTooltipEventHeader_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetEventHeader) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetEventHeader");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetEventHeader) == 0x000030, "Wrong size on WBP_CoreCustomizationTooltip_C_SetEventHeader");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetEventHeader, EventBannerLabel) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetEventHeader::EventBannerLabel' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetEventHeader, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_CoreCustomizationTooltip_C_SetEventHeader::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetEventHeader, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'WBP_CoreCustomizationTooltip_C_SetEventHeader::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetEventHeader, CallFunc_GetTooltipEventHeader_ReturnValue) == 0x000020, "Member 'WBP_CoreCustomizationTooltip_C_SetEventHeader::CallFunc_GetTooltipEventHeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetEventHeader, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_CoreCustomizationTooltip_C_SetEventHeader::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetOriginData
// 0x0070 (0x0070 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetOriginData final
{
public:
	EOriginWidgetState                            OriginState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OriginText;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginWidgetState                            Temp_byte_Variable_2;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetOriginData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetOriginData");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetOriginData) == 0x000070, "Wrong size on WBP_CoreCustomizationTooltip_C_SetOriginData");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, OriginState) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::OriginState' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, OriginText) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::OriginText' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_byte_Variable) == 0x000020, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000022, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_byte_Variable_1) == 0x000023, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_byte_Variable_2) == 0x000025, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_object_Variable) == 0x000028, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_object_Variable_1) == 0x000030, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_object_Variable_2) == 0x000038, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_object_Variable_3) == 0x000040, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_object_Variable_4) == 0x000048, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_object_Variable_5) == 0x000050, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, Temp_bool_Variable) == 0x000058, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, K2Node_Select_Default) == 0x000060, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOriginData, K2Node_Select_Default_1) == 0x000068, "Member 'WBP_CoreCustomizationTooltip_C_SetOriginData::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetOutfitPartsData
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetOutfitPartsData final
{
public:
	bool                                          HasOutfitParts;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnbreakable;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationRewardOutfitPartsViewData* OutfitPartsViewData;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetOutfitPartsData");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData) == 0x000018, "Wrong size on WBP_CoreCustomizationTooltip_C_SetOutfitPartsData");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData, HasOutfitParts) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetOutfitPartsData::HasOutfitParts' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData, IsUnbreakable) == 0x000001, "Member 'WBP_CoreCustomizationTooltip_C_SetOutfitPartsData::IsUnbreakable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData, OutfitPartsViewData) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_SetOutfitPartsData::OutfitPartsViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CoreCustomizationTooltip_C_SetOutfitPartsData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetOutfitPartsData, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'WBP_CoreCustomizationTooltip_C_SetOutfitPartsData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetParentOutfitData
// 0x0040 (0x0040 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetParentOutfitData final
{
public:
	bool                                          IsOutfitPart;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnbreakable;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutfitInfoText;                                    // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetParentOutfitData");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData) == 0x000040, "Wrong size on WBP_CoreCustomizationTooltip_C_SetParentOutfitData");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, IsOutfitPart) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::IsOutfitPart' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, IsUnbreakable) == 0x000001, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::IsUnbreakable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, OutfitInfoText) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::OutfitInfoText' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, Temp_object_Variable) == 0x000020, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, Temp_object_Variable_1) == 0x000028, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, Temp_bool_Variable) == 0x000030, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetParentOutfitData, K2Node_Select_Default) == 0x000038, "Member 'WBP_CoreCustomizationTooltip_C_SetParentOutfitData::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetPriceData
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetPriceData final
{
public:
	bool                                          IsBuyable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOutfitPart;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnbreakable;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPriceTagViewData>              Prices;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPriceTagViewData                      CallFunc_Array_Get_Item;                           // 0x0040(0x0050)()
	class UCorePriceTagWidget*                    CallFunc_CreatePriceTagWidget_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetPriceData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetPriceData");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetPriceData) == 0x0000B8, "Wrong size on WBP_CoreCustomizationTooltip_C_SetPriceData");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, IsBuyable) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::IsBuyable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, IsOutfitPart) == 0x000001, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::IsOutfitPart' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, IsUnbreakable) == 0x000002, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::IsUnbreakable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, Prices) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::Prices' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_BooleanNAND_ReturnValue) == 0x000034, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_Greater_IntInt_ReturnValue) == 0x000035, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_BooleanAND_ReturnValue_1) == 0x000037, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_CreatePriceTagWidget_ReturnValue) == 0x000090, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_CreatePriceTagWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0000A8, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetPriceData, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x0000B0, "Member 'WBP_CoreCustomizationTooltip_C_SetPriceData::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetRarity
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetRarity final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIDataManager*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetTooltipRarityMaterial_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetRarity) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetRarity");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetRarity) == 0x000020, "Wrong size on WBP_CoreCustomizationTooltip_C_SetRarity");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetRarity, Rarity) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetRarity::Rarity' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetRarity, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_SetRarity::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetRarity, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_CoreCustomizationTooltip_C_SetRarity::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetRarity, CallFunc_GetTooltipRarityMaterial_ReturnValue) == 0x000018, "Member 'WBP_CoreCustomizationTooltip_C_SetRarity::CallFunc_GetTooltipRarityMaterial_ReturnValue' has a wrong offset!");

// Function WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C.SetRoleData
// 0x0058 (0x0058 - 0x0000)
struct WBP_CoreCustomizationTooltip_C_SetRoleData final
{
public:
	EPlayerRole                                   Role;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RoleCategory;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlayerRole                                   Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationTooltip_C_SetRoleData) == 0x000008, "Wrong alignment on WBP_CoreCustomizationTooltip_C_SetRoleData");
static_assert(sizeof(WBP_CoreCustomizationTooltip_C_SetRoleData) == 0x000058, "Wrong size on WBP_CoreCustomizationTooltip_C_SetRoleData");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetRoleData, Role) == 0x000000, "Member 'WBP_CoreCustomizationTooltip_C_SetRoleData::Role' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationTooltip_C_SetRoleData, RoleCategory) == 0x000008, "Member 'WBP_CoreCustomizationTooltip_C_SetRoleData::RoleCategory' has a wrong offset!");
