#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSortingWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature");
static_assert(sizeof(WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature) == 0x000008, "Wrong size on WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature");
static_assert(offsetof(WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature, buttonTarget) == 0x000000, "Member 'WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_2_OnHoveredDelegate__DelegateSignature::buttonTarget' has a wrong offset!");

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature");
static_assert(sizeof(WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature) == 0x000008, "Wrong size on WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature");
static_assert(offsetof(WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature, buttonTarget) == 0x000000, "Member 'WBP_CoreSortingWidget_C_BndEvt__WBP_CoreSortingWidget_SortingOptionButton_K2Node_ComponentBoundEvent_3_OnUnhoveredDelegate__DelegateSignature::buttonTarget' has a wrong offset!");

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.ExecuteUbergraph_WBP_CoreSortingWidget
// 0x0090 (0x0090 - 0x0000)
struct WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortingOrder                                 K2Node_Event_sortingOrder;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonWidgetVisibility                       Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonWidgetVisibility                       Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDBDTooltipManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESortingOrder                                 CallFunc_ToggleSortingOrder_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreButtonWidget*                      K2Node_Event_buttonTarget;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_showSortingOrderButton;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonWidgetVisibility                       K2Node_Select_Default_1;                           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreButtonWidget*                      K2Node_ComponentBoundEvent_buttonTarget_1;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0038(0x0018)()
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0050(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class UCoreButtonWidget*                      K2Node_ComponentBoundEvent_buttonTarget;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget) == 0x000008, "Wrong alignment on WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget");
static_assert(sizeof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget) == 0x000090, "Wrong size on WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, EntryPoint) == 0x000000, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_Event_sortingOrder) == 0x000004, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_Event_sortingOrder' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, Temp_byte_Variable) == 0x000005, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, Temp_bool_Variable) == 0x000007, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, CallFunc_ToggleSortingOrder_ReturnValue) == 0x000018, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::CallFunc_ToggleSortingOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_Event_buttonTarget) == 0x000020, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_Event_buttonTarget' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_Event_showSortingOrderButton) == 0x000028, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_Event_showSortingOrderButton' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, Temp_bool_Variable_1) == 0x000029, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_Select_Default) == 0x00002A, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_Select_Default_1) == 0x00002B, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_ComponentBoundEvent_buttonTarget_1) == 0x000030, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_ComponentBoundEvent_buttonTarget_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, CallFunc_TextToUpper_ReturnValue) == 0x000038, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000050, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget, K2Node_ComponentBoundEvent_buttonTarget) == 0x000088, "Member 'WBP_CoreSortingWidget_C_ExecuteUbergraph_WBP_CoreSortingWidget::K2Node_ComponentBoundEvent_buttonTarget' has a wrong offset!");

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.OnSortingOrderClick
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreSortingWidget_C_OnSortingOrderClick final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_OnSortingOrderClick) == 0x000008, "Wrong alignment on WBP_CoreSortingWidget_C_OnSortingOrderClick");
static_assert(sizeof(WBP_CoreSortingWidget_C_OnSortingOrderClick) == 0x000008, "Wrong size on WBP_CoreSortingWidget_C_OnSortingOrderClick");
static_assert(offsetof(WBP_CoreSortingWidget_C_OnSortingOrderClick, buttonTarget) == 0x000000, "Member 'WBP_CoreSortingWidget_C_OnSortingOrderClick::buttonTarget' has a wrong offset!");

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.SetSortingOrderButtonVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility final
{
public:
	bool                                          ShowSortingOrderButton;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility) == 0x000001, "Wrong alignment on WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility");
static_assert(sizeof(WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility) == 0x000001, "Wrong size on WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility");
static_assert(offsetof(WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility, ShowSortingOrderButton) == 0x000000, "Member 'WBP_CoreSortingWidget_C_SetSortingOrderButtonVisibility::ShowSortingOrderButton' has a wrong offset!");

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.UpdateSortingOrderButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSortingWidget_C_UpdateSortingOrderButton final
{
public:
	ESortingOrder                                 SortingOrder;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_UpdateSortingOrderButton) == 0x000001, "Wrong alignment on WBP_CoreSortingWidget_C_UpdateSortingOrderButton");
static_assert(sizeof(WBP_CoreSortingWidget_C_UpdateSortingOrderButton) == 0x000001, "Wrong size on WBP_CoreSortingWidget_C_UpdateSortingOrderButton");
static_assert(offsetof(WBP_CoreSortingWidget_C_UpdateSortingOrderButton, SortingOrder) == 0x000000, "Member 'WBP_CoreSortingWidget_C_UpdateSortingOrderButton::SortingOrder' has a wrong offset!");

// Function WBP_CoreSortingWidget.WBP_CoreSortingWidget_C.UpdateSortingOrderButtonIcon
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon final
{
public:
	ESortingOrder                                 NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortingOrder                                 Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0008(0x0038)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0040(0x0038)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0078(0x0038)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon) == 0x000008, "Wrong alignment on WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon");
static_assert(sizeof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon) == 0x0000B0, "Wrong size on WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon");
static_assert(offsetof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon, NewParam) == 0x000000, "Member 'WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon, Temp_byte_Variable) == 0x000001, "Member 'WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon, Temp_softobject_Variable) == 0x000008, "Member 'WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon, Temp_softobject_Variable_1) == 0x000040, "Member 'WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon, K2Node_Select_Default) == 0x000078, "Member 'WBP_CoreSortingWidget_C_UpdateSortingOrderButtonIcon::K2Node_Select_Default' has a wrong offset!");

}

