#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K28

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DataTableUtilities_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K28.WBP_K28_C
// 0x0090 (0x03C8 - 0x0338)
class UWBP_K28_C final : public UCorePlayerStatusKillerEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Transition_NightToDay;                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Transition_DayToNight;                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Transition_Flash;                                  // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Timer_Pulse;                                       // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Timer_FadeOut;                                     // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuildUp_Pulse;                                     // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuildUp_PulseIntro;                                // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              BuildUp;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Flash;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Timer;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDBDTunableRowHandle                   NightTimeThresholdValue;                           // 0x0390(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsThresholdReached;                                // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPlayFadeAnim;                                   // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UK28StatusData*                         CacheData;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetWarningThreshold(double ProgressPercentage, bool TransitionToNighttimeChanged, bool TransitionToDaytimeChanged, bool IsDaytime, bool IsNighttime);
	void SetNightTimerProgress(bool IsNighttime, double NightCycleProgress);
	void SetNightBuildUpProgress(bool IsDaytime, double DayCycleProgress);
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void SetKiller(class UK28StatusData* StatusData, bool TransitionToNighttimeChanged, bool TransitionToDaytimeChanged);
	void SetK28Data(class UK28StatusData* K28_Status_Data, bool IsLocalKiller);
	void Set_Survivor(class UK28StatusData* StatusData, bool TransitionToNighttimeChanged, bool TransitionToDaytimeChanged);
	void ResetTimer();
	void ResetMaterials();
	void ResetBuildUp();
	void Play_Timer_Warning();
	void Play_Build_Up_Warning();
	void Finished_B8FAF99D481E4E5F354A45B22800170E();
	void Finished_5749240F4E36D543BC12B4A879D32A09();
	void ExecuteUbergraph_WBP_K28(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K28_C">();
	}
	static class UWBP_K28_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K28_C>();
	}
};
static_assert(alignof(UWBP_K28_C) == 0x000008, "Wrong alignment on UWBP_K28_C");
static_assert(sizeof(UWBP_K28_C) == 0x0003C8, "Wrong size on UWBP_K28_C");
static_assert(offsetof(UWBP_K28_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K28_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Transition_NightToDay) == 0x000340, "Member 'UWBP_K28_C::Transition_NightToDay' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Transition_DayToNight) == 0x000348, "Member 'UWBP_K28_C::Transition_DayToNight' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Transition_Flash) == 0x000350, "Member 'UWBP_K28_C::Transition_Flash' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Timer_Pulse) == 0x000358, "Member 'UWBP_K28_C::Timer_Pulse' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Timer_FadeOut) == 0x000360, "Member 'UWBP_K28_C::Timer_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, BuildUp_Pulse) == 0x000368, "Member 'UWBP_K28_C::BuildUp_Pulse' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, BuildUp_PulseIntro) == 0x000370, "Member 'UWBP_K28_C::BuildUp_PulseIntro' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, BuildUp) == 0x000378, "Member 'UWBP_K28_C::BuildUp' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Flash) == 0x000380, "Member 'UWBP_K28_C::Flash' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, Timer) == 0x000388, "Member 'UWBP_K28_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, NightTimeThresholdValue) == 0x000390, "Member 'UWBP_K28_C::NightTimeThresholdValue' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, IsThresholdReached) == 0x0003B8, "Member 'UWBP_K28_C::IsThresholdReached' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, CanPlayFadeAnim) == 0x0003B9, "Member 'UWBP_K28_C::CanPlayFadeAnim' has a wrong offset!");
static_assert(offsetof(UWBP_K28_C, CacheData) == 0x0003C0, "Member 'UWBP_K28_C::CacheData' has a wrong offset!");

}

