#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStatusEffects_Item

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.UpdatePercentageFill
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_UpdatePercentageFill final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_UpdatePercentageFill) == 0x000004, "Wrong alignment on WBP_CoreStatusEffects_Item_C_UpdatePercentageFill");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_UpdatePercentageFill) == 0x000004, "Wrong size on WBP_CoreStatusEffects_Item_C_UpdatePercentageFill");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_UpdatePercentageFill, Percentage) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_UpdatePercentageFill::Percentage' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.SetWidget
// 0x0100 (0x0100 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_SetWidget final
{
public:
	struct FStatusEffectViewData                  NewLocalVar_0;                                     // 0x0000(0x0058)(Edit, BlueprintVisible)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectViewData                  CallFunc_GetStatusEffectData_ReturnValue;          // 0x0070(0x0058)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_Map_Find_Value;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_Map_Find_Value_1;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_SetWidget) == 0x000008, "Wrong alignment on WBP_CoreStatusEffects_Item_C_SetWidget");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_SetWidget) == 0x000100, "Wrong size on WBP_CoreStatusEffects_Item_C_SetWidget");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, NewLocalVar_0) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_NotEqual_NameName_ReturnValue) == 0x000068, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000069, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_GetStatusEffectData_ReturnValue) == 0x000070, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_GetStatusEffectData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C8, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C9, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0000CA, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Map_Find_Value) == 0x0000CC, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Map_Find_Value_1) == 0x0000D4, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Map_Find_ReturnValue_1) == 0x0000D8, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x0000DC, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetWidget, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x0000EC, "Member 'WBP_CoreStatusEffects_Item_C_SetWidget::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.SetGaugeFill
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_SetGaugeFill final
{
public:
	class UImage*                                 GaugeImage;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Percentf;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_SetGaugeFill) == 0x000008, "Wrong alignment on WBP_CoreStatusEffects_Item_C_SetGaugeFill");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_SetGaugeFill) == 0x000020, "Wrong size on WBP_CoreStatusEffects_Item_C_SetGaugeFill");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetGaugeFill, GaugeImage) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_SetGaugeFill::GaugeImage' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetGaugeFill, Percentf) == 0x000008, "Member 'WBP_CoreStatusEffects_Item_C_SetGaugeFill::Percentf' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetGaugeFill, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_CoreStatusEffects_Item_C_SetGaugeFill::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_SetGaugeFill, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_CoreStatusEffects_Item_C_SetGaugeFill::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreStatusEffects_Item_C_PreConstruct");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreStatusEffects_Item_C_PreConstruct");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_CoreStatusEffects_Item_C_OnListItemObjectSet");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_CoreStatusEffects_Item_C_OnListItemObjectSet");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.ExecuteUbergraph_WBP_CoreStatusEffects_Item
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_percentage;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetGaugeFill_percentf_ImplicitCast;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item) == 0x000008, "Wrong alignment on WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item) == 0x000028, "Wrong size on WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, EntryPoint) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, K2Node_Event_percentage) == 0x000014, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::K2Node_Event_percentage' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item, CallFunc_SetGaugeFill_percentf_ImplicitCast) == 0x000020, "Member 'WBP_CoreStatusEffects_Item_C_ExecuteUbergraph_WBP_CoreStatusEffects_Item::CallFunc_SetGaugeFill_percentf_ImplicitCast' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_CoreStatusEffects_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

}

