#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomizationItemGridContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CustomizationItemGridContainer.WBP_CustomizationItemGridContainer_C
// 0x0040 (0x0420 - 0x03E0)
class UWBP_CustomizationItemGridContainer_C final : public UCustomizationItemGridContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EHorizontalAlignment                          GridItemAlignment;                                 // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowScrollBarForDebug;                            // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x2];                                      // 0x03EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            ScrollBarColor;                                    // 0x03EC(0x0014)(Edit, BlueprintVisible)
	EHorizontalAlignment                          ScrollbarAlignment;                                // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberTile;                                        // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberColumn;                                      // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberEmptyTiles;                                  // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                SlotPading;                                        // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_CustomizationItemGridContainer(int32 EntryPoint);
	void HandleAnalogInputEvent(const struct FAnalogInputEvent& InAnalogInputEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CustomizationItemGridContainer_C">();
	}
	static class UWBP_CustomizationItemGridContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CustomizationItemGridContainer_C>();
	}
};
static_assert(alignof(UWBP_CustomizationItemGridContainer_C) == 0x000008, "Wrong alignment on UWBP_CustomizationItemGridContainer_C");
static_assert(sizeof(UWBP_CustomizationItemGridContainer_C) == 0x000420, "Wrong size on UWBP_CustomizationItemGridContainer_C");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, UberGraphFrame) == 0x0003E0, "Member 'UWBP_CustomizationItemGridContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, GridItemAlignment) == 0x0003E8, "Member 'UWBP_CustomizationItemGridContainer_C::GridItemAlignment' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, bShowScrollBarForDebug) == 0x0003E9, "Member 'UWBP_CustomizationItemGridContainer_C::bShowScrollBarForDebug' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, ScrollBarColor) == 0x0003EC, "Member 'UWBP_CustomizationItemGridContainer_C::ScrollBarColor' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, ScrollbarAlignment) == 0x000400, "Member 'UWBP_CustomizationItemGridContainer_C::ScrollbarAlignment' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, NumberTile) == 0x000404, "Member 'UWBP_CustomizationItemGridContainer_C::NumberTile' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, NumberColumn) == 0x000408, "Member 'UWBP_CustomizationItemGridContainer_C::NumberColumn' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, NumberEmptyTiles) == 0x00040C, "Member 'UWBP_CustomizationItemGridContainer_C::NumberEmptyTiles' has a wrong offset!");
static_assert(offsetof(UWBP_CustomizationItemGridContainer_C, SlotPading) == 0x000410, "Member 'UWBP_CustomizationItemGridContainer_C::SlotPading' has a wrong offset!");

}

