#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K28

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_K28.WBP_K28_C.SetWarningThreshold
// 0x0020 (0x0020 - 0x0000)
struct WBP_K28_C_SetWarningThreshold final
{
public:
	double                                        ProgressPercentage;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionToNighttimeChanged;                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionToDaytimeChanged;                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDaytime;                                         // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNighttime;                                       // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTunableRowHandleValue_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GreaterEqual_FloatFloat_A_ImplicitCast;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_SetWarningThreshold) == 0x000008, "Wrong alignment on WBP_K28_C_SetWarningThreshold");
static_assert(sizeof(WBP_K28_C_SetWarningThreshold) == 0x000020, "Wrong size on WBP_K28_C_SetWarningThreshold");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, ProgressPercentage) == 0x000000, "Member 'WBP_K28_C_SetWarningThreshold::ProgressPercentage' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, TransitionToNighttimeChanged) == 0x000008, "Member 'WBP_K28_C_SetWarningThreshold::TransitionToNighttimeChanged' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, TransitionToDaytimeChanged) == 0x000009, "Member 'WBP_K28_C_SetWarningThreshold::TransitionToDaytimeChanged' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, IsDaytime) == 0x00000A, "Member 'WBP_K28_C_SetWarningThreshold::IsDaytime' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, IsNighttime) == 0x00000B, "Member 'WBP_K28_C_SetWarningThreshold::IsNighttime' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'WBP_K28_C_SetWarningThreshold::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00000D, "Member 'WBP_K28_C_SetWarningThreshold::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, CallFunc_GetTunableRowHandleValue_ReturnValue) == 0x000010, "Member 'WBP_K28_C_SetWarningThreshold::CallFunc_GetTunableRowHandleValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_K28_C_SetWarningThreshold::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'WBP_K28_C_SetWarningThreshold::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetWarningThreshold, CallFunc_GreaterEqual_FloatFloat_A_ImplicitCast) == 0x000018, "Member 'WBP_K28_C_SetWarningThreshold::CallFunc_GreaterEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.SetNightTimerProgress
// 0x0028 (0x0028 - 0x0000)
struct WBP_K28_C_SetNightTimerProgress final
{
public:
	bool                                          IsNighttime;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NightCycleProgress;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_SetNightTimerProgress) == 0x000008, "Wrong alignment on WBP_K28_C_SetNightTimerProgress");
static_assert(sizeof(WBP_K28_C_SetNightTimerProgress) == 0x000028, "Wrong size on WBP_K28_C_SetNightTimerProgress");
static_assert(offsetof(WBP_K28_C_SetNightTimerProgress, IsNighttime) == 0x000000, "Member 'WBP_K28_C_SetNightTimerProgress::IsNighttime' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightTimerProgress, NightCycleProgress) == 0x000008, "Member 'WBP_K28_C_SetNightTimerProgress::NightCycleProgress' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightTimerProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_K28_C_SetNightTimerProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightTimerProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_K28_C_SetNightTimerProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightTimerProgress, CallFunc_Subtract_FloatFloat_B_ImplicitCast) == 0x000020, "Member 'WBP_K28_C_SetNightTimerProgress::CallFunc_Subtract_FloatFloat_B_ImplicitCast' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.SetNightBuildUpProgress
// 0x0020 (0x0020 - 0x0000)
struct WBP_K28_C_SetNightBuildUpProgress final
{
public:
	bool                                          IsDaytime;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DayCycleProgress;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_SetNightBuildUpProgress) == 0x000008, "Wrong alignment on WBP_K28_C_SetNightBuildUpProgress");
static_assert(sizeof(WBP_K28_C_SetNightBuildUpProgress) == 0x000020, "Wrong size on WBP_K28_C_SetNightBuildUpProgress");
static_assert(offsetof(WBP_K28_C_SetNightBuildUpProgress, IsDaytime) == 0x000000, "Member 'WBP_K28_C_SetNightBuildUpProgress::IsDaytime' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightBuildUpProgress, DayCycleProgress) == 0x000008, "Member 'WBP_K28_C_SetNightBuildUpProgress::DayCycleProgress' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightBuildUpProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_K28_C_SetNightBuildUpProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetNightBuildUpProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_K28_C_SetNightBuildUpProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.SetKillerData
// 0x0098 (0x0098 - 0x0000)
struct WBP_K28_C_SetKillerData final
{
public:
	struct FPlayerStatusViewData                  Data;                                              // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_K28_C_SetKillerData) == 0x000008, "Wrong alignment on WBP_K28_C_SetKillerData");
static_assert(sizeof(WBP_K28_C_SetKillerData) == 0x000098, "Wrong size on WBP_K28_C_SetKillerData");
static_assert(offsetof(WBP_K28_C_SetKillerData, Data) == 0x000000, "Member 'WBP_K28_C_SetKillerData::Data' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.SetKiller
// 0x0040 (0x0040 - 0x0000)
struct WBP_K28_C_SetKiller final
{
public:
	class UK28StatusData*                         StatusData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionToNighttimeChanged;                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionToDaytimeChanged;                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetNightBuildUpProgress_DayCycleProgress_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetNightTimerProgress_NightCycleProgress_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetWarningThreshold_ProgressPercentage_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_SetKiller) == 0x000008, "Wrong alignment on WBP_K28_C_SetKiller");
static_assert(sizeof(WBP_K28_C_SetKiller) == 0x000040, "Wrong size on WBP_K28_C_SetKiller");
static_assert(offsetof(WBP_K28_C_SetKiller, StatusData) == 0x000000, "Member 'WBP_K28_C_SetKiller::StatusData' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, TransitionToNighttimeChanged) == 0x000008, "Member 'WBP_K28_C_SetKiller::TransitionToNighttimeChanged' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, TransitionToDaytimeChanged) == 0x000009, "Member 'WBP_K28_C_SetKiller::TransitionToDaytimeChanged' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_K28_C_SetKiller::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'WBP_K28_C_SetKiller::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'WBP_K28_C_SetKiller::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_BooleanAND_ReturnValue_1) == 0x000021, "Member 'WBP_K28_C_SetKiller::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'WBP_K28_C_SetKiller::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_SetNightBuildUpProgress_DayCycleProgress_ImplicitCast) == 0x000028, "Member 'WBP_K28_C_SetKiller::CallFunc_SetNightBuildUpProgress_DayCycleProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_SetNightTimerProgress_NightCycleProgress_ImplicitCast) == 0x000030, "Member 'WBP_K28_C_SetKiller::CallFunc_SetNightTimerProgress_NightCycleProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetKiller, CallFunc_SetWarningThreshold_ProgressPercentage_ImplicitCast) == 0x000038, "Member 'WBP_K28_C_SetKiller::CallFunc_SetWarningThreshold_ProgressPercentage_ImplicitCast' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.SetK28Data
// 0x0010 (0x0010 - 0x0000)
struct WBP_K28_C_SetK28Data final
{
public:
	class UK28StatusData*                         K28_Status_Data;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalKiller;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_SetK28Data) == 0x000008, "Wrong alignment on WBP_K28_C_SetK28Data");
static_assert(sizeof(WBP_K28_C_SetK28Data) == 0x000010, "Wrong size on WBP_K28_C_SetK28Data");
static_assert(offsetof(WBP_K28_C_SetK28Data, K28_Status_Data) == 0x000000, "Member 'WBP_K28_C_SetK28Data::K28_Status_Data' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetK28Data, IsLocalKiller) == 0x000008, "Member 'WBP_K28_C_SetK28Data::IsLocalKiller' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetK28Data, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000009, "Member 'WBP_K28_C_SetK28Data::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_SetK28Data, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x00000A, "Member 'WBP_K28_C_SetK28Data::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.Set Survivor
// 0x0030 (0x0030 - 0x0000)
struct WBP_K28_C_Set_Survivor final
{
public:
	class UK28StatusData*                         StatusData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionToNighttimeChanged;                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionToDaytimeChanged;                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetNightTimerProgress_NightCycleProgress_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetWarningThreshold_ProgressPercentage_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_Set_Survivor) == 0x000008, "Wrong alignment on WBP_K28_C_Set_Survivor");
static_assert(sizeof(WBP_K28_C_Set_Survivor) == 0x000030, "Wrong size on WBP_K28_C_Set_Survivor");
static_assert(offsetof(WBP_K28_C_Set_Survivor, StatusData) == 0x000000, "Member 'WBP_K28_C_Set_Survivor::StatusData' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, TransitionToNighttimeChanged) == 0x000008, "Member 'WBP_K28_C_Set_Survivor::TransitionToNighttimeChanged' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, TransitionToDaytimeChanged) == 0x000009, "Member 'WBP_K28_C_Set_Survivor::TransitionToDaytimeChanged' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WBP_K28_C_Set_Survivor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'WBP_K28_C_Set_Survivor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_K28_C_Set_Survivor::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_BooleanAND_ReturnValue_1) == 0x000018, "Member 'WBP_K28_C_Set_Survivor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_BooleanOR_ReturnValue_1) == 0x000019, "Member 'WBP_K28_C_Set_Survivor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_SetNightTimerProgress_NightCycleProgress_ImplicitCast) == 0x000020, "Member 'WBP_K28_C_Set_Survivor::CallFunc_SetNightTimerProgress_NightCycleProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_Set_Survivor, CallFunc_SetWarningThreshold_ProgressPercentage_ImplicitCast) == 0x000028, "Member 'WBP_K28_C_Set_Survivor::CallFunc_SetWarningThreshold_ProgressPercentage_ImplicitCast' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.ResetTimer
// 0x0008 (0x0008 - 0x0000)
struct WBP_K28_C_ResetTimer final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_ResetTimer) == 0x000008, "Wrong alignment on WBP_K28_C_ResetTimer");
static_assert(sizeof(WBP_K28_C_ResetTimer) == 0x000008, "Wrong size on WBP_K28_C_ResetTimer");
static_assert(offsetof(WBP_K28_C_ResetTimer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_K28_C_ResetTimer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.ResetMaterials
// 0x0010 (0x0010 - 0x0000)
struct WBP_K28_C_ResetMaterials final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_ResetMaterials) == 0x000008, "Wrong alignment on WBP_K28_C_ResetMaterials");
static_assert(sizeof(WBP_K28_C_ResetMaterials) == 0x000010, "Wrong size on WBP_K28_C_ResetMaterials");
static_assert(offsetof(WBP_K28_C_ResetMaterials, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_K28_C_ResetMaterials::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_ResetMaterials, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'WBP_K28_C_ResetMaterials::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.ResetBuildUp
// 0x0008 (0x0008 - 0x0000)
struct WBP_K28_C_ResetBuildUp final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_ResetBuildUp) == 0x000008, "Wrong alignment on WBP_K28_C_ResetBuildUp");
static_assert(sizeof(WBP_K28_C_ResetBuildUp) == 0x000008, "Wrong size on WBP_K28_C_ResetBuildUp");
static_assert(offsetof(WBP_K28_C_ResetBuildUp, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_K28_C_ResetBuildUp::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_K28.WBP_K28_C.ExecuteUbergraph_WBP_K28
// 0x0118 (0x0118 - 0x0000)
struct WBP_K28_C_ExecuteUbergraph_WBP_K28 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerStatusViewData                  K2Node_Event_data;                                 // 0x0068(0x0098)(ConstParm)
	class UK28StatusData*                         K2Node_DynamicCast_AsK28Status_Data;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UK28StatusData*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K28_C_ExecuteUbergraph_WBP_K28) == 0x000008, "Wrong alignment on WBP_K28_C_ExecuteUbergraph_WBP_K28");
static_assert(sizeof(WBP_K28_C_ExecuteUbergraph_WBP_K28) == 0x000118, "Wrong size on WBP_K28_C_ExecuteUbergraph_WBP_K28");
static_assert(offsetof(WBP_K28_C_ExecuteUbergraph_WBP_K28, EntryPoint) == 0x000000, "Member 'WBP_K28_C_ExecuteUbergraph_WBP_K28::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_ExecuteUbergraph_WBP_K28, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_K28_C_ExecuteUbergraph_WBP_K28::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_K28_C_ExecuteUbergraph_WBP_K28, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_K28_C_ExecuteUbergraph_WBP_K28::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
