#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSubtitles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreSubtitles.WBP_CoreSubtitles_C
// 0x0020 (0x0350 - 0x0330)
class UWBP_CoreSubtitles_C final : public UCoreSubtitlesWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAspectRatioBox*                        AspectRatio;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              SubtitlesBG;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SubtitlesContainer;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreSubtitles(int32 EntryPoint);
	void SetBackgroundOpacity(ESubtitlesBackgroundOpacity backgroundOpacity);
	void SetConstrainAspectRatioChanged(bool IsConstrained, float Param_AspectRatio);
	void SetFontSize(int32 Size);
	void SetPositionByAnchor(const struct FVector2D& Position);
	void SetSubtitlesBackgroundOpacity(ESubtitlesBackgroundOpacity Opacity);
	void SetSubtitlesPosition(ESubtitlesPosition Position);
	void SetSubtitlesSize(ESubtitlesSize Size);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreSubtitles_C">();
	}
	static class UWBP_CoreSubtitles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreSubtitles_C>();
	}
};
static_assert(alignof(UWBP_CoreSubtitles_C) == 0x000008, "Wrong alignment on UWBP_CoreSubtitles_C");
static_assert(sizeof(UWBP_CoreSubtitles_C) == 0x000350, "Wrong size on UWBP_CoreSubtitles_C");
static_assert(offsetof(UWBP_CoreSubtitles_C, UberGraphFrame) == 0x000330, "Member 'UWBP_CoreSubtitles_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSubtitles_C, AspectRatio) == 0x000338, "Member 'UWBP_CoreSubtitles_C::AspectRatio' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSubtitles_C, SubtitlesBG) == 0x000340, "Member 'UWBP_CoreSubtitles_C::SubtitlesBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreSubtitles_C, SubtitlesContainer) == 0x000348, "Member 'UWBP_CoreSubtitles_C::SubtitlesContainer' has a wrong offset!");

}

