#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerCardContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePlayerCardContainer.WBP_CorePlayerCardContainer_C
// 0x0098 (0x03D0 - 0x0338)
class UWBP_CorePlayerCardContainer_C final : public UCorePlayerCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDButton*                             OnHoverZone;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                WBPAnimation;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                IconTexture;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              BadgeTexture;                                      // 0x0358(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ECustomizationCategory                        Category;                                          // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              bannerTexture;                                     // 0x0398(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CorePlayerCardContainer_HitzoneButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_CorePlayerCardContainer(int32 EntryPoint);
	void InitAnimation(class UClass* WidgetAnimation);
	void InitIcon(TSoftObjectPtr<class UTexture2D> Param_Icon);
	void PreConstruct(bool IsDesignTime);
	void SetAnimation(class UClass* WidgetAnimation, class UUserWidget** WidgetObj);
	void SetAnimationPlay(bool IsPlaying);
	void SetIcon(TSoftObjectPtr<class UTexture2D> Texture2D);
	void SetOpacity(double Opacity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePlayerCardContainer_C">();
	}
	static class UWBP_CorePlayerCardContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePlayerCardContainer_C>();
	}
};
static_assert(alignof(UWBP_CorePlayerCardContainer_C) == 0x000008, "Wrong alignment on UWBP_CorePlayerCardContainer_C");
static_assert(sizeof(UWBP_CorePlayerCardContainer_C) == 0x0003D0, "Wrong size on UWBP_CorePlayerCardContainer_C");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, UberGraphFrame) == 0x000338, "Member 'UWBP_CorePlayerCardContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, OnHoverZone) == 0x000340, "Member 'UWBP_CorePlayerCardContainer_C::OnHoverZone' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, WBPAnimation) == 0x000348, "Member 'UWBP_CorePlayerCardContainer_C::WBPAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, IconTexture) == 0x000350, "Member 'UWBP_CorePlayerCardContainer_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, BadgeTexture) == 0x000358, "Member 'UWBP_CorePlayerCardContainer_C::BadgeTexture' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, Category) == 0x000390, "Member 'UWBP_CorePlayerCardContainer_C::Category' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardContainer_C, bannerTexture) == 0x000398, "Member 'UWBP_CorePlayerCardContainer_C::bannerTexture' has a wrong offset!");

}

