#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K32BinaryTextAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K32BinaryTextAnim.WBP_K32BinaryTextAnim_C
// 0x0090 (0x0338 - 0x02A8)
class UWBP_K32BinaryTextAnim_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Glitch;                                            // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDRichTextBlock*                      RichText;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 BinaryText;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         NbBinarySymbolMax;                                 // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NbAllienSymbolMax;                                 // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSymbolCounter;                              // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NbLinesMax;                                        // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SymbolDBRowNumber;                                 // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLineCounter;                                // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBetweenCharactersMin;                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LinesLengthArray;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PreviousLineLength;                                // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeBetweenCharactersMax;                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBetweenLines;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnimPlaying;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllienSymbolMode;                                  // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ModeChanged;                                       // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BinaryEntityTranslation;                           // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         CurrentBinaryCounter;                              // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateBinaryText();
	void PreConstruct(bool IsDesignTime);
	void SwitchMode(bool IsInAllienMode);
	void StopBinaryTextAnim();
	void SetBinaryTextColor(const struct FLinearColor& Color);
	void ResetText();
	void RemoveFirstLine();
	void PrepareNextLine();
	void PlayBinaryTextAnim();
	void Finished_55E4FE73447D5694976775888E2FF1D6();
	void ExecuteUbergraph_WBP_K32BinaryTextAnim(int32 EntryPoint);
	void AddCharacter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K32BinaryTextAnim_C">();
	}
	static class UWBP_K32BinaryTextAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K32BinaryTextAnim_C>();
	}
};
static_assert(alignof(UWBP_K32BinaryTextAnim_C) == 0x000008, "Wrong alignment on UWBP_K32BinaryTextAnim_C");
static_assert(sizeof(UWBP_K32BinaryTextAnim_C) == 0x000338, "Wrong size on UWBP_K32BinaryTextAnim_C");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_K32BinaryTextAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, Glitch) == 0x0002B0, "Member 'UWBP_K32BinaryTextAnim_C::Glitch' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, RichText) == 0x0002B8, "Member 'UWBP_K32BinaryTextAnim_C::RichText' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, BinaryText) == 0x0002C0, "Member 'UWBP_K32BinaryTextAnim_C::BinaryText' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, NbBinarySymbolMax) == 0x0002D0, "Member 'UWBP_K32BinaryTextAnim_C::NbBinarySymbolMax' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, NbAllienSymbolMax) == 0x0002D4, "Member 'UWBP_K32BinaryTextAnim_C::NbAllienSymbolMax' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, CurrentSymbolCounter) == 0x0002D8, "Member 'UWBP_K32BinaryTextAnim_C::CurrentSymbolCounter' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, NbLinesMax) == 0x0002DC, "Member 'UWBP_K32BinaryTextAnim_C::NbLinesMax' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, SymbolDBRowNumber) == 0x0002E0, "Member 'UWBP_K32BinaryTextAnim_C::SymbolDBRowNumber' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, CurrentLineCounter) == 0x0002E4, "Member 'UWBP_K32BinaryTextAnim_C::CurrentLineCounter' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, TimeBetweenCharactersMin) == 0x0002E8, "Member 'UWBP_K32BinaryTextAnim_C::TimeBetweenCharactersMin' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, LinesLengthArray) == 0x0002F0, "Member 'UWBP_K32BinaryTextAnim_C::LinesLengthArray' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, PreviousLineLength) == 0x000300, "Member 'UWBP_K32BinaryTextAnim_C::PreviousLineLength' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, TimeBetweenCharactersMax) == 0x000308, "Member 'UWBP_K32BinaryTextAnim_C::TimeBetweenCharactersMax' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, TimeBetweenLines) == 0x000310, "Member 'UWBP_K32BinaryTextAnim_C::TimeBetweenLines' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, IsAnimPlaying) == 0x000318, "Member 'UWBP_K32BinaryTextAnim_C::IsAnimPlaying' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, AllienSymbolMode) == 0x000319, "Member 'UWBP_K32BinaryTextAnim_C::AllienSymbolMode' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, ModeChanged) == 0x00031A, "Member 'UWBP_K32BinaryTextAnim_C::ModeChanged' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, BinaryEntityTranslation) == 0x000320, "Member 'UWBP_K32BinaryTextAnim_C::BinaryEntityTranslation' has a wrong offset!");
static_assert(offsetof(UWBP_K32BinaryTextAnim_C, CurrentBinaryCounter) == 0x000330, "Member 'UWBP_K32BinaryTextAnim_C::CurrentBinaryCounter' has a wrong offset!");

}

