#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAuricCellsFirstPurchaseBanner

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreAuricCellsFirstPurchaseBanner.WBP_CoreAuricCellsFirstPurchaseBanner_C
// 0x0038 (0x02E0 - 0x02A8)
class UWBP_CoreAuricCellsFirstPurchaseBanner_C final : public UUserWidget
{
public:
	class UOverlay*                               FirstPurchase;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          FirstPurchaseDescriptionTextBlock;                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              FirstPurchaseIconImage;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          FirstPurchaseTitleTextBlock;                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        FlagSwitcher;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreOwnedTag_C*                    WBP_CoreOwnedTag;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreTimerFlag_C*                   WBP_CoreTimerFlag;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetFirstPurchaseData(const struct FAuricCellsFirstPurchaseViewData& FirstPurchaseData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreAuricCellsFirstPurchaseBanner_C">();
	}
	static class UWBP_CoreAuricCellsFirstPurchaseBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreAuricCellsFirstPurchaseBanner_C>();
	}
};
static_assert(alignof(UWBP_CoreAuricCellsFirstPurchaseBanner_C) == 0x000008, "Wrong alignment on UWBP_CoreAuricCellsFirstPurchaseBanner_C");
static_assert(sizeof(UWBP_CoreAuricCellsFirstPurchaseBanner_C) == 0x0002E0, "Wrong size on UWBP_CoreAuricCellsFirstPurchaseBanner_C");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, FirstPurchase) == 0x0002A8, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::FirstPurchase' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, FirstPurchaseDescriptionTextBlock) == 0x0002B0, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::FirstPurchaseDescriptionTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, FirstPurchaseIconImage) == 0x0002B8, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::FirstPurchaseIconImage' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, FirstPurchaseTitleTextBlock) == 0x0002C0, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::FirstPurchaseTitleTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, FlagSwitcher) == 0x0002C8, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::FlagSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, WBP_CoreOwnedTag) == 0x0002D0, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::WBP_CoreOwnedTag' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsFirstPurchaseBanner_C, WBP_CoreTimerFlag) == 0x0002D8, "Member 'UWBP_CoreAuricCellsFirstPurchaseBanner_C::WBP_CoreTimerFlag' has a wrong offset!");

}

