#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreIconToggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreIconToggle.WBP_CoreIconToggle_C
// 0x00E8 (0x0590 - 0x04A8)
class UWBP_CoreIconToggle_C final : public UCoreIconToggleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconIMG;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              NewSelectionTagIMG;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PressedColor;                                      // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredColor;                                      // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ToggledColor;                                      // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledColor;                                     // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0510(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackgroundIMGDynamicMaterial;                      // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       backgroundMaterial;                                // 0x0550(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IconMatchSize;                                     // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateVisuals();
	void SetNotificationIconVisibility(bool ShowNotification);
	void SetActiveVisualState(bool IsActive);
	void PreConstruct(bool IsDesignTime);
	void OnUnhovered();
	void OnReleased();
	void OnPressed();
	void OnHovered();
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnClicked();
	void ExecuteUbergraph_WBP_CoreIconToggle(int32 EntryPoint);
	void Event_Update_Icon_Texture(TSoftObjectPtr<class UTexture2D> New_Texture);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreIconToggle_C">();
	}
	static class UWBP_CoreIconToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreIconToggle_C>();
	}
};
static_assert(alignof(UWBP_CoreIconToggle_C) == 0x000008, "Wrong alignment on UWBP_CoreIconToggle_C");
static_assert(sizeof(UWBP_CoreIconToggle_C) == 0x000590, "Wrong size on UWBP_CoreIconToggle_C");
static_assert(offsetof(UWBP_CoreIconToggle_C, UberGraphFrame) == 0x0004A8, "Member 'UWBP_CoreIconToggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, IconIMG) == 0x0004B0, "Member 'UWBP_CoreIconToggle_C::IconIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, NewSelectionTagIMG) == 0x0004B8, "Member 'UWBP_CoreIconToggle_C::NewSelectionTagIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, DefaultColor) == 0x0004C0, "Member 'UWBP_CoreIconToggle_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, PressedColor) == 0x0004D0, "Member 'UWBP_CoreIconToggle_C::PressedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, HoveredColor) == 0x0004E0, "Member 'UWBP_CoreIconToggle_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, ToggledColor) == 0x0004F0, "Member 'UWBP_CoreIconToggle_C::ToggledColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, DisabledColor) == 0x000500, "Member 'UWBP_CoreIconToggle_C::DisabledColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, IconTexture) == 0x000510, "Member 'UWBP_CoreIconToggle_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, BackgroundIMGDynamicMaterial) == 0x000548, "Member 'UWBP_CoreIconToggle_C::BackgroundIMGDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, backgroundMaterial) == 0x000550, "Member 'UWBP_CoreIconToggle_C::backgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreIconToggle_C, IconMatchSize) == 0x000588, "Member 'UWBP_CoreIconToggle_C::IconMatchSize' has a wrong offset!");

}

