#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInteractionProgressWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.UpdateInputProgress
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_UpdateInputProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemCharge;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlocked;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PercentageStopDischarge;                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_UpdateInputProgress) == 0x000004, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_UpdateInputProgress");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_UpdateInputProgress) == 0x000010, "Wrong size on WBP_CoreInteractionProgressWidget_C_UpdateInputProgress");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_UpdateInputProgress, Progress) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_UpdateInputProgress::Progress' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_UpdateInputProgress, ItemCharge) == 0x000004, "Member 'WBP_CoreInteractionProgressWidget_C_UpdateInputProgress::ItemCharge' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_UpdateInputProgress, IsBlocked) == 0x000008, "Member 'WBP_CoreInteractionProgressWidget_C_UpdateInputProgress::IsBlocked' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_UpdateInputProgress, PercentageStopDischarge) == 0x00000C, "Member 'WBP_CoreInteractionProgressWidget_C_UpdateInputProgress::PercentageStopDischarge' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.Update Progress
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_Update_Progress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PercentageStopDischarge;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeProgress;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlocked;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RemapValueRange_Result;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RemapValueRange_Result_1;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RemapValueRange_TargetHigh_ImplicitCast;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EqualEqual_FloatFloat_A_ImplicitCast;     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Greater_FloatFloat_A_ImplicitCast;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Greater_FloatFloat_A_ImplicitCast_1;      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EqualEqual_FloatFloat_A_ImplicitCast_1;   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Greater_FloatFloat_A_ImplicitCast_2;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast_1;     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RemapValueRange_TargetHigh_ImplicitCast_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_Update_Progress) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_Update_Progress");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_Update_Progress) == 0x0000A0, "Wrong size on WBP_CoreInteractionProgressWidget_C_Update_Progress");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, Progress) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::Progress' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, PercentageStopDischarge) == 0x000008, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::PercentageStopDischarge' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, ChargeProgress) == 0x000010, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::ChargeProgress' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, IsBlocked) == 0x000018, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::IsBlocked' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_RemapValueRange_Result) == 0x000020, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_RemapValueRange_Result' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000028, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00002A, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000048, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000049, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_BooleanAND_ReturnValue_1) == 0x00004A, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00004B, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_PlayAnimation_ReturnValue_2) == 0x000050, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000058, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_RemapValueRange_Result_1) == 0x000060, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_RemapValueRange_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Subtract_FloatFloat_B_ImplicitCast) == 0x000068, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Subtract_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_RemapValueRange_TargetHigh_ImplicitCast) == 0x000070, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_RemapValueRange_TargetHigh_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_EqualEqual_FloatFloat_A_ImplicitCast) == 0x000078, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_EqualEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Greater_FloatFloat_A_ImplicitCast) == 0x00007C, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Greater_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Greater_FloatFloat_A_ImplicitCast_1) == 0x000080, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Greater_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_EqualEqual_FloatFloat_A_ImplicitCast_1) == 0x000084, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_EqualEqual_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Greater_FloatFloat_A_ImplicitCast_2) == 0x000088, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Greater_FloatFloat_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_Subtract_FloatFloat_B_ImplicitCast_1) == 0x00008C, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_Subtract_FloatFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_RemapValueRange_TargetHigh_ImplicitCast_1) == 0x000090, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_RemapValueRange_TargetHigh_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Update_Progress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000098, "Member 'WBP_CoreInteractionProgressWidget_C_Update_Progress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.TriggerHemorrhageAnim
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim final
{
public:
	bool                                          Play;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim) == 0x000010, "Wrong size on WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim, Play) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim::Play' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000002, "Member 'WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreInteractionProgressWidget_C_TriggerHemorrhageAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.SetTutorialHighlight
// 0x0002 (0x0002 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudComponent                                 ComponentId;                                       // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight) == 0x000001, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight) == 0x000002, "Wrong size on WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight, Show) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight::Show' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight, ComponentId) == 0x000001, "Member 'WBP_CoreInteractionProgressWidget_C_SetTutorialHighlight::ComponentId' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.SetRegressionBar
// 0x0040 (0x0040 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_SetRegressionBar final
{
public:
	double                                        PercentageStopDecharge;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0020(0x0020)(NoDestructor)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_SetRegressionBar) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_SetRegressionBar");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_SetRegressionBar) == 0x000040, "Wrong size on WBP_CoreInteractionProgressWidget_C_SetRegressionBar");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetRegressionBar, PercentageStopDecharge) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_SetRegressionBar::PercentageStopDecharge' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetRegressionBar, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_CoreInteractionProgressWidget_C_SetRegressionBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetRegressionBar, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_CoreInteractionProgressWidget_C_SetRegressionBar::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetRegressionBar, K2Node_MakeStruct_Anchors) == 0x000020, "Member 'WBP_CoreInteractionProgressWidget_C_SetRegressionBar::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.SetInputProgressPrompt
// 0x0078 (0x0078 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt final
{
public:
	struct FInteractionProgressViewData           Data;                                              // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt) == 0x000078, "Wrong size on WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt, Data) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_SetInputProgressPrompt::Data' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.SetData
// 0x04E0 (0x04E0 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_SetData final
{
public:
	struct FInteractionProgressViewData           ViewData;                                          // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RemapValueRange_Result;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x00A0(0x0020)(NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RemapValueRange_Result_1;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0108(0x0018)()
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0xF];                                      // 0x0131(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0140(0x00D0)()
	struct FProgressBarStyle                      K2Node_MakeStruct_ProgressBarStyle;                // 0x0210(0x0290)()
	double                                        CallFunc_RemapValueRange_Value_ImplicitCast;       // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_cachedPermanentProgress_ImplicitCast; // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RemapValueRange_Value_ImplicitCast_1;     // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast;       // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RemapValueRange_TargetHigh_ImplicitCast;  // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_SetData) == 0x000010, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_SetData");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_SetData) == 0x0004E0, "Wrong size on WBP_CoreInteractionProgressWidget_C_SetData");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, ViewData) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000080, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_RemapValueRange_Result) == 0x000098, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_RemapValueRange_Result' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, K2Node_MakeStruct_Anchors) == 0x0000A0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C8, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000D0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000D8, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000E0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_RemapValueRange_Result_1) == 0x0000E8, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_RemapValueRange_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000108, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000120, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Map_Find_Value) == 0x000128, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Map_Find_ReturnValue) == 0x000130, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, K2Node_MakeStruct_SlateBrush) == 0x000140, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, K2Node_MakeStruct_ProgressBarStyle) == 0x000210, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::K2Node_MakeStruct_ProgressBarStyle' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_RemapValueRange_Value_ImplicitCast) == 0x0004A0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_RemapValueRange_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, K2Node_VariableSet_cachedPermanentProgress_ImplicitCast) == 0x0004A8, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::K2Node_VariableSet_cachedPermanentProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0004B0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_RemapValueRange_Value_ImplicitCast_1) == 0x0004B8, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_RemapValueRange_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0004C0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_Subtract_FloatFloat_B_ImplicitCast) == 0x0004C4, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_Subtract_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_RemapValueRange_TargetHigh_ImplicitCast) == 0x0004C8, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_RemapValueRange_TargetHigh_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_SetData, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0004D0, "Member 'WBP_CoreInteractionProgressWidget_C_SetData::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.Set Position
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_Set_Position final
{
public:
	class FString                                 View_Data_Message;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_Set_Position) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_Set_Position");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_Set_Position) == 0x000028, "Wrong size on WBP_CoreInteractionProgressWidget_C_Set_Position");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Set_Position, View_Data_Message) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_Set_Position::View_Data_Message' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Set_Position, Temp_bool_Variable) == 0x000010, "Member 'WBP_CoreInteractionProgressWidget_C_Set_Position::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Set_Position, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000011, "Member 'WBP_CoreInteractionProgressWidget_C_Set_Position::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Set_Position, K2Node_Select_Default) == 0x000018, "Member 'WBP_CoreInteractionProgressWidget_C_Set_Position::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_Set_Position, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_CoreInteractionProgressWidget_C_Set_Position::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_PreConstruct");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreInteractionProgressWidget_C_PreConstruct");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.ExecuteUbergraph_WBP_CoreInteractionProgressWidget
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_show;                                 // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudComponent                                 K2Node_Event_componentId;                          // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_progress;                             // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_itemCharge;                           // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isBlocked;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_percentageStopDischarge;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionProgressViewData           K2Node_Event_data;                                 // 0x0020(0x0078)(ConstParm)
	double                                        CallFunc_Update_Progress_progress_ImplicitCast;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Update_Progress_chargeProgress_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Update_Progress_percentageStopDischarge_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CachedRegressionProgress_ImplicitCast; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget) == 0x0000B8, "Wrong size on WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, EntryPoint) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_show) == 0x000005, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_show' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_componentId) == 0x000006, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_componentId' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_progress) == 0x000008, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_progress' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_itemCharge) == 0x00000C, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_itemCharge' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_isBlocked) == 0x000010, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_isBlocked' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_percentageStopDischarge) == 0x000014, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_percentageStopDischarge' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_Event_data) == 0x000020, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, CallFunc_Update_Progress_progress_ImplicitCast) == 0x000098, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::CallFunc_Update_Progress_progress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, CallFunc_Update_Progress_chargeProgress_ImplicitCast) == 0x0000A0, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::CallFunc_Update_Progress_chargeProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, CallFunc_Update_Progress_percentageStopDischarge_ImplicitCast) == 0x0000A8, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::CallFunc_Update_Progress_percentageStopDischarge_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget, K2Node_VariableSet_CachedRegressionProgress_ImplicitCast) == 0x0000B0, "Member 'WBP_CoreInteractionProgressWidget_C_ExecuteUbergraph_WBP_CoreInteractionProgressWidget::K2Node_VariableSet_CachedRegressionProgress_ImplicitCast' has a wrong offset!");

// Function WBP_CoreInteractionProgressWidget.WBP_CoreInteractionProgressWidget_C.BuildProficiencyArray
// 0x0048 (0x0048 - 0x0000)
struct WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreStatusEffectIcon*                  K2Node_DynamicCast_AsCore_Status_Effect_Icon;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray) == 0x000008, "Wrong alignment on WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray");
static_assert(sizeof(WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray) == 0x000048, "Wrong size on WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_CoreInteractionProgressWidget_C_BuildProficiencyArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
