#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreGenericRefreshingPopupWidget

#include "Basic.hpp"

#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreGenericRefreshingPopupWidget.WBP_CoreGenericRefreshingPopupWidget_C
// 0x0020 (0x03B0 - 0x0390)
class UWBP_CoreGenericRefreshingPopupWidget_C final : public UCoreGenericRefreshingPopupWidget
{
public:
	class UDBDImage*                              Bg;                                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           Mask;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDScrollBox*                          MessageScrollBox;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              PriorityHeader;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreGenericRefreshingPopupWidget_C">();
	}
	static class UWBP_CoreGenericRefreshingPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreGenericRefreshingPopupWidget_C>();
	}
};
static_assert(alignof(UWBP_CoreGenericRefreshingPopupWidget_C) == 0x000008, "Wrong alignment on UWBP_CoreGenericRefreshingPopupWidget_C");
static_assert(sizeof(UWBP_CoreGenericRefreshingPopupWidget_C) == 0x0003B0, "Wrong size on UWBP_CoreGenericRefreshingPopupWidget_C");
static_assert(offsetof(UWBP_CoreGenericRefreshingPopupWidget_C, Bg) == 0x000390, "Member 'UWBP_CoreGenericRefreshingPopupWidget_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericRefreshingPopupWidget_C, Mask) == 0x000398, "Member 'UWBP_CoreGenericRefreshingPopupWidget_C::Mask' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericRefreshingPopupWidget_C, MessageScrollBox) == 0x0003A0, "Member 'UWBP_CoreGenericRefreshingPopupWidget_C::MessageScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_CoreGenericRefreshingPopupWidget_C, PriorityHeader) == 0x0003A8, "Member 'UWBP_CoreGenericRefreshingPopupWidget_C::PriorityHeader' has a wrong offset!");

}

