#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TallyClassPlayerStatusContainer

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.TryGetAnimatedWidget
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget final
{
public:
	struct FPlayerCardViewData                    ViewData;                                          // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_CorePlayerCardContainer_C*         ParentWidget;                                      // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget) == 0x000008, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget) == 0x0000D8, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, ViewData) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, ParentWidget) == 0x0000A8, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::ParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, Success) == 0x0000B0, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::Success' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0000B8, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000C0, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, CallFunc_IsValidClass_ReturnValue) == 0x0000C1, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget) == 0x0000C8, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget, K2Node_ClassDynamicCast_bSuccess) == 0x0000D0, "Member 'WBP_TallyClassPlayerStatusContainer_C_TryGetAnimatedWidget::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.SetVisualIsPlayer
// 0x0001 (0x0001 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer final
{
public:
	bool                                          IsPlayer;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer) == 0x000001, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer) == 0x000001, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer, IsPlayer) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetVisualIsPlayer::IsPlayer' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.SetReportButtonOpacity
// 0x0004 (0x0004 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity final
{
public:
	float                                         Opacity;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity) == 0x000004, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity) == 0x000004, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity, Opacity) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetReportButtonOpacity::Opacity' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.SetPlayerCards
// 0x0150 (0x0150 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards final
{
public:
	struct FPlayerCardViewData                    Param_Banner;                                      // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPlayerCardViewData                    Param_Badge;                                       // 0x00A8(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards) == 0x000008, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards) == 0x000150, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards, Param_Banner) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards::Param_Banner' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards, Param_Badge) == 0x0000A8, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetPlayerCards::Param_Badge' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.SetPlayerCardAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation final
{
public:
	bool                                          Param_IsAnimationPlaying;                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation) == 0x000001, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation) == 0x000001, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation, Param_IsAnimationPlaying) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetPlayerCardAnimation::Param_IsAnimationPlaying' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.SetData
// 0x0208 (0x0208 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_SetData final
{
public:
	struct FTallyPlayerStatusViewData             ViewData;                                          // 0x0000(0x0200)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EGameType                                     GameType;                                          // 0x0200(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingCharacterClass;                             // 0x0201(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_SetData) == 0x000008, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_SetData");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_SetData) == 0x000208, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_SetData");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetData, ViewData) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetData::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetData, GameType) == 0x000200, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetData::GameType' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetData, IsUsingCharacterClass) == 0x000201, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetData::IsUsingCharacterClass' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.SetBackground
// 0x0078 (0x0078 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_SetBackground final
{
public:
	bool                                          IsKiller;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0008(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0040(0x0038)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_SetBackground) == 0x000008, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_SetBackground");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_SetBackground) == 0x000078, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_SetBackground");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetBackground, IsKiller) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetBackground::IsKiller' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetBackground, IsPlayer) == 0x000001, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetBackground::IsPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetBackground, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000008, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetBackground::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_SetBackground, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x000040, "Member 'WBP_TallyClassPlayerStatusContainer_C_SetBackground::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_PreConstruct");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_PreConstruct");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C.ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer
// 0x0520 (0x0520 - 0x0000)
struct WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_2;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_3;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_4;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_5;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_6;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_7;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_8;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_9;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0058(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0090(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTallyPlayerStatusViewData             K2Node_Event_viewData;                             // 0x00D0(0x0200)(ConstParm)
	EGameType                                     K2Node_Event_gameType;                             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isUsingCharacterClass;                // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetBeautifiedNumericText_ReturnValue;     // 0x02D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02F0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0308(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0320(0x0018)()
	bool                                          Temp_bool_Variable_6;                              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameState                                    Temp_byte_Variable_2;                              // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_opacity;                              // 0x0340(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCardViewData                    K2Node_CustomEvent_Banner;                         // 0x0348(0x00A8)()
	struct FPlayerCardViewData                    K2Node_CustomEvent_Badge;                          // 0x03F0(0x00A8)()
	class UTexture2D*                             Temp_object_Variable;                              // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameState                                    Temp_byte_Variable_3;                              // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_2; // 0x04B0(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetAnimatedWidget_success;             // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x04EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerCardAnimationViewInterface> K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface; // 0x04F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerCardAnimationViewInterface> K2Node_DynamicCast_AsPlayer_Card_Animation_View_Interface_1; // 0x0508(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetAnimatedWidget_success_1;           // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isAnimationPlaying;                   // 0x051A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x051B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateScale_scale_ImplicitCast;           // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer) == 0x000008, "Wrong alignment on WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer");
static_assert(sizeof(WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer) == 0x000520, "Wrong size on WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer");
static_assert(offsetof(WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer, EntryPoint) == 0x000000, "Member 'WBP_TallyClassPlayerStatusContainer_C_ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer::EntryPoint' has a wrong offset!");
