#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreRankPipsContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreRankPipsContainer.WBP_CoreRankPipsContainer_C.SetPipsState
// 0x0048 (0x0048 - 0x0000)
struct WBP_CoreRankPipsContainer_C_SetPipsState final
{
public:
	int32                                         RankPipsCount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActivePipsCount;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CoreRankPip_C*>             K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CoreRankPip_C*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreRankPipsContainer_C_SetPipsState) == 0x000008, "Wrong alignment on WBP_CoreRankPipsContainer_C_SetPipsState");
static_assert(sizeof(WBP_CoreRankPipsContainer_C_SetPipsState) == 0x000048, "Wrong size on WBP_CoreRankPipsContainer_C_SetPipsState");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, RankPipsCount) == 0x000000, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::RankPipsCount' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, ActivePipsCount) == 0x000004, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::ActivePipsCount' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreRankPipsContainer_C_SetPipsState, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_CoreRankPipsContainer_C_SetPipsState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

