#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHudAlertsWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreHudAlertsWidget.WBP_CoreHudAlertsWidget_C.FadeOut
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreHudAlertsWidget_C_FadeOut final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHudAlertsWidget_C_FadeOut) == 0x000004, "Wrong alignment on WBP_CoreHudAlertsWidget_C_FadeOut");
static_assert(sizeof(WBP_CoreHudAlertsWidget_C_FadeOut) == 0x000004, "Wrong size on WBP_CoreHudAlertsWidget_C_FadeOut");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_FadeOut, Delay) == 0x000000, "Member 'WBP_CoreHudAlertsWidget_C_FadeOut::Delay' has a wrong offset!");

// Function WBP_CoreHudAlertsWidget.WBP_CoreHudAlertsWidget_C.ExecuteUbergraph_WBP_CoreHudAlertsWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_delay;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_B_ImplicitCast;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget) == 0x000008, "Wrong alignment on WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget");
static_assert(sizeof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget) == 0x000028, "Wrong size on WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget, EntryPoint) == 0x000000, "Member 'WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget, K2Node_Event_delay) == 0x000010, "Member 'WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget::K2Node_Event_delay' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget, CallFunc_Subtract_FloatFloat_B_ImplicitCast) == 0x000024, "Member 'WBP_CoreHudAlertsWidget_C_ExecuteUbergraph_WBP_CoreHudAlertsWidget::CallFunc_Subtract_FloatFloat_B_ImplicitCast' has a wrong offset!");

}

