#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreNotifications

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreNotifications.WBP_CoreNotifications_C
// 0x0018 (0x02C0 - 0x02A8)
class UWBP_CoreNotifications_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blinking;                                          // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Icon;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreNotifications(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreNotifications_C">();
	}
	static class UWBP_CoreNotifications_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreNotifications_C>();
	}
};
static_assert(alignof(UWBP_CoreNotifications_C) == 0x000008, "Wrong alignment on UWBP_CoreNotifications_C");
static_assert(sizeof(UWBP_CoreNotifications_C) == 0x0002C0, "Wrong size on UWBP_CoreNotifications_C");
static_assert(offsetof(UWBP_CoreNotifications_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_CoreNotifications_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreNotifications_C, Blinking) == 0x0002B0, "Member 'UWBP_CoreNotifications_C::Blinking' has a wrong offset!");
static_assert(offsetof(UWBP_CoreNotifications_C, Icon) == 0x0002B8, "Member 'UWBP_CoreNotifications_C::Icon' has a wrong offset!");

}

