#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerRank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePlayerRank.WBP_CorePlayerRank_C
// 0x0010 (0x05B8 - 0x05A8)
class UWBP_CorePlayerRank_C final : public UCorePlayerRankWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          TestIsKiller;                                      // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TestRankIndex;                                     // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateRankUp();
	void Destruct();
	void ExecuteUbergraph_WBP_CorePlayerRank(int32 EntryPoint);
	void OnHovered();
	void OnUnhovered();
	void PreConstruct(bool IsDesignTime);
	void SetData(const struct FRankViewData& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePlayerRank_C">();
	}
	static class UWBP_CorePlayerRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePlayerRank_C>();
	}
};
static_assert(alignof(UWBP_CorePlayerRank_C) == 0x000008, "Wrong alignment on UWBP_CorePlayerRank_C");
static_assert(sizeof(UWBP_CorePlayerRank_C) == 0x0005B8, "Wrong size on UWBP_CorePlayerRank_C");
static_assert(offsetof(UWBP_CorePlayerRank_C, UberGraphFrame) == 0x0005A8, "Member 'UWBP_CorePlayerRank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerRank_C, TestIsKiller) == 0x0005B0, "Member 'UWBP_CorePlayerRank_C::TestIsKiller' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerRank_C, TestRankIndex) == 0x0005B4, "Member 'UWBP_CorePlayerRank_C::TestRankIndex' has a wrong offset!");

}

