#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreItem.WBP_CoreItem_C
// 0x0110 (0x0468 - 0x0358)
class UWBP_CoreItem_C final : public UCoreItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             CoreItemGrid;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             IconGrid;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ImageBG;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ImageLimitedItem;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InputPromptContainer;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LayoutSizeScale;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreInputPrompt_C*                 WBP_CoreInputPrompt_1;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemChargeGauge_C*                 WBP_ItemChargeGauge;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLongPressEvent;                                  // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FItemViewData                          ItemDataView;                                      // 0x03B0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInterface*                     Count;                                             // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     None_rarity;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseGague;                                     // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CoreItem;                                          // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0462(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGaugeLeftSide;                                   // 0x0463(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateInputPrompt(EControlMode ControlMode);
	void UpdateEnergyLevel();
	void SetValidState(bool IsValidData);
	void SetInputVisibility();
	void SetGaugeSide();
	void SetData(const struct FItemViewData& ItemViewData);
	void SetActiveState(bool Param_IsActive);
	void PreConstruct(bool IsDesignTime);
	void OnLongPressEvent__DelegateSignature();
	void IsEmpty(bool* Param_IsEmpty);
	void ExecuteUbergraph_WBP_CoreItem(int32 EntryPoint);
	void ClearData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreItem_C">();
	}
	static class UWBP_CoreItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreItem_C>();
	}
};
static_assert(alignof(UWBP_CoreItem_C) == 0x000008, "Wrong alignment on UWBP_CoreItem_C");
static_assert(sizeof(UWBP_CoreItem_C) == 0x000468, "Wrong size on UWBP_CoreItem_C");
static_assert(offsetof(UWBP_CoreItem_C, UberGraphFrame) == 0x000358, "Member 'UWBP_CoreItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, CoreItemGrid) == 0x000360, "Member 'UWBP_CoreItem_C::CoreItemGrid' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, IconGrid) == 0x000368, "Member 'UWBP_CoreItem_C::IconGrid' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, ImageBG) == 0x000370, "Member 'UWBP_CoreItem_C::ImageBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, ImageLimitedItem) == 0x000378, "Member 'UWBP_CoreItem_C::ImageLimitedItem' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, InputPromptContainer) == 0x000380, "Member 'UWBP_CoreItem_C::InputPromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, LayoutSizeScale) == 0x000388, "Member 'UWBP_CoreItem_C::LayoutSizeScale' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, WBP_CoreInputPrompt_1) == 0x000390, "Member 'UWBP_CoreItem_C::WBP_CoreInputPrompt_1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, WBP_ItemChargeGauge) == 0x000398, "Member 'UWBP_CoreItem_C::WBP_ItemChargeGauge' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, OnLongPressEvent) == 0x0003A0, "Member 'UWBP_CoreItem_C::OnLongPressEvent' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, ItemDataView) == 0x0003B0, "Member 'UWBP_CoreItem_C::ItemDataView' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, Count) == 0x000450, "Member 'UWBP_CoreItem_C::Count' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, None_rarity) == 0x000458, "Member 'UWBP_CoreItem_C::None_rarity' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, CollapseGague) == 0x000460, "Member 'UWBP_CoreItem_C::CollapseGague' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, CoreItem) == 0x000461, "Member 'UWBP_CoreItem_C::CoreItem' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, IsActive) == 0x000462, "Member 'UWBP_CoreItem_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_CoreItem_C, IsGaugeLeftSide) == 0x000463, "Member 'UWBP_CoreItem_C::IsGaugeLeftSide' has a wrong offset!");

}

