#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAuricCells

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreAuricCells.WBP_CoreAuricCells_C
// 0x0048 (0x03C8 - 0x0380)
class UWBP_CoreAuricCells_C final : public UCoreAuricCellsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 AlertIcon;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAuricCellsFirstPurchaseBanner_C* AuricCellsFirstPurchaseBanner;                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              BackgroundFog;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              DefaultTextBG;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptyBundles;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          TaxIncludedTextBlock;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FAuricCellsBundleViewData>      Bundles;                                           // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetTaxIncludedData(const class FString& TaxIncludeMessage);
	void SetData(const struct FAuricCellsViewData& ViewData);
	void SetContentVisibility(bool HasBundles);
	void Has_Any_First_Purchase_Reward(TArray<struct FAuricCellsBundleViewData>& Param_Bundles, bool* HasFirstPurchaseReward);
	void ExecuteUbergraph_WBP_CoreAuricCells(int32 EntryPoint);
	void BndEvt__WBP_CoreAuricCells_BackInputSwitcher_K2Node_ComponentBoundEvent_0_InputSwitcherTriggeredDelegate__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreAuricCells_C">();
	}
	static class UWBP_CoreAuricCells_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreAuricCells_C>();
	}
};
static_assert(alignof(UWBP_CoreAuricCells_C) == 0x000008, "Wrong alignment on UWBP_CoreAuricCells_C");
static_assert(sizeof(UWBP_CoreAuricCells_C) == 0x0003C8, "Wrong size on UWBP_CoreAuricCells_C");
static_assert(offsetof(UWBP_CoreAuricCells_C, UberGraphFrame) == 0x000380, "Member 'UWBP_CoreAuricCells_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, AlertIcon) == 0x000388, "Member 'UWBP_CoreAuricCells_C::AlertIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, AuricCellsFirstPurchaseBanner) == 0x000390, "Member 'UWBP_CoreAuricCells_C::AuricCellsFirstPurchaseBanner' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, BackgroundFog) == 0x000398, "Member 'UWBP_CoreAuricCells_C::BackgroundFog' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, DefaultTextBG) == 0x0003A0, "Member 'UWBP_CoreAuricCells_C::DefaultTextBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, EmptyBundles) == 0x0003A8, "Member 'UWBP_CoreAuricCells_C::EmptyBundles' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, TaxIncludedTextBlock) == 0x0003B0, "Member 'UWBP_CoreAuricCells_C::TaxIncludedTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCells_C, Bundles) == 0x0003B8, "Member 'UWBP_CoreAuricCells_C::Bundles' has a wrong offset!");

}

