#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHudRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeadByDaylight_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreHudRoot.WBP_CoreHudRoot_C
// 0x0028 (0x0378 - 0x0350)
class UWBP_CoreHudRoot_C final : public UCoreHudRootWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutWidgetContainer;                            // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInWidgetContainer;                             // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAspectRatioBox*                        AspectRatioBox_0;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPlayingFadeoutAnimation;                         // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetWidgetsVisibility(bool Visible);
	void ScalePadding();
	void PreConstruct(bool IsDesignTime);
	void OnFadeOutCompleted();
	void FadeOutWidgets();
	void FadeInWidgets();
	void ExecuteUbergraph_WBP_CoreHudRoot(int32 EntryPoint);
	void ApplyConstrainedAspectRatio(bool IsConstrained, float AspectRatio);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreHudRoot_C">();
	}
	static class UWBP_CoreHudRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreHudRoot_C>();
	}
};
static_assert(alignof(UWBP_CoreHudRoot_C) == 0x000008, "Wrong alignment on UWBP_CoreHudRoot_C");
static_assert(sizeof(UWBP_CoreHudRoot_C) == 0x000378, "Wrong size on UWBP_CoreHudRoot_C");
static_assert(offsetof(UWBP_CoreHudRoot_C, UberGraphFrame) == 0x000350, "Member 'UWBP_CoreHudRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudRoot_C, FadeOutWidgetContainer) == 0x000358, "Member 'UWBP_CoreHudRoot_C::FadeOutWidgetContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudRoot_C, FadeInWidgetContainer) == 0x000360, "Member 'UWBP_CoreHudRoot_C::FadeInWidgetContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudRoot_C, AspectRatioBox_0) == 0x000368, "Member 'UWBP_CoreHudRoot_C::AspectRatioBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudRoot_C, IsPlayingFadeoutAnimation) == 0x000370, "Member 'UWBP_CoreHudRoot_C::IsPlayingFadeoutAnimation' has a wrong offset!");

}

