#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerSocialOptionButtonWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePlayerSocialOptionButtonWidget.WBP_CorePlayerSocialOptionButtonWidget_C
// 0x0060 (0x0558 - 0x04F8)
class UWBP_CorePlayerSocialOptionButtonWidget_C final : public UCorePlayerSocialOptionButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               BackgroundContainer;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Bg;                                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              BgInactive;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RedTraitIMG;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        PaddingText;                                       // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ActionMapping;                                     // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UpdateVisual();
	void ResetVisuals(bool Param_IsEnabled);
	void OnUnhovered();
	void OnPressed();
	void OnHovered();
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnButtonVisibilityChanged(const EButtonWidgetVisibility PreviousVisibility, const EButtonWidgetVisibility NewVisibility);
	void OnAlignmentChanged(ETextJustify NewAlignment);
	void ExecuteUbergraph_WBP_CorePlayerSocialOptionButtonWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePlayerSocialOptionButtonWidget_C">();
	}
	static class UWBP_CorePlayerSocialOptionButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePlayerSocialOptionButtonWidget_C>();
	}
};
static_assert(alignof(UWBP_CorePlayerSocialOptionButtonWidget_C) == 0x000008, "Wrong alignment on UWBP_CorePlayerSocialOptionButtonWidget_C");
static_assert(sizeof(UWBP_CorePlayerSocialOptionButtonWidget_C) == 0x000558, "Wrong size on UWBP_CorePlayerSocialOptionButtonWidget_C");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, UberGraphFrame) == 0x0004F8, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, Pressed) == 0x000500, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, Hover) == 0x000508, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, Default) == 0x000510, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, BackgroundContainer) == 0x000518, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::BackgroundContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, Bg) == 0x000520, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, BgInactive) == 0x000528, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::BgInactive' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, Overlay) == 0x000530, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, RedTraitIMG) == 0x000538, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::RedTraitIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, PaddingText) == 0x000540, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::PaddingText' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerSocialOptionButtonWidget_C, ActionMapping) == 0x000548, "Member 'UWBP_CorePlayerSocialOptionButtonWidget_C::ActionMapping' has a wrong offset!");

}

