#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSortButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreSortButton.WBP_CoreSortButton_C.ExecuteUbergraph_WBP_CoreSortButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton) == 0x000008, "Wrong alignment on WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton");
static_assert(sizeof(WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton) == 0x000018, "Wrong size on WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton");
static_assert(offsetof(WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton, EntryPoint) == 0x000000, "Member 'WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton, K2Node_Event_isEnabled) == 0x000010, "Member 'WBP_CoreSortButton_C_ExecuteUbergraph_WBP_CoreSortButton::K2Node_Event_isEnabled' has a wrong offset!");

// Function WBP_CoreSortButton.WBP_CoreSortButton_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSortButton_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortButton_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreSortButton_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreSortButton_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreSortButton_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreSortButton_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreSortButton_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreSortButton.WBP_CoreSortButton_C.SetColors
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreSortButton_C_SetColors final
{
public:
	struct FLinearColor                           BackgroundColor;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColor;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortButton_C_SetColors) == 0x000004, "Wrong alignment on WBP_CoreSortButton_C_SetColors");
static_assert(sizeof(WBP_CoreSortButton_C_SetColors) == 0x000020, "Wrong size on WBP_CoreSortButton_C_SetColors");
static_assert(offsetof(WBP_CoreSortButton_C_SetColors, BackgroundColor) == 0x000000, "Member 'WBP_CoreSortButton_C_SetColors::BackgroundColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortButton_C_SetColors, IconColor) == 0x000010, "Member 'WBP_CoreSortButton_C_SetColors::IconColor' has a wrong offset!");

// Function WBP_CoreSortButton.WBP_CoreSortButton_C.UpdateVisuals
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreSortButton_C_UpdateVisuals final
{
public:
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSortButton_C_UpdateVisuals) == 0x000001, "Wrong alignment on WBP_CoreSortButton_C_UpdateVisuals");
static_assert(sizeof(WBP_CoreSortButton_C_UpdateVisuals) == 0x000003, "Wrong size on WBP_CoreSortButton_C_UpdateVisuals");
static_assert(offsetof(WBP_CoreSortButton_C_UpdateVisuals, CallFunc_IsPressed_ReturnValue) == 0x000000, "Member 'WBP_CoreSortButton_C_UpdateVisuals::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortButton_C_UpdateVisuals, CallFunc_IsHovered_ReturnValue) == 0x000001, "Member 'WBP_CoreSortButton_C_UpdateVisuals::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSortButton_C_UpdateVisuals, CallFunc_IsEnabled_ReturnValue) == 0x000002, "Member 'WBP_CoreSortButton_C_UpdateVisuals::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");

}

