#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHudScoreAlertItem

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreHudScoreAlertItem.WBP_CoreHudScoreAlertItem_C
// 0x0088 (0x03A8 - 0x0320)
class UWBP_CoreHudScoreAlertItem_C final : public UCoreHudScoreAlertItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDTextBlock*                          CategoryTitle;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreHudScoreAlertIcon_C*           ScoreAlertIcon;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ScoreNum;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EDBDScoreCategory, class UTexture2D*>    CategoryIcons;                                     // 0x0340(0x0050)(Edit, BlueprintVisible)
	class FText                                   MaxScoreText;                                      // 0x0390(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetScoreText(int32 ScoreValue);
	void SetData(const struct FScoreAlertViewData& Data);
	void ExecuteUbergraph_WBP_CoreHudScoreAlertItem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreHudScoreAlertItem_C">();
	}
	static class UWBP_CoreHudScoreAlertItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreHudScoreAlertItem_C>();
	}
};
static_assert(alignof(UWBP_CoreHudScoreAlertItem_C) == 0x000008, "Wrong alignment on UWBP_CoreHudScoreAlertItem_C");
static_assert(sizeof(UWBP_CoreHudScoreAlertItem_C) == 0x0003A8, "Wrong size on UWBP_CoreHudScoreAlertItem_C");
static_assert(offsetof(UWBP_CoreHudScoreAlertItem_C, UberGraphFrame) == 0x000320, "Member 'UWBP_CoreHudScoreAlertItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudScoreAlertItem_C, CategoryTitle) == 0x000328, "Member 'UWBP_CoreHudScoreAlertItem_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudScoreAlertItem_C, ScoreAlertIcon) == 0x000330, "Member 'UWBP_CoreHudScoreAlertItem_C::ScoreAlertIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudScoreAlertItem_C, ScoreNum) == 0x000338, "Member 'UWBP_CoreHudScoreAlertItem_C::ScoreNum' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudScoreAlertItem_C, CategoryIcons) == 0x000340, "Member 'UWBP_CoreHudScoreAlertItem_C::CategoryIcons' has a wrong offset!");
static_assert(offsetof(UWBP_CoreHudScoreAlertItem_C, MaxScoreText) == 0x000390, "Member 'UWBP_CoreHudScoreAlertItem_C::MaxScoreText' has a wrong offset!");

}

