#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemChargeGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemChargeGauge.WBP_ItemChargeGauge_C
// 0x0060 (0x0308 - 0x02A8)
class UWBP_ItemChargeGauge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ItemChargeGauge;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EBarColor, struct FLinearColor>          Tints;                                             // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetPercent(double Percent);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_ItemChargeGauge(int32 EntryPoint);
	void ChangeColor(EBarColor Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemChargeGauge_C">();
	}
	static class UWBP_ItemChargeGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemChargeGauge_C>();
	}
};
static_assert(alignof(UWBP_ItemChargeGauge_C) == 0x000008, "Wrong alignment on UWBP_ItemChargeGauge_C");
static_assert(sizeof(UWBP_ItemChargeGauge_C) == 0x000308, "Wrong size on UWBP_ItemChargeGauge_C");
static_assert(offsetof(UWBP_ItemChargeGauge_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_ItemChargeGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemChargeGauge_C, ItemChargeGauge) == 0x0002B0, "Member 'UWBP_ItemChargeGauge_C::ItemChargeGauge' has a wrong offset!");
static_assert(offsetof(UWBP_ItemChargeGauge_C, Tints) == 0x0002B8, "Member 'UWBP_ItemChargeGauge_C::Tints' has a wrong offset!");

}

