#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreRankPip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreRankPip.WBP_CoreRankPip_C
// 0x0030 (0x02D8 - 0x02A8)
class UWBP_CoreRankPip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              Background;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Foreground;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               backgroundMaterial;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ForegroundMaterial;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PipSeed;                                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PipActivated;                                      // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreRankPip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetState(bool Param_IsVisible, bool IsActivePip);
	void UpdatePipVisual(int32 Param_PipSeed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreRankPip_C">();
	}
	static class UWBP_CoreRankPip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreRankPip_C>();
	}
};
static_assert(alignof(UWBP_CoreRankPip_C) == 0x000008, "Wrong alignment on UWBP_CoreRankPip_C");
static_assert(sizeof(UWBP_CoreRankPip_C) == 0x0002D8, "Wrong size on UWBP_CoreRankPip_C");
static_assert(offsetof(UWBP_CoreRankPip_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_CoreRankPip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreRankPip_C, Background) == 0x0002B0, "Member 'UWBP_CoreRankPip_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_CoreRankPip_C, Foreground) == 0x0002B8, "Member 'UWBP_CoreRankPip_C::Foreground' has a wrong offset!");
static_assert(offsetof(UWBP_CoreRankPip_C, backgroundMaterial) == 0x0002C0, "Member 'UWBP_CoreRankPip_C::backgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreRankPip_C, ForegroundMaterial) == 0x0002C8, "Member 'UWBP_CoreRankPip_C::ForegroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreRankPip_C, PipSeed) == 0x0002D0, "Member 'UWBP_CoreRankPip_C::PipSeed' has a wrong offset!");
static_assert(offsetof(UWBP_CoreRankPip_C, PipActivated) == 0x0002D4, "Member 'UWBP_CoreRankPip_C::PipActivated' has a wrong offset!");

}

