#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAuricCellsContainer

#include "Basic.hpp"

#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreAuricCellsContainer.WBP_CoreAuricCellsContainer_C
// 0x0030 (0x0390 - 0x0360)
class UWBP_CoreAuricCellsContainer_C final : public UCoreAuricCellsContainerWidget
{
public:
	class UWBP_CoreAuricCellsBundle_C*            WBP_CoreAuricCellsTile_1;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAuricCellsBundle_C*            WBP_CoreAuricCellsTile_2;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAuricCellsBundle_C*            WBP_CoreAuricCellsTile_3;                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAuricCellsBundle_C*            WBP_CoreAuricCellsTile_4;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAuricCellsBundle_C*            WBP_CoreAuricCellsTile_5;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreAuricCellsBundle_C*            WBP_CoreAuricCellsTile_6;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreAuricCellsContainer_C">();
	}
	static class UWBP_CoreAuricCellsContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreAuricCellsContainer_C>();
	}
};
static_assert(alignof(UWBP_CoreAuricCellsContainer_C) == 0x000008, "Wrong alignment on UWBP_CoreAuricCellsContainer_C");
static_assert(sizeof(UWBP_CoreAuricCellsContainer_C) == 0x000390, "Wrong size on UWBP_CoreAuricCellsContainer_C");
static_assert(offsetof(UWBP_CoreAuricCellsContainer_C, WBP_CoreAuricCellsTile_1) == 0x000360, "Member 'UWBP_CoreAuricCellsContainer_C::WBP_CoreAuricCellsTile_1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsContainer_C, WBP_CoreAuricCellsTile_2) == 0x000368, "Member 'UWBP_CoreAuricCellsContainer_C::WBP_CoreAuricCellsTile_2' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsContainer_C, WBP_CoreAuricCellsTile_3) == 0x000370, "Member 'UWBP_CoreAuricCellsContainer_C::WBP_CoreAuricCellsTile_3' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsContainer_C, WBP_CoreAuricCellsTile_4) == 0x000378, "Member 'UWBP_CoreAuricCellsContainer_C::WBP_CoreAuricCellsTile_4' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsContainer_C, WBP_CoreAuricCellsTile_5) == 0x000380, "Member 'UWBP_CoreAuricCellsContainer_C::WBP_CoreAuricCellsTile_5' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAuricCellsContainer_C, WBP_CoreAuricCellsTile_6) == 0x000388, "Member 'UWBP_CoreAuricCellsContainer_C::WBP_CoreAuricCellsTile_6' has a wrong offset!");

}

