#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerCardButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePlayerCardButton.WBP_CorePlayerCardButton_C
// 0x0030 (0x04D0 - 0x04A0)
class UWBP_CorePlayerCardButton_C final : public UCoreButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              BadgeShadow;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Container;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreOnHoverBorder_C*               OnHoverBorder;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CorePlayerCardContainer_C*         WBP_CorePlayerCardContainer;                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCorePlayerProfileWidget*               PlayerProfile;                                     // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SetAnimation(class UClass* AnimationWidget);
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnClicked();
	void ExecuteUbergraph_WBP_CorePlayerCardButton(int32 EntryPoint);
	void Construct();
	void SetIcon(TSoftObjectPtr<class UTexture2D> Icon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePlayerCardButton_C">();
	}
	static class UWBP_CorePlayerCardButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePlayerCardButton_C>();
	}
};
static_assert(alignof(UWBP_CorePlayerCardButton_C) == 0x000008, "Wrong alignment on UWBP_CorePlayerCardButton_C");
static_assert(sizeof(UWBP_CorePlayerCardButton_C) == 0x0004D0, "Wrong size on UWBP_CorePlayerCardButton_C");
static_assert(offsetof(UWBP_CorePlayerCardButton_C, UberGraphFrame) == 0x0004A0, "Member 'UWBP_CorePlayerCardButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardButton_C, BadgeShadow) == 0x0004A8, "Member 'UWBP_CorePlayerCardButton_C::BadgeShadow' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardButton_C, Container) == 0x0004B0, "Member 'UWBP_CorePlayerCardButton_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardButton_C, OnHoverBorder) == 0x0004B8, "Member 'UWBP_CorePlayerCardButton_C::OnHoverBorder' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardButton_C, WBP_CorePlayerCardContainer) == 0x0004C0, "Member 'UWBP_CorePlayerCardButton_C::WBP_CorePlayerCardContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerCardButton_C, PlayerProfile) == 0x0004C8, "Member 'UWBP_CorePlayerCardButton_C::PlayerProfile' has a wrong offset!");

}

