#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInteractionPromptsContainer

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreInteractionPromptsContainer.WBP_CoreInteractionPromptsContainer_C.SetTutorialHighlight
// 0x0002 (0x0002 - 0x0000)
struct WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudComponent                                 ComponentId;                                       // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight) == 0x000001, "Wrong alignment on WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight");
static_assert(sizeof(WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight) == 0x000002, "Wrong size on WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight");
static_assert(offsetof(WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight, Show) == 0x000000, "Member 'WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight::Show' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight, ComponentId) == 0x000001, "Member 'WBP_CoreInteractionPromptsContainer_C_SetTutorialHighlight::ComponentId' has a wrong offset!");

// Function WBP_CoreInteractionPromptsContainer.WBP_CoreInteractionPromptsContainer_C.ExecuteUbergraph_WBP_CoreInteractionPromptsContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_show;                                 // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudComponent                                 K2Node_Event_componentId;                          // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer) == 0x000004, "Wrong alignment on WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer");
static_assert(sizeof(WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer) == 0x000008, "Wrong size on WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer");
static_assert(offsetof(WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer, EntryPoint) == 0x000000, "Member 'WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer, K2Node_Event_show) == 0x000004, "Member 'WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer::K2Node_Event_show' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer, K2Node_Event_componentId) == 0x000005, "Member 'WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer::K2Node_Event_componentId' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'WBP_CoreInteractionPromptsContainer_C_ExecuteUbergraph_WBP_CoreInteractionPromptsContainer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

