#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHudScoreAlertItem

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreHudScoreAlertItem.WBP_CoreHudScoreAlertItem_C.SetScoreText
// 0x0048 (0x0048 - 0x0000)
struct WBP_CoreHudScoreAlertItem_C_SetScoreText final
{
public:
	int32                                         ScoreValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_CoreHudScoreAlertItem_C_SetScoreText) == 0x000008, "Wrong alignment on WBP_CoreHudScoreAlertItem_C_SetScoreText");
static_assert(sizeof(WBP_CoreHudScoreAlertItem_C_SetScoreText) == 0x000048, "Wrong size on WBP_CoreHudScoreAlertItem_C_SetScoreText");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_SetScoreText, ScoreValue) == 0x000000, "Member 'WBP_CoreHudScoreAlertItem_C_SetScoreText::ScoreValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_SetScoreText, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'WBP_CoreHudScoreAlertItem_C_SetScoreText::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_SetScoreText, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_CoreHudScoreAlertItem_C_SetScoreText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_SetScoreText, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_CoreHudScoreAlertItem_C_SetScoreText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_SetScoreText, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_CoreHudScoreAlertItem_C_SetScoreText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CoreHudScoreAlertItem.WBP_CoreHudScoreAlertItem_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreHudScoreAlertItem_C_SetData final
{
public:
	struct FScoreAlertViewData                    Data;                                              // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreHudScoreAlertItem_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreHudScoreAlertItem_C_SetData");
static_assert(sizeof(WBP_CoreHudScoreAlertItem_C_SetData) == 0x000020, "Wrong size on WBP_CoreHudScoreAlertItem_C_SetData");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_SetData, Data) == 0x000000, "Member 'WBP_CoreHudScoreAlertItem_C_SetData::Data' has a wrong offset!");

// Function WBP_CoreHudScoreAlertItem.WBP_CoreHudScoreAlertItem_C.ExecuteUbergraph_WBP_CoreHudScoreAlertItem
// 0x0058 (0x0058 - 0x0000)
struct WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScoreAlertViewData                    K2Node_Event_data;                                 // 0x0008(0x0020)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetProgress_Progress_ImplicitCast;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem) == 0x000008, "Wrong alignment on WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem");
static_assert(sizeof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem) == 0x000058, "Wrong size on WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem, EntryPoint) == 0x000000, "Member 'WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem, K2Node_Event_data) == 0x000008, "Member 'WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem, CallFunc_Map_Find_Value) == 0x000040, "Member 'WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem, CallFunc_SetProgress_Progress_ImplicitCast) == 0x000050, "Member 'WBP_CoreHudScoreAlertItem_C_ExecuteUbergraph_WBP_CoreHudScoreAlertItem::CallFunc_SetProgress_Progress_ImplicitCast' has a wrong offset!");

}

