#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreGenericPopup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreGenericPopup.WBP_CoreGenericPopup_C.ExecuteUbergraph_WBP_CoreGenericPopup
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBasePopupViewData*                     K2Node_Event_data;                                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnalogInputEvent                      K2Node_Event_InAnalogInputEvent;                   // 0x0020(0x0050)(ConstParm)
	float                                         CallFunc_GetAnalogValue_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue; // 0x0078(0x0048)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x00C0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup) == 0x000008, "Wrong alignment on WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup");
static_assert(sizeof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup) == 0x0000E8, "Wrong size on WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, EntryPoint) == 0x000000, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, K2Node_Event_data) == 0x000008, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, K2Node_Event_InAnalogInputEvent) == 0x000020, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::K2Node_Event_InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, CallFunc_GetAnalogValue_ReturnValue) == 0x000070, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::CallFunc_GetAnalogValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue) == 0x000078, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, CallFunc_GetKey_ReturnValue) == 0x0000C0, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0000E0, "Member 'WBP_CoreGenericPopup_C_ExecuteUbergraph_WBP_CoreGenericPopup::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function WBP_CoreGenericPopup.WBP_CoreGenericPopup_C.HandleAnalogInputEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_CoreGenericPopup_C_HandleAnalogInputEvent final
{
public:
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreGenericPopup_C_HandleAnalogInputEvent) == 0x000008, "Wrong alignment on WBP_CoreGenericPopup_C_HandleAnalogInputEvent");
static_assert(sizeof(WBP_CoreGenericPopup_C_HandleAnalogInputEvent) == 0x000050, "Wrong size on WBP_CoreGenericPopup_C_HandleAnalogInputEvent");
static_assert(offsetof(WBP_CoreGenericPopup_C_HandleAnalogInputEvent, InAnalogInputEvent) == 0x000000, "Member 'WBP_CoreGenericPopup_C_HandleAnalogInputEvent::InAnalogInputEvent' has a wrong offset!");

// Function WBP_CoreGenericPopup.WBP_CoreGenericPopup_C.SetHeaderColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreGenericPopup_C_SetHeaderColor final
{
public:
	class UBasePopupViewData*                     Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_GetPopupHeader_MaterialInstance;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreGenericPopup_C_SetHeaderColor) == 0x000008, "Wrong alignment on WBP_CoreGenericPopup_C_SetHeaderColor");
static_assert(sizeof(WBP_CoreGenericPopup_C_SetHeaderColor) == 0x000010, "Wrong size on WBP_CoreGenericPopup_C_SetHeaderColor");
static_assert(offsetof(WBP_CoreGenericPopup_C_SetHeaderColor, Data) == 0x000000, "Member 'WBP_CoreGenericPopup_C_SetHeaderColor::Data' has a wrong offset!");
static_assert(offsetof(WBP_CoreGenericPopup_C_SetHeaderColor, CallFunc_GetPopupHeader_MaterialInstance) == 0x000008, "Member 'WBP_CoreGenericPopup_C_SetHeaderColor::CallFunc_GetPopupHeader_MaterialInstance' has a wrong offset!");

// Function WBP_CoreGenericPopup.WBP_CoreGenericPopup_C.Show
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreGenericPopup_C_Show final
{
public:
	class UBasePopupViewData*                     Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreGenericPopup_C_Show) == 0x000008, "Wrong alignment on WBP_CoreGenericPopup_C_Show");
static_assert(sizeof(WBP_CoreGenericPopup_C_Show) == 0x000008, "Wrong size on WBP_CoreGenericPopup_C_Show");
static_assert(offsetof(WBP_CoreGenericPopup_C_Show, Data) == 0x000000, "Member 'WBP_CoreGenericPopup_C_Show::Data' has a wrong offset!");

}

