#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EffectCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EffectCard.WBP_EffectCard_C
// 0x0140 (0x05B8 - 0x0478)
class UWBP_EffectCard_C final : public UCoreEffectCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDButton*                             HitzoneButton;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Hover;                                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Shadow;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TopPadding;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEffectCardViewData                    Effect_Card_Data;                                  // 0x04A8(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               CardDynamicMaterial;                               // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CardMaterial;                                      // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CardIcon;                                          // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FutureToNextCardColor;                             // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ShadowDynamicMaterial;                             // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Audio_Mouse_Hover;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCardState(const EEffectCardState State);
	void SetShadow();
	void SetSheenEffectOnCard(bool HasSheen, class UMaterialInstanceDynamic* DynamicMaterial);
	void SetDissolver();
	void SetData(const struct FEffectCardViewData& EffectCardData);
	void PreConstruct(bool IsDesignTime);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2(class UObject* Loaded);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnLoaded_66688C874602FBCAD2327EBAC4BB68F5(class UObject* Loaded);
	void ExecuteUbergraph_WBP_EffectCard(int32 EntryPoint);

	void UpdateTimer(const float Param_CurrentTimer) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EffectCard_C">();
	}
	static class UWBP_EffectCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EffectCard_C>();
	}
};
static_assert(alignof(UWBP_EffectCard_C) == 0x000008, "Wrong alignment on UWBP_EffectCard_C");
static_assert(sizeof(UWBP_EffectCard_C) == 0x0005B8, "Wrong size on UWBP_EffectCard_C");
static_assert(offsetof(UWBP_EffectCard_C, UberGraphFrame) == 0x000478, "Member 'UWBP_EffectCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, OnHover) == 0x000480, "Member 'UWBP_EffectCard_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, HitzoneButton) == 0x000488, "Member 'UWBP_EffectCard_C::HitzoneButton' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, Hover) == 0x000490, "Member 'UWBP_EffectCard_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, Shadow) == 0x000498, "Member 'UWBP_EffectCard_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, TopPadding) == 0x0004A0, "Member 'UWBP_EffectCard_C::TopPadding' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, Effect_Card_Data) == 0x0004A8, "Member 'UWBP_EffectCard_C::Effect_Card_Data' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, CardDynamicMaterial) == 0x000580, "Member 'UWBP_EffectCard_C::CardDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, CardMaterial) == 0x000588, "Member 'UWBP_EffectCard_C::CardMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, CardIcon) == 0x000590, "Member 'UWBP_EffectCard_C::CardIcon' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, FutureToNextCardColor) == 0x000598, "Member 'UWBP_EffectCard_C::FutureToNextCardColor' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, ShadowDynamicMaterial) == 0x0005A8, "Member 'UWBP_EffectCard_C::ShadowDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_EffectCard_C, Audio_Mouse_Hover) == 0x0005B0, "Member 'UWBP_EffectCard_C::Audio_Mouse_Hover' has a wrong offset!");

}

