#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EffectCard

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_EffectCard.WBP_EffectCard_C.UpdateCardState
// 0x0044 (0x0044 - 0x0000)
struct WBP_EffectCard_C_UpdateCardState final
{
public:
	EEffectCardState                              State;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEffectCardState                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_UpdateCardState) == 0x000004, "Wrong alignment on WBP_EffectCard_C_UpdateCardState");
static_assert(sizeof(WBP_EffectCard_C_UpdateCardState) == 0x000044, "Wrong size on WBP_EffectCard_C_UpdateCardState");
static_assert(offsetof(WBP_EffectCard_C_UpdateCardState, State) == 0x000000, "Member 'WBP_EffectCard_C_UpdateCardState::State' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_UpdateCardState, Temp_byte_Variable) == 0x000001, "Member 'WBP_EffectCard_C_UpdateCardState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_UpdateCardState, Temp_struct_Variable) == 0x000004, "Member 'WBP_EffectCard_C_UpdateCardState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_UpdateCardState, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_EffectCard_C_UpdateCardState::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_UpdateCardState, Temp_struct_Variable_2) == 0x000024, "Member 'WBP_EffectCard_C_UpdateCardState::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_UpdateCardState, K2Node_Select_Default) == 0x000034, "Member 'WBP_EffectCard_C_UpdateCardState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.SetSheenEffectOnCard
// 0x0010 (0x0010 - 0x0000)
struct WBP_EffectCard_C_SetSheenEffectOnCard final
{
public:
	bool                                          HasSheen;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_SetSheenEffectOnCard) == 0x000008, "Wrong alignment on WBP_EffectCard_C_SetSheenEffectOnCard");
static_assert(sizeof(WBP_EffectCard_C_SetSheenEffectOnCard) == 0x000010, "Wrong size on WBP_EffectCard_C_SetSheenEffectOnCard");
static_assert(offsetof(WBP_EffectCard_C_SetSheenEffectOnCard, HasSheen) == 0x000000, "Member 'WBP_EffectCard_C_SetSheenEffectOnCard::HasSheen' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_SetSheenEffectOnCard, DynamicMaterial) == 0x000008, "Member 'WBP_EffectCard_C_SetSheenEffectOnCard::DynamicMaterial' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.SetData
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_EffectCard_C_SetData final
{
public:
	struct FEffectCardViewData                    EffectCardData;                                    // 0x0000(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_EffectCard_C_SetData) == 0x000008, "Wrong alignment on WBP_EffectCard_C_SetData");
static_assert(sizeof(WBP_EffectCard_C_SetData) == 0x0000D8, "Wrong size on WBP_EffectCard_C_SetData");
static_assert(offsetof(WBP_EffectCard_C_SetData, EffectCardData) == 0x000000, "Member 'WBP_EffectCard_C_SetData::EffectCardData' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_EffectCard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_EffectCard_C_PreConstruct");
static_assert(sizeof(WBP_EffectCard_C_PreConstruct) == 0x000001, "Wrong size on WBP_EffectCard_C_PreConstruct");
static_assert(offsetof(WBP_EffectCard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_EffectCard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_EffectCard_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_EffectCard_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_EffectCard_C_OnMouseEnter");
static_assert(sizeof(WBP_EffectCard_C_OnMouseEnter) == 0x0000B8, "Wrong size on WBP_EffectCard_C_OnMouseEnter");
static_assert(offsetof(WBP_EffectCard_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_EffectCard_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_EffectCard_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2
// 0x0008 (0x0008 - 0x0000)
struct WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2) == 0x000008, "Wrong alignment on WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2");
static_assert(sizeof(WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2) == 0x000008, "Wrong size on WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2");
static_assert(offsetof(WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2, Loaded) == 0x000000, "Member 'WBP_EffectCard_C_OnLoaded_D2FA113A41FCC1D2A6305BBAF4CB18B2::Loaded' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_EffectCard_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_EffectCard_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_EffectCard_C_OnMouseLeave");
static_assert(sizeof(WBP_EffectCard_C_OnMouseLeave) == 0x000080, "Wrong size on WBP_EffectCard_C_OnMouseLeave");
static_assert(offsetof(WBP_EffectCard_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_EffectCard_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.OnLoaded_66688C874602FBCAD2327EBAC4BB68F5
// 0x0008 (0x0008 - 0x0000)
struct WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5) == 0x000008, "Wrong alignment on WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5");
static_assert(sizeof(WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5) == 0x000008, "Wrong size on WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5");
static_assert(offsetof(WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5, Loaded) == 0x000000, "Member 'WBP_EffectCard_C_OnLoaded_66688C874602FBCAD2327EBAC4BB68F5::Loaded' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.ExecuteUbergraph_WBP_EffectCard
// 0x0338 (0x0338 - 0x0000)
struct WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_currentTimer;                         // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0080)(ConstParm)
	class UObject*                                Temp_object_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0080)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_hasSheen;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_DynamicMaterial;                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEffectCardViewData                    K2Node_Event_effectCardData;                       // 0x0190(0x00D8)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0288(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x02C4(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDBDTooltipManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x02E0(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard) == 0x000008, "Wrong alignment on WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard");
static_assert(sizeof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard) == 0x000338, "Wrong size on WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, EntryPoint) == 0x000000, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_Event_currentTimer) == 0x000004, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_Event_currentTimer' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, Temp_object_Variable) == 0x0000C0, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000148, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_Event_IsDesignTime) == 0x000150, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000158, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_CustomEvent_Loaded) == 0x000160, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_CustomEvent_hasSheen) == 0x000168, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_CustomEvent_hasSheen' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_CustomEvent_DynamicMaterial) == 0x000170, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_CustomEvent_DynamicMaterial' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, Temp_object_Variable_1) == 0x000178, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000180, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_CustomEvent_Loaded_1) == 0x000188, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_Event_effectCardData) == 0x000190, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_Event_effectCardData' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_PlayAnimation_ReturnValue) == 0x000268, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_PlayAnimation_ReturnValue_1) == 0x000270, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000278, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000280, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000288, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002C0, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_CreateDelegate_OutputDelegate) == 0x0002C4, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0002D8, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002E0, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0002F8, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_DynamicCast_AsMaterial_Instance) == 0x000300, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000309, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000310, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000318, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_BooleanAND_ReturnValue) == 0x000319, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000320, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_DynamicCast_AsTexture_2D) == 0x000328, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard, K2Node_DynamicCast_bSuccess_1) == 0x000330, "Member 'WBP_EffectCard_C_ExecuteUbergraph_WBP_EffectCard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_EffectCard.WBP_EffectCard_C.UpdateTimer
// 0x0004 (0x0004 - 0x0000)
struct WBP_EffectCard_C_UpdateTimer final
{
public:
	float                                         Param_CurrentTimer;                                // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EffectCard_C_UpdateTimer) == 0x000004, "Wrong alignment on WBP_EffectCard_C_UpdateTimer");
static_assert(sizeof(WBP_EffectCard_C_UpdateTimer) == 0x000004, "Wrong size on WBP_EffectCard_C_UpdateTimer");
static_assert(offsetof(WBP_EffectCard_C_UpdateTimer, Param_CurrentTimer) == 0x000000, "Member 'WBP_EffectCard_C_UpdateTimer::Param_CurrentTimer' has a wrong offset!");

}

