#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K07

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_K07.WBP_K07_C
// 0x0038 (0x0370 - 0x0338)
class UWBP_K07_C final : public UCorePlayerStatusKillerEffectK07Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AfflictionHitAnimation;                            // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AfflictionLevelAnimation03;                        // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AfflictionLevelAnimation02;                        // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AfflictionLevelAnimation01;                        // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Static;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDoctorStatusData*                      CachedData;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetKillerData(const struct FPlayerStatusViewData& Data);
	void SetDoctorVisibility(EAfflictionLevel Affliction_Level);
	void SetDoctorData(class UDoctorStatusData* DoctorStatusData);
	void ResetDoctorData();
	void Finished_9EFFE8AA49BAEFEF972E2CB361B8420A();
	void ExecuteUbergraph_WBP_K07(int32 EntryPoint);
	void Construct();
	void ClearDoctorAnimations();
	void AfflictionHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_K07_C">();
	}
	static class UWBP_K07_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_K07_C>();
	}
};
static_assert(alignof(UWBP_K07_C) == 0x000008, "Wrong alignment on UWBP_K07_C");
static_assert(sizeof(UWBP_K07_C) == 0x000370, "Wrong size on UWBP_K07_C");
static_assert(offsetof(UWBP_K07_C, UberGraphFrame) == 0x000338, "Member 'UWBP_K07_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_K07_C, AfflictionHitAnimation) == 0x000340, "Member 'UWBP_K07_C::AfflictionHitAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_K07_C, AfflictionLevelAnimation03) == 0x000348, "Member 'UWBP_K07_C::AfflictionLevelAnimation03' has a wrong offset!");
static_assert(offsetof(UWBP_K07_C, AfflictionLevelAnimation02) == 0x000350, "Member 'UWBP_K07_C::AfflictionLevelAnimation02' has a wrong offset!");
static_assert(offsetof(UWBP_K07_C, AfflictionLevelAnimation01) == 0x000358, "Member 'UWBP_K07_C::AfflictionLevelAnimation01' has a wrong offset!");
static_assert(offsetof(UWBP_K07_C, Static) == 0x000360, "Member 'UWBP_K07_C::Static' has a wrong offset!");
static_assert(offsetof(UWBP_K07_C, CachedData) == 0x000368, "Member 'UWBP_K07_C::CachedData' has a wrong offset!");

}

