#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInteractionPrompt

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreInteractionPrompt.WBP_CoreInteractionPrompt_C.SetMovementButtons
// 0x0048 (0x0048 - 0x0000)
struct WBP_CoreInteractionPrompt_C_SetMovementButtons final
{
public:
	struct FKey                                   InputKey3;                                         // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FKey                                   InputKey4;                                         // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_HasFourthPrompt_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasThirdPrompt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionPrompt_C_SetMovementButtons) == 0x000008, "Wrong alignment on WBP_CoreInteractionPrompt_C_SetMovementButtons");
static_assert(sizeof(WBP_CoreInteractionPrompt_C_SetMovementButtons) == 0x000048, "Wrong size on WBP_CoreInteractionPrompt_C_SetMovementButtons");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetMovementButtons, InputKey3) == 0x000000, "Member 'WBP_CoreInteractionPrompt_C_SetMovementButtons::InputKey3' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetMovementButtons, InputKey4) == 0x000020, "Member 'WBP_CoreInteractionPrompt_C_SetMovementButtons::InputKey4' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetMovementButtons, CallFunc_HasFourthPrompt_ReturnValue) == 0x000040, "Member 'WBP_CoreInteractionPrompt_C_SetMovementButtons::CallFunc_HasFourthPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetMovementButtons, CallFunc_HasThirdPrompt_ReturnValue) == 0x000041, "Member 'WBP_CoreInteractionPrompt_C_SetMovementButtons::CallFunc_HasThirdPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetMovementButtons, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'WBP_CoreInteractionPrompt_C_SetMovementButtons::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CoreInteractionPrompt.WBP_CoreInteractionPrompt_C.SetData
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_CoreInteractionPrompt_C_SetData final
{
public:
	struct FInteractionPromptViewData             Data;                                              // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreInteractionPrompt_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreInteractionPrompt_C_SetData");
static_assert(sizeof(WBP_CoreInteractionPrompt_C_SetData) == 0x0000B0, "Wrong size on WBP_CoreInteractionPrompt_C_SetData");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetData, Data) == 0x000000, "Member 'WBP_CoreInteractionPrompt_C_SetData::Data' has a wrong offset!");

// Function WBP_CoreInteractionPrompt.WBP_CoreInteractionPrompt_C.SetActiveWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreInteractionPrompt_C_SetActiveWidget final
{
public:
	EInteractionPromptType                        Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionPromptType                        Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreInteractionPromptActionWidget*     K2Node_DynamicCast_AsCore_Interaction_Prompt_Action_Widget; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionPrompt_C_SetActiveWidget) == 0x000008, "Wrong alignment on WBP_CoreInteractionPrompt_C_SetActiveWidget");
static_assert(sizeof(WBP_CoreInteractionPrompt_C_SetActiveWidget) == 0x000028, "Wrong size on WBP_CoreInteractionPrompt_C_SetActiveWidget");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetActiveWidget, Type) == 0x000000, "Member 'WBP_CoreInteractionPrompt_C_SetActiveWidget::Type' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetActiveWidget, Temp_byte_Variable) == 0x000001, "Member 'WBP_CoreInteractionPrompt_C_SetActiveWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetActiveWidget, Temp_object_Variable) == 0x000008, "Member 'WBP_CoreInteractionPrompt_C_SetActiveWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetActiveWidget, K2Node_Select_Default) == 0x000010, "Member 'WBP_CoreInteractionPrompt_C_SetActiveWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetActiveWidget, K2Node_DynamicCast_AsCore_Interaction_Prompt_Action_Widget) == 0x000018, "Member 'WBP_CoreInteractionPrompt_C_SetActiveWidget::K2Node_DynamicCast_AsCore_Interaction_Prompt_Action_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_SetActiveWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CoreInteractionPrompt_C_SetActiveWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CoreInteractionPrompt.WBP_CoreInteractionPrompt_C.ExecuteUbergraph_WBP_CoreInteractionPrompt
// 0x0128 (0x0128 - 0x0000)
struct WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	struct FInteractionPromptViewData             K2Node_Event_data;                                 // 0x0020(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSecondPrompt_ReturnValue;              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt) == 0x000008, "Wrong alignment on WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt");
static_assert(sizeof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt) == 0x000128, "Wrong size on WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, EntryPoint) == 0x000000, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, K2Node_Event_data) == 0x000020, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D1, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, CallFunc_IsEmpty_ReturnValue) == 0x0000D2, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, Temp_struct_Variable) == 0x0000F0, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, Temp_struct_Variable_1) == 0x000100, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, Temp_bool_Variable) == 0x000110, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, K2Node_Select_Default) == 0x000114, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt, CallFunc_HasSecondPrompt_ReturnValue) == 0x000124, "Member 'WBP_CoreInteractionPrompt_C_ExecuteUbergraph_WBP_CoreInteractionPrompt::CallFunc_HasSecondPrompt_ReturnValue' has a wrong offset!");

}

