#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHUD_EventObjectiveItem

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.UpdateCharges
// 0x0038 (0x0038 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges final
{
public:
	int32                                         NewChargeCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasMaxCharges;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges) == 0x000038, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, NewChargeCount) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::NewChargeCount' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, HasMaxCharges) == 0x000004, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::HasMaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000031, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000032, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_BooleanOR_ReturnValue) == 0x000033, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges, CallFunc_BooleanOR_ReturnValue_1) == 0x000035, "Member 'WBP_CoreHUD_EventObjectiveItem_C_UpdateCharges::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.ShouldResetGaugePercentage
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage final
{
public:
	int32                                         OldCharges;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldMaxCharges;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCharges;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewMaxCharges;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldResetGauge;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage) == 0x000018, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, OldCharges) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::OldCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, OldMaxCharges) == 0x000004, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::OldMaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, NewCharges) == 0x000008, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::NewCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, NewMaxCharges) == 0x00000C, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::NewMaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, ShouldResetGauge) == 0x000010, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::ShouldResetGauge' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000012, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000013, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ShouldResetGaugePercentage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetWidgetState
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState final
{
public:
	EEventObjectiveItemState                      EventItemState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState) == 0x000001, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState) == 0x000001, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState, EventItemState) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetWidgetState::EventItemState' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetWidgetData
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData final
{
public:
	EEventObjectiveItemState                      EventItemState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Charges;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCharges;                                        // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargePercent;                                     // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData) == 0x000010, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData, EventItemState) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData::EventItemState' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData, Charges) == 0x000004, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData::Charges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData, MaxCharges) == 0x000008, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData::MaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData, ChargePercent) == 0x00000C, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetWidgetData::ChargePercent' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetUsable
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetUsable final
{
public:
	bool                                          IsUsable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetUsable");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable) == 0x000018, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetUsable");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, IsUsable) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::IsUsable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, Temp_bool_Variable) == 0x000001, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, Temp_byte_Variable) == 0x000010, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, K2Node_Select_Default) == 0x000012, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetUsable, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000014, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetUsable::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetInputKey
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetInputKey final
{
public:
	struct FKey                                   InputKey;                                          // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetInputKey) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetInputKey");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetInputKey) == 0x000020, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetInputKey");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetInputKey, InputKey) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetInputKey::InputKey' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetHighlightVisual
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual final
{
public:
	bool                                          IsHighlighted;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual) == 0x000018, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual, IsHighlighted) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual::IsHighlighted' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetHighlightVisual::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetCooldownPercentage
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage final
{
public:
	float                                         CooldownPercent;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage) == 0x000004, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage, CooldownPercent) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldownPercentage::CooldownPercent' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetCooldown
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetCooldown final
{
public:
	bool                                          IsOnCooldown;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetCooldown");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown) == 0x000018, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetCooldown");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, IsOnCooldown) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::IsOnCooldown' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, Temp_bool_Variable) == 0x000001, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, Temp_byte_Variable) == 0x000010, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, K2Node_Select_Default) == 0x000012, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetCooldown, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000014, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetCooldown::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetChargePercentage
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage final
{
public:
	float                                         ChargePercent;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage) == 0x000004, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage, ChargePercent) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetChargePercentage::ChargePercent' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetAvailableCharges
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges final
{
public:
	int32                                         Charges;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCharges;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges) == 0x000004, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges) == 0x000008, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges, Charges) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges::Charges' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges, MaxCharges) == 0x000004, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetAvailableCharges::MaxCharges' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.SetActive
// 0x0030 (0x0030 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_SetActive) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_SetActive");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_SetActive) == 0x000030, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_SetActive");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, IsActive) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, Temp_bool_Variable) == 0x000001, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, Temp_object_Variable) == 0x000010, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, Temp_object_Variable_1) == 0x000018, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, K2Node_Select_Default) == 0x000020, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_SetActive, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'WBP_CoreHUD_EventObjectiveItem_C_SetActive::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.InitWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_InitWidget final
{
public:
	bool                                          IsLocalKiller;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_InitWidget) == 0x000001, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_InitWidget");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_InitWidget) == 0x000001, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_InitWidget");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_InitWidget, IsLocalKiller) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_InitWidget::IsLocalKiller' has a wrong offset!");

// Function WBP_CoreHUD_EventObjectiveItem.WBP_CoreHUD_EventObjectiveItem_C.ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem
// 0x0118 (0x0118 - 0x0000)
struct WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isLocalKiller;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEventObjectiveItemState                      K2Node_Event_eventItemState_1;                     // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_charges_1;                            // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_maxCharges_1;                         // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_chargePercent_1;                      // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_cooldownPercent;                      // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_inputKey;                             // 0x0038(0x0020)(ConstParm, HasGetValueTypeHash)
	EEventObjectiveItemState                      K2Node_Event_eventItemState;                       // 0x0058(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToMaterialVectorParameter_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_charges;                              // 0x00E0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_maxCharges;                           // 0x00E4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldResetGaugePercentage_ShouldResetGauge; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_chargePercent;                        // 0x00EC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem) == 0x000008, "Wrong alignment on WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem");
static_assert(sizeof(WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem) == 0x000118, "Wrong size on WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem");
static_assert(offsetof(WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem, EntryPoint) == 0x000000, "Member 'WBP_CoreHUD_EventObjectiveItem_C_ExecuteUbergraph_WBP_CoreHUD_EventObjectiveItem::EntryPoint' has a wrong offset!");
