#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DailyRitualTileClaimButtonWidget

#include "Basic.hpp"

#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DailyRitualTileClaimButtonWidget.WBP_DailyRitualTileClaimButtonWidget_C
// 0x0018 (0x04B8 - 0x04A0)
class UWBP_DailyRitualTileClaimButtonWidget_C final : public UCoreButtonWidget
{
public:
	class UWidgetAnimation*                       CompletedGlowAnimation;                            // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              GlowAnimation;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Icon;                                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DailyRitualTileClaimButtonWidget_C">();
	}
	static class UWBP_DailyRitualTileClaimButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DailyRitualTileClaimButtonWidget_C>();
	}
};
static_assert(alignof(UWBP_DailyRitualTileClaimButtonWidget_C) == 0x000008, "Wrong alignment on UWBP_DailyRitualTileClaimButtonWidget_C");
static_assert(sizeof(UWBP_DailyRitualTileClaimButtonWidget_C) == 0x0004B8, "Wrong size on UWBP_DailyRitualTileClaimButtonWidget_C");
static_assert(offsetof(UWBP_DailyRitualTileClaimButtonWidget_C, CompletedGlowAnimation) == 0x0004A0, "Member 'UWBP_DailyRitualTileClaimButtonWidget_C::CompletedGlowAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_DailyRitualTileClaimButtonWidget_C, GlowAnimation) == 0x0004A8, "Member 'UWBP_DailyRitualTileClaimButtonWidget_C::GlowAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_DailyRitualTileClaimButtonWidget_C, Icon) == 0x0004B0, "Member 'UWBP_DailyRitualTileClaimButtonWidget_C::Icon' has a wrong offset!");

}

