#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStatusEffects_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreStatusEffects_Item.WBP_CoreStatusEffects_Item_C
// 0x0140 (0x04C0 - 0x0380)
class UWBP_CoreStatusEffects_Item_C final : public UCoreStatusEffectIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GlowAnim;                                          // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LevelSwitcher;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressGauge;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressGaugeEmpty;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              StatusIcon;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStatusEffectViewData                  StatusEffectData;                                  // 0x03B8(0x0058)(Edit, BlueprintVisible)
	TMap<EStatusEffectType, struct FColor>        ProgressBarTints;                                  // 0x0410(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EStatusEffectType, struct FColor>        ProgressBarEmptyTints;                             // 0x0460(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          backgroundMaterial;                                // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CachedID;                                          // 0x04B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidget();
	void UpdatePercentageFill(float Percentage);
	void SetWidget();
	void SetGaugeFill(class UImage* GaugeImage, double Percentf);
	void ResetWidget();
	void PreConstruct(bool IsDesignTime);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_WBP_CoreStatusEffects_Item(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreStatusEffects_Item_C">();
	}
	static class UWBP_CoreStatusEffects_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreStatusEffects_Item_C>();
	}
};
static_assert(alignof(UWBP_CoreStatusEffects_Item_C) == 0x000008, "Wrong alignment on UWBP_CoreStatusEffects_Item_C");
static_assert(sizeof(UWBP_CoreStatusEffects_Item_C) == 0x0004C0, "Wrong size on UWBP_CoreStatusEffects_Item_C");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, UberGraphFrame) == 0x000380, "Member 'UWBP_CoreStatusEffects_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, GlowAnim) == 0x000388, "Member 'UWBP_CoreStatusEffects_Item_C::GlowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, Background) == 0x000390, "Member 'UWBP_CoreStatusEffects_Item_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, LevelSwitcher) == 0x000398, "Member 'UWBP_CoreStatusEffects_Item_C::LevelSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, ProgressGauge) == 0x0003A0, "Member 'UWBP_CoreStatusEffects_Item_C::ProgressGauge' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, ProgressGaugeEmpty) == 0x0003A8, "Member 'UWBP_CoreStatusEffects_Item_C::ProgressGaugeEmpty' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, StatusIcon) == 0x0003B0, "Member 'UWBP_CoreStatusEffects_Item_C::StatusIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, StatusEffectData) == 0x0003B8, "Member 'UWBP_CoreStatusEffects_Item_C::StatusEffectData' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, ProgressBarTints) == 0x000410, "Member 'UWBP_CoreStatusEffects_Item_C::ProgressBarTints' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, ProgressBarEmptyTints) == 0x000460, "Member 'UWBP_CoreStatusEffects_Item_C::ProgressBarEmptyTints' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, backgroundMaterial) == 0x0004B0, "Member 'UWBP_CoreStatusEffects_Item_C::backgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStatusEffects_Item_C, CachedID) == 0x0004B4, "Member 'UWBP_CoreStatusEffects_Item_C::CachedID' has a wrong offset!");

}

