#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileMenuRoot

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.ExecuteUbergraph_WBP_ProfileMenuRoot
// 0x0050 (0x0050 - 0x0000)
struct WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EProfileMenuState                             K2Node_Event_menuState;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_title;                                // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_subtitle;                             // 0x0038(0x0018)(ConstParm)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot) == 0x000008, "Wrong alignment on WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot");
static_assert(sizeof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot) == 0x000050, "Wrong size on WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot");
static_assert(offsetof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot, EntryPoint) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot, K2Node_Event_menuState) == 0x000018, "Member 'WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot::K2Node_Event_menuState' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot, K2Node_Event_title) == 0x000020, "Member 'WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot::K2Node_Event_title' has a wrong offset!");
static_assert(offsetof(WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot, K2Node_Event_subtitle) == 0x000038, "Member 'WBP_ProfileMenuRoot_C_ExecuteUbergraph_WBP_ProfileMenuRoot::K2Node_Event_subtitle' has a wrong offset!");

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.SetMenuState
// 0x0001 (0x0001 - 0x0000)
struct WBP_ProfileMenuRoot_C_SetMenuState final
{
public:
	EProfileMenuState                             MenuState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_SetMenuState) == 0x000001, "Wrong alignment on WBP_ProfileMenuRoot_C_SetMenuState");
static_assert(sizeof(WBP_ProfileMenuRoot_C_SetMenuState) == 0x000001, "Wrong size on WBP_ProfileMenuRoot_C_SetMenuState");
static_assert(offsetof(WBP_ProfileMenuRoot_C_SetMenuState, MenuState) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_SetMenuState::MenuState' has a wrong offset!");

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.SetSubtitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ProfileMenuRoot_C_SetSubtitle final
{
public:
	class FText                                   Subtitle;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_SetSubtitle) == 0x000008, "Wrong alignment on WBP_ProfileMenuRoot_C_SetSubtitle");
static_assert(sizeof(WBP_ProfileMenuRoot_C_SetSubtitle) == 0x000018, "Wrong size on WBP_ProfileMenuRoot_C_SetSubtitle");
static_assert(offsetof(WBP_ProfileMenuRoot_C_SetSubtitle, Subtitle) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_SetSubtitle::Subtitle' has a wrong offset!");

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ProfileMenuRoot_C_SetTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_SetTitle) == 0x000008, "Wrong alignment on WBP_ProfileMenuRoot_C_SetTitle");
static_assert(sizeof(WBP_ProfileMenuRoot_C_SetTitle) == 0x000018, "Wrong size on WBP_ProfileMenuRoot_C_SetTitle");
static_assert(offsetof(WBP_ProfileMenuRoot_C_SetTitle, Title) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_SetTitle::Title' has a wrong offset!");

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.GetProfileMenuBadgeInterface
// 0x0010 (0x0010 - 0x0000)
struct WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface final
{
public:
	TScriptInterface<class IProfileMenuCustomizationViewInterface> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface) == 0x000008, "Wrong alignment on WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface");
static_assert(sizeof(WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface) == 0x000010, "Wrong size on WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface");
static_assert(offsetof(WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface, ReturnValue) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_GetProfileMenuBadgeInterface::ReturnValue' has a wrong offset!");

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.GetProfileMenuBannerInterface
// 0x0010 (0x0010 - 0x0000)
struct WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface final
{
public:
	TScriptInterface<class IProfileMenuCustomizationViewInterface> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface) == 0x000008, "Wrong alignment on WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface");
static_assert(sizeof(WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface) == 0x000010, "Wrong size on WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface");
static_assert(offsetof(WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface, ReturnValue) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_GetProfileMenuBannerInterface::ReturnValue' has a wrong offset!");

// Function WBP_ProfileMenuRoot.WBP_ProfileMenuRoot_C.GetProfileMenuStatsInterface
// 0x0010 (0x0010 - 0x0000)
struct WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface final
{
public:
	TScriptInterface<class IProfileMenuStatsViewInterface> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface) == 0x000008, "Wrong alignment on WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface");
static_assert(sizeof(WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface) == 0x000010, "Wrong size on WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface");
static_assert(offsetof(WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface, ReturnValue) == 0x000000, "Member 'WBP_ProfileMenuRoot_C_GetProfileMenuStatsInterface::ReturnValue' has a wrong offset!");

}

