#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreStandardButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreStandardButton.WBP_CoreStandardButton_C
// 0x0060 (0x0538 - 0x04D8)
class UWBP_CoreStandardButton_C final : public UCoreKeyListenerButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               BackgroundContainer;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Bg;                                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RedTraitIMG;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              SmokeBG;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        PaddingText;                                       // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ActionMapping;                                     // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewVar;                                            // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreStandardButton(int32 EntryPoint);
	void OnAlignmentChanged(ETextJustify NewAlignment);
	void OnButtonVisibilityChanged(const EButtonWidgetVisibility PreviousVisibility, const EButtonWidgetVisibility NewVisibility);
	void OnEnabledChanged(bool Param_IsEnabled);
	void OnHovered();
	void OnPressed();
	void OnUnhovered();
	void Reset_Visuals(bool Param_IsEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreStandardButton_C">();
	}
	static class UWBP_CoreStandardButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreStandardButton_C>();
	}
};
static_assert(alignof(UWBP_CoreStandardButton_C) == 0x000008, "Wrong alignment on UWBP_CoreStandardButton_C");
static_assert(sizeof(UWBP_CoreStandardButton_C) == 0x000538, "Wrong size on UWBP_CoreStandardButton_C");
static_assert(offsetof(UWBP_CoreStandardButton_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_CoreStandardButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, Pressed) == 0x0004E0, "Member 'UWBP_CoreStandardButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, Hover) == 0x0004E8, "Member 'UWBP_CoreStandardButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, BackgroundContainer) == 0x0004F0, "Member 'UWBP_CoreStandardButton_C::BackgroundContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, Bg) == 0x0004F8, "Member 'UWBP_CoreStandardButton_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, Overlay) == 0x000500, "Member 'UWBP_CoreStandardButton_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, RedTraitIMG) == 0x000508, "Member 'UWBP_CoreStandardButton_C::RedTraitIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, SmokeBG) == 0x000510, "Member 'UWBP_CoreStandardButton_C::SmokeBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, PaddingText) == 0x000518, "Member 'UWBP_CoreStandardButton_C::PaddingText' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, ActionMapping) == 0x000520, "Member 'UWBP_CoreStandardButton_C::ActionMapping' has a wrong offset!");
static_assert(offsetof(UWBP_CoreStandardButton_C, NewVar) == 0x000530, "Member 'UWBP_CoreStandardButton_C::NewVar' has a wrong offset!");

}

