#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCustomizationItemSlotWrapper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCustomizationItemSlotWrapper.WBP_CoreCustomizationItemSlotWrapper_C.ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEmptySlot;                          // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetRealSize_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper) == 0x000008, "Wrong alignment on WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper");
static_assert(sizeof(WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper) == 0x000018, "Wrong size on WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper");
static_assert(offsetof(WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper, EntryPoint) == 0x000000, "Member 'WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper, K2Node_Event_isEmptySlot) == 0x000005, "Member 'WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper::K2Node_Event_isEmptySlot' has a wrong offset!");
static_assert(offsetof(WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper, CallFunc_GetRealSize_ReturnValue) == 0x000008, "Member 'WBP_CoreCustomizationItemSlotWrapper_C_ExecuteUbergraph_WBP_CoreCustomizationItemSlotWrapper::CallFunc_GetRealSize_ReturnValue' has a wrong offset!");

// Function WBP_CoreCustomizationItemSlotWrapper.WBP_CoreCustomizationItemSlotWrapper_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct");
static_assert(sizeof(WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct");
static_assert(offsetof(WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreCustomizationItemSlotWrapper_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreCustomizationItemSlotWrapper.WBP_CoreCustomizationItemSlotWrapper_C.SetAsEmptySlot
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot final
{
public:
	bool                                          IsEmptySlot;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot) == 0x000001, "Wrong alignment on WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot");
static_assert(sizeof(WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot) == 0x000001, "Wrong size on WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot");
static_assert(offsetof(WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot, IsEmptySlot) == 0x000000, "Member 'WBP_CoreCustomizationItemSlotWrapper_C_SetAsEmptySlot::IsEmptySlot' has a wrong offset!");

}

