#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreArrowButton

#include "Basic.hpp"

#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreArrowButton.WBP_CoreArrowButton_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreArrowButton_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArrowButton_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreArrowButton_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreArrowButton_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreArrowButton_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreArrowButton_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreArrowButton_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreArrowButton.WBP_CoreArrowButton_C.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreArrowButton_C_OnAlignmentChanged final
{
public:
	ETextJustify                                  NewAlignment;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArrowButton_C_OnAlignmentChanged) == 0x000001, "Wrong alignment on WBP_CoreArrowButton_C_OnAlignmentChanged");
static_assert(sizeof(WBP_CoreArrowButton_C_OnAlignmentChanged) == 0x000001, "Wrong size on WBP_CoreArrowButton_C_OnAlignmentChanged");
static_assert(offsetof(WBP_CoreArrowButton_C_OnAlignmentChanged, NewAlignment) == 0x000000, "Member 'WBP_CoreArrowButton_C_OnAlignmentChanged::NewAlignment' has a wrong offset!");

// Function WBP_CoreArrowButton.WBP_CoreArrowButton_C.ExecuteUbergraph_WBP_CoreArrowButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Event_newAlignment;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_2;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_3;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton) == 0x000008, "Wrong alignment on WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton");
static_assert(sizeof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton) == 0x000028, "Wrong size on WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, EntryPoint) == 0x000000, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, K2Node_Event_newAlignment) == 0x000020, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::K2Node_Event_newAlignment' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_IsEnabled_ReturnValue) == 0x000022, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_IsEnabled_ReturnValue_1) == 0x000023, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_IsEnabled_ReturnValue_2) == 0x000024, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_IsEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, CallFunc_IsEnabled_ReturnValue_3) == 0x000025, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::CallFunc_IsEnabled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton, K2Node_Event_isEnabled) == 0x000026, "Member 'WBP_CoreArrowButton_C_ExecuteUbergraph_WBP_CoreArrowButton::K2Node_Event_isEnabled' has a wrong offset!");

}

