#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerCardButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CorePlayerCardButton.WBP_CorePlayerCardButton_C.SetAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_CorePlayerCardButton_C_SetAnimation final
{
public:
	class UClass*                                 AnimationWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerCardButton_C_SetAnimation) == 0x000008, "Wrong alignment on WBP_CorePlayerCardButton_C_SetAnimation");
static_assert(sizeof(WBP_CorePlayerCardButton_C_SetAnimation) == 0x000008, "Wrong size on WBP_CorePlayerCardButton_C_SetAnimation");
static_assert(offsetof(WBP_CorePlayerCardButton_C_SetAnimation, AnimationWidget) == 0x000000, "Member 'WBP_CorePlayerCardButton_C_SetAnimation::AnimationWidget' has a wrong offset!");

// Function WBP_CorePlayerCardButton.WBP_CorePlayerCardButton_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePlayerCardButton_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerCardButton_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CorePlayerCardButton_C_OnEnabledChanged");
static_assert(sizeof(WBP_CorePlayerCardButton_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CorePlayerCardButton_C_OnEnabledChanged");
static_assert(offsetof(WBP_CorePlayerCardButton_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CorePlayerCardButton_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CorePlayerCardButton.WBP_CorePlayerCardButton_C.ExecuteUbergraph_WBP_CorePlayerCardButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton) == 0x000004, "Wrong alignment on WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton");
static_assert(sizeof(WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton) == 0x000008, "Wrong size on WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton");
static_assert(offsetof(WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton, EntryPoint) == 0x000000, "Member 'WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton, K2Node_Event_isEnabled) == 0x000004, "Member 'WBP_CorePlayerCardButton_C_ExecuteUbergraph_WBP_CorePlayerCardButton::K2Node_Event_isEnabled' has a wrong offset!");

// Function WBP_CorePlayerCardButton.WBP_CorePlayerCardButton_C.SetIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_CorePlayerCardButton_C_SetIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerCardButton_C_SetIcon) == 0x000008, "Wrong alignment on WBP_CorePlayerCardButton_C_SetIcon");
static_assert(sizeof(WBP_CorePlayerCardButton_C_SetIcon) == 0x000038, "Wrong size on WBP_CorePlayerCardButton_C_SetIcon");
static_assert(offsetof(WBP_CorePlayerCardButton_C_SetIcon, Icon) == 0x000000, "Member 'WBP_CorePlayerCardButton_C_SetIcon::Icon' has a wrong offset!");

}

