#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePremiumCurrencyButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CorePremiumCurrencyButton.WBP_CorePremiumCurrencyButton_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePremiumCurrencyButton_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePremiumCurrencyButton_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CorePremiumCurrencyButton_C_OnEnabledChanged");
static_assert(sizeof(WBP_CorePremiumCurrencyButton_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CorePremiumCurrencyButton_C_OnEnabledChanged");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CorePremiumCurrencyButton_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CorePremiumCurrencyButton.WBP_CorePremiumCurrencyButton_C.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged final
{
public:
	ETextJustify                                  NewAlignment;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged) == 0x000001, "Wrong alignment on WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged");
static_assert(sizeof(WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged) == 0x000001, "Wrong size on WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged, NewAlignment) == 0x000000, "Member 'WBP_CorePremiumCurrencyButton_C_OnAlignmentChanged::NewAlignment' has a wrong offset!");

// Function WBP_CorePremiumCurrencyButton.WBP_CorePremiumCurrencyButton_C.ExecuteUbergraph_WBP_CorePremiumCurrencyButton
// 0x0098 (0x0098 - 0x0000)
struct WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  K2Node_Event_newAlignment;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast_1;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton) == 0x000008, "Wrong alignment on WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton");
static_assert(sizeof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton) == 0x000098, "Wrong size on WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, EntryPoint) == 0x000000, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, CallFunc_MakeVector2D_ReturnValue_1) == 0x000020, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_MakeStruct_Margin_1) == 0x000040, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_Event_newAlignment) == 0x000050, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_Event_newAlignment' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_DynamicCast_AsOverlay_Slot) == 0x000058, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_DynamicCast_AsOverlay_Slot_1) == 0x000068, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_DynamicCast_AsOverlay_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_Event_isEnabled) == 0x000071, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_MakeStruct_Right_ImplicitCast) == 0x000090, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton, K2Node_MakeStruct_Right_ImplicitCast_1) == 0x000094, "Member 'WBP_CorePremiumCurrencyButton_C_ExecuteUbergraph_WBP_CorePremiumCurrencyButton::K2Node_MakeStruct_Right_ImplicitCast_1' has a wrong offset!");

}

