#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreArchiveTomeProgress_LevelContainer

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreArchiveTomeProgress_LevelContainer.WBP_CoreArchiveTomeProgress_LevelContainer_C.UpdateVisual
// 0x0002 (0x0002 - 0x0000)
struct WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual final
{
public:
	EArchivesStoryLevelStatus                     GlobalStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_PlayAnimation;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual) == 0x000001, "Wrong alignment on WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual");
static_assert(sizeof(WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual) == 0x000002, "Wrong size on WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual, GlobalStatus) == 0x000000, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual::GlobalStatus' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual, Param_PlayAnimation) == 0x000001, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_UpdateVisual::Param_PlayAnimation' has a wrong offset!");

// Function WBP_CoreArchiveTomeProgress_LevelContainer.WBP_CoreArchiveTomeProgress_LevelContainer_C.SetCompletionVisuals
// 0x0030 (0x0030 - 0x0000)
struct WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals final
{
public:
	EArchivesStoryLevelStatus                     CompletionStatus;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_PlayAnimation;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals) == 0x000008, "Wrong alignment on WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals");
static_assert(sizeof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals) == 0x000030, "Wrong size on WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, CompletionStatus) == 0x000000, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::CompletionStatus' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, Param_PlayAnimation) == 0x000001, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::Param_PlayAnimation' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, K2Node_SwitchEnum_CmpSuccess_1) == 0x000003, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_SetCompletionVisuals::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function WBP_CoreArchiveTomeProgress_LevelContainer.WBP_CoreArchiveTomeProgress_LevelContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct");
static_assert(sizeof(WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreArchiveTomeProgress_LevelContainer.WBP_CoreArchiveTomeProgress_LevelContainer_C.ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer
// 0x0038 (0x0038 - 0x0000)
struct WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectPrevious_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectNext_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EArchivesStoryLevelStatus                     K2Node_Event_globalStatus;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_playAnimation;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer) == 0x000008, "Wrong alignment on WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer");
static_assert(sizeof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer) == 0x000038, "Wrong size on WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, EntryPoint) == 0x000000, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, CallFunc_SelectPrevious_ReturnValue) == 0x000005, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::CallFunc_SelectPrevious_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, CallFunc_SelectNext_ReturnValue) == 0x000006, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::CallFunc_SelectNext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, K2Node_Event_globalStatus) == 0x000007, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::K2Node_Event_globalStatus' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, K2Node_Event_playAnimation) == 0x000008, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::K2Node_Event_playAnimation' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_CoreArchiveTomeProgress_LevelContainer_C_ExecuteUbergraph_WBP_CoreArchiveTomeProgress_LevelContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

