#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreDBDLogo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreDBDLogo.WBP_CoreDBDLogo_C.ExecuteUbergraph_WBP_CoreDBDLogo
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_play;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo) == 0x000008, "Wrong alignment on WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo");
static_assert(sizeof(WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo) == 0x000010, "Wrong size on WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo");
static_assert(offsetof(WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo, EntryPoint) == 0x000000, "Member 'WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo, K2Node_CustomEvent_play) == 0x000005, "Member 'WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo::K2Node_CustomEvent_play' has a wrong offset!");
static_assert(offsetof(WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreDBDLogo_C_ExecuteUbergraph_WBP_CoreDBDLogo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_CoreDBDLogo.WBP_CoreDBDLogo_C.PlayLogoAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreDBDLogo_C_PlayLogoAnim final
{
public:
	bool                                          Play;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreDBDLogo_C_PlayLogoAnim) == 0x000001, "Wrong alignment on WBP_CoreDBDLogo_C_PlayLogoAnim");
static_assert(sizeof(WBP_CoreDBDLogo_C_PlayLogoAnim) == 0x000001, "Wrong size on WBP_CoreDBDLogo_C_PlayLogoAnim");
static_assert(offsetof(WBP_CoreDBDLogo_C_PlayLogoAnim, Play) == 0x000000, "Member 'WBP_CoreDBDLogo_C_PlayLogoAnim::Play' has a wrong offset!");

// Function WBP_CoreDBDLogo.WBP_CoreDBDLogo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreDBDLogo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreDBDLogo_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreDBDLogo_C_PreConstruct");
static_assert(sizeof(WBP_CoreDBDLogo_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreDBDLogo_C_PreConstruct");
static_assert(offsetof(WBP_CoreDBDLogo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreDBDLogo_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

