#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HudEffectCard

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HudEffectCard.WBP_HudEffectCard_C.UpdateTimerFeedback
// 0x0004 (0x0004 - 0x0000)
struct WBP_HudEffectCard_C_UpdateTimerFeedback final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HudEffectCard_C_UpdateTimerFeedback) == 0x000004, "Wrong alignment on WBP_HudEffectCard_C_UpdateTimerFeedback");
static_assert(sizeof(WBP_HudEffectCard_C_UpdateTimerFeedback) == 0x000004, "Wrong size on WBP_HudEffectCard_C_UpdateTimerFeedback");
static_assert(offsetof(WBP_HudEffectCard_C_UpdateTimerFeedback, ElapsedTime) == 0x000000, "Member 'WBP_HudEffectCard_C_UpdateTimerFeedback::ElapsedTime' has a wrong offset!");

// Function WBP_HudEffectCard.WBP_HudEffectCard_C.RotateCards
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_HudEffectCard_C_RotateCards final
{
public:
	bool                                          IsFutureCardValid;                                 // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectCardViewData                    FutureCardViewData;                                // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HudEffectCard_C_RotateCards) == 0x000008, "Wrong alignment on WBP_HudEffectCard_C_RotateCards");
static_assert(sizeof(WBP_HudEffectCard_C_RotateCards) == 0x0000E0, "Wrong size on WBP_HudEffectCard_C_RotateCards");
static_assert(offsetof(WBP_HudEffectCard_C_RotateCards, IsFutureCardValid) == 0x000000, "Member 'WBP_HudEffectCard_C_RotateCards::IsFutureCardValid' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_RotateCards, FutureCardViewData) == 0x000008, "Member 'WBP_HudEffectCard_C_RotateCards::FutureCardViewData' has a wrong offset!");

// Function WBP_HudEffectCard.WBP_HudEffectCard_C.OnTweens Completed
// 0x0008 (0x0008 - 0x0000)
struct WBP_HudEffectCard_C_OnTweens_Completed final
{
public:
	class UUITweenInstance*                       Tween;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HudEffectCard_C_OnTweens_Completed) == 0x000008, "Wrong alignment on WBP_HudEffectCard_C_OnTweens_Completed");
static_assert(sizeof(WBP_HudEffectCard_C_OnTweens_Completed) == 0x000008, "Wrong size on WBP_HudEffectCard_C_OnTweens_Completed");
static_assert(offsetof(WBP_HudEffectCard_C_OnTweens_Completed, Tween) == 0x000000, "Member 'WBP_HudEffectCard_C_OnTweens_Completed::Tween' has a wrong offset!");

// Function WBP_HudEffectCard.WBP_HudEffectCard_C.InitCards
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_HudEffectCard_C_InitCards final
{
public:
	struct FEffectCardViewData                    CurrentCardViewData;                               // 0x0000(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEffectCardViewData                    NextCardViewData;                                  // 0x00D8(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HudEffectCard_C_InitCards) == 0x000008, "Wrong alignment on WBP_HudEffectCard_C_InitCards");
static_assert(sizeof(WBP_HudEffectCard_C_InitCards) == 0x0001B0, "Wrong size on WBP_HudEffectCard_C_InitCards");
static_assert(offsetof(WBP_HudEffectCard_C_InitCards, CurrentCardViewData) == 0x000000, "Member 'WBP_HudEffectCard_C_InitCards::CurrentCardViewData' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_InitCards, NextCardViewData) == 0x0000D8, "Member 'WBP_HudEffectCard_C_InitCards::NextCardViewData' has a wrong offset!");

// Function WBP_HudEffectCard.WBP_HudEffectCard_C.ExecuteUbergraph_WBP_HudEffectCard
// 0x06D8 (0x06D8 - 0x0000)
struct WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isFutureCardValid;                    // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectCardViewData                    K2Node_Event_futureCardViewData;                   // 0x0018(0x00D8)(ConstParm)
	bool                                          K2Node_Event_isSecondPoint;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_withAnimation;                        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue_1;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_elapsedTime;                          // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue;                    // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_1;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_1;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEffectCardViewData                    K2Node_Event_currentCardViewData;                  // 0x0190(0x00D8)(ConstParm)
	struct FEffectCardViewData                    K2Node_Event_nextCardViewData;                     // 0x0268(0x00D8)(ConstParm)
	TScriptInterface<class IEffectCardViewInterface> CallFunc_SetData_self_CastInput;                   // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectCardViewInterface> CallFunc_SetData_self_CastInput_1;                 // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectCardViewInterface> CallFunc_SetData_self_CastInput_2;                 // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue_2;           // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUITweenInstance* Tween)> K2Node_CreateDelegate_OutputDelegate;              // 0x0380(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0398(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       K2Node_CustomEvent_tween_1;                        // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_6;           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03C8(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_2;                     // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromTranslation_ReturnValue;              // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_3;                     // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToTranslation_ReturnValue;                // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromRotation_ReturnValue;                 // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToRotation_ReturnValue;                   // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromMaterialScalarParameter_ReturnValue;  // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_ToMaterialScalarParameter_ReturnValue;    // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_4;                     // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromTranslation_ReturnValue_1;            // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Array_Get_Item;                           // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToTranslation_ReturnValue_1;              // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromScale_ReturnValue;                    // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_ToScale_ReturnValue;                      // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromRotation_ReturnValue_1;               // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToRotation_ReturnValue_1;                 // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromOpacity_ReturnValue;                  // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_5;                     // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_2;                  // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromTranslation_ReturnValue_2;            // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_ToTranslation_ReturnValue_2;              // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       K2Node_CustomEvent_tween;                          // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromScale_ReturnValue_1;                  // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToScale_ReturnValue_1;                    // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_6;                     // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromRotation_ReturnValue_2;               // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromTranslation_ReturnValue_3;            // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToRotation_ReturnValue_2;                 // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToTranslation_ReturnValue_3;              // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromOpacity_ReturnValue_1;                // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromScale_ReturnValue_2;                  // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_3;                  // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToScale_ReturnValue_2;                    // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_FromRotation_ReturnValue_3;               // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToRotation_ReturnValue_3;                 // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_7;                     // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromOpacity_ReturnValue_2;                // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromTranslation_ReturnValue_4;            // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_4;                  // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToTranslation_ReturnValue_4;              // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromScale_ReturnValue_3;                  // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_ToScale_ReturnValue_3;                    // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromRotation_ReturnValue_4;               // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUITweenInstance* Tween)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0570(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITweenInstance*                       CallFunc_ToRotation_ReturnValue_4;                 // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_FromOpacity_ReturnValue_3;                // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToOpacity_ReturnValue_5;                  // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD[0x3];                                      // 0x05AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2[0x6];                                      // 0x05D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x05D8(0x0038)(NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0610(0x0038)(NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_2;               // 0x0648(0x0038)(NoDestructor)
	float                                         CallFunc_ToOpacity_targetValue_ImplicitCast;       // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromOpacity_startValue_ImplicitCast;      // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToRotation_targetValue_ImplicitCast;      // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromRotation_startValue_ImplicitCast;     // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToOpacity_targetValue_ImplicitCast_1;     // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromOpacity_startValue_ImplicitCast_1;    // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToRotation_targetValue_ImplicitCast_1;    // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromRotation_startValue_ImplicitCast_1;   // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToOpacity_targetValue_ImplicitCast_2;     // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromOpacity_startValue_ImplicitCast_2;    // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToRotation_targetValue_ImplicitCast_2;    // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromRotation_startValue_ImplicitCast_2;   // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToOpacity_targetValue_ImplicitCast_3;     // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromOpacity_startValue_ImplicitCast_3;    // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToRotation_targetValue_ImplicitCast_3;    // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromRotation_startValue_ImplicitCast_3;   // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2; // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Angle_ImplicitCast;              // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Angle_ImplicitCast_1;            // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Angle_ImplicitCast_2;            // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard) == 0x000008, "Wrong alignment on WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard");
static_assert(sizeof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard) == 0x0006D8, "Wrong size on WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, EntryPoint) == 0x000000, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_isFutureCardValid) == 0x000010, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_isFutureCardValid' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_futureCardViewData) == 0x000018, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_futureCardViewData' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_isSecondPoint) == 0x0000F0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_isSecondPoint' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_withAnimation) == 0x0000F1, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_withAnimation' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Greater_ByteByte_ReturnValue) == 0x0000F2, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_PlayAnimation_ReturnValue) == 0x0000F8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_PlayAnimation_ReturnValue_1) == 0x000100, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Greater_ByteByte_ReturnValue_1) == 0x000108, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Greater_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000110, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_elapsedTime) == 0x000118, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_elapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue) == 0x000120, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_ReturnValue) == 0x000128, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_1) == 0x000130, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_ReturnValue_1) == 0x000138, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000140, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000148, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000150, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000158, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000160, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_PlayAnimation_ReturnValue_2) == 0x000168, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_PlayAnimation_ReturnValue_3) == 0x000170, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_PlayAnimation_ReturnValue_4) == 0x000178, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000180, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000188, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_currentCardViewData) == 0x000190, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_currentCardViewData' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_Event_nextCardViewData) == 0x000268, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_Event_nextCardViewData' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SetData_self_CastInput) == 0x000340, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SetData_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SetData_self_CastInput_1) == 0x000350, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SetData_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SetData_self_CastInput_2) == 0x000360, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SetData_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Greater_ByteByte_ReturnValue_2) == 0x000370, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Greater_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x000378, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_CreateDelegate_OutputDelegate) == 0x000380, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_IsValid_ReturnValue) == 0x000394, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000398, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_CustomEvent_tween_1) == 0x0003B0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_CustomEvent_tween_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Length_ReturnValue) == 0x0003B8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_SlotAsCanvasSlot_ReturnValue_6) == 0x0003C0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_SlotAsCanvasSlot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003C8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_2) == 0x0003E0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromTranslation_ReturnValue) == 0x0003E8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromTranslation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_3) == 0x0003F0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToTranslation_ReturnValue) == 0x0003F8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToTranslation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_ReturnValue) == 0x000400, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_ReturnValue) == 0x000408, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromMaterialScalarParameter_ReturnValue) == 0x000410, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromMaterialScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Add_ReturnValue) == 0x000418, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToMaterialScalarParameter_ReturnValue) == 0x000420, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToMaterialScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Add_ReturnValue_1) == 0x000428, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, Temp_int_Variable) == 0x00042C, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Add_IntInt_ReturnValue) == 0x000430, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_4) == 0x000438, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromTranslation_ReturnValue_1) == 0x000440, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromTranslation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Get_Item) == 0x000448, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToTranslation_ReturnValue_1) == 0x000450, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToTranslation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromScale_ReturnValue) == 0x000458, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Less_IntInt_ReturnValue) == 0x000460, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToScale_ReturnValue) == 0x000468, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_ReturnValue_1) == 0x000470, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_ReturnValue_1) == 0x000478, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_ReturnValue) == 0x000480, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_5) == 0x000488, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_ReturnValue_2) == 0x000490, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromTranslation_ReturnValue_2) == 0x000498, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromTranslation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Add_ReturnValue_2) == 0x0004A0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToTranslation_ReturnValue_2) == 0x0004A8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToTranslation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_CustomEvent_tween) == 0x0004B0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_CustomEvent_tween' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromScale_ReturnValue_1) == 0x0004B8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToScale_ReturnValue_1) == 0x0004C0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_6) == 0x0004C8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_ReturnValue_2) == 0x0004D0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromTranslation_ReturnValue_3) == 0x0004D8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromTranslation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_ReturnValue_2) == 0x0004E0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToTranslation_ReturnValue_3) == 0x0004E8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToTranslation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_ReturnValue_1) == 0x0004F0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromScale_ReturnValue_2) == 0x0004F8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromScale_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_ReturnValue_3) == 0x000500, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToScale_ReturnValue_2) == 0x000508, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToScale_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Add_ReturnValue_3) == 0x000510, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_ReturnValue_3) == 0x000518, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_ReturnValue_3) == 0x000520, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Create_ReturnValue_7) == 0x000528, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_ReturnValue_2) == 0x000530, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromTranslation_ReturnValue_4) == 0x000538, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromTranslation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_ReturnValue_4) == 0x000540, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToTranslation_ReturnValue_4) == 0x000548, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToTranslation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromScale_ReturnValue_3) == 0x000550, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromScale_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Add_ReturnValue_4) == 0x000558, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToScale_ReturnValue_3) == 0x000560, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToScale_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_ReturnValue_4) == 0x000568, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_CreateDelegate_OutputDelegate_3) == 0x000570, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_ReturnValue_4) == 0x000588, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_ReturnValue_3) == 0x000590, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_PlayAnimation_ReturnValue_5) == 0x000598, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_ReturnValue_5) == 0x0005A0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Array_Add_ReturnValue_5) == 0x0005A8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_Not_PreBool_ReturnValue) == 0x0005AC, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0005B0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0005B8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0005C0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0005C8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_IsValid_ReturnValue_1) == 0x0005D0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_IsValid_ReturnValue_2) == 0x0005D1, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_MakeStruct_WidgetTransform) == 0x0005D8, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_MakeStruct_WidgetTransform_1) == 0x000610, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_MakeStruct_WidgetTransform_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, K2Node_MakeStruct_WidgetTransform_2) == 0x000648, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::K2Node_MakeStruct_WidgetTransform_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_targetValue_ImplicitCast) == 0x000680, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_targetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_startValue_ImplicitCast) == 0x000684, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_startValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_targetValue_ImplicitCast) == 0x000688, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_targetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_startValue_ImplicitCast) == 0x00068C, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_startValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_targetValue_ImplicitCast_1) == 0x000690, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_targetValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_startValue_ImplicitCast_1) == 0x000694, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_startValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToRotation_targetValue_ImplicitCast_1) == 0x000698, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToRotation_targetValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromRotation_startValue_ImplicitCast_1) == 0x00069C, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromRotation_startValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_ToOpacity_targetValue_ImplicitCast_2) == 0x0006A0, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_ToOpacity_targetValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard, CallFunc_FromOpacity_startValue_ImplicitCast_2) == 0x0006A4, "Member 'WBP_HudEffectCard_C_ExecuteUbergraph_WBP_HudEffectCard::CallFunc_FromOpacity_startValue_ImplicitCast_2' has a wrong offset!");
