#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerStatusesContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePlayerStatusesContainer.WBP_CorePlayerStatusesContainer_C
// 0x0028 (0x03A0 - 0x0378)
class UWBP_CorePlayerStatusesContainer_C final : public UCorePlayerStatusesContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CorePlayerStatus_C*                PlayerStatus0;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CorePlayerStatus_C*                PlayerStatus1;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CorePlayerStatus_C*                PlayerStatus2;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CorePlayerStatus_C*                PlayerStatus3;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetTutorialHighlight(const bool Show, const EHudComponent& ComponentId);
	void ExecuteUbergraph_WBP_CorePlayerStatusesContainer(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePlayerStatusesContainer_C">();
	}
	static class UWBP_CorePlayerStatusesContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePlayerStatusesContainer_C>();
	}
};
static_assert(alignof(UWBP_CorePlayerStatusesContainer_C) == 0x000008, "Wrong alignment on UWBP_CorePlayerStatusesContainer_C");
static_assert(sizeof(UWBP_CorePlayerStatusesContainer_C) == 0x0003A0, "Wrong size on UWBP_CorePlayerStatusesContainer_C");
static_assert(offsetof(UWBP_CorePlayerStatusesContainer_C, UberGraphFrame) == 0x000378, "Member 'UWBP_CorePlayerStatusesContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerStatusesContainer_C, PlayerStatus0) == 0x000380, "Member 'UWBP_CorePlayerStatusesContainer_C::PlayerStatus0' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerStatusesContainer_C, PlayerStatus1) == 0x000388, "Member 'UWBP_CorePlayerStatusesContainer_C::PlayerStatus1' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerStatusesContainer_C, PlayerStatus2) == 0x000390, "Member 'UWBP_CorePlayerStatusesContainer_C::PlayerStatus2' has a wrong offset!");
static_assert(offsetof(UWBP_CorePlayerStatusesContainer_C, PlayerStatus3) == 0x000398, "Member 'UWBP_CorePlayerStatusesContainer_C::PlayerStatus3' has a wrong offset!");

}

