#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreLabelTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreLabelTooltip.WBP_CoreLabelTooltip_C.ExecuteUbergraph_WBP_CoreLabelTooltip
// 0x0028 (0x0028 - 0x0000)
struct WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip) == 0x000008, "Wrong alignment on WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip");
static_assert(sizeof(WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip) == 0x000028, "Wrong size on WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip");
static_assert(offsetof(WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip, EntryPoint) == 0x000000, "Member 'WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_CoreLabelTooltip_C_ExecuteUbergraph_WBP_CoreLabelTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CoreLabelTooltip.WBP_CoreLabelTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreLabelTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreLabelTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreLabelTooltip_C_PreConstruct");
static_assert(sizeof(WBP_CoreLabelTooltip_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreLabelTooltip_C_PreConstruct");
static_assert(offsetof(WBP_CoreLabelTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreLabelTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

