#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreTooltipDisabledItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreTooltipDisabledItem.WBP_CoreTooltipDisabledItem_C
// 0x0038 (0x02E0 - 0x02A8)
class UWBP_CoreTooltipDisabledItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              Bg;                                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DisabledByGamemode;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          DisabledMessageText;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Icon;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KillSwitch;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          KillswitchMessageText;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreTooltipDisabledItem(int32 EntryPoint);
	void SetTooltipData(EDisabledItemOption DisabledItemOption, const class FText& DisabledMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreTooltipDisabledItem_C">();
	}
	static class UWBP_CoreTooltipDisabledItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreTooltipDisabledItem_C>();
	}
};
static_assert(alignof(UWBP_CoreTooltipDisabledItem_C) == 0x000008, "Wrong alignment on UWBP_CoreTooltipDisabledItem_C");
static_assert(sizeof(UWBP_CoreTooltipDisabledItem_C) == 0x0002E0, "Wrong size on UWBP_CoreTooltipDisabledItem_C");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_CoreTooltipDisabledItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, Bg) == 0x0002B0, "Member 'UWBP_CoreTooltipDisabledItem_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, DisabledByGamemode) == 0x0002B8, "Member 'UWBP_CoreTooltipDisabledItem_C::DisabledByGamemode' has a wrong offset!");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, DisabledMessageText) == 0x0002C0, "Member 'UWBP_CoreTooltipDisabledItem_C::DisabledMessageText' has a wrong offset!");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, Icon) == 0x0002C8, "Member 'UWBP_CoreTooltipDisabledItem_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, KillSwitch) == 0x0002D0, "Member 'UWBP_CoreTooltipDisabledItem_C::KillSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_CoreTooltipDisabledItem_C, KillswitchMessageText) == 0x0002D8, "Member 'UWBP_CoreTooltipDisabledItem_C::KillswitchMessageText' has a wrong offset!");

}

