#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreObjectiveRewardLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreObjectiveRewardLabel.WBP_CoreObjectiveRewardLabel_C
// 0x0040 (0x0360 - 0x0320)
class UWBP_CoreObjectiveRewardLabel_C final : public UObjectiveRewardLabelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDTextBlock*                          Equal;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              GlowBackground;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainPanel;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              MarkerIcon;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ProgressTB;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RewardIcon;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          RewardTB;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreObjectiveRewardLabel(int32 EntryPoint);
	void SetData(const struct FObjectiveRewardLabelViewData& ViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreObjectiveRewardLabel_C">();
	}
	static class UWBP_CoreObjectiveRewardLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreObjectiveRewardLabel_C>();
	}
};
static_assert(alignof(UWBP_CoreObjectiveRewardLabel_C) == 0x000008, "Wrong alignment on UWBP_CoreObjectiveRewardLabel_C");
static_assert(sizeof(UWBP_CoreObjectiveRewardLabel_C) == 0x000360, "Wrong size on UWBP_CoreObjectiveRewardLabel_C");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, UberGraphFrame) == 0x000320, "Member 'UWBP_CoreObjectiveRewardLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, Equal) == 0x000328, "Member 'UWBP_CoreObjectiveRewardLabel_C::Equal' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, GlowBackground) == 0x000330, "Member 'UWBP_CoreObjectiveRewardLabel_C::GlowBackground' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, MainPanel) == 0x000338, "Member 'UWBP_CoreObjectiveRewardLabel_C::MainPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, MarkerIcon) == 0x000340, "Member 'UWBP_CoreObjectiveRewardLabel_C::MarkerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, ProgressTB) == 0x000348, "Member 'UWBP_CoreObjectiveRewardLabel_C::ProgressTB' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, RewardIcon) == 0x000350, "Member 'UWBP_CoreObjectiveRewardLabel_C::RewardIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreObjectiveRewardLabel_C, RewardTB) == 0x000358, "Member 'UWBP_CoreObjectiveRewardLabel_C::RewardTB' has a wrong offset!");

}

