#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAuricCellsFirstPurchaseBanner

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreAuricCellsFirstPurchaseBanner.WBP_CoreAuricCellsFirstPurchaseBanner_C.SetFirstPurchaseData
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData final
{
public:
	struct FAuricCellsFirstPurchaseViewData       FirstPurchaseData;                                 // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DateTimeDateTime_ReturnValue;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerFlagViewData                     K2Node_MakeStruct_TimerFlagViewData;               // 0x0078(0x0030)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData) == 0x000008, "Wrong alignment on WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData");
static_assert(sizeof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData) == 0x0000E8, "Wrong size on WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, FirstPurchaseData) == 0x000000, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::FirstPurchaseData' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, CallFunc_Now_ReturnValue) == 0x000068, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, CallFunc_Less_DateTimeDateTime_ReturnValue) == 0x000070, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::CallFunc_Less_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, K2Node_MakeStruct_TimerFlagViewData) == 0x000078, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::K2Node_MakeStruct_TimerFlagViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, Temp_bool_Variable) == 0x0000D8, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_CoreAuricCellsFirstPurchaseBanner_C_SetFirstPurchaseData::K2Node_Select_Default' has a wrong offset!");

}

