#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePrestigeWidget

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CorePrestigeWidget.WBP_CorePrestigeWidget_C.UpdateProgressFill
// 0x0018 (0x0018 - 0x0000)
struct WBP_CorePrestigeWidget_C_UpdateProgressFill final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePrestigeWidget_C_UpdateProgressFill) == 0x000008, "Wrong alignment on WBP_CorePrestigeWidget_C_UpdateProgressFill");
static_assert(sizeof(WBP_CorePrestigeWidget_C_UpdateProgressFill) == 0x000018, "Wrong size on WBP_CorePrestigeWidget_C_UpdateProgressFill");
static_assert(offsetof(WBP_CorePrestigeWidget_C_UpdateProgressFill, Progress) == 0x000000, "Member 'WBP_CorePrestigeWidget_C_UpdateProgressFill::Progress' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_UpdateProgressFill, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CorePrestigeWidget_C_UpdateProgressFill::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_UpdateProgressFill, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CorePrestigeWidget_C_UpdateProgressFill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_UpdateProgressFill, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000014, "Member 'WBP_CorePrestigeWidget_C_UpdateProgressFill::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CorePrestigeWidget.WBP_CorePrestigeWidget_C.SetData
// 0x000C (0x000C - 0x0000)
struct WBP_CorePrestigeWidget_C_SetData final
{
public:
	struct FPrestigeViewData                      Data;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          HideClaws;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePrestigeWidget_C_SetData) == 0x000004, "Wrong alignment on WBP_CorePrestigeWidget_C_SetData");
static_assert(sizeof(WBP_CorePrestigeWidget_C_SetData) == 0x00000C, "Wrong size on WBP_CorePrestigeWidget_C_SetData");
static_assert(offsetof(WBP_CorePrestigeWidget_C_SetData, Data) == 0x000000, "Member 'WBP_CorePrestigeWidget_C_SetData::Data' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_SetData, HideClaws) == 0x000008, "Member 'WBP_CorePrestigeWidget_C_SetData::HideClaws' has a wrong offset!");

// Function WBP_CorePrestigeWidget.WBP_CorePrestigeWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePrestigeWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePrestigeWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CorePrestigeWidget_C_PreConstruct");
static_assert(sizeof(WBP_CorePrestigeWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_CorePrestigeWidget_C_PreConstruct");
static_assert(offsetof(WBP_CorePrestigeWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CorePrestigeWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CorePrestigeWidget.WBP_CorePrestigeWidget_C.ExecuteUbergraph_WBP_CorePrestigeWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrestigeViewData                      K2Node_Event_data;                                 // 0x0004(0x0008)(ConstParm, NoDestructor)
	bool                                          K2Node_Event_hideClaws;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrestigeViewData                      K2Node_MakeStruct_PrestigeViewData;                // 0x0010(0x0008)(NoDestructor)
	double                                        CallFunc_UpdateProgressFill_Progress_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget) == 0x000008, "Wrong alignment on WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget");
static_assert(sizeof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget) == 0x000020, "Wrong size on WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, EntryPoint) == 0x000000, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, K2Node_Event_data) == 0x000004, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, K2Node_Event_hideClaws) == 0x00000C, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::K2Node_Event_hideClaws' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, K2Node_Event_IsDesignTime) == 0x00000E, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, K2Node_MakeStruct_PrestigeViewData) == 0x000010, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::K2Node_MakeStruct_PrestigeViewData' has a wrong offset!");
static_assert(offsetof(WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget, CallFunc_UpdateProgressFill_Progress_ImplicitCast) == 0x000018, "Member 'WBP_CorePrestigeWidget_C_ExecuteUbergraph_WBP_CorePrestigeWidget::CallFunc_UpdateProgressFill_Progress_ImplicitCast' has a wrong offset!");

}

