#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCircularProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreCircularProgressBar.WBP_CoreCircularProgressBar_C
// 0x0078 (0x0398 - 0x0320)
class UWBP_CoreCircularProgressBar_C final : public UCoreBaseUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              base;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Fill;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        GaugeWidth;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GaugeHeight;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percentf;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FillImage;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             baseImage;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BaseColor;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidget();
	void SetFillAmount(class UImage* ImageWidget, double FillAmountf);
	void SetFill(class UImage* ImageWidget, double Percent, const struct FLinearColor& Color);
	void SetBase(class UImage* ImageWidget, const struct FLinearColor& Color);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_CoreCircularProgressBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreCircularProgressBar_C">();
	}
	static class UWBP_CoreCircularProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreCircularProgressBar_C>();
	}
};
static_assert(alignof(UWBP_CoreCircularProgressBar_C) == 0x000008, "Wrong alignment on UWBP_CoreCircularProgressBar_C");
static_assert(sizeof(UWBP_CoreCircularProgressBar_C) == 0x000398, "Wrong size on UWBP_CoreCircularProgressBar_C");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, UberGraphFrame) == 0x000320, "Member 'UWBP_CoreCircularProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, NewAnimation_1) == 0x000328, "Member 'UWBP_CoreCircularProgressBar_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, NewAnimation) == 0x000330, "Member 'UWBP_CoreCircularProgressBar_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, base) == 0x000338, "Member 'UWBP_CoreCircularProgressBar_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, Fill) == 0x000340, "Member 'UWBP_CoreCircularProgressBar_C::Fill' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, SizeBoxContainer) == 0x000348, "Member 'UWBP_CoreCircularProgressBar_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, GaugeWidth) == 0x000350, "Member 'UWBP_CoreCircularProgressBar_C::GaugeWidth' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, GaugeHeight) == 0x000358, "Member 'UWBP_CoreCircularProgressBar_C::GaugeHeight' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, Percentf) == 0x000360, "Member 'UWBP_CoreCircularProgressBar_C::Percentf' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, FillImage) == 0x000368, "Member 'UWBP_CoreCircularProgressBar_C::FillImage' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, FillColor) == 0x000370, "Member 'UWBP_CoreCircularProgressBar_C::FillColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, baseImage) == 0x000380, "Member 'UWBP_CoreCircularProgressBar_C::baseImage' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCircularProgressBar_C, BaseColor) == 0x000388, "Member 'UWBP_CoreCircularProgressBar_C::BaseColor' has a wrong offset!");

}

