#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CorePopup.WBP_CorePopup_C
// 0x00F0 (0x0450 - 0x0360)
class UWBP_CorePopup_C final : public UCoreTutorialPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MaskAnimation;                                     // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              Bg;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Divider;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Image;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           Mask;                                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDRichTextBlock*                      Message;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Smoke;                                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          Subtitle;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          Title;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              TutoIcon;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FNotifTutorialPopupViewData            NotifData;                                         // 0x03B8(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           UpdateMask;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UnbindProgressionButton();
	void ShowNotifTutorialPopup(const struct FNotifTutorialPopupViewData& NotifTutoData);
	void ShowAnimation();
	void SetNotifTitle();
	void SetNotifPopup();
	void SetNotifMessage();
	void SetNotifImage();
	void SetNotifIcon();
	void ProgressionButtonTriggered();
	void CustomEvent_0();
	void Construct();
	void CheckControlMode();
	void OnProgressionButtonTriggered();
	void HideTutorialPopup(bool PlaySoundEffect);
	void ExecuteUbergraph_WBP_CorePopup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CorePopup_C">();
	}
	static class UWBP_CorePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CorePopup_C>();
	}
};
static_assert(alignof(UWBP_CorePopup_C) == 0x000008, "Wrong alignment on UWBP_CorePopup_C");
static_assert(sizeof(UWBP_CorePopup_C) == 0x000450, "Wrong size on UWBP_CorePopup_C");
static_assert(offsetof(UWBP_CorePopup_C, UberGraphFrame) == 0x000360, "Member 'UWBP_CorePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, MaskAnimation) == 0x000368, "Member 'UWBP_CorePopup_C::MaskAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Bg) == 0x000370, "Member 'UWBP_CorePopup_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Divider) == 0x000378, "Member 'UWBP_CorePopup_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Image) == 0x000380, "Member 'UWBP_CorePopup_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Mask) == 0x000388, "Member 'UWBP_CorePopup_C::Mask' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Message) == 0x000390, "Member 'UWBP_CorePopup_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Smoke) == 0x000398, "Member 'UWBP_CorePopup_C::Smoke' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Subtitle) == 0x0003A0, "Member 'UWBP_CorePopup_C::Subtitle' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, Title) == 0x0003A8, "Member 'UWBP_CorePopup_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, TutoIcon) == 0x0003B0, "Member 'UWBP_CorePopup_C::TutoIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, NotifData) == 0x0003B8, "Member 'UWBP_CorePopup_C::NotifData' has a wrong offset!");
static_assert(offsetof(UWBP_CorePopup_C, UpdateMask) == 0x000448, "Member 'UWBP_CorePopup_C::UpdateMask' has a wrong offset!");

}

