#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreHudStatusEffectAlertItem

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreHudStatusEffectAlertItem.WBP_CoreHudStatusEffectAlertItem_C.SetViewData
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_CoreHudStatusEffectAlertItem_C_SetViewData final
{
public:
	struct FStatusEffectAlertViewData             ViewData;                                          // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D8(0x0018)()
};
static_assert(alignof(WBP_CoreHudStatusEffectAlertItem_C_SetViewData) == 0x000008, "Wrong alignment on WBP_CoreHudStatusEffectAlertItem_C_SetViewData");
static_assert(sizeof(WBP_CoreHudStatusEffectAlertItem_C_SetViewData) == 0x0001F0, "Wrong size on WBP_CoreHudStatusEffectAlertItem_C_SetViewData");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetViewData, ViewData) == 0x000000, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetViewData::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetViewData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001D0, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetViewData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetViewData, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D8, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetViewData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CoreHudStatusEffectAlertItem.WBP_CoreHudStatusEffectAlertItem_C.SetSourceData
// 0x0268 (0x0268 - 0x0000)
struct WBP_CoreHudStatusEffectAlertItem_C_SetSourceData final
{
public:
	struct FStatusEffectAlertViewData             ViewData;                                          // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01F0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0208(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAddonViewInterface>   K2Node_DynamicCast_AsAddon_View_Interface;         // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IItemViewInterface>    K2Node_DynamicCast_AsItem_View_Interface;          // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPerkViewInterface>    CallFunc_SetData_self_CastInput;                   // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData) == 0x000008, "Wrong alignment on WBP_CoreHudStatusEffectAlertItem_C_SetSourceData");
static_assert(sizeof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData) == 0x000268, "Wrong size on WBP_CoreHudStatusEffectAlertItem_C_SetSourceData");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, ViewData) == 0x000000, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::ViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D0, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D8, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001F0, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000208, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, K2Node_SwitchEnum_CmpSuccess) == 0x000220, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, K2Node_DynamicCast_AsAddon_View_Interface) == 0x000228, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::K2Node_DynamicCast_AsAddon_View_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, K2Node_DynamicCast_AsItem_View_Interface) == 0x000240, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::K2Node_DynamicCast_AsItem_View_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetSourceData, CallFunc_SetData_self_CastInput) == 0x000258, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetSourceData::CallFunc_SetData_self_CastInput' has a wrong offset!");

// Function WBP_CoreHudStatusEffectAlertItem.WBP_CoreHudStatusEffectAlertItem_C.SetData
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_CoreHudStatusEffectAlertItem_C_SetData final
{
public:
	struct FStatusEffectAlertViewData             Data;                                              // 0x0000(0x01D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreHudStatusEffectAlertItem_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreHudStatusEffectAlertItem_C_SetData");
static_assert(sizeof(WBP_CoreHudStatusEffectAlertItem_C_SetData) == 0x0001D0, "Wrong size on WBP_CoreHudStatusEffectAlertItem_C_SetData");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_SetData, Data) == 0x000000, "Member 'WBP_CoreHudStatusEffectAlertItem_C_SetData::Data' has a wrong offset!");

// Function WBP_CoreHudStatusEffectAlertItem.WBP_CoreHudStatusEffectAlertItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreHudStatusEffectAlertItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreHudStatusEffectAlertItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreHudStatusEffectAlertItem_C_PreConstruct");
static_assert(sizeof(WBP_CoreHudStatusEffectAlertItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreHudStatusEffectAlertItem_C_PreConstruct");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreHudStatusEffectAlertItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreHudStatusEffectAlertItem.WBP_CoreHudStatusEffectAlertItem_C.ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectAlertViewData             K2Node_Event_data;                                 // 0x0008(0x01D0)(ConstParm)
};
static_assert(alignof(WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem) == 0x000008, "Wrong alignment on WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem");
static_assert(sizeof(WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem) == 0x0001D8, "Wrong size on WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem, EntryPoint) == 0x000000, "Member 'WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem, K2Node_Event_data) == 0x000008, "Member 'WBP_CoreHudStatusEffectAlertItem_C_ExecuteUbergraph_WBP_CoreHudStatusEffectAlertItem::K2Node_Event_data' has a wrong offset!");

}

