#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K29

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_K29.WBP_K29_C.SetKillerData
// 0x0098 (0x0098 - 0x0000)
struct WBP_K29_C_SetKillerData final
{
public:
	struct FPlayerStatusViewData                  Data;                                              // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_K29_C_SetKillerData) == 0x000008, "Wrong alignment on WBP_K29_C_SetKillerData");
static_assert(sizeof(WBP_K29_C_SetKillerData) == 0x000098, "Wrong size on WBP_K29_C_SetKillerData");
static_assert(offsetof(WBP_K29_C_SetKillerData, Data) == 0x000000, "Member 'WBP_K29_C_SetKillerData::Data' has a wrong offset!");

// Function WBP_K29.WBP_K29_C.SetInfection
// 0x0010 (0x0010 - 0x0000)
struct WBP_K29_C_SetInfection final
{
public:
	class UK29StatusData*                         KillerData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKiller;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K29_C_SetInfection) == 0x000008, "Wrong alignment on WBP_K29_C_SetInfection");
static_assert(sizeof(WBP_K29_C_SetInfection) == 0x000010, "Wrong size on WBP_K29_C_SetInfection");
static_assert(offsetof(WBP_K29_C_SetInfection, KillerData) == 0x000000, "Member 'WBP_K29_C_SetInfection::KillerData' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_SetInfection, IsKiller) == 0x000008, "Member 'WBP_K29_C_SetInfection::IsKiller' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_SetInfection, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WBP_K29_C_SetInfection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_K29.WBP_K29_C.SetColor
// 0x0014 (0x0014 - 0x0000)
struct WBP_K29_C_SetColor final
{
public:
	bool                                          IsMaxxedOut;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K29_C_SetColor) == 0x000004, "Wrong alignment on WBP_K29_C_SetColor");
static_assert(sizeof(WBP_K29_C_SetColor) == 0x000014, "Wrong size on WBP_K29_C_SetColor");
static_assert(offsetof(WBP_K29_C_SetColor, IsMaxxedOut) == 0x000000, "Member 'WBP_K29_C_SetColor::IsMaxxedOut' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_SetColor, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_K29_C_SetColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_K29.WBP_K29_C.ExecuteUbergraph_WBP_K29
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_K29_C_ExecuteUbergraph_WBP_K29 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayerStatusViewData                  K2Node_Event_data;                                 // 0x0010(0x0098)(ConstParm)
	class UK29StatusData*                         K2Node_DynamicCast_AsK29Status_Data;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K29_C_ExecuteUbergraph_WBP_K29) == 0x000008, "Wrong alignment on WBP_K29_C_ExecuteUbergraph_WBP_K29");
static_assert(sizeof(WBP_K29_C_ExecuteUbergraph_WBP_K29) == 0x0000B8, "Wrong size on WBP_K29_C_ExecuteUbergraph_WBP_K29");
static_assert(offsetof(WBP_K29_C_ExecuteUbergraph_WBP_K29, EntryPoint) == 0x000000, "Member 'WBP_K29_C_ExecuteUbergraph_WBP_K29::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_ExecuteUbergraph_WBP_K29, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_K29_C_ExecuteUbergraph_WBP_K29::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_ExecuteUbergraph_WBP_K29, K2Node_Event_data) == 0x000010, "Member 'WBP_K29_C_ExecuteUbergraph_WBP_K29::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_ExecuteUbergraph_WBP_K29, K2Node_DynamicCast_AsK29Status_Data) == 0x0000A8, "Member 'WBP_K29_C_ExecuteUbergraph_WBP_K29::K2Node_DynamicCast_AsK29Status_Data' has a wrong offset!");
static_assert(offsetof(WBP_K29_C_ExecuteUbergraph_WBP_K29, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_K29_C_ExecuteUbergraph_WBP_K29::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

