#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LockedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LockedOverlay.WBP_LockedOverlay_C
// 0x0058 (0x0378 - 0x0320)
class UWBP_LockedOverlay_C final : public UCoreLockedOverlayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnlockAnim;                                        // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              LockedMaterial;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundTexture;                                 // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TextureSize;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconScaleX;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconScaleY;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconOffsetX;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconOffsetY;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LockedOverlay(int32 EntryPoint);
	void Finished_CAC253D64C47EC4CC34AE7898425099E();
	void PreConstruct(bool IsDesignTime);
	void SetIsLocked(bool IsLocked, bool UseAnimation);
	void SetMaterial(bool UseAnimation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LockedOverlay_C">();
	}
	static class UWBP_LockedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LockedOverlay_C>();
	}
};
static_assert(alignof(UWBP_LockedOverlay_C) == 0x000008, "Wrong alignment on UWBP_LockedOverlay_C");
static_assert(sizeof(UWBP_LockedOverlay_C) == 0x000378, "Wrong size on UWBP_LockedOverlay_C");
static_assert(offsetof(UWBP_LockedOverlay_C, UberGraphFrame) == 0x000320, "Member 'UWBP_LockedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, UnlockAnim) == 0x000328, "Member 'UWBP_LockedOverlay_C::UnlockAnim' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, LockedMaterial) == 0x000330, "Member 'UWBP_LockedOverlay_C::LockedMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, BackgroundTexture) == 0x000338, "Member 'UWBP_LockedOverlay_C::BackgroundTexture' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, TextureSize) == 0x000340, "Member 'UWBP_LockedOverlay_C::TextureSize' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, IconScaleX) == 0x000350, "Member 'UWBP_LockedOverlay_C::IconScaleX' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, IconScaleY) == 0x000358, "Member 'UWBP_LockedOverlay_C::IconScaleY' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, IconOffsetX) == 0x000360, "Member 'UWBP_LockedOverlay_C::IconOffsetX' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, IconOffsetY) == 0x000368, "Member 'UWBP_LockedOverlay_C::IconOffsetY' has a wrong offset!");
static_assert(offsetof(UWBP_LockedOverlay_C, DynamicMaterial) == 0x000370, "Member 'UWBP_LockedOverlay_C::DynamicMaterial' has a wrong offset!");

}

