#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCustomizationTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreCustomizationTooltip.WBP_CoreCustomizationTooltip_C
// 0x0130 (0x04C8 - 0x0398)
class UWBP_CoreCustomizationTooltip_C final : public UCustomizationTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              Bg;                                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              EventHeader;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              IconCircleBG;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InstructionContainer;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              InstructionIcon;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          InstructionText;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              LegendaryBackground;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Line;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Locked;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              OriginBG;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OriginContainer;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              OriginIcon;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OutfitPartsContainerParent;                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ParentOutfitBG;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ParentOutfitContainer;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              ParentOutfitIcon;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RarityBG;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RoleBG;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RoleContainer;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              RoleIcon;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ToolTipAvailableInParentOutfit;                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ToolTipCollectionName;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ToolTipOriginInfo;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ToolTipRarityBody;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          ToolTipRoleOwner;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          TooltipTitle;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              VisceralImage;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreTooltipDisabledItem_C*         WBP_CoreDisabledTooltip;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            LockedColor;                                       // 0x0480(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            OwnedColor;                                        // 0x0494(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            EquippedColor;                                     // 0x04A8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CoreTooltipDisabledItem_C*         WBP_CoreTooltipKillSwitch_0;                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void DebugPreviewOutfitParts();
	void DebugPreviewPriceTags();
	void ExecuteUbergraph_WBP_CoreCustomizationTooltip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Status_Text_Color(bool Equipped, bool Owned, bool Param_Locked);
	void SetCustomizationData(const struct FCustomizationTooltipViewData& Customization_Tooltip_Data);
	void SetEventHeader(const class FString& EventBannerLabel);
	void SetOriginData(EOriginWidgetState OriginState, const class FText& OriginText);
	void SetOutfitPartsData(bool HasOutfitParts, bool IsUnbreakable, class UCustomizationRewardOutfitPartsViewData* OutfitPartsViewData);
	void SetParentOutfitData(bool IsOutfitPart, bool IsUnbreakable, const class FText& OutfitInfoText);
	void SetPriceData(bool IsBuyable, bool IsOutfitPart, bool IsUnbreakable, TArray<struct FPriceTagViewData>& Prices);
	void SetRarity(EItemRarity Rarity);
	void SetRoleData(EPlayerRole Role, const class FText& RoleCategory);
	void SetTooltipData(const struct FCustomizationTooltipViewData& CustomizationViewData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreCustomizationTooltip_C">();
	}
	static class UWBP_CoreCustomizationTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreCustomizationTooltip_C>();
	}
};
static_assert(alignof(UWBP_CoreCustomizationTooltip_C) == 0x000008, "Wrong alignment on UWBP_CoreCustomizationTooltip_C");
static_assert(sizeof(UWBP_CoreCustomizationTooltip_C) == 0x0004C8, "Wrong size on UWBP_CoreCustomizationTooltip_C");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, UberGraphFrame) == 0x000398, "Member 'UWBP_CoreCustomizationTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, Bg) == 0x0003A0, "Member 'UWBP_CoreCustomizationTooltip_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, EventHeader) == 0x0003A8, "Member 'UWBP_CoreCustomizationTooltip_C::EventHeader' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, IconCircleBG) == 0x0003B0, "Member 'UWBP_CoreCustomizationTooltip_C::IconCircleBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, InstructionContainer) == 0x0003B8, "Member 'UWBP_CoreCustomizationTooltip_C::InstructionContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, InstructionIcon) == 0x0003C0, "Member 'UWBP_CoreCustomizationTooltip_C::InstructionIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, InstructionText) == 0x0003C8, "Member 'UWBP_CoreCustomizationTooltip_C::InstructionText' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, LegendaryBackground) == 0x0003D0, "Member 'UWBP_CoreCustomizationTooltip_C::LegendaryBackground' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, Line) == 0x0003D8, "Member 'UWBP_CoreCustomizationTooltip_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, Locked) == 0x0003E0, "Member 'UWBP_CoreCustomizationTooltip_C::Locked' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, OriginBG) == 0x0003E8, "Member 'UWBP_CoreCustomizationTooltip_C::OriginBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, OriginContainer) == 0x0003F0, "Member 'UWBP_CoreCustomizationTooltip_C::OriginContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, OriginIcon) == 0x0003F8, "Member 'UWBP_CoreCustomizationTooltip_C::OriginIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, OutfitPartsContainerParent) == 0x000400, "Member 'UWBP_CoreCustomizationTooltip_C::OutfitPartsContainerParent' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ParentOutfitBG) == 0x000408, "Member 'UWBP_CoreCustomizationTooltip_C::ParentOutfitBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ParentOutfitContainer) == 0x000410, "Member 'UWBP_CoreCustomizationTooltip_C::ParentOutfitContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ParentOutfitIcon) == 0x000418, "Member 'UWBP_CoreCustomizationTooltip_C::ParentOutfitIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, RarityBG) == 0x000420, "Member 'UWBP_CoreCustomizationTooltip_C::RarityBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, RoleBG) == 0x000428, "Member 'UWBP_CoreCustomizationTooltip_C::RoleBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, RoleContainer) == 0x000430, "Member 'UWBP_CoreCustomizationTooltip_C::RoleContainer' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, RoleIcon) == 0x000438, "Member 'UWBP_CoreCustomizationTooltip_C::RoleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ToolTipAvailableInParentOutfit) == 0x000440, "Member 'UWBP_CoreCustomizationTooltip_C::ToolTipAvailableInParentOutfit' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ToolTipCollectionName) == 0x000448, "Member 'UWBP_CoreCustomizationTooltip_C::ToolTipCollectionName' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ToolTipOriginInfo) == 0x000450, "Member 'UWBP_CoreCustomizationTooltip_C::ToolTipOriginInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ToolTipRarityBody) == 0x000458, "Member 'UWBP_CoreCustomizationTooltip_C::ToolTipRarityBody' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, ToolTipRoleOwner) == 0x000460, "Member 'UWBP_CoreCustomizationTooltip_C::ToolTipRoleOwner' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, TooltipTitle) == 0x000468, "Member 'UWBP_CoreCustomizationTooltip_C::TooltipTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, VisceralImage) == 0x000470, "Member 'UWBP_CoreCustomizationTooltip_C::VisceralImage' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, WBP_CoreDisabledTooltip) == 0x000478, "Member 'UWBP_CoreCustomizationTooltip_C::WBP_CoreDisabledTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, LockedColor) == 0x000480, "Member 'UWBP_CoreCustomizationTooltip_C::LockedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, OwnedColor) == 0x000494, "Member 'UWBP_CoreCustomizationTooltip_C::OwnedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, EquippedColor) == 0x0004A8, "Member 'UWBP_CoreCustomizationTooltip_C::EquippedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreCustomizationTooltip_C, WBP_CoreTooltipKillSwitch_0) == 0x0004C0, "Member 'UWBP_CoreCustomizationTooltip_C::WBP_CoreTooltipKillSwitch_0' has a wrong offset!");

}

