#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreMenuOffering

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreMenuOffering.WBP_CoreMenuOffering_C
// 0x0018 (0x0560 - 0x0548)
class UWBP_CoreMenuOffering_C final : public UCoreMenuOfferingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              HiddenIcon;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             MainContent;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetHiddenOffering(bool IsHidden);
	void ExecuteUbergraph_WBP_CoreMenuOffering(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreMenuOffering_C">();
	}
	static class UWBP_CoreMenuOffering_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreMenuOffering_C>();
	}
};
static_assert(alignof(UWBP_CoreMenuOffering_C) == 0x000008, "Wrong alignment on UWBP_CoreMenuOffering_C");
static_assert(sizeof(UWBP_CoreMenuOffering_C) == 0x000560, "Wrong size on UWBP_CoreMenuOffering_C");
static_assert(offsetof(UWBP_CoreMenuOffering_C, UberGraphFrame) == 0x000548, "Member 'UWBP_CoreMenuOffering_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreMenuOffering_C, HiddenIcon) == 0x000550, "Member 'UWBP_CoreMenuOffering_C::HiddenIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreMenuOffering_C, MainContent) == 0x000558, "Member 'UWBP_CoreMenuOffering_C::MainContent' has a wrong offset!");

}

