#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreCurrencyForTooltips

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreCurrencyForTooltips.WBP_CoreCurrencyForTooltips_C.SetData
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_CoreCurrencyForTooltips_C_SetData final
{
public:
	struct FCurrencyProgressionRewardViewData     CurrencyRewardViewData;                            // 0x0000(0x01B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreCurrencyForTooltips_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreCurrencyForTooltips_C_SetData");
static_assert(sizeof(WBP_CoreCurrencyForTooltips_C_SetData) == 0x0001B8, "Wrong size on WBP_CoreCurrencyForTooltips_C_SetData");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_SetData, CurrencyRewardViewData) == 0x000000, "Member 'WBP_CoreCurrencyForTooltips_C_SetData::CurrencyRewardViewData' has a wrong offset!");

// Function WBP_CoreCurrencyForTooltips.WBP_CoreCurrencyForTooltips_C.ExecuteUbergraph_WBP_CoreCurrencyForTooltips
// 0x0218 (0x0218 - 0x0000)
struct WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyProgressionRewardViewData     K2Node_Event_currencyRewardViewData;               // 0x0008(0x01B8)(ConstParm)
	class FText                                   CallFunc_GetBeautifiedNumericText_ReturnValue;     // 0x01C0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01DC(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01F0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0204(0x0014)()
};
static_assert(alignof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips) == 0x000008, "Wrong alignment on WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips");
static_assert(sizeof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips) == 0x000218, "Wrong size on WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, EntryPoint) == 0x000000, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, K2Node_Event_currencyRewardViewData) == 0x000008, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::K2Node_Event_currencyRewardViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, CallFunc_GetBeautifiedNumericText_ReturnValue) == 0x0001C0, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::CallFunc_GetBeautifiedNumericText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D8, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, K2Node_MakeStruct_SlateColor) == 0x0001DC, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, K2Node_MakeStruct_SlateColor_1) == 0x0001F0, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips, K2Node_MakeStruct_SlateColor_2) == 0x000204, "Member 'WBP_CoreCurrencyForTooltips_C_ExecuteUbergraph_WBP_CoreCurrencyForTooltips::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

}

