#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSpectateBar

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.SetSpectatedName
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreSpectateBar_C_SetSpectatedName final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_SetSpectatedName) == 0x000008, "Wrong alignment on WBP_CoreSpectateBar_C_SetSpectatedName");
static_assert(sizeof(WBP_CoreSpectateBar_C_SetSpectatedName) == 0x000010, "Wrong size on WBP_CoreSpectateBar_C_SetSpectatedName");
static_assert(offsetof(WBP_CoreSpectateBar_C_SetSpectatedName, PlayerName) == 0x000000, "Member 'WBP_CoreSpectateBar_C_SetSpectatedName::PlayerName' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.SetSpectateBarVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSpectateBar_C_SetSpectateBarVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_SetSpectateBarVisibility) == 0x000001, "Wrong alignment on WBP_CoreSpectateBar_C_SetSpectateBarVisibility");
static_assert(sizeof(WBP_CoreSpectateBar_C_SetSpectateBarVisibility) == 0x000001, "Wrong size on WBP_CoreSpectateBar_C_SetSpectateBarVisibility");
static_assert(offsetof(WBP_CoreSpectateBar_C_SetSpectateBarVisibility, Param_IsVisible) == 0x000000, "Member 'WBP_CoreSpectateBar_C_SetSpectateBarVisibility::Param_IsVisible' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.SetHoveredOpacity
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSpectateBar_C_SetHoveredOpacity final
{
public:
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_SetHoveredOpacity) == 0x000001, "Wrong alignment on WBP_CoreSpectateBar_C_SetHoveredOpacity");
static_assert(sizeof(WBP_CoreSpectateBar_C_SetHoveredOpacity) == 0x000001, "Wrong size on WBP_CoreSpectateBar_C_SetHoveredOpacity");
static_assert(offsetof(WBP_CoreSpectateBar_C_SetHoveredOpacity, CallFunc_IsHovered_ReturnValue) == 0x000000, "Member 'WBP_CoreSpectateBar_C_SetHoveredOpacity::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.SetDefaultOpacity
// 0x0004 (0x0004 - 0x0000)
struct WBP_CoreSpectateBar_C_SetDefaultOpacity final
{
public:
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_SetDefaultOpacity) == 0x000004, "Wrong alignment on WBP_CoreSpectateBar_C_SetDefaultOpacity");
static_assert(sizeof(WBP_CoreSpectateBar_C_SetDefaultOpacity) == 0x000004, "Wrong size on WBP_CoreSpectateBar_C_SetDefaultOpacity");
static_assert(offsetof(WBP_CoreSpectateBar_C_SetDefaultOpacity, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000000, "Member 'WBP_CoreSpectateBar_C_SetDefaultOpacity::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.SetBotTag
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSpectateBar_C_SetBotTag final
{
public:
	bool                                          IsBot;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_SetBotTag) == 0x000001, "Wrong alignment on WBP_CoreSpectateBar_C_SetBotTag");
static_assert(sizeof(WBP_CoreSpectateBar_C_SetBotTag) == 0x000001, "Wrong size on WBP_CoreSpectateBar_C_SetBotTag");
static_assert(offsetof(WBP_CoreSpectateBar_C_SetBotTag, IsBot) == 0x000000, "Member 'WBP_CoreSpectateBar_C_SetBotTag::IsBot' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.SetArrowsVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSpectateBar_C_SetArrowsVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_SetArrowsVisibility) == 0x000001, "Wrong alignment on WBP_CoreSpectateBar_C_SetArrowsVisibility");
static_assert(sizeof(WBP_CoreSpectateBar_C_SetArrowsVisibility) == 0x000001, "Wrong size on WBP_CoreSpectateBar_C_SetArrowsVisibility");
static_assert(offsetof(WBP_CoreSpectateBar_C_SetArrowsVisibility, Param_IsVisible) == 0x000000, "Member 'WBP_CoreSpectateBar_C_SetArrowsVisibility::Param_IsVisible' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSpectateBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreSpectateBar_C_PreConstruct");
static_assert(sizeof(WBP_CoreSpectateBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreSpectateBar_C_PreConstruct");
static_assert(offsetof(WBP_CoreSpectateBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreSpectateBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.OnSpectateBarHovered
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreSpectateBar_C_OnSpectateBarHovered final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_CoreSpectateBar_C_OnSpectateBarHovered) == 0x000008, "Wrong alignment on WBP_CoreSpectateBar_C_OnSpectateBarHovered");
static_assert(sizeof(WBP_CoreSpectateBar_C_OnSpectateBarHovered) == 0x000018, "Wrong size on WBP_CoreSpectateBar_C_OnSpectateBarHovered");
static_assert(offsetof(WBP_CoreSpectateBar_C_OnSpectateBarHovered, ReturnValue) == 0x000000, "Member 'WBP_CoreSpectateBar_C_OnSpectateBarHovered::ReturnValue' has a wrong offset!");

// Function WBP_CoreSpectateBar.WBP_CoreSpectateBar_C.ExecuteUbergraph_WBP_CoreSpectateBar
// 0x0050 (0x0050 - 0x0000)
struct WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible_1;                          // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible;                            // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_playerName;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isBot;                                // 0x0049(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar) == 0x000008, "Wrong alignment on WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar");
static_assert(sizeof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar) == 0x000050, "Wrong size on WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, EntryPoint) == 0x000000, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, Temp_byte_Variable) == 0x000004, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, K2Node_Event_IsDesignTime) == 0x000006, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, CallFunc_IsHovered_ReturnValue) == 0x000007, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, K2Node_Event_isVisible_1) == 0x000008, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::K2Node_Event_isVisible_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, K2Node_Event_isVisible) == 0x000018, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::K2Node_Event_isVisible' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, K2Node_Event_playerName) == 0x000020, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::K2Node_Event_playerName' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, Temp_bool_Variable) == 0x000048, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, K2Node_Event_isBot) == 0x000049, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::K2Node_Event_isBot' has a wrong offset!");
static_assert(offsetof(WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar, K2Node_Select_Default) == 0x00004A, "Member 'WBP_CoreSpectateBar_C_ExecuteUbergraph_WBP_CoreSpectateBar::K2Node_Select_Default' has a wrong offset!");

}

