#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_K35

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_K35.WBP_K35_C.SetKillerData
// 0x0098 (0x0098 - 0x0000)
struct WBP_K35_C_SetKillerData final
{
public:
	struct FPlayerStatusViewData                  Data;                                              // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_K35_C_SetKillerData) == 0x000008, "Wrong alignment on WBP_K35_C_SetKillerData");
static_assert(sizeof(WBP_K35_C_SetKillerData) == 0x000098, "Wrong size on WBP_K35_C_SetKillerData");
static_assert(offsetof(WBP_K35_C_SetKillerData, Data) == 0x000000, "Member 'WBP_K35_C_SetKillerData::Data' has a wrong offset!");

// Function WBP_K35.WBP_K35_C.ExecuteUbergraph_WBP_K35
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_K35_C_ExecuteUbergraph_WBP_K35 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerStatusViewData                  K2Node_Event_data;                                 // 0x0008(0x0098)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UK35StatusData*                         K2Node_DynamicCast_AsK35Status_Data;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_K35_C_ExecuteUbergraph_WBP_K35) == 0x000008, "Wrong alignment on WBP_K35_C_ExecuteUbergraph_WBP_K35");
static_assert(sizeof(WBP_K35_C_ExecuteUbergraph_WBP_K35) == 0x0000E0, "Wrong size on WBP_K35_C_ExecuteUbergraph_WBP_K35");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, EntryPoint) == 0x000000, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, K2Node_Event_data) == 0x000008, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::K2Node_Event_data' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, K2Node_DynamicCast_AsK35Status_Data) == 0x0000A8, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::K2Node_DynamicCast_AsK35Status_Data' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B4, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000C0, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000C8, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0000D0, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_K35_C_ExecuteUbergraph_WBP_K35, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x0000D8, "Member 'WBP_K35_C_ExecuteUbergraph_WBP_K35::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");

}

