#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChallengeTrackerContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ChallengeTrackerContainer.WBP_ChallengeTrackerContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ChallengeTrackerContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChallengeTrackerContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ChallengeTrackerContainer_C_PreConstruct");
static_assert(sizeof(WBP_ChallengeTrackerContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_ChallengeTrackerContainer_C_PreConstruct");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ChallengeTrackerContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ChallengeTrackerContainer.WBP_ChallengeTrackerContainer_C.ExecuteUbergraph_WBP_ChallengeTrackerContainer
// 0x0028 (0x0028 - 0x0000)
struct WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer) == 0x000008, "Wrong alignment on WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer");
static_assert(sizeof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer) == 0x000028, "Wrong size on WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer, EntryPoint) == 0x000000, "Member 'WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer, K2Node_DynamicCast_AsOverlay_Slot) == 0x000018, "Member 'WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ChallengeTrackerContainer_C_ExecuteUbergraph_WBP_ChallengeTrackerContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

