#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreIconToggle

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.UpdateVisuals
// 0x0003 (0x0003 - 0x0000)
struct WBP_CoreIconToggle_C_UpdateVisuals final
{
public:
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsToggled_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_UpdateVisuals) == 0x000001, "Wrong alignment on WBP_CoreIconToggle_C_UpdateVisuals");
static_assert(sizeof(WBP_CoreIconToggle_C_UpdateVisuals) == 0x000003, "Wrong size on WBP_CoreIconToggle_C_UpdateVisuals");
static_assert(offsetof(WBP_CoreIconToggle_C_UpdateVisuals, CallFunc_IsEnabled_ReturnValue) == 0x000000, "Member 'WBP_CoreIconToggle_C_UpdateVisuals::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_UpdateVisuals, CallFunc_IsHovered_ReturnValue) == 0x000001, "Member 'WBP_CoreIconToggle_C_UpdateVisuals::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_UpdateVisuals, CallFunc_IsToggled_ReturnValue) == 0x000002, "Member 'WBP_CoreIconToggle_C_UpdateVisuals::CallFunc_IsToggled_ReturnValue' has a wrong offset!");

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.SetNotificationIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreIconToggle_C_SetNotificationIconVisibility final
{
public:
	bool                                          ShowNotification;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_SetNotificationIconVisibility) == 0x000001, "Wrong alignment on WBP_CoreIconToggle_C_SetNotificationIconVisibility");
static_assert(sizeof(WBP_CoreIconToggle_C_SetNotificationIconVisibility) == 0x000001, "Wrong size on WBP_CoreIconToggle_C_SetNotificationIconVisibility");
static_assert(offsetof(WBP_CoreIconToggle_C_SetNotificationIconVisibility, ShowNotification) == 0x000000, "Member 'WBP_CoreIconToggle_C_SetNotificationIconVisibility::ShowNotification' has a wrong offset!");

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.SetActiveVisualState
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreIconToggle_C_SetActiveVisualState final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_SetActiveVisualState) == 0x000001, "Wrong alignment on WBP_CoreIconToggle_C_SetActiveVisualState");
static_assert(sizeof(WBP_CoreIconToggle_C_SetActiveVisualState) == 0x000001, "Wrong size on WBP_CoreIconToggle_C_SetActiveVisualState");
static_assert(offsetof(WBP_CoreIconToggle_C_SetActiveVisualState, IsActive) == 0x000000, "Member 'WBP_CoreIconToggle_C_SetActiveVisualState::IsActive' has a wrong offset!");

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreIconToggle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreIconToggle_C_PreConstruct");
static_assert(sizeof(WBP_CoreIconToggle_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreIconToggle_C_PreConstruct");
static_assert(offsetof(WBP_CoreIconToggle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreIconToggle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreIconToggle_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreIconToggle_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreIconToggle_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreIconToggle_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreIconToggle_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreIconToggle_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.ExecuteUbergraph_WBP_CoreIconToggle
// 0x0058 (0x0058 - 0x0000)
struct WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_New_Texture;                    // 0x0010(0x0038)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_showNotification;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsActive;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle) == 0x000008, "Wrong alignment on WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle");
static_assert(sizeof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle) == 0x000058, "Wrong size on WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, EntryPoint) == 0x000000, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000004, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000005, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, CallFunc_IsEnabled_ReturnValue) == 0x000006, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, CallFunc_IsEnabled_ReturnValue_1) == 0x000007, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, K2Node_Event_isEnabled) == 0x000008, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, K2Node_CustomEvent_New_Texture) == 0x000010, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::K2Node_CustomEvent_New_Texture' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, K2Node_Event_showNotification) == 0x000050, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::K2Node_Event_showNotification' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, K2Node_Event_IsActive) == 0x000051, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::K2Node_Event_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle, K2Node_Event_IsDesignTime) == 0x000052, "Member 'WBP_CoreIconToggle_C_ExecuteUbergraph_WBP_CoreIconToggle::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CoreIconToggle.WBP_CoreIconToggle_C.Event Update Icon Texture
// 0x0038 (0x0038 - 0x0000)
struct WBP_CoreIconToggle_C_Event_Update_Icon_Texture final
{
public:
	TSoftObjectPtr<class UTexture2D>              New_Texture;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreIconToggle_C_Event_Update_Icon_Texture) == 0x000008, "Wrong alignment on WBP_CoreIconToggle_C_Event_Update_Icon_Texture");
static_assert(sizeof(WBP_CoreIconToggle_C_Event_Update_Icon_Texture) == 0x000038, "Wrong size on WBP_CoreIconToggle_C_Event_Update_Icon_Texture");
static_assert(offsetof(WBP_CoreIconToggle_C_Event_Update_Icon_Texture, New_Texture) == 0x000000, "Member 'WBP_CoreIconToggle_C_Event_Update_Icon_Texture::New_Texture' has a wrong offset!");

}

