#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreInputPrompt_HoldButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CoreInputPrompt_HoldButton.WBP_CoreInputPrompt_HoldButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreInputPrompt_HoldButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_HoldButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreInputPrompt_HoldButton_C_PreConstruct");
static_assert(sizeof(WBP_CoreInputPrompt_HoldButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreInputPrompt_HoldButton_C_PreConstruct");
static_assert(offsetof(WBP_CoreInputPrompt_HoldButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreInputPrompt_HoldButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreInputPrompt_HoldButton.WBP_CoreInputPrompt_HoldButton_C.ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton) == 0x000004, "Wrong alignment on WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton");
static_assert(sizeof(WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton) == 0x000008, "Wrong size on WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton");
static_assert(offsetof(WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton, EntryPoint) == 0x000000, "Member 'WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CoreInputPrompt_HoldButton_C_ExecuteUbergraph_WBP_CoreInputPrompt_HoldButton::K2Node_Event_IsDesignTime' has a wrong offset!");

}

