#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TallyClassPlayerStatusContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TallyClassPlayerStatusContainer.WBP_TallyClassPlayerStatusContainer_C
// 0x0068 (0x0658 - 0x05F0)
class UWBP_TallyClassPlayerStatusContainer_C final : public UCoreTallyPlayerStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDBDImage*                              Background;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CorePlayerCardContainer_C*         Badge;                                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CorePlayerCardContainer_C*         Banner;                                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              BotLabelIcon;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              CrossplayIcon;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              PlayerStatusIcon;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              StatusBackground;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundKiller;                                  // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundLocalPlayer;                             // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     PlayerStateIcon;                                   // 0x0640(0x0010)(Edit, BlueprintVisible)
	double                                        Class_Widget_Scale;                                // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TryGetAnimatedWidget(const struct FPlayerCardViewData& ViewData, class UWBP_CorePlayerCardContainer_C* ParentWidget, bool* Success);
	void SetVisualIsPlayer(bool IsPlayer);
	void SetReportButtonOpacity(const float Opacity);
	void SetPlayerCards(const struct FPlayerCardViewData& Param_Banner, const struct FPlayerCardViewData& Param_Badge);
	void SetPlayerCardAnimation(const bool Param_IsAnimationPlaying);
	void SetData(const struct FTallyPlayerStatusViewData& ViewData, EGameType GameType, bool IsUsingCharacterClass);
	void SetBackground(bool IsKiller, bool IsPlayer);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_TallyClassPlayerStatusContainer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TallyClassPlayerStatusContainer_C">();
	}
	static class UWBP_TallyClassPlayerStatusContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TallyClassPlayerStatusContainer_C>();
	}
};
static_assert(alignof(UWBP_TallyClassPlayerStatusContainer_C) == 0x000008, "Wrong alignment on UWBP_TallyClassPlayerStatusContainer_C");
static_assert(sizeof(UWBP_TallyClassPlayerStatusContainer_C) == 0x000658, "Wrong size on UWBP_TallyClassPlayerStatusContainer_C");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, UberGraphFrame) == 0x0005F0, "Member 'UWBP_TallyClassPlayerStatusContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, Background) == 0x0005F8, "Member 'UWBP_TallyClassPlayerStatusContainer_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, Badge) == 0x000600, "Member 'UWBP_TallyClassPlayerStatusContainer_C::Badge' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, Banner) == 0x000608, "Member 'UWBP_TallyClassPlayerStatusContainer_C::Banner' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, BotLabelIcon) == 0x000610, "Member 'UWBP_TallyClassPlayerStatusContainer_C::BotLabelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, CrossplayIcon) == 0x000618, "Member 'UWBP_TallyClassPlayerStatusContainer_C::CrossplayIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, PlayerStatusIcon) == 0x000620, "Member 'UWBP_TallyClassPlayerStatusContainer_C::PlayerStatusIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, StatusBackground) == 0x000628, "Member 'UWBP_TallyClassPlayerStatusContainer_C::StatusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, BackgroundKiller) == 0x000630, "Member 'UWBP_TallyClassPlayerStatusContainer_C::BackgroundKiller' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, BackgroundLocalPlayer) == 0x000638, "Member 'UWBP_TallyClassPlayerStatusContainer_C::BackgroundLocalPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, PlayerStateIcon) == 0x000640, "Member 'UWBP_TallyClassPlayerStatusContainer_C::PlayerStateIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TallyClassPlayerStatusContainer_C, Class_Widget_Scale) == 0x000650, "Member 'UWBP_TallyClassPlayerStatusContainer_C::Class_Widget_Scale' has a wrong offset!");

}

