#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Objectives_Generator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Objectives_Generator.WBP_Objectives_Generator_C
// 0x0028 (0x02D0 - 0x02A8)
class UWBP_Objectives_Generator_C final : public UUserWidget
{
public:
	class UDBDImage*                              GeneratorIcon;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Highlight;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          QuantityText;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          TotalText;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TutorialHighlight_C*               WBP_TutorialHighlight;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set_Generator_Count(int32 NbGeneratorsLeft, int32 RequiredActivatedGeneratorCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Objectives_Generator_C">();
	}
	static class UWBP_Objectives_Generator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Objectives_Generator_C>();
	}
};
static_assert(alignof(UWBP_Objectives_Generator_C) == 0x000008, "Wrong alignment on UWBP_Objectives_Generator_C");
static_assert(sizeof(UWBP_Objectives_Generator_C) == 0x0002D0, "Wrong size on UWBP_Objectives_Generator_C");
static_assert(offsetof(UWBP_Objectives_Generator_C, GeneratorIcon) == 0x0002A8, "Member 'UWBP_Objectives_Generator_C::GeneratorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Objectives_Generator_C, Highlight) == 0x0002B0, "Member 'UWBP_Objectives_Generator_C::Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_Objectives_Generator_C, QuantityText) == 0x0002B8, "Member 'UWBP_Objectives_Generator_C::QuantityText' has a wrong offset!");
static_assert(offsetof(UWBP_Objectives_Generator_C, TotalText) == 0x0002C0, "Member 'UWBP_Objectives_Generator_C::TotalText' has a wrong offset!");
static_assert(offsetof(UWBP_Objectives_Generator_C, WBP_TutorialHighlight) == 0x0002C8, "Member 'UWBP_Objectives_Generator_C::WBP_TutorialHighlight' has a wrong offset!");

}

