#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CheckBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CheckBox.WBP_CheckBox_C.ExecuteUbergraph_WBP_CheckBox
// 0x0028 (0x0028 - 0x0000)
struct WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isChecked;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox) == 0x000008, "Wrong alignment on WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox");
static_assert(sizeof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox) == 0x000028, "Wrong size on WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox");
static_assert(offsetof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox, EntryPoint) == 0x000000, "Member 'WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox, K2Node_CustomEvent_isChecked) == 0x000018, "Member 'WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox::K2Node_CustomEvent_isChecked' has a wrong offset!");
static_assert(offsetof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox, CallFunc_IsChecked_ReturnValue) == 0x000019, "Member 'WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_CheckBox_C_ExecuteUbergraph_WBP_CheckBox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_CheckBox.WBP_CheckBox_C.SetIsChecked
// 0x0001 (0x0001 - 0x0000)
struct WBP_CheckBox_C_SetIsChecked final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CheckBox_C_SetIsChecked) == 0x000001, "Wrong alignment on WBP_CheckBox_C_SetIsChecked");
static_assert(sizeof(WBP_CheckBox_C_SetIsChecked) == 0x000001, "Wrong size on WBP_CheckBox_C_SetIsChecked");
static_assert(offsetof(WBP_CheckBox_C_SetIsChecked, IsChecked) == 0x000000, "Member 'WBP_CheckBox_C_SetIsChecked::IsChecked' has a wrong offset!");

// Function WBP_CheckBox.WBP_CheckBox_C.GetIsChecked
// 0x0002 (0x0002 - 0x0000)
struct WBP_CheckBox_C_GetIsChecked final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CheckBox_C_GetIsChecked) == 0x000001, "Wrong alignment on WBP_CheckBox_C_GetIsChecked");
static_assert(sizeof(WBP_CheckBox_C_GetIsChecked) == 0x000002, "Wrong size on WBP_CheckBox_C_GetIsChecked");
static_assert(offsetof(WBP_CheckBox_C_GetIsChecked, IsChecked) == 0x000000, "Member 'WBP_CheckBox_C_GetIsChecked::IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_CheckBox_C_GetIsChecked, CallFunc_IsChecked_ReturnValue) == 0x000001, "Member 'WBP_CheckBox_C_GetIsChecked::CallFunc_IsChecked_ReturnValue' has a wrong offset!");

}

