#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ImagePreviewArea

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function WBP_ImagePreviewArea.WBP_ImagePreviewArea_C.ExecuteUbergraph_WBP_ImagePreviewArea
// 0x0108 (0x0108 - 0x0000)
struct WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECustomizationCategory                        K2Node_Event_customizationCategory;                // 0x00A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UStoreCustomizationItemViewData*  K2Node_Event_previewItemData;                      // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CorePlayerCardContainer_C*         K2Node_DynamicCast_AsWBP_Core_Player_Card_Container; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_BannerAspectRatio_ImplicitCast; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BannerAspectRatio_ImplicitCast_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast_1;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_1;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea) == 0x000008, "Wrong alignment on WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea");
static_assert(sizeof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea) == 0x000108, "Wrong size on WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, EntryPoint) == 0x000000, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_GetSize_ReturnValue) == 0x000018, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000028, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000040, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_MakeVector2D_ReturnValue) == 0x000048, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000058, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000060, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000068, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_GetSize_ReturnValue_1) == 0x000070, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_MakeStruct_Margin_1) == 0x000080, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_MakeVector2D_ReturnValue_1) == 0x000090, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x0000A0, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_Event_customizationCategory) == 0x0000A8, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_Event_customizationCategory' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_SwitchEnum_CmpSuccess) == 0x0000A9, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_Event_previewItemData) == 0x0000B0, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_Event_previewItemData' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_DynamicCast_AsWBP_Core_Player_Card_Container) == 0x0000B8, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_DynamicCast_AsWBP_Core_Player_Card_Container' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000C1, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0000C8, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, CallFunc_IsValidClass_ReturnValue) == 0x0000D0, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget) == 0x0000D8, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_ClassDynamicCast_AsCore_Player_Card_Animation_Widget' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_ClassDynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_VariableSet_BannerAspectRatio_ImplicitCast) == 0x0000E8, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_VariableSet_BannerAspectRatio_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x0000F0, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000F4, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_VariableSet_BannerAspectRatio_ImplicitCast_1) == 0x0000F8, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_VariableSet_BannerAspectRatio_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_MakeStruct_Bottom_ImplicitCast_1) == 0x000100, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_MakeStruct_Bottom_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea, K2Node_MakeStruct_Left_ImplicitCast_1) == 0x000104, "Member 'WBP_ImagePreviewArea_C_ExecuteUbergraph_WBP_ImagePreviewArea::K2Node_MakeStruct_Left_ImplicitCast_1' has a wrong offset!");

// Function WBP_ImagePreviewArea.WBP_ImagePreviewArea_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ImagePreviewArea_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ImagePreviewArea_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ImagePreviewArea_C_PreConstruct");
static_assert(sizeof(WBP_ImagePreviewArea_C_PreConstruct) == 0x000001, "Wrong size on WBP_ImagePreviewArea_C_PreConstruct");
static_assert(offsetof(WBP_ImagePreviewArea_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ImagePreviewArea_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ImagePreviewArea.WBP_ImagePreviewArea_C.SetAnimatedPreviewData
// 0x0008 (0x0008 - 0x0000)
struct WBP_ImagePreviewArea_C_SetAnimatedPreviewData final
{
public:
	const class UStoreCustomizationItemViewData*  PreviewItemData;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ImagePreviewArea_C_SetAnimatedPreviewData) == 0x000008, "Wrong alignment on WBP_ImagePreviewArea_C_SetAnimatedPreviewData");
static_assert(sizeof(WBP_ImagePreviewArea_C_SetAnimatedPreviewData) == 0x000008, "Wrong size on WBP_ImagePreviewArea_C_SetAnimatedPreviewData");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetAnimatedPreviewData, PreviewItemData) == 0x000000, "Member 'WBP_ImagePreviewArea_C_SetAnimatedPreviewData::PreviewItemData' has a wrong offset!");

// Function WBP_ImagePreviewArea.WBP_ImagePreviewArea_C.SetBannerPreviewContainer
// 0x0078 (0x0078 - 0x0000)
struct WBP_ImagePreviewArea_C_SetBannerPreviewContainer final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast_1;     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast_1;     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast_2;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer) == 0x000008, "Wrong alignment on WBP_ImagePreviewArea_C_SetBannerPreviewContainer");
static_assert(sizeof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer) == 0x000078, "Wrong size on WBP_ImagePreviewArea_C_SetBannerPreviewContainer");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_BreakVector2D_X) == 0x000000, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000030, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000038, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_MakeVector2D_ReturnValue_1) == 0x000040, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_A_ImplicitCast) == 0x000050, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_A_ImplicitCast_1) == 0x000054, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_B_ImplicitCast) == 0x000058, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_B_ImplicitCast_1) == 0x00005C, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000060, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_Multiply_FloatFloat_B_ImplicitCast_2) == 0x000068, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_Multiply_FloatFloat_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetBannerPreviewContainer, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000070, "Member 'WBP_ImagePreviewArea_C_SetBannerPreviewContainer::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");

// Function WBP_ImagePreviewArea.WBP_ImagePreviewArea_C.SetItemPreviewContainer
// 0x0068 (0x0068 - 0x0000)
struct WBP_ImagePreviewArea_C_SetItemPreviewContainer final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_B_ImplicitCast_1;     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_A_ImplicitCast_1;     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ImagePreviewArea_C_SetItemPreviewContainer) == 0x000008, "Wrong alignment on WBP_ImagePreviewArea_C_SetItemPreviewContainer");
static_assert(sizeof(WBP_ImagePreviewArea_C_SetItemPreviewContainer) == 0x000068, "Wrong size on WBP_ImagePreviewArea_C_SetItemPreviewContainer");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_BreakVector2D_X) == 0x000000, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000038, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000040, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_Multiply_FloatFloat_B_ImplicitCast) == 0x000048, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_Multiply_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_Multiply_FloatFloat_B_ImplicitCast_1) == 0x00004C, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_Multiply_FloatFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_Multiply_FloatFloat_A_ImplicitCast) == 0x000050, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_Multiply_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_Multiply_FloatFloat_A_ImplicitCast_1) == 0x000054, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_Multiply_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000058, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetItemPreviewContainer, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000060, "Member 'WBP_ImagePreviewArea_C_SetItemPreviewContainer::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");

// Function WBP_ImagePreviewArea.WBP_ImagePreviewArea_C.SetPreviewContainerVisual
// 0x0001 (0x0001 - 0x0000)
struct WBP_ImagePreviewArea_C_SetPreviewContainerVisual final
{
public:
	ECustomizationCategory                        CustomizationCategory;                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ImagePreviewArea_C_SetPreviewContainerVisual) == 0x000001, "Wrong alignment on WBP_ImagePreviewArea_C_SetPreviewContainerVisual");
static_assert(sizeof(WBP_ImagePreviewArea_C_SetPreviewContainerVisual) == 0x000001, "Wrong size on WBP_ImagePreviewArea_C_SetPreviewContainerVisual");
static_assert(offsetof(WBP_ImagePreviewArea_C_SetPreviewContainerVisual, CustomizationCategory) == 0x000000, "Member 'WBP_ImagePreviewArea_C_SetPreviewContainerVisual::CustomizationCategory' has a wrong offset!");

}

