#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAlerts

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DBDSharedTypes_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.ExecuteUbergraph_WBP_CoreAlerts
// 0x1260 (0x1260 - 0x0000)
struct WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRewardWrapperViewData>         K2Node_Event_AlertRewards;                         // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class UUserWidget*>                    CallFunc_SetData_Widget;                           // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Temp_struct_Variable;                              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardWrapperViewData                 K2Node_Event_rewardData;                           // 0x00A0(0x0528)(ConstParm)
	class UAkAudioEvent*                          CallFunc_GetDisplayRewardSound_ReturnValue;        // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Event_soundFx;                              // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x05EC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Temp_struct_Variable_1;                            // 0x0630(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERewardType                                   Temp_byte_Variable_1;                              // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChallengeViewData>             K2Node_Event_challengesCompleted;                  // 0x0648(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FRewardWrapperViewData>         K2Node_Event_challengesRewards;                    // 0x0658(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardWrapperViewData                 CallFunc_Array_Get_Item;                           // 0x0670(0x0528)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0B9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_SetData_Widget_1;                         // 0x0BA0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FChallengeTrackerViewData>      K2Node_Event_challengesTrackers;                   // 0x0BB0(0x0010)(ConstParm, ReferenceParm)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0BC0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CoreRewardWrapperAnimation_C*      K2Node_DynamicCast_AsWBP_Core_Reward_Wrapper_Animation; // 0x0BD0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0BD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9[0x3];                                      // 0x0BD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0BDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0BE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0BE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE5[0x3];                                      // 0x0BE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0BEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BED[0x3];                                      // 0x0BED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0BF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0BF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue_1;      // 0x0C00(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0C38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_2;                         // 0x0C48(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRewardWrapperViewData                 CallFunc_Array_Get_Item_3;                         // 0x0C50(0x0528)()
	class UWBP_CoreRewardWrapperAnimation_C*      K2Node_DynamicCast_AsWBP_Core_Reward_Wrapper_Animation_1; // 0x1178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x1180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1181[0x3];                                     // 0x1181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default;                             // 0x1184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x1194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1195[0x3];                                     // 0x1195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x1198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119C[0x4];                                     // 0x119C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x11A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue_2;      // 0x11A8(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x11E0(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default_1;                           // 0x11F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1204[0x4];                                     // 0x1204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_2;    // 0x1208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue_3;      // 0x1210(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_3;    // 0x1248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x1250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x1254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x1258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_3;            // 0x125C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts");
static_assert(sizeof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts) == 0x001260, "Wrong size on WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, EntryPoint) == 0x000000, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000008, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_int_Variable) == 0x000010, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_int_Variable_1) == 0x000018, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Event_AlertRewards) == 0x000020, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Event_AlertRewards' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_SetData_Widget) == 0x000030, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_SetData_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_struct_Variable) == 0x000050, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000060, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000068, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1) == 0x000088, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1) == 0x000090, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_byte_Variable) == 0x000099, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Event_rewardData) == 0x0000A0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Event_rewardData' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetDisplayRewardSound_ReturnValue) == 0x0005C8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetDisplayRewardSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Event_soundFx) == 0x0005D0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Event_soundFx' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_int_Variable_2) == 0x0005D8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0005E0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Add_IntInt_ReturnValue_2) == 0x0005E8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x0005EC, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000628, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_struct_Variable_1) == 0x000630, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_byte_Variable_1) == 0x000640, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Event_challengesCompleted) == 0x000648, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Event_challengesCompleted' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Event_challengesRewards) == 0x000658, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Event_challengesRewards' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Length_ReturnValue_1) == 0x000668, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Get_Item) == 0x000670, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000B98, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000B9C, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_SetData_Widget_1) == 0x000BA0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_SetData_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Event_challengesTrackers) == 0x000BB0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Event_challengesTrackers' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Get_Item_1) == 0x000BC0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Length_ReturnValue_2) == 0x000BC8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_DynamicCast_AsWBP_Core_Reward_Wrapper_Animation) == 0x000BD0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_DynamicCast_AsWBP_Core_Reward_Wrapper_Animation' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_DynamicCast_bSuccess) == 0x000BD8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000BDC, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Length_ReturnValue_3) == 0x000BE0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000BE4, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000BE8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000BEC, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000BF0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000BF8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetPaintSpaceGeometry_ReturnValue_1) == 0x000C00, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetPaintSpaceGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000C38, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, Temp_int_Variable_3) == 0x000C40, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Get_Item_2) == 0x000C48, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Array_Get_Item_3) == 0x000C50, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_DynamicCast_AsWBP_Core_Reward_Wrapper_Animation_1) == 0x001178, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_DynamicCast_AsWBP_Core_Reward_Wrapper_Animation_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_DynamicCast_bSuccess_1) == 0x001180, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Select_Default) == 0x001184, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x001194, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Add_IntInt_ReturnValue_3) == 0x001198, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x0011A0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetPaintSpaceGeometry_ReturnValue_2) == 0x0011A8, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetPaintSpaceGeometry_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_CreateDelegate_OutputDelegate_1) == 0x0011E0, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, K2Node_Select_Default_1) == 0x0011F4, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_AddChildToHorizontalBox_ReturnValue_2) == 0x001208, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_AddChildToHorizontalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_GetPaintSpaceGeometry_ReturnValue_3) == 0x001210, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_GetPaintSpaceGeometry_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_AddChildToHorizontalBox_ReturnValue_3) == 0x001248, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_AddChildToHorizontalBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Delay_Duration_ImplicitCast) == 0x001250, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Delay_Duration_ImplicitCast_1) == 0x001254, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Delay_Duration_ImplicitCast_2) == 0x001258, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts, CallFunc_Delay_Duration_ImplicitCast_3) == 0x00125C, "Member 'WBP_CoreAlerts_C_ExecuteUbergraph_WBP_CoreAlerts::CallFunc_Delay_Duration_ImplicitCast_3' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.PlayDisplayRewardSound
// 0x0528 (0x0528 - 0x0000)
struct WBP_CoreAlerts_C_PlayDisplayRewardSound final
{
public:
	struct FRewardWrapperViewData                 RewardData;                                        // 0x0000(0x0528)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreAlerts_C_PlayDisplayRewardSound) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_PlayDisplayRewardSound");
static_assert(sizeof(WBP_CoreAlerts_C_PlayDisplayRewardSound) == 0x000528, "Wrong size on WBP_CoreAlerts_C_PlayDisplayRewardSound");
static_assert(offsetof(WBP_CoreAlerts_C_PlayDisplayRewardSound, RewardData) == 0x000000, "Member 'WBP_CoreAlerts_C_PlayDisplayRewardSound::RewardData' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.PlayNextChallengesCompletedSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation final
{
public:
	TArray<struct FChallengeViewData>             ChallengesCompleted;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation");
static_assert(sizeof(WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation) == 0x000010, "Wrong size on WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation");
static_assert(offsetof(WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation, ChallengesCompleted) == 0x000000, "Member 'WBP_CoreAlerts_C_PlayNextChallengesCompletedSequenceAnimation::ChallengesCompleted' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.PlayNextChallengesRewardsSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation final
{
public:
	TArray<struct FRewardWrapperViewData>         ChallengesRewards;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation");
static_assert(sizeof(WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation) == 0x000010, "Wrong size on WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation");
static_assert(offsetof(WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation, ChallengesRewards) == 0x000000, "Member 'WBP_CoreAlerts_C_PlayNextChallengesRewardsSequenceAnimation::ChallengesRewards' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.PlayNextChallengesTrackersSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation final
{
public:
	TArray<struct FChallengeTrackerViewData>      ChallengesTrackers;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation");
static_assert(sizeof(WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation) == 0x000010, "Wrong size on WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation");
static_assert(offsetof(WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation, ChallengesTrackers) == 0x000000, "Member 'WBP_CoreAlerts_C_PlayNextChallengesTrackersSequenceAnimation::ChallengesTrackers' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.PlayNextRewardsSequenceAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation final
{
public:
	TArray<struct FRewardWrapperViewData>         AlertRewards;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation");
static_assert(sizeof(WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation) == 0x000010, "Wrong size on WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation");
static_assert(offsetof(WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation, AlertRewards) == 0x000000, "Member 'WBP_CoreAlerts_C_PlayNextRewardsSequenceAnimation::AlertRewards' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.PlaySoundEffect
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreAlerts_C_PlaySoundEffect final
{
public:
	class UAkAudioEvent*                          SoundFx;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAlerts_C_PlaySoundEffect) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_PlaySoundEffect");
static_assert(sizeof(WBP_CoreAlerts_C_PlaySoundEffect) == 0x000008, "Wrong size on WBP_CoreAlerts_C_PlaySoundEffect");
static_assert(offsetof(WBP_CoreAlerts_C_PlaySoundEffect, SoundFx) == 0x000000, "Member 'WBP_CoreAlerts_C_PlaySoundEffect::SoundFx' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.ResetVisuals
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreAlerts_C_ResetVisuals final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAlerts_C_ResetVisuals) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_ResetVisuals");
static_assert(sizeof(WBP_CoreAlerts_C_ResetVisuals) == 0x000008, "Wrong size on WBP_CoreAlerts_C_ResetVisuals");
static_assert(offsetof(WBP_CoreAlerts_C_ResetVisuals, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_CoreAlerts_C_ResetVisuals::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.SetData
// 0x05C0 (0x05C0 - 0x0000)
struct WBP_CoreAlerts_C_SetData final
{
public:
	TArray<struct FRewardWrapperViewData>         Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UUserWidget*>                    Widget;                                            // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardWrapperViewData                 CallFunc_Array_Get_Item;                           // 0x0038(0x0528)()
	class UWBP_CoreRewardWrapperAnimation_C*      CallFunc_Create_ReturnValue;                       // 0x0560(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0570(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0588(0x0018)(ConstParm)
	ERewardType                                   Temp_byte_Variable;                                // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x05A8(0x0018)(ConstParm)
};
static_assert(alignof(WBP_CoreAlerts_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_SetData");
static_assert(sizeof(WBP_CoreAlerts_C_SetData) == 0x0005C0, "Wrong size on WBP_CoreAlerts_C_SetData");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Data) == 0x000000, "Member 'WBP_CoreAlerts_C_SetData::Data' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Widget) == 0x000010, "Member 'WBP_CoreAlerts_C_SetData::Widget' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_CoreAlerts_C_SetData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_CoreAlerts_C_SetData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CoreAlerts_C_SetData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CoreAlerts_C_SetData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_CoreAlerts_C_SetData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_CoreAlerts_C_SetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, CallFunc_Create_ReturnValue) == 0x000560, "Member 'WBP_CoreAlerts_C_SetData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, CallFunc_Array_Add_ReturnValue) == 0x000568, "Member 'WBP_CoreAlerts_C_SetData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Temp_text_Variable) == 0x000570, "Member 'WBP_CoreAlerts_C_SetData::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Temp_text_Variable_1) == 0x000588, "Member 'WBP_CoreAlerts_C_SetData::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, Temp_byte_Variable) == 0x0005A0, "Member 'WBP_CoreAlerts_C_SetData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetData, K2Node_Select_Default) == 0x0005A8, "Member 'WBP_CoreAlerts_C_SetData::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CoreAlerts.WBP_CoreAlerts_C.SetEventBackground
// 0x0080 (0x0080 - 0x0000)
struct WBP_CoreAlerts_C_SetEventBackground final
{
public:
	class FString                                 EventThemeLabel;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIDataManager*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetAlertRewardEventBackground_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreAlerts_C_SetEventBackground) == 0x000008, "Wrong alignment on WBP_CoreAlerts_C_SetEventBackground");
static_assert(sizeof(WBP_CoreAlerts_C_SetEventBackground) == 0x000080, "Wrong size on WBP_CoreAlerts_C_SetEventBackground");
static_assert(offsetof(WBP_CoreAlerts_C_SetEventBackground, EventThemeLabel) == 0x000000, "Member 'WBP_CoreAlerts_C_SetEventBackground::EventThemeLabel' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetEventBackground, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'WBP_CoreAlerts_C_SetEventBackground::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreAlerts_C_SetEventBackground, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000018, "Member 'WBP_CoreAlerts_C_SetEventBackground::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
