#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastNotificationWidget

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToastNotificationWidget.WBP_ToastNotificationWidget_C.ChangeVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToastNotificationWidget_C_ChangeVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotificationWidget_C_ChangeVisibility) == 0x000001, "Wrong alignment on WBP_ToastNotificationWidget_C_ChangeVisibility");
static_assert(sizeof(WBP_ToastNotificationWidget_C_ChangeVisibility) == 0x000001, "Wrong size on WBP_ToastNotificationWidget_C_ChangeVisibility");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ChangeVisibility, Param_IsVisible) == 0x000000, "Member 'WBP_ToastNotificationWidget_C_ChangeVisibility::Param_IsVisible' has a wrong offset!");

// Function WBP_ToastNotificationWidget.WBP_ToastNotificationWidget_C.ExecuteUbergraph_WBP_ToastNotificationWidget
// 0x0208 (0x0208 - 0x0000)
struct WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIEventDispatcher*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isVisible;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FToastNotificationViewData             K2Node_Event_toastData;                            // 0x0038(0x00C0)(ConstParm)
	bool                                          K2Node_Event_isInteractable;                       // 0x00F8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0130(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FToastInput                            CallFunc_Map_Find_Value;                           // 0x0148(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoreButtonWidget*                      K2Node_Event_button_1;                             // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_Event_button;                               // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputBlockerId_id;                     // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x01A8(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01E0(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputBlockerId_id_1;                   // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget) == 0x000008, "Wrong alignment on WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget");
static_assert(sizeof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget) == 0x000208, "Wrong size on WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, EntryPoint) == 0x000000, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, K2Node_Event_isVisible) == 0x000028, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::K2Node_Event_isVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, K2Node_Event_toastData) == 0x000038, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::K2Node_Event_toastData' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, K2Node_Event_isInteractable) == 0x0000F8, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::K2Node_Event_isInteractable' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000100, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000108, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000111, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000118, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Map_Keys_Keys) == 0x000130, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Array_Get_Item) == 0x000140, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Map_Find_Value) == 0x000148, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Map_Find_ReturnValue) == 0x000178, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Array_Length_ReturnValue) == 0x00017C, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, K2Node_Event_button_1) == 0x000188, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::K2Node_Event_button_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, K2Node_Event_button) == 0x000190, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::K2Node_Event_button' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_GetInputBlockerId_id) == 0x000198, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_GetInputBlockerId_id' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x0001A8, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0001E0, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget, CallFunc_GetInputBlockerId_id_1) == 0x0001F8, "Member 'WBP_ToastNotificationWidget_C_ExecuteUbergraph_WBP_ToastNotificationWidget::CallFunc_GetInputBlockerId_id_1' has a wrong offset!");

// Function WBP_ToastNotificationWidget.WBP_ToastNotificationWidget_C.GetInputBlockerId
// 0x0040 (0x0040 - 0x0000)
struct WBP_ToastNotificationWidget_C_GetInputBlockerId final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotificationWidget_C_GetInputBlockerId) == 0x000008, "Wrong alignment on WBP_ToastNotificationWidget_C_GetInputBlockerId");
static_assert(sizeof(WBP_ToastNotificationWidget_C_GetInputBlockerId) == 0x000040, "Wrong size on WBP_ToastNotificationWidget_C_GetInputBlockerId");
static_assert(offsetof(WBP_ToastNotificationWidget_C_GetInputBlockerId, ID) == 0x000000, "Member 'WBP_ToastNotificationWidget_C_GetInputBlockerId::ID' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_GetInputBlockerId, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'WBP_ToastNotificationWidget_C_GetInputBlockerId::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_GetInputBlockerId, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_ToastNotificationWidget_C_GetInputBlockerId::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_GetInputBlockerId, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'WBP_ToastNotificationWidget_C_GetInputBlockerId::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function WBP_ToastNotificationWidget.WBP_ToastNotificationWidget_C.OnLeftButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToastNotificationWidget_C_OnLeftButtonClicked final
{
public:
	class UCoreButtonWidget*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotificationWidget_C_OnLeftButtonClicked) == 0x000008, "Wrong alignment on WBP_ToastNotificationWidget_C_OnLeftButtonClicked");
static_assert(sizeof(WBP_ToastNotificationWidget_C_OnLeftButtonClicked) == 0x000008, "Wrong size on WBP_ToastNotificationWidget_C_OnLeftButtonClicked");
static_assert(offsetof(WBP_ToastNotificationWidget_C_OnLeftButtonClicked, Button) == 0x000000, "Member 'WBP_ToastNotificationWidget_C_OnLeftButtonClicked::Button' has a wrong offset!");

// Function WBP_ToastNotificationWidget.WBP_ToastNotificationWidget_C.OnRightButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToastNotificationWidget_C_OnRightButtonClicked final
{
public:
	class UCoreButtonWidget*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotificationWidget_C_OnRightButtonClicked) == 0x000008, "Wrong alignment on WBP_ToastNotificationWidget_C_OnRightButtonClicked");
static_assert(sizeof(WBP_ToastNotificationWidget_C_OnRightButtonClicked) == 0x000008, "Wrong size on WBP_ToastNotificationWidget_C_OnRightButtonClicked");
static_assert(offsetof(WBP_ToastNotificationWidget_C_OnRightButtonClicked, Button) == 0x000000, "Member 'WBP_ToastNotificationWidget_C_OnRightButtonClicked::Button' has a wrong offset!");

// Function WBP_ToastNotificationWidget.WBP_ToastNotificationWidget_C.SetVisuals
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_ToastNotificationWidget_C_SetVisuals final
{
public:
	struct FToastNotificationViewData             ToastData;                                         // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Param_IsInteractable;                              // 0x00C0(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotificationWidget_C_SetVisuals) == 0x000008, "Wrong alignment on WBP_ToastNotificationWidget_C_SetVisuals");
static_assert(sizeof(WBP_ToastNotificationWidget_C_SetVisuals) == 0x0000C8, "Wrong size on WBP_ToastNotificationWidget_C_SetVisuals");
static_assert(offsetof(WBP_ToastNotificationWidget_C_SetVisuals, ToastData) == 0x000000, "Member 'WBP_ToastNotificationWidget_C_SetVisuals::ToastData' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotificationWidget_C_SetVisuals, Param_IsInteractable) == 0x0000C0, "Member 'WBP_ToastNotificationWidget_C_SetVisuals::Param_IsInteractable' has a wrong offset!");

}

