#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreFooterButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DBDUIViewInterfaces_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreFooterButton.WBP_CoreFooterButton_C
// 0x0118 (0x0660 - 0x0548)
class UWBP_CoreFooterButton_C final : public UCoreFooterButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SubPanel_OnHoverAnimation;                         // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               BetaFeatureOverlay;                                // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          BetaFeatureTB;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              GiftPlusIcon;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              HighlightIMG;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingWheel_C*                    LoadingWheel;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LoadingWheelSizeBox;                               // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              LockedIcon;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SubPanel;                                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              SubPanelBG;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          SubPanelDescriptionTB;                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDTextBlock*                          SubPanelTitleTB;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreNotifications_C*               WBP_CoreNotifications;                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x05B8(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                           IconHoverColor;                                    // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconUnhoverColor;                                  // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundHoverColor;                              // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundUnhoverColor;                            // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconLoadingOrLockedColor;                          // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundLoadingOrLockedUnhoverColor;             // 0x0640(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconPressedColor;                                  // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CoreFooterButton(int32 EntryPoint);
	void OnHovered();
	void OnPressed();
	void OnReleased();
	void OnUnhovered();
	void PreConstruct(bool IsDesignTime);
	void SetBetaFeatureOverlayVisible(bool Param_IsVisible);
	void SetButtonDisableState(EButtonDisableState buttonDisableState);
	void SetHoveredColor();
	void SetNotificationVisibility(bool Param_IsVisible);
	void SetSubPanelText(const class FText& Title, const class FText& Description);
	void SetUnhoveredColor();
	void ShowSubPanel(bool Param_IsHovered);
	void UpdateDisableVisuals();
	void UpdateInteractability();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreFooterButton_C">();
	}
	static class UWBP_CoreFooterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreFooterButton_C>();
	}
};
static_assert(alignof(UWBP_CoreFooterButton_C) == 0x000008, "Wrong alignment on UWBP_CoreFooterButton_C");
static_assert(sizeof(UWBP_CoreFooterButton_C) == 0x000660, "Wrong size on UWBP_CoreFooterButton_C");
static_assert(offsetof(UWBP_CoreFooterButton_C, UberGraphFrame) == 0x000548, "Member 'UWBP_CoreFooterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, SubPanel_OnHoverAnimation) == 0x000550, "Member 'UWBP_CoreFooterButton_C::SubPanel_OnHoverAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, BetaFeatureOverlay) == 0x000558, "Member 'UWBP_CoreFooterButton_C::BetaFeatureOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, BetaFeatureTB) == 0x000560, "Member 'UWBP_CoreFooterButton_C::BetaFeatureTB' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, GiftPlusIcon) == 0x000568, "Member 'UWBP_CoreFooterButton_C::GiftPlusIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, HighlightIMG) == 0x000570, "Member 'UWBP_CoreFooterButton_C::HighlightIMG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, LoadingWheel) == 0x000578, "Member 'UWBP_CoreFooterButton_C::LoadingWheel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, LoadingWheelSizeBox) == 0x000580, "Member 'UWBP_CoreFooterButton_C::LoadingWheelSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, LockedIcon) == 0x000588, "Member 'UWBP_CoreFooterButton_C::LockedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, SubPanel) == 0x000590, "Member 'UWBP_CoreFooterButton_C::SubPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, SubPanelBG) == 0x000598, "Member 'UWBP_CoreFooterButton_C::SubPanelBG' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, SubPanelDescriptionTB) == 0x0005A0, "Member 'UWBP_CoreFooterButton_C::SubPanelDescriptionTB' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, SubPanelTitleTB) == 0x0005A8, "Member 'UWBP_CoreFooterButton_C::SubPanelTitleTB' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, WBP_CoreNotifications) == 0x0005B0, "Member 'UWBP_CoreFooterButton_C::WBP_CoreNotifications' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, IconTexture) == 0x0005B8, "Member 'UWBP_CoreFooterButton_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, IconHoverColor) == 0x0005F0, "Member 'UWBP_CoreFooterButton_C::IconHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, IconUnhoverColor) == 0x000600, "Member 'UWBP_CoreFooterButton_C::IconUnhoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, BackgroundHoverColor) == 0x000610, "Member 'UWBP_CoreFooterButton_C::BackgroundHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, BackgroundUnhoverColor) == 0x000620, "Member 'UWBP_CoreFooterButton_C::BackgroundUnhoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, IconLoadingOrLockedColor) == 0x000630, "Member 'UWBP_CoreFooterButton_C::IconLoadingOrLockedColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, BackgroundLoadingOrLockedUnhoverColor) == 0x000640, "Member 'UWBP_CoreFooterButton_C::BackgroundLoadingOrLockedUnhoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_CoreFooterButton_C, IconPressedColor) == 0x000650, "Member 'UWBP_CoreFooterButton_C::IconPressedColor' has a wrong offset!");

}

