#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreOnHoverBorder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.AnimationCompleted
// 0x0010 (0x0010 - 0x0000)
struct WBP_CoreOnHoverBorder_C_AnimationCompleted final
{
public:
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_AnimationCompleted) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_AnimationCompleted");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_AnimationCompleted) == 0x000010, "Wrong size on WBP_CoreOnHoverBorder_C_AnimationCompleted");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_AnimationCompleted, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_AnimationCompleted::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_AnimationCompleted, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WBP_CoreOnHoverBorder_C_AnimationCompleted::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_AnimationCompleted, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000008, "Member 'WBP_CoreOnHoverBorder_C_AnimationCompleted::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.BindToButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_BindToButton final
{
public:
	class UCoreButtonWidget*                      buttonToBindOn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_BindToButton) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_BindToButton");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_BindToButton) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_BindToButton");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_BindToButton, buttonToBindOn) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_BindToButton::buttonToBindOn' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.EndOfAnimationEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_EndOfAnimationEvent final
{
public:
	class UUITweenInstance*                       Tween;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_EndOfAnimationEvent) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_EndOfAnimationEvent");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_EndOfAnimationEvent) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_EndOfAnimationEvent");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_EndOfAnimationEvent, Tween) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_EndOfAnimationEvent::Tween' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.ExecuteUbergraph_WBP_CoreOnHoverBorder
// 0x0270 (0x0270 - 0x0000)
struct WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_thickness;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_desiredSize;                          // 0x0008(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCoreButtonWidget* buttonTarget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushTileType                           Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushTileType                           Temp_byte_Variable_1;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITween*                               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUITweenInstance* Tween)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUITween*                               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_Event_buttonToBindOn;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_CustomEvent_buttonTarget_4;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_CustomEvent_buttonTarget_3;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_CustomEvent_buttonTarget_2;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_CustomEvent_buttonTarget_1;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_playForward_1;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_playForward;                          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoreButtonWidget*                      K2Node_CustomEvent_buttonTarget;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_progressBarColor;                     // 0x0098(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_backgroundColor;                      // 0x00A8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateBrushTileType                           K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCoreButtonWidget* buttonTarget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00CC(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCoreButtonWidget* buttonTarget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0xC];                                       // 0x00F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0100(0x00D0)()
	class UUITweenInstance*                       K2Node_CustomEvent_tween;                          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue;                       // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToMaterialScalarParameter_ReturnValue;    // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCoreButtonWidget* buttonTarget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E8(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCoreButtonWidget* buttonTarget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01FC(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_Create_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUITweenInstance*                       CallFunc_ToMaterialScalarParameter_ReturnValue_1;  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToMaterialScalarParameter_targetValue_ImplicitCast; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Create_duration_ImplicitCast;             // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Create_duration_ImplicitCast_1;           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ToMaterialScalarParameter_targetValue_ImplicitCast_1; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder) == 0x000010, "Wrong alignment on WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder) == 0x000270, "Wrong size on WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, EntryPoint) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_thickness) == 0x000004, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_thickness' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_desiredSize) == 0x000008, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_desiredSize' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, Temp_bool_Variable) == 0x00002C, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, Temp_byte_Variable) == 0x00002D, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, Temp_byte_Variable_1) == 0x00002E, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000050, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_buttonToBindOn) == 0x000058, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_buttonToBindOn' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CustomEvent_buttonTarget_4) == 0x000060, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CustomEvent_buttonTarget_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CustomEvent_buttonTarget_3) == 0x000068, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CustomEvent_buttonTarget_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CustomEvent_buttonTarget_2) == 0x000070, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CustomEvent_buttonTarget_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CustomEvent_buttonTarget_1) == 0x000078, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CustomEvent_buttonTarget_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_playForward_1) == 0x000080, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_playForward_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_playForward) == 0x000081, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_playForward' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SelectFloat_ReturnValue) == 0x000088, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CustomEvent_buttonTarget) == 0x000090, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CustomEvent_buttonTarget' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_progressBarColor) == 0x000098, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_progressBarColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_backgroundColor) == 0x0000A8, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_backgroundColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Event_IsDesignTime) == 0x0000B9, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C0, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E0, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_MakeStruct_SlateBrush) == 0x000100, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CustomEvent_tween) == 0x0001D0, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CustomEvent_tween' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_Create_ReturnValue) == 0x0001D8, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_ToMaterialScalarParameter_ReturnValue) == 0x0001E0, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_ToMaterialScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E8, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001FC, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_Create_ReturnValue_1) == 0x000210, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_IsHovered_ReturnValue) == 0x000218, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SelectFloat_ReturnValue_1) == 0x000220, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SelectFloat_ReturnValue_2) == 0x000228, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_ToMaterialScalarParameter_ReturnValue_1) == 0x000230, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_ToMaterialScalarParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_ToMaterialScalarParameter_targetValue_ImplicitCast) == 0x000238, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_ToMaterialScalarParameter_targetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00023C, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000240, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000244, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000248, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x00024C, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000250, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000254, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000258, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_Create_duration_ImplicitCast) == 0x000260, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_Create_duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_Create_duration_ImplicitCast_1) == 0x000264, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_Create_duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder, CallFunc_ToMaterialScalarParameter_targetValue_ImplicitCast_1) == 0x000268, "Member 'WBP_CoreOnHoverBorder_C_ExecuteUbergraph_WBP_CoreOnHoverBorder::CallFunc_ToMaterialScalarParameter_targetValue_ImplicitCast_1' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.ForceBorderSize
// 0x0048 (0x0048 - 0x0000)
struct WBP_CoreOnHoverBorder_C_ForceBorderSize final
{
public:
	int32                                         Thickness;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DesiredSize;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast_1;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_ForceBorderSize) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_ForceBorderSize");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_ForceBorderSize) == 0x000048, "Wrong size on WBP_CoreOnHoverBorder_C_ForceBorderSize");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, Thickness) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::Thickness' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, DesiredSize) == 0x000008, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::DesiredSize' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000034, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Divide_FloatFloat_B_ImplicitCast) == 0x000038, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Divide_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Divide_FloatFloat_B_ImplicitCast_1) == 0x00003C, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Divide_FloatFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Divide_FloatFloat_A_ImplicitCast) == 0x000040, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Divide_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_ForceBorderSize, CallFunc_Divide_FloatFloat_A_ImplicitCast_1) == 0x000044, "Member 'WBP_CoreOnHoverBorder_C_ForceBorderSize::CallFunc_Divide_FloatFloat_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.OnClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_OnClicked final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_OnClicked) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_OnClicked");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_OnClicked) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_OnClicked");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_OnClicked, buttonTarget) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_OnClicked::buttonTarget' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.OnHovered
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_OnHovered final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_OnHovered) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_OnHovered");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_OnHovered) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_OnHovered");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_OnHovered, buttonTarget) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_OnHovered::buttonTarget' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.OnPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_OnPressed final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_OnPressed) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_OnPressed");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_OnPressed) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_OnPressed");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_OnPressed, buttonTarget) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_OnPressed::buttonTarget' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.OnReleased
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_OnReleased final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_OnReleased) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_OnReleased");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_OnReleased) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_OnReleased");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_OnReleased, buttonTarget) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_OnReleased::buttonTarget' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.OnUnhovered
// 0x0008 (0x0008 - 0x0000)
struct WBP_CoreOnHoverBorder_C_OnUnhovered final
{
public:
	class UCoreButtonWidget*                      buttonTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_OnUnhovered) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_OnUnhovered");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_OnUnhovered) == 0x000008, "Wrong size on WBP_CoreOnHoverBorder_C_OnUnhovered");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_OnUnhovered, buttonTarget) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_OnUnhovered::buttonTarget' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.PlayHoveredAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreOnHoverBorder_C_PlayHoveredAnimation final
{
public:
	bool                                          PlayForward;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_PlayHoveredAnimation) == 0x000001, "Wrong alignment on WBP_CoreOnHoverBorder_C_PlayHoveredAnimation");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_PlayHoveredAnimation) == 0x000001, "Wrong size on WBP_CoreOnHoverBorder_C_PlayHoveredAnimation");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PlayHoveredAnimation, PlayForward) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_PlayHoveredAnimation::PlayForward' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.PlayPressedAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreOnHoverBorder_C_PlayPressedAnimation final
{
public:
	bool                                          PlayForward;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_PlayPressedAnimation) == 0x000001, "Wrong alignment on WBP_CoreOnHoverBorder_C_PlayPressedAnimation");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_PlayPressedAnimation) == 0x000001, "Wrong size on WBP_CoreOnHoverBorder_C_PlayPressedAnimation");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PlayPressedAnimation, PlayForward) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_PlayPressedAnimation::PlayForward' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreOnHoverBorder_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreOnHoverBorder_C_PreConstruct");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreOnHoverBorder_C_PreConstruct");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.PrintPreviewRatios
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CoreOnHoverBorder_C_PrintPreviewRatios final
{
public:
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0008(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast_1;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast_1;       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_PrintPreviewRatios");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios) == 0x0000A8, "Wrong size on WBP_CoreOnHoverBorder_C_PrintPreviewRatios");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000008, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_GetLocalSize_ReturnValue) == 0x000040, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_BreakVector2D_X) == 0x000050, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_BreakVector2D_Y) == 0x000058, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000064, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000068, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000078, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Divide_FloatFloat_A_ImplicitCast) == 0x000088, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Divide_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Divide_FloatFloat_A_ImplicitCast_1) == 0x00008C, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Divide_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Divide_FloatFloat_B_ImplicitCast) == 0x000090, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Divide_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Divide_FloatFloat_B_ImplicitCast_1) == 0x000094, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Divide_FloatFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000098, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_PrintPreviewRatios, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x0000A0, "Member 'WBP_CoreOnHoverBorder_C_PrintPreviewRatios::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.UpdateBorderSize
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreOnHoverBorder_C_UpdateBorderSize final
{
public:
	int32                                         Thickness;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DesiredSize;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_UpdateBorderSize) == 0x000008, "Wrong alignment on WBP_CoreOnHoverBorder_C_UpdateBorderSize");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_UpdateBorderSize) == 0x000018, "Wrong size on WBP_CoreOnHoverBorder_C_UpdateBorderSize");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_UpdateBorderSize, Thickness) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_UpdateBorderSize::Thickness' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_UpdateBorderSize, DesiredSize) == 0x000008, "Member 'WBP_CoreOnHoverBorder_C_UpdateBorderSize::DesiredSize' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.UpdateColors
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreOnHoverBorder_C_UpdateColors final
{
public:
	struct FLinearColor                           ProgressBarColor;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_UpdateColors) == 0x000004, "Wrong alignment on WBP_CoreOnHoverBorder_C_UpdateColors");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_UpdateColors) == 0x000020, "Wrong size on WBP_CoreOnHoverBorder_C_UpdateColors");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_UpdateColors, ProgressBarColor) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_UpdateColors::ProgressBarColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_UpdateColors, BackgroundColor) == 0x000010, "Member 'WBP_CoreOnHoverBorder_C_UpdateColors::BackgroundColor' has a wrong offset!");

// Function WBP_CoreOnHoverBorder.WBP_CoreOnHoverBorder_C.UpdateMaterialColors
// 0x0020 (0x0020 - 0x0000)
struct WBP_CoreOnHoverBorder_C_UpdateMaterialColors final
{
public:
	struct FLinearColor                           ProgressBarColor;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreOnHoverBorder_C_UpdateMaterialColors) == 0x000004, "Wrong alignment on WBP_CoreOnHoverBorder_C_UpdateMaterialColors");
static_assert(sizeof(WBP_CoreOnHoverBorder_C_UpdateMaterialColors) == 0x000020, "Wrong size on WBP_CoreOnHoverBorder_C_UpdateMaterialColors");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_UpdateMaterialColors, ProgressBarColor) == 0x000000, "Member 'WBP_CoreOnHoverBorder_C_UpdateMaterialColors::ProgressBarColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreOnHoverBorder_C_UpdateMaterialColors, BackgroundColor) == 0x000010, "Member 'WBP_CoreOnHoverBorder_C_UpdateMaterialColors::BackgroundColor' has a wrong offset!");

}

