#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreSkill

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreSkill.WBP_CoreSkill_C.SetData
// 0x0070 (0x0070 - 0x0000)
struct WBP_CoreSkill_C_SetData final
{
public:
	struct FSkillViewData                         SkillViewData;                                     // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CoreSkill_C_SetData) == 0x000008, "Wrong alignment on WBP_CoreSkill_C_SetData");
static_assert(sizeof(WBP_CoreSkill_C_SetData) == 0x000070, "Wrong size on WBP_CoreSkill_C_SetData");
static_assert(offsetof(WBP_CoreSkill_C_SetData, SkillViewData) == 0x000000, "Member 'WBP_CoreSkill_C_SetData::SkillViewData' has a wrong offset!");

// Function WBP_CoreSkill.WBP_CoreSkill_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreSkill_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSkill_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CoreSkill_C_PreConstruct");
static_assert(sizeof(WBP_CoreSkill_C_PreConstruct) == 0x000001, "Wrong size on WBP_CoreSkill_C_PreConstruct");
static_assert(offsetof(WBP_CoreSkill_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CoreSkill_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CoreSkill.WBP_CoreSkill_C.ExecuteUbergraph_WBP_CoreSkill
// 0x0088 (0x0088 - 0x0000)
struct WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillViewData                         K2Node_Event_skillViewData;                        // 0x0008(0x0070)(ConstParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetPercentage_Percent_ImplicitCast;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill) == 0x000008, "Wrong alignment on WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill");
static_assert(sizeof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill) == 0x000088, "Wrong size on WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill");
static_assert(offsetof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill, EntryPoint) == 0x000000, "Member 'WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill, K2Node_Event_skillViewData) == 0x000008, "Member 'WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill::K2Node_Event_skillViewData' has a wrong offset!");
static_assert(offsetof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill, K2Node_Event_IsDesignTime) == 0x000079, "Member 'WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill, CallFunc_SetPercentage_Percent_ImplicitCast) == 0x000080, "Member 'WBP_CoreSkill_C_ExecuteUbergraph_WBP_CoreSkill::CallFunc_SetPercentage_Percent_ImplicitCast' has a wrong offset!");

}

