#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialMysteryNotes

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_TutorialMysteryNotes.WBP_TutorialMysteryNotes_C.ShowMysteryNote
// 0x0090 (0x0090 - 0x0000)
struct WBP_TutorialMysteryNotes_C_ShowMysteryNote final
{
public:
	struct FNotifTutorialPopupViewData            NotifData;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TutorialMysteryNotes_C_ShowMysteryNote) == 0x000008, "Wrong alignment on WBP_TutorialMysteryNotes_C_ShowMysteryNote");
static_assert(sizeof(WBP_TutorialMysteryNotes_C_ShowMysteryNote) == 0x000090, "Wrong size on WBP_TutorialMysteryNotes_C_ShowMysteryNote");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ShowMysteryNote, NotifData) == 0x000000, "Member 'WBP_TutorialMysteryNotes_C_ShowMysteryNote::NotifData' has a wrong offset!");

// Function WBP_TutorialMysteryNotes.WBP_TutorialMysteryNotes_C.ExecuteUbergraph_WBP_TutorialMysteryNotes
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FNotifTutorialPopupViewData            K2Node_Event_notifData;                            // 0x0018(0x0090)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes) == 0x000008, "Wrong alignment on WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes");
static_assert(sizeof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes) == 0x0000E8, "Wrong size on WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, EntryPoint) == 0x000000, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, K2Node_Event_notifData) == 0x000018, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::K2Node_Event_notifData' has a wrong offset!");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D8, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000E0, "Member 'WBP_TutorialMysteryNotes_C_ExecuteUbergraph_WBP_TutorialMysteryNotes::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

