#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadingWheel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoadingWheel.WBP_LoadingWheel_C
// 0x0018 (0x02C0 - 0x02A8)
class UWBP_LoadingWheel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Spin;                                              // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDBDImage*                              LoadingLarge;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LoadingWheel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoadingWheel_C">();
	}
	static class UWBP_LoadingWheel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoadingWheel_C>();
	}
};
static_assert(alignof(UWBP_LoadingWheel_C) == 0x000008, "Wrong alignment on UWBP_LoadingWheel_C");
static_assert(sizeof(UWBP_LoadingWheel_C) == 0x0002C0, "Wrong size on UWBP_LoadingWheel_C");
static_assert(offsetof(UWBP_LoadingWheel_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_LoadingWheel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingWheel_C, Spin) == 0x0002B0, "Member 'UWBP_LoadingWheel_C::Spin' has a wrong offset!");
static_assert(offsetof(UWBP_LoadingWheel_C, LoadingLarge) == 0x0002B8, "Member 'UWBP_LoadingWheel_C::LoadingLarge' has a wrong offset!");

}

