#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreKeyListenerInputPrompt

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreKeyListenerInputPrompt.WBP_CoreKeyListenerInputPrompt_C.ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt
// 0x0030 (0x0030 - 0x0000)
struct WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
};
static_assert(alignof(WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt) == 0x000004, "Wrong alignment on WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt");
static_assert(sizeof(WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt) == 0x000030, "Wrong size on WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt");
static_assert(offsetof(WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt, EntryPoint) == 0x000000, "Member 'WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt, K2Node_Event_isEnabled) == 0x000004, "Member 'WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'WBP_CoreKeyListenerInputPrompt_C_ExecuteUbergraph_WBP_CoreKeyListenerInputPrompt::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_CoreKeyListenerInputPrompt.WBP_CoreKeyListenerInputPrompt_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreKeyListenerInputPrompt_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

}

