#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreBackButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_CoreBackButton.WBP_CoreBackButton_C.ExecuteUbergraph_WBP_CoreBackButton
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Event_newAlignment;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_2;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_3;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_4;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_5;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_6;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_7;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isEnabled;                            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton) == 0x000008, "Wrong alignment on WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton");
static_assert(sizeof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton) == 0x0000C8, "Wrong size on WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, EntryPoint) == 0x000000, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_IsEnabled_ReturnValue) == 0x000004, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_MakeVector2D_ReturnValue_1) == 0x000030, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_Event_newAlignment) == 0x000040, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_Event_newAlignment' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000048, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_1) == 0x000050, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_2) == 0x000058, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_3) == 0x000060, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_MakeStruct_Margin) == 0x000068, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_MakeStruct_Margin_1) == 0x000078, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_4) == 0x000088, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_5) == 0x000090, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_6) == 0x000098, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsGridSlot_ReturnValue_7) == 0x0000A0, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsGridSlot_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x0000A8, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, CallFunc_SlotAsSizeBoxSlot_ReturnValue_1) == 0x0000B0, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::CallFunc_SlotAsSizeBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_Event_isEnabled) == 0x0000B8, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_Event_isEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000BC, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton, K2Node_MakeStruct_Right_ImplicitCast) == 0x0000C0, "Member 'WBP_CoreBackButton_C_ExecuteUbergraph_WBP_CoreBackButton::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");

// Function WBP_CoreBackButton.WBP_CoreBackButton_C.OnAlignmentChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreBackButton_C_OnAlignmentChanged final
{
public:
	ETextJustify                                  NewAlignment;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreBackButton_C_OnAlignmentChanged) == 0x000001, "Wrong alignment on WBP_CoreBackButton_C_OnAlignmentChanged");
static_assert(sizeof(WBP_CoreBackButton_C_OnAlignmentChanged) == 0x000001, "Wrong size on WBP_CoreBackButton_C_OnAlignmentChanged");
static_assert(offsetof(WBP_CoreBackButton_C_OnAlignmentChanged, NewAlignment) == 0x000000, "Member 'WBP_CoreBackButton_C_OnAlignmentChanged::NewAlignment' has a wrong offset!");

// Function WBP_CoreBackButton.WBP_CoreBackButton_C.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CoreBackButton_C_OnEnabledChanged final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreBackButton_C_OnEnabledChanged) == 0x000001, "Wrong alignment on WBP_CoreBackButton_C_OnEnabledChanged");
static_assert(sizeof(WBP_CoreBackButton_C_OnEnabledChanged) == 0x000001, "Wrong size on WBP_CoreBackButton_C_OnEnabledChanged");
static_assert(offsetof(WBP_CoreBackButton_C_OnEnabledChanged, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreBackButton_C_OnEnabledChanged::Param_IsEnabled' has a wrong offset!");

// Function WBP_CoreBackButton.WBP_CoreBackButton_C.ResetSmokeMaterial
// 0x0018 (0x0018 - 0x0000)
struct WBP_CoreBackButton_C_ResetSmokeMaterial final
{
public:
	class UMaterialInstanceDynamic*               SmokeMaterial;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreBackButton_C_ResetSmokeMaterial) == 0x000008, "Wrong alignment on WBP_CoreBackButton_C_ResetSmokeMaterial");
static_assert(sizeof(WBP_CoreBackButton_C_ResetSmokeMaterial) == 0x000018, "Wrong size on WBP_CoreBackButton_C_ResetSmokeMaterial");
static_assert(offsetof(WBP_CoreBackButton_C_ResetSmokeMaterial, SmokeMaterial) == 0x000000, "Member 'WBP_CoreBackButton_C_ResetSmokeMaterial::SmokeMaterial' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetSmokeMaterial, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_CoreBackButton_C_ResetSmokeMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetSmokeMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_CoreBackButton_C_ResetSmokeMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_CoreBackButton.WBP_CoreBackButton_C.ResetVisuals
// 0x0100 (0x0100 - 0x0000)
struct WBP_CoreBackButton_C_ResetVisuals final
{
public:
	bool                                          Param_IsEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0050(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0088(0x0038)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x00C8(0x0038)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CoreBackButton_C_ResetVisuals) == 0x000008, "Wrong alignment on WBP_CoreBackButton_C_ResetVisuals");
static_assert(sizeof(WBP_CoreBackButton_C_ResetVisuals) == 0x000100, "Wrong size on WBP_CoreBackButton_C_ResetVisuals");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, Param_IsEnabled) == 0x000000, "Member 'WBP_CoreBackButton_C_ResetVisuals::Param_IsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_CoreBackButton_C_ResetVisuals::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, CallFunc_SelectColor_ReturnValue_1) == 0x000014, "Member 'WBP_CoreBackButton_C_ResetVisuals::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'WBP_CoreBackButton_C_ResetVisuals::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WBP_CoreBackButton_C_ResetVisuals::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, Temp_softobject_Variable) == 0x000050, "Member 'WBP_CoreBackButton_C_ResetVisuals::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, Temp_softobject_Variable_1) == 0x000088, "Member 'WBP_CoreBackButton_C_ResetVisuals::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, Temp_bool_Variable) == 0x0000C0, "Member 'WBP_CoreBackButton_C_ResetVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CoreBackButton_C_ResetVisuals, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_CoreBackButton_C_ResetVisuals::K2Node_Select_Default' has a wrong offset!");

}

