#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CorePlayerLevelTooltip

#include "Basic.hpp"

#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK::Params
{

// Function WBP_CorePlayerLevelTooltip.WBP_CorePlayerLevelTooltip_C.ExecuteUbergraph_WBP_CorePlayerLevelTooltip
// 0x0058 (0x0058 - 0x0000)
struct WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorePlayerLevelTooltipViewData        K2Node_MakeStruct_CorePlayerLevelTooltipViewData;  // 0x0004(0x0010)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCorePlayerLevelTooltipViewData        K2Node_Event_viewData;                             // 0x0018(0x0010)(ConstParm, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_B_ImplicitCast;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_A_ImplicitCast;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip) == 0x000008, "Wrong alignment on WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip");
static_assert(sizeof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip) == 0x000058, "Wrong size on WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, EntryPoint) == 0x000000, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, K2Node_MakeStruct_CorePlayerLevelTooltipViewData) == 0x000004, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::K2Node_MakeStruct_CorePlayerLevelTooltipViewData' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, K2Node_Event_viewData) == 0x000018, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::K2Node_Event_viewData' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000048, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_Divide_FloatFloat_B_ImplicitCast) == 0x000050, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_Divide_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip, CallFunc_Divide_FloatFloat_A_ImplicitCast) == 0x000054, "Member 'WBP_CorePlayerLevelTooltip_C_ExecuteUbergraph_WBP_CorePlayerLevelTooltip::CallFunc_Divide_FloatFloat_A_ImplicitCast' has a wrong offset!");

// Function WBP_CorePlayerLevelTooltip.WBP_CorePlayerLevelTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CorePlayerLevelTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CorePlayerLevelTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CorePlayerLevelTooltip_C_PreConstruct");
static_assert(sizeof(WBP_CorePlayerLevelTooltip_C_PreConstruct) == 0x000001, "Wrong size on WBP_CorePlayerLevelTooltip_C_PreConstruct");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CorePlayerLevelTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CorePlayerLevelTooltip.WBP_CorePlayerLevelTooltip_C.SetTooltipData
// 0x0010 (0x0010 - 0x0000)
struct WBP_CorePlayerLevelTooltip_C_SetTooltipData final
{
public:
	struct FCorePlayerLevelTooltipViewData        ViewData;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_CorePlayerLevelTooltip_C_SetTooltipData) == 0x000004, "Wrong alignment on WBP_CorePlayerLevelTooltip_C_SetTooltipData");
static_assert(sizeof(WBP_CorePlayerLevelTooltip_C_SetTooltipData) == 0x000010, "Wrong size on WBP_CorePlayerLevelTooltip_C_SetTooltipData");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetTooltipData, ViewData) == 0x000000, "Member 'WBP_CorePlayerLevelTooltip_C_SetTooltipData::ViewData' has a wrong offset!");

// Function WBP_CorePlayerLevelTooltip.WBP_CorePlayerLevelTooltip_C.SetViewData
// 0x0098 (0x0098 - 0x0000)
struct WBP_CorePlayerLevelTooltip_C_SetViewData final
{
public:
	struct FCorePlayerLevelTooltipViewData        CorePlayerLevelTooltipViewData;                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0048(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0060(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0080(0x0018)()
};
static_assert(alignof(WBP_CorePlayerLevelTooltip_C_SetViewData) == 0x000008, "Wrong alignment on WBP_CorePlayerLevelTooltip_C_SetViewData");
static_assert(sizeof(WBP_CorePlayerLevelTooltip_C_SetViewData) == 0x000098, "Wrong size on WBP_CorePlayerLevelTooltip_C_SetViewData");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CorePlayerLevelTooltipViewData) == 0x000000, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CorePlayerLevelTooltipViewData' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000048, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000060, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CorePlayerLevelTooltip_C_SetViewData, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000080, "Member 'WBP_CorePlayerLevelTooltip_C_SetViewData::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");

}

