#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreDailyRitualsPopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreDailyRitualsPopupWidget.WBP_CoreDailyRitualsPopupWidget_C
// 0x0018 (0x0408 - 0x03F0)
class UWBP_CoreDailyRitualsPopupWidget_C final : public UDailyRitualsPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundDetails;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDBDImage*                              Smoke;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoreDailyRitualsPopupWidget(int32 EntryPoint);
	void GetAfterTrialProgressionButtonPadding(double* Param_Padding);
	void SetBackground(bool IsAfterTrial);
	void SetDailyRitualDetailAlignment(bool IsAfterTrial);
	void SetProgressionButtonAlignmentAndPadding(bool IsAfterTrial);
	void SetVisuals(bool IsAfterTrial);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreDailyRitualsPopupWidget_C">();
	}
	static class UWBP_CoreDailyRitualsPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreDailyRitualsPopupWidget_C>();
	}
};
static_assert(alignof(UWBP_CoreDailyRitualsPopupWidget_C) == 0x000008, "Wrong alignment on UWBP_CoreDailyRitualsPopupWidget_C");
static_assert(sizeof(UWBP_CoreDailyRitualsPopupWidget_C) == 0x000408, "Wrong size on UWBP_CoreDailyRitualsPopupWidget_C");
static_assert(offsetof(UWBP_CoreDailyRitualsPopupWidget_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_CoreDailyRitualsPopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDailyRitualsPopupWidget_C, BackgroundDetails) == 0x0003F8, "Member 'UWBP_CoreDailyRitualsPopupWidget_C::BackgroundDetails' has a wrong offset!");
static_assert(offsetof(UWBP_CoreDailyRitualsPopupWidget_C, Smoke) == 0x000400, "Member 'UWBP_CoreDailyRitualsPopupWidget_C::Smoke' has a wrong offset!");

}

