#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoreAlerts

#include "Basic.hpp"

#include "DBDSharedTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "DBDUIViewsCore_classes.hpp"
#include "DBDUIViewInterfaces_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoreAlerts.WBP_CoreAlerts_C
// 0x05D8 (0x0A38 - 0x0460)
class UWBP_CoreAlerts_C final : public UCoreAlertsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AllFadeOutAnim;                                    // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RewardFadeOutAnim;                                 // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           BannerGroupTextPanel;                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreRewardWrapperAnimation_C*      WBP_CoreRewardWrapperAnimation;                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CoreRewardWrapperAnimation_C*      WBP_CoreRewardWrapperAnimation_1;                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    UserWidgetArray;                                   // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        DelayBetweenShowItem;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_on_Text_Fade_Out;                             // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                  LevelSelectSoundEffect;                            // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRewardWrapperViewData                 Reward;                                            // 0x04C8(0x0528)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               BackgroundImageDynamicMaterial;                    // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                CustomizationPadding;                              // 0x09F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                CurrencyPadding;                                   // 0x0A08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                CompletedChallengePadding;                         // 0x0A18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                ChallengeTrackersPadding;                          // 0x0A28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_CoreAlerts(int32 EntryPoint);
	void Finished_4A3EFA3847957701465B81AFF62B0D0D();
	void Finished_51CB27344662389D77C9C3A24FE729B8();
	void PlayDisappearRewardSound();
	void PlayDisplayRewardSound(const struct FRewardWrapperViewData& RewardData);
	void PlayEndSequenceAnimation();
	void PlayInterSequenceAnimation();
	void PlayNextChallengesCompletedSequenceAnimation(const TArray<struct FChallengeViewData>& ChallengesCompleted);
	void PlayNextChallengesRewardsSequenceAnimation(const TArray<struct FRewardWrapperViewData>& ChallengesRewards);
	void PlayNextChallengesTrackersSequenceAnimation(const TArray<struct FChallengeTrackerViewData>& ChallengesTrackers);
	void PlayNextRewardsSequenceAnimation(const TArray<struct FRewardWrapperViewData>& AlertRewards);
	void PlaySoundEffect(class UAkAudioEvent* SoundFx);
	void ResetVisuals();
	void SetData(TArray<struct FRewardWrapperViewData>& Data, TArray<class UUserWidget*>* Widget);
	void SetEventBackground(const class FString& EventThemeLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoreAlerts_C">();
	}
	static class UWBP_CoreAlerts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoreAlerts_C>();
	}
};
static_assert(alignof(UWBP_CoreAlerts_C) == 0x000008, "Wrong alignment on UWBP_CoreAlerts_C");
static_assert(sizeof(UWBP_CoreAlerts_C) == 0x000A38, "Wrong size on UWBP_CoreAlerts_C");
static_assert(offsetof(UWBP_CoreAlerts_C, UberGraphFrame) == 0x000460, "Member 'UWBP_CoreAlerts_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, AllFadeOutAnim) == 0x000468, "Member 'UWBP_CoreAlerts_C::AllFadeOutAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, RewardFadeOutAnim) == 0x000470, "Member 'UWBP_CoreAlerts_C::RewardFadeOutAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, BannerGroupTextPanel) == 0x000478, "Member 'UWBP_CoreAlerts_C::BannerGroupTextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, MainOverlay) == 0x000480, "Member 'UWBP_CoreAlerts_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, WBP_CoreRewardWrapperAnimation) == 0x000488, "Member 'UWBP_CoreAlerts_C::WBP_CoreRewardWrapperAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, WBP_CoreRewardWrapperAnimation_1) == 0x000490, "Member 'UWBP_CoreAlerts_C::WBP_CoreRewardWrapperAnimation_1' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, UserWidgetArray) == 0x000498, "Member 'UWBP_CoreAlerts_C::UserWidgetArray' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, DelayBetweenShowItem) == 0x0004A8, "Member 'UWBP_CoreAlerts_C::DelayBetweenShowItem' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, Time_on_Text_Fade_Out) == 0x0004B0, "Member 'UWBP_CoreAlerts_C::Time_on_Text_Fade_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, LevelSelectSoundEffect) == 0x0004B8, "Member 'UWBP_CoreAlerts_C::LevelSelectSoundEffect' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, Reward) == 0x0004C8, "Member 'UWBP_CoreAlerts_C::Reward' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, BackgroundImageDynamicMaterial) == 0x0009F0, "Member 'UWBP_CoreAlerts_C::BackgroundImageDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, CustomizationPadding) == 0x0009F8, "Member 'UWBP_CoreAlerts_C::CustomizationPadding' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, CurrencyPadding) == 0x000A08, "Member 'UWBP_CoreAlerts_C::CurrencyPadding' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, CompletedChallengePadding) == 0x000A18, "Member 'UWBP_CoreAlerts_C::CompletedChallengePadding' has a wrong offset!");
static_assert(offsetof(UWBP_CoreAlerts_C, ChallengeTrackersPadding) == 0x000A28, "Member 'UWBP_CoreAlerts_C::ChallengeTrackersPadding' has a wrong offset!");

}

