#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileMenuTitle

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ProfileMenuTitle.WBP_ProfileMenuTitle_C.SetSubtitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ProfileMenuTitle_C_SetSubtitle final
{
public:
	class FText                                   SubtitleText;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ProfileMenuTitle_C_SetSubtitle) == 0x000008, "Wrong alignment on WBP_ProfileMenuTitle_C_SetSubtitle");
static_assert(sizeof(WBP_ProfileMenuTitle_C_SetSubtitle) == 0x000018, "Wrong size on WBP_ProfileMenuTitle_C_SetSubtitle");
static_assert(offsetof(WBP_ProfileMenuTitle_C_SetSubtitle, SubtitleText) == 0x000000, "Member 'WBP_ProfileMenuTitle_C_SetSubtitle::SubtitleText' has a wrong offset!");

// Function WBP_ProfileMenuTitle.WBP_ProfileMenuTitle_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ProfileMenuTitle_C_SetTitle final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ProfileMenuTitle_C_SetTitle) == 0x000008, "Wrong alignment on WBP_ProfileMenuTitle_C_SetTitle");
static_assert(sizeof(WBP_ProfileMenuTitle_C_SetTitle) == 0x000018, "Wrong size on WBP_ProfileMenuTitle_C_SetTitle");
static_assert(offsetof(WBP_ProfileMenuTitle_C_SetTitle, TitleText) == 0x000000, "Member 'WBP_ProfileMenuTitle_C_SetTitle::TitleText' has a wrong offset!");

}

